
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十章：批处理 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch11.html" />
    
    
    <link rel="prev" href="part-iii.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十章：批处理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="10-&#x6279;&#x5904;&#x7406;">10. &#x6279;&#x5904;&#x7406;</h1>
<p><img src="img/ch10.png" alt="">
z</p>
<blockquote>
<p>&#x5E26;&#x6709;&#x592A;&#x5F3A;&#x4E2A;&#x4EBA;&#x8272;&#x5F69;&#x7684;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x6210;&#x529F;&#x3002;&#x5F53;&#x6700;&#x521D;&#x7684;&#x8BBE;&#x8BA1;&#x5B8C;&#x6210;&#x5E76;&#x4E14;&#x76F8;&#x5BF9;&#x7A33;&#x5B9A;&#x65F6;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x4EEC;&#x4EE5;&#x81EA;&#x5DF1;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x8003;&#x9A8C;&#x624D;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x2014;&#x2014;&#x9AD8;&#x5FB7;&#x7EB3;</p>
</blockquote>
<hr>
<p>[TOC]</p>
<p>&#x200B;    &#x5728;&#x672C;&#x4E66;&#x7684;&#x524D;&#x4E24;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x5F88;&#x591A;&#x5173;&#x4E8E;<strong>&#x8BF7;&#x6C42;</strong>&#x548C;<strong>&#x67E5;&#x8BE2;</strong>&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;<strong>&#x54CD;&#x5E94;</strong>&#x6216;<strong>&#x7ED3;&#x679C;</strong>&#x3002;&#x8BB8;&#x591A;&#x73B0;&#x6709;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x90FD;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF1A;&#x4F60;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x6307;&#x4EE4;&#xFF0C;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;(&#x6211;&#x4EEC;&#x671F;&#x671B;)&#x7CFB;&#x7EDF;&#x4F1A;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x7ED3;&#x679C;&#x3002;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7F13;&#x5B58;&#xFF0C;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#xFF0C;Web&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x90FD;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x50CF;&#x8FD9;&#x6837;&#x7684;<strong>&#x5728;&#x7EBF;&#xFF08;online&#xFF09;</strong>&#x7CFB;&#x7EDF;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x8BF7;&#x6C42;&#x9875;&#x9762;&#x8FD8;&#x662F;&#x8C03;&#x7528;&#x8FDC;&#x7A0B;API&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x8BA4;&#x4E3A;&#x8BF7;&#x6C42;&#x662F;&#x7531;&#x4EBA;&#x7C7B;&#x7528;&#x6237;&#x89E6;&#x53D1;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x54CD;&#x5E94;&#x3002;&#x4ED6;&#x4EEC;&#x4E0D;&#x5E94;&#x8BE5;&#x7B49;&#x592A;&#x4E45;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x975E;&#x5E38;&#x5173;&#x6CE8;&#x7CFB;&#x7EDF;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch1.html">&#x63CF;&#x8FF0;&#x6027;&#x80FD;</a>&#x201D;&#xFF09;&#x3002;</p>
<p>&#x200B;    Web&#x548C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x57FA;&#x4E8E;HTTP/REST&#x7684;API&#x4F7F;&#x4EA4;&#x4E92;&#x7684;&#x8BF7;&#x6C42;/&#x54CD;&#x5E94;&#x98CE;&#x683C;&#x53D8;&#x5F97;&#x5982;&#x6B64;&#x666E;&#x904D;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5F88;&#x5BB9;&#x6613;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x7406;&#x6240;&#x5F53;&#x7136;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x4E5F;&#x6709;&#x5176;&#x4F18;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x7CFB;&#x7EDF;&#xFF1A;</p>
<p> <strong><em>&#x670D;&#x52A1;&#xFF08;&#x5728;&#x7EBF;&#x7CFB;&#x7EDF;&#xFF09;</em></strong></p>
<p>&#x200B;    &#x670D;&#x52A1;&#x7B49;&#x5F85;&#x5BA2;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x6216;&#x6307;&#x4EE4;&#x5230;&#x8FBE;&#x3002;&#x6BCF;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#xFF0C;&#x670D;&#x52A1;&#x4F1A;&#x8BD5;&#x56FE;&#x5C3D;&#x5FEB;&#x5904;&#x7406;&#x5B83;&#xFF0C;&#x5E76;&#x53D1;&#x56DE;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x3002;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x901A;&#x5E38;&#x662F;&#x670D;&#x52A1;&#x6027;&#x80FD;&#x7684;&#x4E3B;&#x8981;&#x8861;&#x91CF;&#x6307;&#x6807;&#xFF0C;&#x53EF;&#x7528;&#x6027;&#x901A;&#x5E38;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF08;&#x5982;&#x679C;&#x5BA2;&#x6237;&#x7AEF;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x6536;&#x5230;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#xFF09;&#x3002;</p>
<p><strong><em>&#x6279;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#xFF08;&#x79BB;&#x7EBF;&#x7CFB;&#x7EDF;&#xFF09;</em></strong></p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x6279;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x6709;&#x5927;&#x91CF;&#x7684;&#x8F93;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x8DD1;&#x4E00;&#x4E2A;<strong>&#x4F5C;&#x4E1A;&#xFF08;job&#xFF09;</strong>&#x6765;&#x5904;&#x7406;&#x5B83;&#xFF0C;&#x5E76;&#x751F;&#x6210;&#x4E00;&#x4E9B;&#x8F93;&#x51FA;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5F80;&#x5F80;&#x9700;&#x8981;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF08;&#x4ECE;&#x51E0;&#x5206;&#x949F;&#x5230;&#x51E0;&#x5929;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x6709;&#x7528;&#x6237;&#x7B49;&#x5F85;&#x4F5C;&#x4E1A;&#x5B8C;&#x6210;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6279;&#x91CF;&#x4F5C;&#x4E1A;&#x901A;&#x5E38;&#x4F1A;&#x5B9A;&#x671F;&#x8FD0;&#x884C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6BCF;&#x5929;&#x4E00;&#x6B21;&#xFF09;&#x3002;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x7684;&#x4E3B;&#x8981;&#x6027;&#x80FD;&#x8861;&#x91CF;&#x6807;&#x51C6;&#x901A;&#x5E38;&#x662F;&#x541E;&#x5410;&#x91CF;&#xFF08;&#x5904;&#x7406;&#x7279;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x8F93;&#x5165;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#xFF09;&#x3002;&#x672C;&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x5C31;&#x662F;&#x6279;&#x5904;&#x7406;&#x3002;</p>
<p><strong><em>&#x6D41;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#xFF08;&#x51C6;&#x5B9E;&#x65F6;&#x7CFB;&#x7EDF;&#xFF09;</em></strong></p>
<p>&#x200B;    &#x6D41;&#x5904;&#x7406;&#x4ECB;&#x4E8E;&#x5728;&#x7EBF;&#x548C;&#x79BB;&#x7EBF;&#xFF08;&#x6279;&#x5904;&#x7406;&#xFF09;&#x4E4B;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x65F6;&#x5019;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x51C6;&#x5B9E;&#x65F6;&#xFF08;near-real-time&#xFF09;</strong>&#x6216;<strong>&#x51C6;&#x5728;&#x7EBF;&#xFF08;nearline&#xFF09;</strong>&#x5904;&#x7406;&#x3002;&#x50CF;&#x6279;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#xFF0C;&#x6D41;&#x5904;&#x7406;&#x6D88;&#x8D39;&#x8F93;&#x5165;&#x5E76;&#x4EA7;&#x751F;&#x8F93;&#x51FA;&#xFF08;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x54CD;&#x5E94;&#x8BF7;&#x6C42;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6D41;&#x5F0F;&#x4F5C;&#x4E1A;&#x5728;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x540E;&#x4E0D;&#x4E45;&#x5C31;&#x4F1A;&#x5BF9;&#x4E8B;&#x4EF6;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x5219;&#x9700;&#x7B49;&#x5F85;&#x56FA;&#x5B9A;&#x7684;&#x4E00;&#x7EC4;&#x8F93;&#x5165;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x4F7F;&#x6D41;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x6BD4;&#x8D77;&#x6279;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x66F4;&#x4F4E;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x7531;&#x4E8E;&#x6D41;&#x5904;&#x7406;&#x57FA;&#x4E8E;&#x6279;&#x5904;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch11.html">&#x7B2C;11&#x7AE0;</a>&#x8BA8;&#x8BBA;&#x5B83;&#x3002;</p>
<p>&#x200B;    &#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6279;&#x5904;&#x7406;&#x662F;&#x6784;&#x5EFA;&#x53EF;&#x9760;&#xFF0C;&#x53EF;&#x4F38;&#x7F29;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x4F8B;&#x5982;&#xFF0C;2004&#x5E74;&#x53D1;&#x5E03;&#x7684;&#x6279;&#x5904;&#x7406;&#x7B97;&#x6CD5;Map-Reduce&#xFF08;&#x53EF;&#x80FD;&#x88AB;&#x8FC7;&#x5206;&#x70ED;&#x60C5;&#x5730;&#xFF09;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x9020;&#x5C31;Google&#x5927;&#x89C4;&#x6A21;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x7684;&#x7B97;&#x6CD5;&#x201D;&#x3010;2&#x3011;&#x3002;&#x968F;&#x540E;&#x5728;&#x5404;&#x79CD;&#x5F00;&#x6E90;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F97;&#x5230;&#x5E94;&#x7528;&#xFF0C;&#x5305;&#x62EC;Hadoop&#xFF0C;CouchDB&#x548C;MongoDB&#x3002;</p>
<p>&#x200B;    &#x4E0E;&#x591A;&#x5E74;&#x524D;&#x4E3A;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x5F00;&#x53D1;&#x7684;&#x5E76;&#x884C;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x3010;3,4&#x3011;&#x76F8;&#x6BD4;&#xFF0C;MapReduce&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x5B83;&#x4F7F;&#x5F97;&#x5728;&#x5546;&#x7528;&#x786C;&#x4EF6;&#x4E0A;&#x80FD;&#x8FDB;&#x884C;&#x7684;&#x5904;&#x7406;&#x89C4;&#x6A21;&#x8FC8;&#x4E0A;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x53F0;&#x9636;&#x3002;&#x867D;&#x7136;MapReduce&#x7684;&#x91CD;&#x8981;&#x6027;&#x6B63;&#x5728;&#x4E0B;&#x964D;&#x3010;5&#x3011;&#xFF0C;&#x4F46;&#x5B83;&#x4ECD;&#x7136;&#x503C;&#x5F97;&#x53BB;&#x7406;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x63CF;&#x7ED8;&#x4E86;&#x4E00;&#x5E45;&#x5173;&#x4E8E;&#x6279;&#x5904;&#x7406;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x7528;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5B9E;&#x7528;&#x7684;&#x6E05;&#x6670;&#x56FE;&#x666F;&#x3002;</p>
<p>&#x200B;    &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6279;&#x5904;&#x7406;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x53E4;&#x8001;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#x3002;&#x65E9;&#x5728;&#x53EF;&#x7F16;&#x7A0B;&#x6570;&#x5B57;&#x8BA1;&#x7B97;&#x673A;&#x8BDE;&#x751F;&#x4E4B;&#x524D;&#xFF0C;&#x6253;&#x5B54;&#x5361;&#x5236;&#x8868;&#x673A;&#xFF08;&#x4F8B;&#x5982;1890&#x5E74;&#x7F8E;&#x56FD;&#x4EBA;&#x53E3;&#x666E;&#x67E5;&#x3010;6&#x3011;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x970D;&#x5C14;&#x91CC;&#x65AF;&#x673A;&#xFF09;&#x5B9E;&#x73B0;&#x4E86;&#x534A;&#x673A;&#x68B0;&#x5316;&#x7684;&#x6279;&#x5904;&#x7406;&#x5F62;&#x5F0F;&#xFF0C;&#x4ECE;&#x5927;&#x91CF;&#x8F93;&#x5165;&#x4E2D;&#x6C47;&#x603B;&#x8BA1;&#x7B97;&#x3002; Map-Reduce&#x4E0E;1940&#x5E74;&#x4EE3;&#x548C;1950&#x5E74;&#x4EE3;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x5546;&#x4E1A;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x673A;&#x7535;IBM&#x5361;&#x7247;&#x5206;&#x7C7B;&#x673A;&#x5668;&#x6709;&#x7740;&#x60CA;&#x4EBA;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x3010;7&#x3011;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x8BF4;&#xFF0C;&#x5386;&#x53F2;&#x603B;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E86;&#x89E3;MapReduce&#x548C;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x6279;&#x5904;&#x7406;&#x7B97;&#x6CD5;&#x548C;&#x6846;&#x67B6;&#xFF0C;&#x5E76;&#x63A2;&#x7D22;&#x5B83;&#x4EEC;&#x5728;&#x73B0;&#x4EE3;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x4F46;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x770B;&#x4F7F;&#x7528;&#x6807;&#x51C6;Unix&#x5DE5;&#x5177;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x5DF2;&#x7ECF;&#x719F;&#x6089;&#x4E86;&#x5B83;&#x4EEC;&#xFF0C;Unix&#x7684;&#x54F2;&#x5B66;&#x4E5F;&#x503C;&#x5F97;&#x4E00;&#x8BFB;&#xFF0C;Unix&#x7684;&#x601D;&#x60F3;&#x548C;&#x7ECF;&#x9A8C;&#x6559;&#x8BAD;&#x53EF;&#x4EE5;&#x8FC1;&#x79FB;&#x5230;&#x5927;&#x89C4;&#x6A21;&#xFF0C;&#x5F02;&#x6784;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;</p>
<h2 id="&#x4F7F;&#x7528;unix&#x5DE5;&#x5177;&#x7684;&#x6279;&#x5904;&#x7406;">&#x4F7F;&#x7528;Unix&#x5DE5;&#x5177;&#x7684;&#x6279;&#x5904;&#x7406;</h2>
<p>&#x200B;    &#x6211;&#x4EEC;&#x4ECE;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x5F00;&#x59CB;&#x3002;&#x5047;&#x8BBE;&#x60A8;&#x6709;&#x4E00;&#x53F0;Web&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6BCF;&#x6B21;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x65F6;&#x90FD;&#x4F1A;&#x5728;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x4E2D;&#x9644;&#x52A0;&#x4E00;&#x884C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;nginx&#x9ED8;&#x8BA4;&#x8BBF;&#x95EE;&#x65E5;&#x5FD7;&#x683C;&#x5F0F;&#xFF0C;&#x65E5;&#x5FD7;&#x7684;&#x4E00;&#x884C;&#x53EF;&#x80FD;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-bash">216.58.210.78 - - [27/Feb/2015:17:55:11 +0000] <span class="hljs-string">&quot;GET /css/typography.css HTTP/1.1&quot;</span> 
200 3377 <span class="hljs-string">&quot;http://martin.kleppmann.com/&quot;</span> <span class="hljs-string">&quot;Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_5) 
AppleWebKit/537.36 (KHTML, like Gecko) Chrome/40.0.2214.115 Safari/537.36&quot;</span>
</code></pre>
<p>&#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x884C;&#xFF0C;&#x5206;&#x6210;&#x591A;&#x884C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x9605;&#x8BFB;&#x3002;&#xFF09;&#x8FD9;&#x4E00;&#x884C;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x91CA;&#x5B83;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x65E5;&#x5FD7;&#x683C;&#x5F0F;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code> $remote_addr - $remote_user [$time_local] &quot;$request&quot;
 $status $body_bytes_sent &quot;$http_referer&quot; &quot;$http_user_agent&quot;
</code></pre><p>&#x200B;    &#x65E5;&#x5FD7;&#x7684;&#x8FD9;&#x4E00;&#x884C;&#x8868;&#x660E;&#x5728;2015&#x5E74;2&#x6708;27&#x65E5;17:55:11 UTC&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;IP&#x5730;&#x5740;<code>216.58.210.78</code>&#x63A5;&#x6536;&#x5230;&#x5BF9;&#x6587;&#x4EF6;<code>/css/typography.css</code>&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x7528;&#x6237;&#x6CA1;&#x6709;&#x88AB;&#x8BA4;&#x8BC1;&#xFF0C;&#x6240;&#x4EE5;<code>$remote_user</code>&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A;&#x8FDE;&#x5B57;&#x7B26;&#xFF08;<code>-</code> &#xFF09;&#x3002;&#x54CD;&#x5E94;&#x72B6;&#x6001;&#x662F;200&#xFF08;&#x5373;&#x8BF7;&#x6C42;&#x6210;&#x529F;&#xFF09;&#xFF0C;&#x54CD;&#x5E94;&#x7684;&#x5927;&#x5C0F;&#x662F;3377&#x5B57;&#x8282;&#x3002;&#x7F51;&#x9875;&#x6D4F;&#x89C8;&#x5668;&#x662F;Chrome 40&#xFF0C;URL <code>http://martin.kleppmann.com/</code> &#x7684;&#x9875;&#x9762;&#x4E2D;&#x7684;&#x5F15;&#x7528;&#x5BFC;&#x81F4;&#x8BE5;&#x6587;&#x4EF6;&#x88AB;&#x52A0;&#x8F7D;&#x3002;</p>
<h3 id="&#x5206;&#x6790;&#x7B80;&#x5355;&#x65E5;&#x5FD7;">&#x5206;&#x6790;&#x7B80;&#x5355;&#x65E5;&#x5FD7;</h3>
<p>&#x200B;    &#x5F88;&#x591A;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x4ECE;&#x8FD9;&#x4E9B;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x751F;&#x6210;&#x5173;&#x4E8E;&#x7F51;&#x7AD9;&#x6D41;&#x91CF;&#x7684;&#x6F02;&#x4EAE;&#x7684;&#x62A5;&#x544A;&#xFF0C;&#x4F46;&#x4E3A;&#x4E86;&#x7EC3;&#x624B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x7684;Unix&#x529F;&#x80FD;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x5177;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x5728;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x627E;&#x5230;&#x4E94;&#x4E2A;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x7F51;&#x9875;&#x3002; &#x5219;&#x53EF;&#x4EE5;&#x5728;Unix shell&#x4E2D;&#x8FD9;&#x6837;&#x505A;&#xFF1A;<sup><a href="#fn_i" id="reffn_i">i</a></sup></p>
<blockquote id="fn_i">
<sup>i</sup>. &#x6709;&#x4E9B;&#x4EBA;&#x8BA4;&#x4E3A;<code>cat</code>&#x8FD9;&#x91CC;&#x5E76;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F5C;&#x4E3A;awk&#x7684;&#x53C2;&#x6570;&#x3002; &#x4F46;&#x8FD9;&#x79CD;&#x5199;&#x6CD5;&#x8BA9;&#x7EBF;&#x6027;&#x7BA1;&#x9053;&#x66F4;&#x4E3A;&#x663E;&#x773C;&#x3002;<a href="#reffn_i" title="Jump back to footnote [i] in the text."> &#x21A9;</a>
</blockquote>
<pre><code class="lang-bash">cat /var/<span class="hljs-built_in">log</span>/nginx/access.log | <span class="hljs-comment">#1</span>
    awk <span class="hljs-string">&apos;{print $7}&apos;</span> | <span class="hljs-comment">#2</span>
    sort             | <span class="hljs-comment">#3</span>
    uniq -c          | <span class="hljs-comment">#4</span>
    sort -r -n       | <span class="hljs-comment">#5</span>
    head -n 5          <span class="hljs-comment">#6</span>
</code></pre>
<ol>
<li>&#x8BFB;&#x53D6;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;</li>
<li>&#x5C06;&#x6BCF;&#x4E00;&#x884C;&#x6309;&#x7A7A;&#x683C;&#x5206;&#x5272;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x6BCF;&#x884C;&#x53EA;&#x8F93;&#x51FA;&#x7B2C;&#x4E03;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x6070;&#x597D;&#x662F;&#x8BF7;&#x6C42;&#x7684;URL&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x662F;<code>/css/typography.css</code>&#x3002;</li>
<li>&#x6309;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x6392;&#x5217;&#x8BF7;&#x6C42;&#x7684;URL&#x5217;&#x8868;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E2A;URL&#x88AB;&#x8BF7;&#x6C42;&#x8FC7;n&#x6B21;&#xFF0C;&#x90A3;&#x4E48;&#x6392;&#x5E8F;&#x540E;&#xFF0C;&#x6587;&#x4EF6;&#x5C06;&#x5305;&#x542B;&#x8FDE;&#x7EED;&#x91CD;&#x590D;&#x51FA;&#x73B0;n&#x6B21;&#x7684;&#x8BE5;URL&#x3002;</li>
<li><code>uniq</code>&#x547D;&#x4EE4;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x4E24;&#x4E2A;&#x76F8;&#x90BB;&#x7684;&#x884C;&#x662F;&#x5426;&#x76F8;&#x540C;&#x6765;&#x8FC7;&#x6EE4;&#x6389;&#x8F93;&#x5165;&#x4E2D;&#x7684;&#x91CD;&#x590D;&#x884C;&#x3002; <code>-c</code>&#x5219;&#x8868;&#x793A;&#x8FD8;&#x8981;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#xFF1A;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x4E0D;&#x540C;&#x7684;URL&#xFF0C;&#x5B83;&#x4F1A;&#x62A5;&#x544A;&#x8F93;&#x5165;&#x4E2D;&#x51FA;&#x73B0;&#x8BE5;URL&#x7684;&#x6B21;&#x6570;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x79CD;&#x6392;&#x5E8F;&#x6309;&#x6BCF;&#x884C;&#x8D77;&#x59CB;&#x5904;&#x7684;&#x6570;&#x5B57;&#xFF08;<code>-n</code>&#xFF09;&#x6392;&#x5E8F;&#xFF0C;&#x8FD9;&#x662F;URL&#x7684;&#x8BF7;&#x6C42;&#x6B21;&#x6570;&#x3002;&#x7136;&#x540E;&#x9006;&#x5E8F;&#xFF08;<code>-r</code>&#xFF09;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;&#x5927;&#x7684;&#x6570;&#x5B57;&#x5728;&#x524D;&#x3002;</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x53EA;&#x8F93;&#x51FA;&#x524D;&#x4E94;&#x884C;&#xFF08;<code>-n 5</code>&#xFF09;&#xFF0C;&#x5E76;&#x4E22;&#x5F03;&#x5176;&#x4F59;&#x7684;&#x3002;&#x8BE5;&#x7CFB;&#x5217;&#x547D;&#x4EE4;&#x7684;&#x8F93;&#x51FA;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</li>
</ol>
<pre><code>    4189 /favicon.ico
    3631 /2013/05/24/improving-security-of-ssh-private-keys.html
    2124 /2012/12/05/schema-evolution-in-avro-protocol-buffers-thrift.html
    1369 /
     915 /css/typography.css
</code></pre><p>&#x200B;    &#x5982;&#x679C;&#x4F60;&#x4E0D;&#x719F;&#x6089;Unix&#x5DE5;&#x5177;&#xFF0C;&#x4E0A;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x5403;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x3002;&#x5B83;&#x80FD;&#x5728;&#x51E0;&#x79D2;&#x949F;&#x5185;&#x5904;&#x7406;&#x51E0;GB&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x8F7B;&#x677E;&#x4FEE;&#x6539;&#x547D;&#x4EE4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x4ECE;&#x62A5;&#x544A;&#x4E2D;&#x7701;&#x7565;CSS&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;awk&#x53C2;&#x6570;&#x66F4;&#x6539;&#x4E3A;<code>&apos;$7 !~ /\.css$/ {print $7}&apos;</code>,&#x5982;&#x679C;&#x60F3;&#x7EDF;&#x8BA1;&#x6700;&#x591A;&#x7684;&#x5BA2;&#x6237;&#x7AEF;IP&#x5730;&#x5740;,&#x53EF;&#x4EE5;&#x628A;awk&#x53C2;&#x6570;&#x6539;&#x4E3A;<code>&apos;{print $1}&apos;</code>&#x7B49;&#x7B49;&#x3002;</p>
<p>&#x200B;    &#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5728;&#x8FD9;&#x91CC;&#x8BE6;&#x7EC6;&#x63A2;&#x7D22;Unix&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x5B66;&#x4E60;&#x3002;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x662F;&#xFF0C;&#x4F7F;&#x7528;awk&#xFF0C;sed&#xFF0C;grep&#xFF0C;sort&#xFF0C;uniq&#x548C;xargs&#x7684;&#x7EC4;&#x5408;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x51E0;&#x5206;&#x949F;&#x5185;&#x5B8C;&#x6210;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x7684;&#x6027;&#x80FD;&#x76F8;&#x5F53;&#x7684;&#x597D;&#x3010;8&#x3011;&#x3002;</p>
<h4 id="&#x547D;&#x4EE4;&#x94FE;&#x4E0E;&#x81EA;&#x5B9A;&#x4E49;&#x7A0B;&#x5E8F;">&#x547D;&#x4EE4;&#x94FE;&#x4E0E;&#x81EA;&#x5B9A;&#x4E49;&#x7A0B;&#x5E8F;</h4>
<p>&#x9664;&#x4E86;Unix&#x547D;&#x4EE4;&#x94FE;&#xFF0C;&#x4F60;&#x8FD8;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#x6765;&#x505A;&#x540C;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4F8B;&#x5982;&#x5728;Ruby&#x4E2D;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-ruby">counts = Hash.new(<span class="hljs-number">0</span>)         <span class="hljs-comment"># 1</span>
File.open(<span class="hljs-string">&apos;/var/log/nginx/access.log&apos;</span>) <span class="hljs-keyword">do</span> |file| 
    file.each <span class="hljs-keyword">do</span> |line|
        url = line.split[<span class="hljs-number">6</span>]  <span class="hljs-comment"># 2</span>
        counts[url] += <span class="hljs-number">1</span>     <span class="hljs-comment"># 3</span>
    <span class="hljs-keyword">end</span>
<span class="hljs-keyword">end</span>

top5 = counts.map{|url, count| [count, url] }.sort.reverse[<span class="hljs-number">0</span>...<span class="hljs-number">5</span>] <span class="hljs-comment"># 4</span>
top5.each{|count, url| puts <span class="hljs-string">&quot;<span class="hljs-subst">#{count}</span> <span class="hljs-subst">#{url}</span>&quot;</span> }                   <span class="hljs-comment"># 5</span>
</code></pre>
<ol>
<li><code>counts</code>&#x662F;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x4FDD;&#x5B58;&#x4E86;&#x6BCF;&#x4E2A;URL&#x88AB;&#x6D4F;&#x89C8;&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;0&#x3002;</li>
<li>&#x9010;&#x884C;&#x8BFB;&#x53D6;&#x65E5;&#x5FD7;&#xFF0C;&#x62BD;&#x53D6;&#x6BCF;&#x884C;&#x7B2C;&#x4E03;&#x4E2A;&#x88AB;&#x7A7A;&#x683C;&#x5206;&#x9694;&#x7684;&#x5B57;&#x6BB5;&#x4E3A;URL&#xFF08;&#x8FD9;&#x91CC;&#x7684;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x662F;6&#xFF0C;&#x56E0;&#x4E3A;Ruby&#x7684;&#x6570;&#x7EC4;&#x7D22;&#x5F15;&#x4ECE;0&#x5F00;&#x59CB;&#x8BA1;&#x6570;&#xFF09;</li>
<li>&#x5C06;&#x65E5;&#x5FD7;&#x5F53;&#x524D;&#x884C;&#x4E2D;URL&#x5BF9;&#x5E94;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x503C;&#x52A0;&#x4E00;&#x3002;</li>
<li>&#x6309;&#x8BA1;&#x6570;&#x5668;&#x503C;&#xFF08;&#x964D;&#x5E8F;&#xFF09;&#x5BF9;&#x54C8;&#x5E0C;&#x8868;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x5E76;&#x53D6;&#x524D;&#x4E94;&#x4F4D;&#x3002;</li>
<li>&#x6253;&#x5370;&#x51FA;&#x524D;&#x4E94;&#x4E2A;&#x6761;&#x76EE;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5E76;&#x4E0D;&#x50CF;Unix&#x7BA1;&#x9053;&#x90A3;&#x6837;&#x7B80;&#x6D01;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x53EF;&#x8BFB;&#x6027;&#x5F88;&#x5F3A;&#xFF0C;&#x559C;&#x6B22;&#x54EA;&#x4E00;&#x79CD;&#x5C5E;&#x4E8E;&#x53E3;&#x5473;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x4E24;&#x8005;&#x9664;&#x4E86;&#x8868;&#x9762;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#x4E4B;&#x5916;&#xFF0C;&#x6267;&#x884C;&#x6D41;&#x7A0B;&#x4E5F;&#x6709;&#x5F88;&#x5927;&#x5DEE;&#x5F02;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x5927;&#x6587;&#x4EF6;&#x4E0A;&#x8FD0;&#x884C;&#x6B64;&#x5206;&#x6790;&#xFF0C;&#x5219;&#x4F1A;&#x53D8;&#x5F97;&#x660E;&#x663E;&#x3002;</p>
<h4 id="&#x6392;&#x5E8F;-vs-&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x805A;&#x5408;">&#x6392;&#x5E8F; VS &#x5185;&#x5B58;&#x4E2D;&#x7684;&#x805A;&#x5408;</h4>
<p>&#x200B;    Ruby&#x811A;&#x672C;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x5B58;&#x4E86;&#x4E00;&#x4E2A;URL&#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;URL&#x6620;&#x5C04;&#x5230;&#x5B83;&#x51FA;&#x73B0;&#x7684;&#x6B21;&#x6570;&#x3002; Unix&#x7BA1;&#x9053;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x800C;&#x662F;&#x4F9D;&#x8D56;&#x4E8E;&#x5BF9;URL&#x5217;&#x8868;&#x7684;&#x6392;&#x5E8F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;URL&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;URL&#x7684;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x200B;    &#x54EA;&#x79CD;&#x65B9;&#x6CD5;&#x66F4;&#x597D;&#xFF1F;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x4E0D;&#x540C;&#x7684;URL&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x4E2D;&#x5C0F;&#x578B;&#x7F51;&#x7AD9;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x53EF;&#x4EE5;&#x4E3A;&#x6240;&#x6709;&#x4E0D;&#x540C;&#x7F51;&#x5740;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#xFF08;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x4F7F;&#x7528;1GB&#x5185;&#x5B58;&#xFF09;&#x3002;&#x5728;&#x6B64;&#x4F8B;&#x4E2D;&#xFF0C;&#x4F5C;&#x4E1A;&#x7684;<strong>&#x5DE5;&#x4F5C;&#x96C6;&#xFF08;working set&#xFF09;</strong>&#xFF08;&#x4F5C;&#x4E1A;&#x9700;&#x8981;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#xFF09;&#x4EC5;&#x53D6;&#x51B3;&#x4E8E;&#x4E0D;&#x540C;URL&#x7684;&#x6570;&#x91CF;&#xFF1A;&#x5982;&#x679C;&#x65E5;&#x5FD7;&#x4E2D;&#x53EA;&#x6709;&#x5355;&#x4E2A;URL&#xFF0C;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#x4E00;&#x767E;&#x4E07;&#x6B21;&#xFF0C;&#x5219;&#x6563;&#x5217;&#x8868;&#x6240;&#x9700;&#x7684;&#x7A7A;&#x95F4;&#x8868;&#x5C31;&#x53EA;&#x6709;&#x4E00;&#x4E2A;URL&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5F53;&#x5DE5;&#x4F5C;&#x96C6;&#x8DB3;&#x591F;&#x5C0F;&#x65F6;&#xFF0C;&#x5185;&#x5B58;&#x6563;&#x5217;&#x8868;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x6027;&#x80FD;&#x8F83;&#x5DEE;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x4E0A;&#x4E5F;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x4F5C;&#x4E1A;&#x7684;&#x5DE5;&#x4F5C;&#x96C6;&#x5927;&#x4E8E;&#x53EF;&#x7528;&#x5185;&#x5B58;&#xFF0C;&#x5219;&#x6392;&#x5E8F;&#x65B9;&#x6CD5;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x5730;&#x4F7F;&#x7528;&#x78C1;&#x76D8;&#x3002;&#x8FD9;&#x4E0E;&#x6211;&#x4EEC;&#x5728;&#x201C;<a href="ch3.html#SSTables&#x548C;LSM&#x6811;">SSTables&#x548C;LSM&#x6811;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x539F;&#x7406;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF1A;&#x6570;&#x636E;&#x5757;&#x53EF;&#x4EE5;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x6392;&#x5E8F;&#x5E76;&#x4F5C;&#x4E3A;&#x6BB5;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x7136;&#x540E;&#x591A;&#x4E2A;&#x6392;&#x5E8F;&#x597D;&#x7684;&#x6BB5;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x6392;&#x5E8F;&#x6587;&#x4EF6;&#x3002; &#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x5177;&#x6709;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x8FD0;&#x884C;&#x826F;&#x597D;&#x7684;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x3002; &#xFF08;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x9488;&#x5BF9;&#x987A;&#x5E8F;I/O&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x662F;<a href="ch3.html">&#x7B2C;3&#x7AE0;</a>&#x4E2D;&#x53CD;&#x590D;&#x51FA;&#x73B0;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#x5728;&#x6B64;&#x91CD;&#x73B0;&#xFF09;</p>
<p>&#x200B;    GNU Coreutils&#xFF08;Linux&#xFF09;&#x4E2D;&#x7684;<code>sort</code>&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x6EA2;&#x51FA;&#x81F3;&#x78C1;&#x76D8;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x81EA;&#x52A8;&#x5E94;&#x5BF9;&#x5927;&#x4E8E;&#x5185;&#x5B58;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5E76;&#x80FD;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x591A;&#x4E2A;CPU&#x6838;&#x8FDB;&#x884C;&#x5E76;&#x884C;&#x6392;&#x5E8F;&#x3010;9&#x3011;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;&#x7B80;&#x5355;&#x7684;Unix&#x547D;&#x4EE4;&#x94FE;&#x5F88;&#x5BB9;&#x6613;&#x4F38;&#x7F29;&#x81F3;&#x5927;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4E14;&#x4E0D;&#x4F1A;&#x8017;&#x5C3D;&#x5185;&#x5B58;&#x3002;&#x74F6;&#x9888;&#x53EF;&#x80FD;&#x662F;&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<h3 id="unix&#x54F2;&#x5B66;">Unix&#x54F2;&#x5B66;</h3>
<p>&#x200B;    &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5730;&#x4F7F;&#x7528;&#x524D;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x547D;&#x4EE4;&#x6765;&#x5206;&#x6790;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x5E76;&#x975E;&#x5DE7;&#x5408;&#xFF1A;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;Unix&#x7684;&#x5173;&#x952E;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x4E4B;&#x4E00;&#xFF0C;&#x4E14;&#x5B83;&#x4ECA;&#x5929;&#x4ECD;&#x7136;&#x4EE4;&#x4EBA;&#x8BB6;&#x5F02;&#x5730;&#x5173;&#x8054;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x66F4;&#x6DF1;&#x5165;&#x5730;&#x7814;&#x7A76;&#x4E00;&#x4E0B;&#xFF0C;&#x4EE5;&#x4FBF;&#x4ECE;Unix&#x4E2D;&#x501F;&#x9274;&#x4E00;&#x4E9B;&#x60F3;&#x6CD5;&#x3010;10&#x3011;&#x3002;</p>
<p>&#x200B;    Unix&#x7BA1;&#x9053;&#x7684;&#x53D1;&#x660E;&#x8005;&#x9053;&#x683C;&#xB7;&#x9EA6;&#x514B;&#x7F57;&#x4F0A;&#xFF08;Doug McIlroy&#xFF09;&#x5728;1964&#x5E74;&#x9996;&#x5148;&#x63CF;&#x8FF0;&#x4E86;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3010;11&#x3011;&#xFF1A;&#x201C;&#x5F53;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5C06;&#x6D88;&#x606F;&#x4ECE;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4F20;&#x9012;&#x53E6;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x7C7B;&#x4F3C;&#x6C34;&#x7BA1;&#x6CD5;&#x5170;&#x7684;&#x62FC;&#x63A5;&#x7A0B;&#x5E8F;&#x7684;&#x65B9;&#x5F0F;&#x3010;a&#x3011; &#xFF0C;I/O&#x5E94;&#x8BE5;&#x4E5F;&#x6309;&#x7167;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x201C;&#x3002;&#x6C34;&#x7BA1;&#x7684;&#x7C7B;&#x6BD4;&#x4ECD;&#x7136;&#x5728;&#x751F;&#x6548;&#xFF0C;&#x901A;&#x8FC7;&#x7BA1;&#x9053;&#x8FDE;&#x63A5;&#x7A0B;&#x5E8F;&#x7684;&#x60F3;&#x6CD5;&#x6210;&#x4E3A;&#x4E86;&#x73B0;&#x5728;&#x88AB;&#x79F0;&#x4E3A;<strong>Unix&#x54F2;&#x5B66;</strong>&#x7684;&#x4E00;&#x90E8;&#x5206; &#x2014;&#x2014; &#x8FD9;&#x4E00;&#x7EC4;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x5728;Unix&#x7528;&#x6237;&#x4E0E;&#x5F00;&#x53D1;&#x8005;&#x4E4B;&#x95F4;&#x6D41;&#x884C;&#x8D77;&#x6765;&#xFF0C;&#x8BE5;&#x54F2;&#x5B66;&#x5728;1978&#x5E74;&#x8868;&#x8FF0;&#x5982;&#x4E0B;&#x3010;12,13&#x3011;&#xFF1A;</p>
<ol>
<li>&#x8BA9;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x90FD;&#x505A;&#x597D;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;&#x8981;&#x505A;&#x4E00;&#x4EF6;&#x65B0;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5199;&#x4E00;&#x4E2A;&#x65B0;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;&#x201C;&#x529F;&#x80FD;&#x201D;&#x8BA9;&#x8001;&#x7A0B;&#x5E8F;&#x590D;&#x6742;&#x5316;&#x3002;</li>
<li>&#x671F;&#x5F85;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x6210;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x5165;&#x3002;&#x4E0D;&#x8981;&#x5C06;&#x65E0;&#x5173;&#x4FE1;&#x606F;&#x6DF7;&#x5165;&#x8F93;&#x51FA;&#x3002;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x4E25;&#x683C;&#x7684;&#x5217;&#x6570;&#x636E;&#x6216;&#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x5165;&#x683C;&#x5F0F;&#x3002;&#x4E0D;&#x8981;&#x575A;&#x6301;&#x4EA4;&#x4E92;&#x5F0F;&#x8F93;&#x5165;&#x3002;</li>
<li>&#x8BBE;&#x8BA1;&#x548C;&#x6784;&#x5EFA;&#x8F6F;&#x4EF6;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x8981;&#x5C3D;&#x65E9;&#x5C1D;&#x8BD5;&#xFF0C;&#x6700;&#x597D;&#x5728;&#x51E0;&#x5468;&#x5185;&#x5B8C;&#x6210;&#x3002;&#x4E0D;&#x8981;&#x72B9;&#x8C6B;&#xFF0C;&#x6254;&#x6389;&#x7B28;&#x62D9;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x91CD;&#x5EFA;&#x5B83;&#x4EEC;&#x3002;</li>
<li>&#x4F18;&#x5148;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#x6765;&#x51CF;&#x8F7B;&#x7F16;&#x7A0B;&#x4EFB;&#x52A1;&#xFF0C;&#x5373;&#x4F7F;&#x5FC5;&#x987B;&#x66F2;&#x7EBF;&#x6551;&#x56FD;&#x7F16;&#x5199;&#x5DE5;&#x5177;&#xFF0C;&#x4E14;&#x5728;&#x7528;&#x5B8C;&#x540E;&#x5F88;&#x53EF;&#x80FD;&#x8981;&#x6254;&#x6389;&#x5927;&#x90E8;&#x5206;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5; &#x2014;&#x2014; &#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x5FEB;&#x901F;&#x539F;&#x578B;&#x8BBE;&#x8BA1;&#xFF0C;&#x589E;&#x91CF;&#x5F0F;&#x8FED;&#x4EE3;&#xFF0C;&#x5BF9;&#x5B9E;&#x9A8C;&#x53CB;&#x597D;&#xFF0C;&#x5C06;&#x5927;&#x578B;&#x9879;&#x76EE;&#x5206;&#x89E3;&#x6210;&#x53EF;&#x7BA1;&#x7406;&#x7684;&#x5757; &#x2014;&#x2014; &#x542C;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x50CF;&#x4ECA;&#x5929;&#x7684;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x548C;DevOps&#x8FD0;&#x52A8;&#x3002;&#x5947;&#x602A;&#x7684;&#x662F;&#xFF0C;&#x56DB;&#x5341;&#x5E74;&#x6765;&#x53D8;&#x5316;&#x4E0D;&#x5927;&#x3002;</p>
<p>&#x200B;    <code>sort</code>&#x5DE5;&#x5177;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x53EF;&#x4EE5;&#x8BF4;&#x5B83;&#x6BD4;&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6807;&#x51C6;&#x5E93;&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#xFF08;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x5229;&#x7528;&#x78C1;&#x76D8;&#x6216;&#x4F7F;&#x7528;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#x505A;&#x6709;&#x5F88;&#x5927;&#x597D;&#x5904;&#xFF09;&#x8981;&#x66F4;&#x597D;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5355;&#x72EC;&#x4F7F;&#x7528;<code>sort</code> &#x51E0;&#x4E4E;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#x3002;&#x5B83;&#x53EA;&#x80FD;&#x4E0E;&#x5176;&#x4ED6;Unix&#x5DE5;&#x5177;&#xFF08;&#x5982;<code>uniq</code>&#xFF09;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x200B;    &#x50CF; <code>bash</code>&#x8FD9;&#x6837;&#x7684;Unix shell&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x8F7B;&#x677E;&#x5730;&#x5C06;&#x8FD9;&#x4E9B;&#x5C0F;&#x7A0B;&#x5E8F;&#x7EC4;&#x5408;&#x6210;&#x4EE4;&#x4EBA;&#x8BB6;&#x5F02;&#x7684;&#x5F3A;&#x5927;&#x6570;&#x636E;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x662F;&#x7531;&#x4E0D;&#x540C;&#x4EBA;&#x7FA4;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x5730;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002; Unix&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x53EF;&#x7EC4;&#x5408;&#x6027;&#xFF1F;</p>
<h4 id="&#x7EDF;&#x4E00;&#x7684;&#x63A5;&#x53E3;">&#x7EDF;&#x4E00;&#x7684;&#x63A5;&#x53E3;</h4>
<p>&#x200B;    &#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x6210;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x90A3;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F; &#x2014;&#x2014; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x517C;&#x5BB9;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x80FD;&#x591F;&#x5C06;&#x4EFB;&#x4F55;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x5230;&#x4EFB;&#x4F55;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x90A3;&#x610F;&#x5473;&#x7740;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;I/O&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x200B;    &#x5728;Unix&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x63A5;&#x53E3;&#x662F;&#x4E00;&#x4E2A;<strong>&#x6587;&#x4EF6;&#xFF08;file&#xFF09;</strong>&#xFF08;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#xFF09;&#x3002;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x53EA;&#x662F;&#x4E00;&#x4E32;&#x6709;&#x5E8F;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x63A5;&#x53E3;&#x6765;&#x8868;&#x793A;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#xFF1A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x771F;&#x5B9E;&#x6587;&#x4EF6;&#xFF0C;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF08;Unix&#x5957;&#x63A5;&#x5B57;&#xFF0C;stdin&#xFF0C;stdout&#xFF09;&#x7684;&#x901A;&#x4FE1;&#x901A;&#x9053;&#xFF0C;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF08;&#x6BD4;&#x5982;<code>/dev/audio</code>&#x6216;<code>/dev/lp0</code>&#xFF09;&#xFF0C;&#x8868;&#x793A;TCP&#x8FDE;&#x63A5;&#x7684;&#x5957;&#x63A5;&#x5B57;&#x7B49;&#x7B49;&#x3002;&#x5F88;&#x5BB9;&#x6613;&#x5C06;&#x8FD9;&#x4E9B;&#x8BBE;&#x8BA1;&#x89C6;&#x4E3A;&#x7406;&#x6240;&#x5F53;&#x7136;&#x7684;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x80FD;&#x8BA9;&#x8FD9;&#x4E9B;&#x5DEE;&#x5F02;&#x5DE8;&#x5927;&#x7684;&#x4E1C;&#x897F;&#x5171;&#x4EAB;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x63A5;&#x53E3;&#x662F;&#x975E;&#x5E38;&#x5389;&#x5BB3;&#x7684;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;<sup><a href="#fn_ii" id="reffn_ii">ii</a></sup>&#x3002;</p>
<blockquote id="fn_ii">
<sup>ii</sup>. &#x7EDF;&#x4E00;&#x63A5;&#x53E3;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;URL&#x548C;HTTP&#xFF0C;&#x8FD9;&#x662F;Web&#x7684;&#x57FA;&#x77F3;&#x3002; &#x4E00;&#x4E2A;URL&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4E1C;&#x897F;&#xFF08;&#x8D44;&#x6E90;&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x94FE;&#x63A5;&#x5230;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7F51;&#x7AD9;&#x7684;&#x4EFB;&#x4F55;&#x7F51;&#x5740;&#x3002; &#x5177;&#x6709;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x7528;&#x6237;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8DDF;&#x968F;&#x94FE;&#x63A5;&#x5728;&#x7F51;&#x7AD9;&#x4E4B;&#x95F4;&#x65E0;&#x7F1D;&#x8DF3;&#x8F6C;&#xFF0C;&#x5373;&#x4F7F;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x80FD;&#x7531;&#x5B8C;&#x5168;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x7EC4;&#x7EC7;&#x7EF4;&#x62A4;&#x3002; &#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x73B0;&#x5728;&#x4F3C;&#x4E4E;&#x975E;&#x5E38;&#x660E;&#x663E;&#xFF0C;&#x4F46;&#x5B83;&#x5374;&#x662F;&#x7F51;&#x7EDC;&#x53D6;&#x80FD;&#x53D6;&#x5F97;&#x4ECA;&#x5929;&#x6210;&#x5C31;&#x7684;&#x5173;&#x952E;&#x3002; &#x4E4B;&#x524D;&#x7684;&#x7CFB;&#x7EDF;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x7EDF;&#x4E00;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x516C;&#x544A;&#x677F;&#x7CFB;&#x7EDF;&#xFF08;BBS&#xFF09;&#x65F6;&#x4EE3;&#xFF0C;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x548C;&#x6CE2;&#x7279;&#x7387;&#x914D;&#x7F6E;&#x3002; &#x4ECE;&#x4E00;&#x4E2A;BBS&#x5230;&#x53E6;&#x4E00;&#x4E2A;BBS&#x7684;&#x5F15;&#x7528;&#x5FC5;&#x987B;&#x4EE5;&#x7535;&#x8BDD;&#x53F7;&#x7801;&#x548C;&#x8C03;&#x5236;&#x89E3;&#x8C03;&#x5668;&#x8BBE;&#x7F6E;&#x7684;&#x5F62;&#x5F0F;&#xFF1B;&#x7528;&#x6237;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x6302;&#x65AD;&#xFF0C;&#x62E8;&#x6253;&#x5176;&#x4ED6;BBS&#xFF0C;&#x7136;&#x540E;&#x624B;&#x52A8;&#x627E;&#x5230;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x5BFB;&#x627E;&#x7684;&#x4FE1;&#x606F;&#x3002; &#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x76F4;&#x63A5;&#x94FE;&#x63A5;&#x5230;&#x53E6;&#x4E00;&#x4E2A;BBS&#x5185;&#x7684;&#x4E00;&#x4E9B;&#x5185;&#x5BB9;&#x3002;<a href="#reffn_ii" title="Jump back to footnote [ii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x6309;&#x7167;&#x60EF;&#x4F8B;&#xFF0C;&#x8BB8;&#x591A;&#xFF08;&#x4F46;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#xFF09;Unix&#x7A0B;&#x5E8F;&#x5C06;&#x8FD9;&#x4E2A;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x89C6;&#x4E3A;ASCII&#x6587;&#x672C;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x793A;&#x4F8B;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF1A;<code>awk</code>&#xFF0C;<code>sort</code>&#xFF0C;<code>uniq</code>&#x548C;<code>head</code>&#x90FD;&#x5C06;&#x5B83;&#x4EEC;&#x7684;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x89C6;&#x4E3A;&#x7531;<code>\n</code>&#xFF08;&#x6362;&#x884C;&#x7B26;&#xFF0C;ASCII <code>0x0A</code>&#xFF09;&#x5B57;&#x7B26;&#x5206;&#x9694;&#x7684;&#x8BB0;&#x5F55;&#x5217;&#x8868;&#x3002; <code>\n</code>&#x7684;&#x9009;&#x62E9;&#x662F;&#x4EFB;&#x610F;&#x7684; &#x2014;&#x2014; &#x53EF;&#x4EE5;&#x8BF4;&#xFF0C;ASCII&#x8BB0;&#x5F55;&#x5206;&#x9694;&#x7B26;<code>0x1E</code>&#x672C;&#x6765;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E3A;&#x4E86;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3010;14&#x3011;&#xFF0C;&#x4F46;&#x662F;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x90FD;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x8BB0;&#x5F55;&#x5206;&#x9694;&#x7B26;&#x5141;&#x8BB8;&#x5B83;&#x4EEC;&#x4E92;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#xFF08;&#x5373;&#x4E00;&#x884C;&#x8F93;&#x5165;&#xFF09;&#x7684;&#x89E3;&#x6790;&#x5219;&#x66F4;&#x52A0;&#x6A21;&#x7CCA;&#x3002; Unix&#x5DE5;&#x5177;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x7A7A;&#x767D;&#x6216;&#x5236;&#x8868;&#x7B26;&#x5C06;&#x884C;&#x5206;&#x5272;&#x6210;&#x5B57;&#x6BB5;&#xFF0C;&#x4F46;&#x4E5F;&#x4F7F;&#x7528;CSV&#xFF08;&#x9017;&#x53F7;&#x5206;&#x9694;&#xFF09;&#xFF0C;&#x7BA1;&#x9053;&#x5206;&#x9694;&#x548C;&#x5176;&#x4ED6;&#x7F16;&#x7801;&#x3002;&#x5373;&#x4F7F;&#x50CF;<code>xargs</code>&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x5DE5;&#x5177;&#x4E5F;&#x6709;&#x516D;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#xFF0C;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x5982;&#x4F55;&#x89E3;&#x6790;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x200B;    ASCII&#x6587;&#x672C;&#x7684;&#x7EDF;&#x4E00;&#x63A5;&#x53E3;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x90FD;&#x80FD;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x5B83;&#x4E0D;&#x662F;&#x5F88;&#x4F18;&#x96C5;&#xFF1A;&#x6211;&#x4EEC;&#x7684;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x793A;&#x4F8B;&#x4F7F;&#x7528;<code>{print $7}</code>&#x6765;&#x63D0;&#x53D6;&#x7F51;&#x5740;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x8BFB;&#x6027;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x3002;&#x5728;&#x7406;&#x60F3;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#x53EF;&#x80FD;&#x662F;<code>{print $request_url}</code>&#x6216;&#x7C7B;&#x4F3C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6211;&#x4EEC;&#x7A0D;&#x540E;&#x4F1A;&#x56DE;&#x987E;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x3002;</p>
<p>&#x200B;    &#x5C3D;&#x7BA1;&#x51E0;&#x5341;&#x5E74;&#x540E;&#x8FD8;&#x4E0D;&#x591F;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x7EDF;&#x4E00;&#x7684;Unix&#x63A5;&#x53E3;&#x4ECD;&#x7136;&#x662F;&#x975E;&#x5E38;&#x51FA;&#x8272;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x8F6F;&#x4EF6;&#x80FD;&#x50CF;Unix&#x5DE5;&#x5177;&#x4E00;&#x6837;&#x4EA4;&#x4E92;&#x7EC4;&#x5408;&#x7684;&#x8FD9;&#x4E48;&#x597D;&#xFF1A;&#x4F60;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x81EA;&#x5B9A;&#x4E49;&#x5206;&#x6790;&#x5DE5;&#x5177;&#x8F7B;&#x677E;&#x5730;&#x5C06;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5E10;&#x6237;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x5728;&#x7EBF;&#x8D2D;&#x7269;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x4EE5;&#x7BA1;&#x9053;&#x4F20;&#x9001;&#x81F3;&#x7535;&#x5B50;&#x8868;&#x683C;&#x4E2D;&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x53D1;&#x5E03;&#x5230;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x6216;&#x7EF4;&#x57FA;&#x3002;&#x4ECA;&#x5929;&#xFF0C;&#x50CF;Unix&#x5DE5;&#x5177;&#x4E00;&#x6837;&#x6D41;&#x7545;&#x5730;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x662F;&#x4E00;&#x79CD;&#x4F8B;&#x5916;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x89C4;&#x8303;&#x3002;</p>
<p>&#x200B;    &#x5373;&#x4F7F;&#x662F;&#x5177;&#x6709;<strong>&#x76F8;&#x540C;&#x6570;&#x636E;&#x6A21;&#x578B;</strong>&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x79CD;&#x5BFC;&#x51FA;&#x518D;&#x5BFC;&#x5165;&#x53E6;&#x4E00;&#x79CD;&#x4E5F;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x7F3A;&#x4E4F;&#x6574;&#x5408;&#x5BFC;&#x81F4;&#x4E86;&#x6570;&#x636E;&#x7684;<strong>&#x5DF4;&#x5C14;&#x5E72;&#x5316;</strong><sup><a href="#fn_&#x8BD1;&#x6CE8;i" id="reffn_&#x8BD1;&#x6CE8;i">&#x8BD1;&#x6CE8;i</a></sup>&#x3002;</p>
<blockquote id="fn_&#x8BD1;&#x6CE8;i">
<sup>&#x8BD1;&#x6CE8;i</sup>. <strong>&#x5DF4;&#x5C14;&#x5E72;&#x5316;&#xFF08;Balkanization&#xFF09;</strong>&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x5E26;&#x6709;&#x8D2C;&#x4E49;&#x7684;&#x5730;&#x7F18;&#x653F;&#x6CBB;&#x5B66;&#x672F;&#x8BED;&#xFF0C;&#x5176;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;&#x4E00;&#x4E2A;&#x56FD;&#x5BB6;&#x6216;&#x653F;&#x533A;&#x5206;&#x88C2;&#x6210;&#x591A;&#x4E2A;&#x4E92;&#x76F8;&#x654C;&#x5BF9;&#x7684;&#x56FD;&#x5BB6;&#x6216;&#x653F;&#x533A;&#x7684;&#x8FC7;&#x7A0B;&#x3002;<a href="#reffn_&#x8BD1;&#x6CE8;i" title="Jump back to footnote [&#x8BD1;&#x6CE8;i] in the text."> &#x21A9;</a>
</blockquote>
<h4 id="&#x903B;&#x8F91;&#x4E0E;&#x5E03;&#x7EBF;&#x76F8;&#x5206;&#x79BB;">&#x903B;&#x8F91;&#x4E0E;&#x5E03;&#x7EBF;&#x76F8;&#x5206;&#x79BB;</h4>
<p>&#x200B;    Unix&#x5DE5;&#x5177;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x70B9;&#x662F;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x8F93;&#x5165;&#xFF08;<code>stdin</code>&#xFF09;&#x548C;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#xFF08;<code>stdout</code>&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x6307;&#x5B9A;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x6765;&#x81EA;&#x952E;&#x76D8;&#xFF0C;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x6307;&#x5411;&#x5C4F;&#x5E55;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x6587;&#x4EF6;&#x8F93;&#x5165;&#x548C;/&#x6216;&#x5C06;&#x8F93;&#x51FA;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x6587;&#x4EF6;&#x3002;&#x7BA1;&#x9053;&#x5141;&#x8BB8;&#x4F60;&#x5C06;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x9644;&#x52A0;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x6807;&#x51C6;&#x8F93;&#x5165;&#xFF08;&#x6709;&#x4E2A;&#x5C0F;&#x5185;&#x5B58;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5C06;&#x6574;&#x4E2A;&#x4E2D;&#x95F4;&#x6570;&#x636E;&#x6D41;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x7A0B;&#x5E8F;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x4E0D;&#x62C5;&#x5FC3;&#x7279;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#xFF0C;&#x53EA;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x548C;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#xFF0C;&#x5219;Unix&#x65B9;&#x6CD5;&#x6548;&#x679C;&#x6700;&#x597D;&#x3002;&#x8FD9;&#x5141;&#x8BB8;shell&#x7528;&#x6237;&#x4EE5;&#x4EFB;&#x4F55;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x65B9;&#x5F0F;&#x8FDE;&#x63A5;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF1B;&#x8BE5;&#x7A0B;&#x5E8F;&#x4E0D;&#x77E5;&#x9053;&#x6216;&#x4E0D;&#x5173;&#x5FC3;&#x8F93;&#x5165;&#x6765;&#x81EA;&#x54EA;&#x91CC;&#x4EE5;&#x53CA;&#x8F93;&#x51FA;&#x5230;&#x54EA;&#x91CC;&#x3002; &#xFF08;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;&#x8FD9;&#x662F;&#x4E00;&#x79CD;<strong>&#x677E;&#x8026;&#x5408;&#xFF08;loose coupling&#xFF09;</strong>&#xFF0C;<strong>&#x665A;&#x671F;&#x7ED1;&#x5B9A;&#xFF08;late binding&#xFF09;</strong>&#x3010;15&#x3011;&#x6216;<strong>&#x63A7;&#x5236;&#x53CD;&#x8F6C;&#xFF08;inversion of control&#xFF09;</strong>&#x3010;16&#x3011;&#xFF09;&#x3002;&#x5C06;&#x8F93;&#x5165;/&#x8F93;&#x51FA;&#x5E03;&#x7EBF;&#x4E0E;&#x7A0B;&#x5E8F;&#x903B;&#x8F91;&#x5206;&#x5F00;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5C0F;&#x5DE5;&#x5177;&#x7EC4;&#x5408;&#x6210;&#x66F4;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x200B;    &#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x5DE5;&#x5177;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x8BFB;&#x53D6;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x5C06;&#x8F93;&#x51FA;&#x5199;&#x5165;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#xFF0C;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x7BA1;&#x9053;&#x4E2D;&#x3002;&#x5728;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5C06;Usage-Agent&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x6362;&#x4E3A;&#x66F4;&#x7075;&#x654F;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x6216;&#x8005;&#x5C06;IP&#x5730;&#x5740;&#x8F6C;&#x6362;&#x4E3A;&#x56FD;&#x5BB6;&#x4EE3;&#x7801;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x63D2;&#x5165;&#x7BA1;&#x9053;&#x3002;<code>sort</code>&#x7A0B;&#x5E8F;&#x5E76;&#x4E0D;&#x5173;&#x5FC3;&#x5B83;&#x662F;&#x5426;&#x4E0E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x6216;&#x8005;&#x4F60;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x901A;&#x4FE1;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x4F7F;&#x7528;<code>stdin</code>&#x548C;<code>stdout</code>&#x80FD;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x6709;&#x9650;&#x7684;&#x3002;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x7684;&#x7A0B;&#x5E8F;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x975E;&#x5E38;&#x68D8;&#x624B;&#x3002;&#x4F60;&#x6CA1;&#x6CD5;&#x5C06;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x7BA1;&#x9053;&#x8FDE;&#x63A5;&#x81F3;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4E2D;&#x3010;17,18&#x3011;<sup><a href="#fn_iii" id="reffn_iii">iii</a></sup> &#x3002;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x76F4;&#x63A5;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x53E6;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x4F5C;&#x4E3A;&#x5B50;&#x8FDB;&#x7A0B;&#x542F;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#x6253;&#x5F00;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF0C;&#x90A3;&#x4E48;I/O&#x7684;&#x5E03;&#x7EBF;&#x5C31;&#x53D6;&#x51B3;&#x4E8E;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x4E86;&#x3002;&#x5B83;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x88AB;&#x914D;&#x7F6E;&#xFF08;&#x4F8B;&#x5982;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#xFF09;&#xFF0C;&#x4F46;&#x5728;Shell&#x4E2D;&#x5BF9;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x8FDB;&#x884C;&#x5E03;&#x7EBF;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x5C31;&#x5C11;&#x4E86;&#x3002;</p>
<blockquote id="fn_iii">
<sup>iii</sup>. &#x9664;&#x4E86;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5982;<code>netcat</code>&#x6216;<code>curl</code>&#x3002; Unix&#x5F00;&#x59CB;&#x8BD5;&#x56FE;&#x5C06;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x90FD;&#x8868;&#x793A;&#x4E3A;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;BSD&#x5957;&#x63A5;&#x5B57;API&#x504F;&#x79BB;&#x4E86;&#x8FD9;&#x4E2A;&#x60EF;&#x4F8B;&#x3010;17&#x3011;&#x3002;&#x7814;&#x7A76;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;Plan 9&#x548C;Inferno&#x5728;&#x4F7F;&#x7528;&#x6587;&#x4EF6;&#x65B9;&#x9762;&#x66F4;&#x52A0;&#x4E00;&#x81F4;&#xFF1A;&#x5B83;&#x4EEC;&#x5C06;TCP&#x8FDE;&#x63A5;&#x8868;&#x793A;&#x4E3A;<code>/net/tcp</code>&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x3010;18&#x3011;&#x3002;<a href="#reffn_iii" title="Jump back to footnote [iii] in the text."> &#x21A9;</a>
</blockquote>
<h4 id="&#x900F;&#x660E;&#x5EA6;&#x548C;&#x5B9E;&#x9A8C;">&#x900F;&#x660E;&#x5EA6;&#x548C;&#x5B9E;&#x9A8C;</h4>
<p>&#x4F7F;Unix&#x5DE5;&#x5177;&#x5982;&#x6B64;&#x6210;&#x529F;&#x7684;&#x90E8;&#x5206;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x4F7F;&#x67E5;&#x770B;&#x6B63;&#x5728;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#xFF1A;</p>
<ul>
<li>Unix&#x547D;&#x4EE4;&#x7684;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x901A;&#x5E38;&#x88AB;&#x89C6;&#x4E3A;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x8FD0;&#x884C;&#x547D;&#x4EE4;&#xFF0C;&#x5C1D;&#x8BD5;&#x5404;&#x79CD;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x635F;&#x574F;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x3002;</li>
</ul>
<ul>
<li>&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x7ED3;&#x675F;&#x7BA1;&#x9053;&#xFF0C;&#x5C06;&#x7BA1;&#x9053;&#x8F93;&#x51FA;&#x5230;<code>less</code>&#xFF0C;&#x7136;&#x540E;&#x67E5;&#x770B;&#x5B83;&#x662F;&#x5426;&#x5177;&#x6709;&#x9884;&#x671F;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x8FD9;&#x79CD;&#x68C0;&#x67E5;&#x80FD;&#x529B;&#x5BF9;&#x8C03;&#x8BD5;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</li>
<li>&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x6D41;&#x6C34;&#x7EBF;&#x9636;&#x6BB5;&#x7684;&#x8F93;&#x51FA;&#x5199;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x6587;&#x4EF6;&#x7528;&#x4F5C;&#x4E0B;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x8F93;&#x5165;&#x3002;&#x8FD9;&#x4F7F;&#x4F60;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x540E;&#x9762;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x6574;&#x4E2A;&#x7BA1;&#x9053;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E0E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x76F8;&#x6BD4;&#xFF0C;&#x5373;&#x4F7F;Unix&#x5DE5;&#x5177;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x5B9E;&#x9A8C;&#x800C;&#x8A00;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;Unix&#x5DE5;&#x5177;&#x7684;&#x6700;&#x5927;&#x5C40;&#x9650;&#x5728;&#x4E8E;&#x5B83;&#x4EEC;&#x53EA;&#x80FD;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C; &#x2014;&#x2014; &#x800C;Hadoop&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x5373;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#x3002;</p>
<h2 id="mapreduce&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;">MapReduce&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2>
<p>&#x200B;    MapReduce&#x6709;&#x70B9;&#x50CF;Unix&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x5206;&#x5E03;&#x5728;&#x6570;&#x5343;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x50CF;Unix&#x5DE5;&#x5177;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7C97;&#x66B4;&#xFF0C;&#x4F46;&#x4EE4;&#x4EBA;&#x60CA;&#x5F02;&#x5730;&#x7BA1;&#x7528;&#x3002;&#x4E00;&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x53EF;&#x4EE5;&#x548C;&#x4E00;&#x4E2A;Unix&#x8FDB;&#x7A0B;&#x76F8;&#x7C7B;&#x6BD4;&#xFF1A;&#x5B83;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x200B;    &#x548C;&#x5927;&#x591A;&#x6570;Unix&#x5DE5;&#x5177;&#x4E00;&#x6837;&#xFF0C;&#x8FD0;&#x884C;MapReduce&#x4F5C;&#x4E1A;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x4FEE;&#x6539;&#x8F93;&#x5165;&#xFF0C;&#x9664;&#x4E86;&#x751F;&#x6210;&#x8F93;&#x51FA;&#x5916;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x4EE5;&#x8FDE;&#x7EED;&#x7684;&#x65B9;&#x5F0F;&#x4E00;&#x6B21;&#x6027;&#x5199;&#x5165;&#xFF08;&#x4E00;&#x65E6;&#x5199;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x4F1A;&#x4FEE;&#x6539;&#x4EFB;&#x4F55;&#x73B0;&#x6709;&#x7684;&#x6587;&#x4EF6;&#x90E8;&#x5206;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x867D;&#x7136;Unix&#x5DE5;&#x5177;&#x4F7F;&#x7528;<code>stdin</code>&#x548C;<code>stdout</code>&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF0C;&#x4F46;MapReduce&#x4F5C;&#x4E1A;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x8BFB;&#x5199;&#x6587;&#x4EF6;&#x3002;&#x5728;Hadoop&#x7684;Map-Reduce&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x88AB;&#x79F0;&#x4E3A;<strong>HDFS&#xFF08;Hadoop&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF09;</strong>&#xFF0C;&#x4E00;&#x4E2A;Google&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF08;GFS&#xFF09;&#x7684;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#x3010;19&#x3011;&#x3002;</p>
<p>&#x200B;    &#x9664;HDFS&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x5404;&#x79CD;&#x5176;&#x4ED6;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;GlusterFS&#x548C;Quantcast File System&#xFF08;QFS&#xFF09;&#x3010;20&#x3011;&#x3002;&#x8BF8;&#x5982;Amazon S3&#xFF0C;Azure Blob&#x5B58;&#x50A8;&#x548C;OpenStack Swift &#x3010;21&#x3011;&#x7B49;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5728;&#x5F88;&#x591A;&#x65B9;&#x9762;&#x90FD;&#x662F;&#x76F8;&#x4F3C;&#x7684;<sup><a href="#fn_iv" id="reffn_iv">iv</a></sup>&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E3B;&#x8981;&#x4F7F;&#x7528;HDFS&#x4F5C;&#x4E3A;&#x793A;&#x4F8B;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#x9002;&#x7528;&#x4E8E;&#x4EFB;&#x4F55;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;</p>
<blockquote id="fn_iv">
<sup>iv</sup>. &#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5BF9;&#x4E8E;HDFS&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;&#x5B89;&#x6392;&#x5728;&#x5B58;&#x50A8;&#x7279;&#x5B9A;&#x6587;&#x4EF6;&#x526F;&#x672C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x901A;&#x5E38;&#x5C06;&#x5B58;&#x50A8;&#x548C;&#x8BA1;&#x7B97;&#x5206;&#x5F00;&#x3002;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x662F;&#x4E00;&#x4E2A;&#x74F6;&#x9888;&#xFF0C;&#x4ECE;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x6709;&#x6027;&#x80FD;&#x4F18;&#x52BF;&#x3002;&#x4F46;&#x662F;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x7EA0;&#x5220;&#x7801;&#xFF0C;&#x5219;&#x4F1A;&#x4E22;&#x5931;&#x5C40;&#x90E8;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x6765;&#x81EA;&#x591A;&#x53F0;&#x673A;&#x5668;&#x7684;&#x6570;&#x636E;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x5408;&#x5E76;&#x4EE5;&#x91CD;&#x5EFA;&#x539F;&#x59CB;&#x6587;&#x4EF6;&#x3010;20&#x3011;&#x3002;<a href="#reffn_iv" title="Jump back to footnote [iv] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x4E0E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5B58;&#x50A8;&#xFF08;NAS&#xFF09;&#x548C;&#x5B58;&#x50A8;&#x533A;&#x57DF;&#x7F51;&#x7EDC;&#xFF08;SAN&#xFF09;&#x67B6;&#x6784;&#x7684;&#x5171;&#x4EAB;&#x78C1;&#x76D8;&#x65B9;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;HDFS&#x57FA;&#x4E8E;<strong>&#x65E0;&#x5171;&#x4EAB;</strong>&#x539F;&#x5219;&#xFF08;&#x53C2;&#x89C1;<a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x524D;&#x8A00;</a>&#xFF09;&#x3002;&#x5171;&#x4EAB;&#x78C1;&#x76D8;&#x5B58;&#x50A8;&#x7531;&#x96C6;&#x4E2D;&#x5F0F;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x5B9E;&#x73B0;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x5B9A;&#x5236;&#x786C;&#x4EF6;&#x548C;&#x4E13;&#x7528;&#x7F51;&#x7EDC;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#xFF08;&#x5982;&#x5149;&#x7EA4;&#x901A;&#x9053;&#xFF09;&#x3002;&#x800C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x65E0;&#x5171;&#x4EAB;&#x65B9;&#x6CD5;&#x4E0D;&#x9700;&#x8981;&#x7279;&#x6B8A;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4F20;&#x7EDF;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x200B;    HDFS&#x5305;&#x542B;&#x5728;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#xFF0C;&#x5BF9;&#x5916;&#x66B4;&#x9732;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#xFF0C;&#x5141;&#x8BB8;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x8BBF;&#x95EE;&#x5B58;&#x50A8;&#x5728;&#x8BE5;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#xFF08;&#x5047;&#x8BBE;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E2D;&#x7684;&#x6BCF;&#x53F0;&#x901A;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x90FD;&#x6302;&#x8F7D;&#x7740;&#x4E00;&#x4E9B;&#x78C1;&#x76D8;&#xFF09;&#x3002;&#x540D;&#x4E3A;<strong>NameNode</strong>&#x7684;&#x4E2D;&#x592E;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x8DDF;&#x8E2A;&#x54EA;&#x4E2A;&#x6587;&#x4EF6;&#x5757;&#x5B58;&#x50A8;&#x5728;&#x54EA;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;HDFS&#x5728;&#x6982;&#x5FF5;&#x4E0A;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6240;&#x6709;&#x8FD0;&#x884C;&#x6709;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x7684;&#x673A;&#x5668;&#x7684;&#x78C1;&#x76D8;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x5BB9;&#x5FCD;&#x673A;&#x5668;&#x548C;&#x78C1;&#x76D8;&#x6545;&#x969C;&#xFF0C;&#x6587;&#x4EF6;&#x5757;&#x88AB;&#x590D;&#x5236;&#x5230;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x590D;&#x5236;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x591A;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x591A;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5982;<a href="ch5.html">&#x7B2C;5&#x7AE0;</a>&#x4E2D;&#x6240;&#x8FF0;&#xFF0C;&#x6216;&#x8005;&#x8BF8;&#x5982;Reed-Solomon&#x7801;&#x8FD9;&#x6837;&#x7684;&#x7EA0;&#x5220;&#x7801;&#x65B9;&#x6848;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4EE5;&#x6BD4;&#x5B8C;&#x5168;&#x590D;&#x5236;&#x66F4;&#x4F4E;&#x7684;&#x5B58;&#x50A8;&#x5F00;&#x9500;&#x4EE5;&#x6062;&#x590D;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x3010;20,22&#x3011;&#x3002;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x4E0E;RAID&#x76F8;&#x4F3C;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8FDE;&#x63A5;&#x5230;&#x540C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x7684;&#x591A;&#x4E2A;&#x78C1;&#x76D8;&#x4E0A;&#x63D0;&#x4F9B;&#x5197;&#x4F59;&#xFF1B;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6587;&#x4EF6;&#x8BBF;&#x95EE;&#x548C;&#x590D;&#x5236;&#x662F;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x4E0A;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x7279;&#x6B8A;&#x7684;&#x786C;&#x4EF6;&#x3002;</p>
<p>&#x200B;    HDFS&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x5DF2;&#x7ECF;&#x5F88;&#x4E0D;&#x9519;&#x4E86;&#xFF1A;&#x5728;&#x64B0;&#x5199;&#x672C;&#x4E66;&#x65F6;&#xFF0C;&#x6700;&#x5927;&#x7684;HDFS&#x90E8;&#x7F72;&#x8FD0;&#x884C;&#x5728;&#x4E0A;&#x4E07;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x603B;&#x5B58;&#x50A8;&#x5BB9;&#x91CF;&#x8FBE;&#x6570;&#x767E;PB&#x3010;23&#x3011;&#x3002;&#x5982;&#x6B64;&#x5927;&#x7684;&#x89C4;&#x6A21;&#x5DF2;&#x7ECF;&#x53D8;&#x5F97;&#x53EF;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x5546;&#x54C1;&#x786C;&#x4EF6;&#x548C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;HDFS&#x4E0A;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x548C;&#x8BBF;&#x95EE;&#x6210;&#x672C;&#x8FDC;&#x4F4E;&#x4E8E;&#x4E13;&#x7528;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x540C;&#x7B49;&#x5BB9;&#x91CF;&#x3010;24&#x3011;&#x3002;</p>
<h3 id="mapreduce&#x4F5C;&#x4E1A;&#x6267;&#x884C;">MapReduce&#x4F5C;&#x4E1A;&#x6267;&#x884C;</h3>
<p>&#x200B;    MapReduce&#x662F;&#x4E00;&#x4E2A;&#x7F16;&#x7A0B;&#x6846;&#x67B6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x6765;&#x5904;&#x7406;HDFS&#x7B49;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5927;&#x578B;&#x6570;&#x636E;&#x96C6;&#x3002;&#x7406;&#x89E3;&#x5B83;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x662F;&#x53C2;&#x8003;&#x201C;<a href="#&#x7B80;&#x5355;&#x65E5;&#x5FD7;&#x5206;&#x6790;">&#x7B80;&#x5355;&#x65E5;&#x5FD7;&#x5206;&#x6790;</a>&#x201D;&#x4E2D;&#x7684;Web&#x670D;&#x52A1;&#x5668;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x793A;&#x4F8B;&#x3002;MapReduce&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x6A21;&#x5F0F;&#x4E0E;&#x6B64;&#x793A;&#x4F8B;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF1A;</p>
<ol>
<li>&#x8BFB;&#x53D6;&#x4E00;&#x7EC4;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x89E3;&#x6210;<strong>&#x8BB0;&#x5F55;&#xFF08;records&#xFF09;</strong>&#x3002;&#x5728;Web&#x670D;&#x52A1;&#x5668;&#x65E5;&#x5FD7;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x90FD;&#x662F;&#x65E5;&#x5FD7;&#x4E2D;&#x7684;&#x4E00;&#x884C;&#xFF08;&#x5373;<code>\n</code>&#x662F;&#x8BB0;&#x5F55;&#x5206;&#x9694;&#x7B26;&#xFF09;&#x3002;</li>
<li>&#x8C03;&#x7528;Mapper&#x51FD;&#x6570;&#xFF0C;&#x4ECE;&#x6BCF;&#x6761;&#x8F93;&#x5165;&#x8BB0;&#x5F55;&#x4E2D;&#x63D0;&#x53D6;&#x4E00;&#x5BF9;&#x952E;&#x503C;&#x3002;&#x5728;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Mapper&#x51FD;&#x6570;&#x662F;<code>awk &apos;{print $7}&apos;</code>&#xFF1A;&#x5B83;&#x63D0;&#x53D6;URL&#xFF08;<code>$7</code>&#xFF09;&#x4F5C;&#x4E3A;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x5E76;&#x5C06;&#x503C;&#x7559;&#x7A7A;&#x3002;</li>
<li>&#x6309;&#x952E;&#x6392;&#x5E8F;&#x6240;&#x6709;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x3002;&#x5728;&#x65E5;&#x5FD7;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FD9;&#x7531;&#x7B2C;&#x4E00;&#x4E2A;<code>sort</code>&#x547D;&#x4EE4;&#x5B8C;&#x6210;&#x3002;</li>
<li>&#x8C03;&#x7528;Reducer&#x51FD;&#x6570;&#x904D;&#x5386;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x3002;&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;&#x952E;&#x51FA;&#x73B0;&#x591A;&#x6B21;&#xFF0C;&#x6392;&#x5E8F;&#x4F7F;&#x5B83;&#x4EEC;&#x5728;&#x5217;&#x8868;&#x4E2D;&#x76F8;&#x90BB;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7EC4;&#x5408;&#x8FD9;&#x4E9B;&#x503C;&#x800C;&#x4E0D;&#x5FC5;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x7559;&#x5F88;&#x591A;&#x72B6;&#x6001;&#x3002;&#x5728;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Reducer&#x662F;&#x7531;<code>uniq -c</code>&#x547D;&#x4EE4;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x8BE5;&#x547D;&#x4EE4;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x952E;&#x6765;&#x7EDF;&#x8BA1;&#x76F8;&#x90BB;&#x8BB0;&#x5F55;&#x7684;&#x6570;&#x91CF;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x56DB;&#x4E2A;&#x6B65;&#x9AA4;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x6267;&#x884C;&#x3002;&#x6B65;&#x9AA4;2&#xFF08;Map&#xFF09;&#x548C;4&#xFF08;Reduce&#xFF09;&#x662F;&#x4F60;&#x7F16;&#x5199;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6B65;&#x9AA4;1&#xFF08;&#x5C06;&#x6587;&#x4EF6;&#x5206;&#x89E3;&#x6210;&#x8BB0;&#x5F55;&#xFF09;&#x7531;&#x8F93;&#x5165;&#x683C;&#x5F0F;&#x89E3;&#x6790;&#x5668;&#x5904;&#x7406;&#x3002;&#x6B65;&#x9AA4;3&#x4E2D;&#x7684;&#x6392;&#x5E8F;&#x6B65;&#x9AA4;&#x9690;&#x542B;&#x5728;MapReduce&#x4E2D; &#x2014;&#x2014; &#x4F60;&#x4E0D;&#x5FC5;&#x7F16;&#x5199;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;Mapper&#x7684;&#x8F93;&#x51FA;&#x59CB;&#x7EC8;&#x5728;&#x9001;&#x5F80;Reducer&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x8981;&#x521B;&#x5EFA;MapReduce&#x4F5C;&#x4E1A;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x4E24;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF0C;Mapper&#x548C;Reducer&#xFF0C;&#x5176;&#x884C;&#x4E3A;&#x5982;&#x4E0B;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch2.html#MapReduce&#x67E5;&#x8BE2;">MapReduce&#x67E5;&#x8BE2;</a>&#x201D;&#xFF09;&#xFF1A;</p>
<p><strong><em>Mapper</em></strong></p>
<p>&#x200B;    Mapper&#x4F1A;&#x5728;&#x6BCF;&#x6761;&#x8F93;&#x5165;&#x8BB0;&#x5F55;&#x4E0A;&#x8C03;&#x7528;&#x4E00;&#x6B21;&#xFF0C;&#x5176;&#x5DE5;&#x4F5C;&#x662F;&#x4ECE;&#x8F93;&#x5165;&#x8BB0;&#x5F55;&#x4E2D;&#x63D0;&#x53D6;&#x952E;&#x503C;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x952E;&#x503C;&#x5BF9;&#xFF08;&#x5305;&#x62EC;None&#xFF09;&#x3002;&#x5B83;&#x4E0D;&#x4F1A;&#x4FDD;&#x7559;&#x4ECE;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x8BB0;&#x5F55;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x7684;&#x4EFB;&#x4F55;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;&#x8BB0;&#x5F55;&#x90FD;&#x662F;&#x72EC;&#x7ACB;&#x5904;&#x7406;&#x7684;&#x3002;</p>
<p><strong><em>Reducer</em></strong>
    MapReduce&#x6846;&#x67B6;&#x62C9;&#x53D6;&#x7531;Mapper&#x751F;&#x6210;&#x7684;&#x952E;&#x503C;&#x5BF9;&#xFF0C;&#x6536;&#x96C6;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x952E;&#x7684;&#x6240;&#x6709;&#x503C;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5728;&#x8FD9;&#x7EC4;&#x503C;&#x5217;&#x8868;&#x4E0A;&#x8FED;&#x4EE3;&#x8C03;&#x7528;Reducer&#x3002; Reducer&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x8F93;&#x51FA;&#x8BB0;&#x5F55;&#xFF08;&#x4F8B;&#x5982;&#x76F8;&#x540C;URL&#x7684;&#x51FA;&#x73B0;&#x6B21;&#x6570;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5728;Web&#x670D;&#x52A1;&#x5668;&#x65E5;&#x5FD7;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7B2C;5&#x6B65;&#x4E2D;&#x6709;&#x7B2C;&#x4E8C;&#x4E2A;<code>sort</code>&#x547D;&#x4EE4;&#xFF0C;&#x5B83;&#x6309;&#x8BF7;&#x6C42;&#x6570;&#x5BF9;URL&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3002;&#x5728;MapReduce&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x7B2C;&#x4E8C;&#x4E2A;&#x6392;&#x5E8F;&#x9636;&#x6BB5;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F16;&#x5199;&#x7B2C;&#x4E8C;&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x5E76;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x7528;&#x4F5C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#x6765;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x8FD9;&#x6837;&#x770B;&#x6765;&#xFF0C;Mapper&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5C06;&#x6570;&#x636E;&#x653E;&#x5165;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x6392;&#x5E8F;&#x7684;&#x8868;&#x5355;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;Reducer&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5904;&#x7406;&#x5DF2;&#x6392;&#x5E8F;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<h4 id="&#x5206;&#x5E03;&#x5F0F;&#x6267;&#x884C;mapreduce">&#x5206;&#x5E03;&#x5F0F;&#x6267;&#x884C;MapReduce</h4>
<p>&#x200B;    MapReduce&#x4E0E;Unix&#x547D;&#x4EE4;&#x7BA1;&#x9053;&#x7684;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;MapReduce&#x53EF;&#x4EE5;&#x5728;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x5E76;&#x884C;&#x6267;&#x884C;&#x8BA1;&#x7B97;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x6765;&#x663E;&#x5F0F;&#x5904;&#x7406;&#x5E76;&#x884C;&#x95EE;&#x9898;&#x3002;Mapper&#x548C;Reducer&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF1B;&#x5B83;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x7684;&#x8F93;&#x5165;&#x6765;&#x81EA;&#x54EA;&#x91CC;&#xFF0C;&#x6216;&#x8005;&#x8F93;&#x51FA;&#x53BB;&#x5F80;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#xFF0C;&#x6240;&#x4EE5;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5728;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#x6570;&#x636E;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x4E2D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6807;&#x51C6;&#x7684;Unix&#x5DE5;&#x5177;&#x4F5C;&#x4E3A;Mapper&#x548C;Reducer&#x3010;25&#x3011;&#xFF0C;&#x4F46;&#x66F4;&#x5E38;&#x89C1;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x88AB;&#x5B9E;&#x73B0;&#x4E3A;&#x4F20;&#x7EDF;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5728;Hadoop MapReduce&#x4E2D;&#xFF0C;Mapper&#x548C;Reducer&#x90FD;&#x662F;&#x5B9E;&#x73B0;&#x7279;&#x5B9A;&#x63A5;&#x53E3;&#x7684;Java&#x7C7B;&#x3002;&#x5728;MongoDB&#x548C;CouchDB&#x4E2D;&#xFF0C;Mapper&#x548C;Reducer&#x90FD;&#x662F;JavaScript&#x51FD;&#x6570;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch2.html#MapReduce&#x67E5;&#x8BE2;">MapReduce&#x67E5;&#x8BE2;</a>&#x201D;&#xFF09;&#x3002;</p>
<p>&#x200B;    <a href="">&#x56FE;10-1</a>&#x663E;&#x793A;&#x4E86;Hadoop MapReduce&#x4F5C;&#x4E1A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;&#x3002;&#x5176;&#x5E76;&#x884C;&#x5316;&#x57FA;&#x4E8E;&#x5206;&#x533A;&#xFF08;&#x53C2;&#x89C1;<a href="ch6.html">&#x7B2C;6&#x7AE0;</a>&#xFF09;&#xFF1A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#x901A;&#x5E38;&#x662F;HDFS&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x8F93;&#x5165;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x6216;&#x6587;&#x4EF6;&#x5757;&#x90FD;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5206;&#x533A;&#xFF0C;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x5904;&#x7406;map&#x4EFB;&#x52A1;&#xFF08;<a href="img/fig10-1.png">&#x56FE;10-1</a>&#x4E2D;&#x7684;m1&#xFF0C;m2&#x548C;m3&#x6807;&#x8BB0;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x7684;&#x5927;&#x5C0F;&#x901A;&#x5E38;&#x662F;&#x6570;&#x767E;&#x5146;&#x5B57;&#x8282;&#x3002; MapReduce&#x8C03;&#x5EA6;&#x5668;&#xFF08;&#x56FE;&#x4E2D;&#x672A;&#x663E;&#x793A;&#xFF09;&#x8BD5;&#x56FE;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x53F0;&#x5B58;&#x50A8;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x526F;&#x672C;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x6BCF;&#x4E2A;Mapper&#xFF0C;&#x53EA;&#x8981;&#x8BE5;&#x673A;&#x5668;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5907;&#x7528;RAM&#x548C;CPU&#x8D44;&#x6E90;&#x6765;&#x8FD0;&#x884C;Mapper&#x4EFB;&#x52A1;&#x3010;26&#x3011;&#x3002;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5C06;&#x8BA1;&#x7B97;&#x653E;&#x5728;&#x6570;&#x636E;&#x9644;&#x8FD1;</strong>&#x3010;27&#x3011;&#xFF1A;&#x5B83;&#x8282;&#x7701;&#x4E86;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x590D;&#x5236;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x51CF;&#x5C11;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#x5E76;&#x589E;&#x52A0;&#x5C40;&#x90E8;&#x6027;&#x3002;</p>
<p><img src="img/fig10-1.png" alt=""></p>
<p><strong>&#x56FE;10-1 &#x5177;&#x6709;&#x4E09;&#x4E2A;Mapper&#x548C;&#x4E09;&#x4E2A;Reducer&#x7684;MapReduce&#x4EFB;&#x52A1;</strong></p>
<p>&#x200B;    &#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E94;&#x8BE5;&#x5728;Mapper&#x4EFB;&#x52A1;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x5728;&#x5C06;&#x8981;&#x8FD0;&#x884C;&#x5B83;&#x7684;&#x673A;&#x5668;&#x4E0A;&#x8FD8;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x6240;&#x4EE5;MapReduce&#x6846;&#x67B6;&#x9996;&#x5148;&#x5C06;&#x4EE3;&#x7801;&#xFF08;&#x4F8B;&#x5982;Java&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;JAR&#x6587;&#x4EF6;&#xFF09;&#x590D;&#x5236;&#x5230;&#x9002;&#x5F53;&#x7684;&#x673A;&#x5668;&#x3002;&#x7136;&#x540E;&#x542F;&#x52A8;Map&#x4EFB;&#x52A1;&#x5E76;&#x5F00;&#x59CB;&#x8BFB;&#x53D6;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x4E00;&#x6B21;&#x5C06;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x4F20;&#x5165;Mapper&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x3002;Mapper&#x7684;&#x8F93;&#x51FA;&#x7531;&#x952E;&#x503C;&#x5BF9;&#x7EC4;&#x6210;&#x3002;</p>
<p>&#x200B;    &#x8BA1;&#x7B97;&#x7684;Reduce&#x7AEF;&#x4E5F;&#x88AB;&#x5206;&#x533A;&#x3002;&#x867D;&#x7136;Map&#x4EFB;&#x52A1;&#x7684;&#x6570;&#x91CF;&#x7531;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x5757;&#x7684;&#x6570;&#x91CF;&#x51B3;&#x5B9A;&#xFF0C;&#x4F46;Reducer&#x7684;&#x4EFB;&#x52A1;&#x7684;&#x6570;&#x91CF;&#x662F;&#x7531;&#x4F5C;&#x4E1A;&#x4F5C;&#x8005;&#x914D;&#x7F6E;&#x7684;&#xFF08;&#x5B83;&#x53EF;&#x4EE5;&#x4E0D;&#x540C;&#x4E8E;Map&#x4EFB;&#x52A1;&#x7684;&#x6570;&#x91CF;&#xFF09;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x5177;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;&#x6240;&#x6709;&#x952E;&#x503C;&#x5BF9;&#x6700;&#x7EC8;&#x843D;&#x5728;&#x76F8;&#x540C;&#x7684;Reducer&#x5904;&#xFF0C;&#x6846;&#x67B6;&#x4F7F;&#x7528;&#x952E;&#x7684;&#x6563;&#x5217;&#x503C;&#x6765;&#x786E;&#x5B9A;&#x54EA;&#x4E2A;Reduce&#x4EFB;&#x52A1;&#x5E94;&#x8BE5;&#x63A5;&#x6536;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x952E;&#x503C;&#x5BF9;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="ch6.html#&#x6309;&#x952E;&#x6563;&#x5217;&#x5206;&#x533A;">&#x6309;&#x952E;&#x6563;&#x5217;&#x5206;&#x533A;</a>&#x201D;&#xFF09;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x952E;&#x503C;&#x5BF9;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x96C6;&#x53EF;&#x80FD;&#x592A;&#x5927;&#xFF0C;&#x65E0;&#x6CD5;&#x5728;&#x5355;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x4F7F;&#x7528;&#x5E38;&#x89C4;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5206;&#x7C7B;&#x662F;&#x5206;&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x9996;&#x5148;&#x6BCF;&#x4E2A;Map&#x4EFB;&#x52A1;&#x90FD;&#x6309;&#x7167;Reducer&#x5BF9;&#x8F93;&#x51FA;&#x8FDB;&#x884C;&#x5206;&#x533A;&#x3002;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x90FD;&#x88AB;&#x5199;&#x5165;Mapper&#x7A0B;&#x5E8F;&#x7684;&#x672C;&#x5730;&#x78C1;&#x76D8;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x672F;&#x4E0E;&#x6211;&#x4EEC;&#x5728;&#x201C;<a href="ch3.html#SSTables&#x4E0E;LSM&#x6811;">SSTables&#x4E0E;LSM&#x6811;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x7C7B;&#x4F3C;&#x3002;</p>
<p>&#x200B;    &#x53EA;&#x8981;&#x5F53;Mapper&#x8BFB;&#x53D6;&#x5B8C;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5199;&#x5B8C;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;MapReduce&#x8C03;&#x5EA6;&#x5668;&#x5C31;&#x4F1A;&#x901A;&#x77E5;Reducer&#x53EF;&#x4EE5;&#x4ECE;&#x8BE5;Mapper&#x5F00;&#x59CB;&#x83B7;&#x53D6;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x3002;Reducer&#x8FDE;&#x63A5;&#x5230;&#x6BCF;&#x4E2A;Mapper&#xFF0C;&#x5E76;&#x4E0B;&#x8F7D;&#x81EA;&#x5DF1;&#x76F8;&#x5E94;&#x5206;&#x533A;&#x7684;&#x6709;&#x5E8F;&#x952E;&#x503C;&#x5BF9;&#x6587;&#x4EF6;&#x3002;&#x6309;Reducer&#x5206;&#x533A;&#xFF0C;&#x6392;&#x5E8F;&#xFF0C;&#x4ECE;Mapper&#x5411;Reducer&#x590D;&#x5236;&#x5206;&#x533A;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E00;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6DF7;&#x6D17;&#xFF08;shuffle&#xFF09;</strong>&#x3010;26&#x3011;&#xFF08;&#x4E00;&#x4E2A;&#x5BB9;&#x6613;&#x6DF7;&#x6DC6;&#x7684;&#x672F;&#x8BED;  &#x2014;&#x2014; &#x4E0D;&#x50CF;&#x6D17;&#x724C;&#xFF0C;&#x5728;MapReduce&#x4E2D;&#x7684;&#x6DF7;&#x6D17;&#x6CA1;&#x6709;&#x968F;&#x673A;&#x6027;&#xFF09;&#x3002;</p>
<p>&#x200B;    Reduce&#x4EFB;&#x52A1;&#x4ECE;Mapper&#x83B7;&#x53D6;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x4FDD;&#x7559;&#x6709;&#x5E8F;&#x7279;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x540C;&#x7684;Mapper&#x751F;&#x6210;&#x4E86;&#x952E;&#x76F8;&#x540C;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x5219;&#x5728;Reducer&#x7684;&#x8F93;&#x5165;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BB0;&#x5F55;&#x5C06;&#x4F1A;&#x76F8;&#x90BB;&#x3002;</p>
<p>&#x200B;    Reducer&#x8C03;&#x7528;&#x65F6;&#x4F1A;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x952E;&#xFF0C;&#x548C;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x5668;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#xFF0C;&#x8FED;&#x4EE3;&#x5668;&#x4F1A;&#x987A;&#x5E8F;&#x5730;&#x626B;&#x8FC7;&#x6240;&#x6709;&#x5177;&#x6709;&#x8BE5;&#x952E;&#x7684;&#x8BB0;&#x5F55;&#xFF08;&#x56E0;&#x4E3A;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x5B8C;&#x5168;&#x653E;&#x5165;&#x5185;&#x5B58;&#x4E2D;&#xFF09;&#x3002;Reducer&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x610F;&#x903B;&#x8F91;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x8F93;&#x51FA;&#x8BB0;&#x5F55;&#x3002;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x8BB0;&#x5F55;&#x4F1A;&#x5199;&#x5165;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x5728;&#x8DD1;Reducer&#x7684;&#x673A;&#x5668;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x4E0A;&#x7559;&#x4E00;&#x4EFD;&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x4E0A;&#x7559;&#x51E0;&#x4EFD;&#x526F;&#x672C;&#xFF09;&#x3002;</p>
<h4 id="mapreduce&#x5DE5;&#x4F5C;&#x6D41;">MapReduce&#x5DE5;&#x4F5C;&#x6D41;</h4>
<p>&#x200B;    &#x5355;&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x8303;&#x56F4;&#x5F88;&#x6709;&#x9650;&#x3002;&#x4EE5;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x4E3A;&#x4F8B;&#xFF0C;&#x5355;&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x6BCF;&#x4E2A;URL&#x7684;&#x9875;&#x9762;&#x6D4F;&#x89C8;&#x6B21;&#x6570;&#xFF0C;&#x4F46;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x6700;&#x5E38;&#x89C1;&#x7684;URL&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x9700;&#x8981;&#x7B2C;&#x4E8C;&#x8F6E;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#x5C06;MapReduce&#x4F5C;&#x4E1A;&#x94FE;&#x63A5;&#x6210;&#x4E3A;<strong>&#x5DE5;&#x4F5C;&#x6D41;&#xFF08;workflow&#xFF09;</strong>&#x4E2D;&#x662F;&#x6781;&#x4E3A;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x6210;&#x4E3A;&#x4E0B;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#x3002; Hadoop Map-Reduce&#x6846;&#x67B6;&#x5BF9;&#x5DE5;&#x4F5C;&#x6D41;&#x6CA1;&#x6709;&#x7279;&#x6B8A;&#x652F;&#x6301;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x94FE;&#x662F;&#x901A;&#x8FC7;&#x76EE;&#x5F55;&#x540D;&#x9690;&#x5F0F;&#x5B9E;&#x73B0;&#x7684;&#xFF1A;&#x7B2C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x8F93;&#x51FA;&#x914D;&#x7F6E;&#x4E3A;HDFS&#x4E2D;&#x7684;&#x6307;&#x5B9A;&#x76EE;&#x5F55;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F5C;&#x4E1A;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x8F93;&#x5165;&#x914D;&#x7F6E;&#x4E3A;&#x4ECE;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#x3002;&#x4ECE;MapReduce&#x6846;&#x67B6;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x662F;&#x662F;&#x4E24;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4F5C;&#x4E1A;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;&#x88AB;&#x94FE;&#x63A5;&#x7684;MapReduce&#x4F5C;&#x4E1A;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x50CF;Unix&#x547D;&#x4EE4;&#x7BA1;&#x9053;&#xFF08;&#x5B83;&#x76F4;&#x63A5;&#x5C06;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x8F93;&#x51FA;&#x4F5C;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4EC5;&#x7528;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x7F13;&#x51B2;&#x533A;&#xFF09;&#x3002;&#x5B83;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x547D;&#x4EE4;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x8F93;&#x51FA;&#x5199;&#x5165;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;&#x4E0B;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x4ECE;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x3002;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x6709;&#x5229;&#x4E5F;&#x6709;&#x5F0A;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="#&#x7269;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;">&#x7269;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x200B;    &#x53EA;&#x6709;&#x5F53;&#x4F5C;&#x4E1A;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x624D;&#x4F1A;&#x88AB;&#x89C6;&#x4E3A;&#x6709;&#x6548;&#x7684;&#xFF08;MapReduce&#x4F1A;&#x4E22;&#x5F03;&#x5931;&#x8D25;&#x4F5C;&#x4E1A;&#x7684;&#x90E8;&#x5206;&#x8F93;&#x51FA;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5DE5;&#x4F5C;&#x6D41;&#x4E2D;&#x7684;&#x4E00;&#x9879;&#x4F5C;&#x4E1A;&#x53EA;&#x6709;&#x5728;&#x5148;&#x524D;&#x7684;&#x4F5C;&#x4E1A; &#x2014;&#x2014; &#x5373;&#x751F;&#x4EA7;&#x5176;&#x8F93;&#x5165;&#x7684;&#x4F5C;&#x4E1A; &#x2014;&#x2014; &#x6210;&#x529F;&#x5B8C;&#x6210;&#x540E;&#x624D;&#x80FD;&#x5F00;&#x59CB;&#x3002;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x4F5C;&#x4E1A;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x6709;&#x5F88;&#x591A;&#x9488;&#x5BF9;Hadoop&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x8C03;&#x5EA6;&#x5668;&#x88AB;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#xFF0C;&#x5305;&#x62EC;Oozie&#xFF0C;Azkaban&#xFF0C;Luigi&#xFF0C;Airflow&#x548C;Pinball &#x3010;28&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E9B;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x8FD8;&#x5177;&#x6709;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#xFF0C;&#x5728;&#x7EF4;&#x62A4;&#x5927;&#x91CF;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x65F6;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x5728;&#x6784;&#x5EFA;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x7531;50&#x5230;100&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x7EC4;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x662F;&#x5E38;&#x89C1;&#x7684;&#x3010;29&#x3011;&#x3002;&#x800C;&#x5728;&#x5927;&#x578B;&#x7EC4;&#x7EC7;&#x4E2D;&#xFF0C;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x56E2;&#x961F;&#x53EF;&#x80FD;&#x8FD0;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x4F5C;&#x4E1A;&#x6765;&#x8BFB;&#x53D6;&#x5F7C;&#x6B64;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x5DE5;&#x5177;&#x652F;&#x6301;&#x5BF9;&#x4E8E;&#x7BA1;&#x7406;&#x8FD9;&#x6837;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x6D41;&#x800C;&#x8A00;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x200B;    Hadoop&#x7684;&#x5404;&#x79CD;&#x9AD8;&#x7EA7;&#x5DE5;&#x5177;&#xFF08;&#x5982;Pig &#x3010;30&#x3011;&#xFF0C;Hive &#x3010;31&#x3011;&#xFF0C;Cascading &#x3010;32&#x3011;&#xFF0C;Crunch &#x3010;33&#x3011;&#x548C;FlumeJava &#x3010;34&#x3011;&#xFF09;&#x4E5F;&#x80FD;&#x81EA;&#x52A8;&#x5E03;&#x7EBF;&#x7EC4;&#x88C5;&#x591A;&#x4E2A;MapReduce&#x9636;&#x6BB5;&#xFF0C;&#x751F;&#x6210;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x3002;</p>
<h3 id="reduce&#x4FA7;&#x8FDE;&#x63A5;&#x4E0E;&#x5206;&#x7EC4;">Reduce&#x4FA7;&#x8FDE;&#x63A5;&#x4E0E;&#x5206;&#x7EC4;</h3>
<p>&#x200B;    &#x6211;&#x4EEC;&#x5728;<a href="ch2.html">&#x7B2C;2&#x7AE0;</a>&#x4E2D;&#x8BA8;&#x8BBA;&#x4E86;&#x6570;&#x636E;&#x6A21;&#x578B;&#x548C;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x7684;&#x8054;&#x63A5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x6DF1;&#x5165;&#x63A2;&#x8BA8;&#x8FDE;&#x63A5;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x73B0;&#x5728;&#x662F;&#x6211;&#x4EEC;&#x518D;&#x6B21;&#x6361;&#x8D77;&#x8FD9;&#x6761;&#x7EBF;&#x7D22;&#x7684;&#x65F6;&#x5019;&#x4E86;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#xFF0C;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x4E0E;&#x53E6;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x5B58;&#x5728;&#x5173;&#x8054;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#xFF1A;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x4E2D;&#x7684;<strong>&#x5916;&#x952E;</strong>&#xFF0C;&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;<strong>&#x6587;&#x6863;&#x5F15;&#x7528;</strong>&#x6216;&#x56FE;&#x6A21;&#x578B;&#x4E2D;&#x7684;<strong>&#x8FB9;</strong>&#x3002;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x8FD9;&#x4E00;&#x5173;&#x8054;&#x7684;&#x4E24;&#x4FA7;&#xFF08;&#x6301;&#x6709;&#x5F15;&#x7528;&#x7684;&#x8BB0;&#x5F55;&#x4E0E;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x8BB0;&#x5F55;&#xFF09;&#x65F6;&#xFF0C;&#x8FDE;&#x63A5;&#x5C31;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;&#x6B63;&#x5982;<a href="ch2.html">&#x7B2C;2&#x7AE0;</a>&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x975E;&#x89C4;&#x8303;&#x5316;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5BF9;&#x8FDE;&#x63A5;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x65E0;&#x6CD5;&#x5C06;&#x5176;&#x5B8C;&#x5168;&#x79FB;&#x9664;<sup><a href="#fn_v" id="reffn_v">v</a></sup>&#x3002;</p>
<blockquote id="fn_v">
<sup>v</sup>. &#x6211;&#x4EEC;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x8FDE;&#x63A5;&#x901A;&#x5E38;&#x662F;&#x7B49;&#x503C;&#x8FDE;&#x63A5;&#xFF0C;&#x5373;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x8FDE;&#x63A5;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x4E2D;&#x8BB0;&#x5F55;&#x4E0E;&#x5176;&#x4ED6;&#x8BB0;&#x5F55;&#x5728;&#x7279;&#x5B9A;&#x5B57;&#x6BB5;&#xFF08;&#x4F8B;&#x5982;ID&#xFF09;&#x4E2D;&#x5177;&#x6709;<strong>&#x76F8;&#x540C;&#x503C;</strong>&#x76F8;&#x5173;&#x8054;&#x3002;&#x6709;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x652F;&#x6301;&#x66F4;&#x901A;&#x7528;&#x7684;&#x8FDE;&#x63A5;&#x7C7B;&#x578B;&#xFF0C;&#x4F8B;&#x5982;&#x4F7F;&#x7528;&#x5C0F;&#x4E8E;&#x8FD0;&#x7B97;&#x7B26;&#x800C;&#x4E0D;&#x662F;&#x7B49;&#x53F7;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5730;&#x65B9;&#x6765;&#x8BB2;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x3002;<a href="#reffn_v" title="Jump back to footnote [v] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x6267;&#x884C;&#x53EA;&#x6D89;&#x53CA;&#x5C11;&#x91CF;&#x8BB0;&#x5F55;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;<strong>&#x7D22;&#x5F15;</strong>&#x6765;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BB0;&#x5F55;&#xFF08;&#x53C2;&#x9605;<a href="ch3.html">&#x7B2C;3&#x7AE0;</a>&#xFF09;&#x3002;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x6D89;&#x53CA;&#x5230;&#x8FDE;&#x63A5;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x6D89;&#x53CA;&#x5230;&#x67E5;&#x627E;&#x591A;&#x4E2A;&#x7D22;&#x5F15;&#x3002;&#x7136;&#x800C;MapReduce&#x6CA1;&#x6709;&#x7D22;&#x5F15;&#x7684;&#x6982;&#x5FF5; &#x2014;&#x2014; &#x81F3;&#x5C11;&#x5728;&#x901A;&#x5E38;&#x610F;&#x4E49;&#x4E0A;&#x6CA1;&#x6709;&#x3002;</p>
<p>&#x200B;    &#x5F53;MapReduce&#x4F5C;&#x4E1A;&#x88AB;&#x8D4B;&#x4E88;&#x4E00;&#x7EC4;&#x6587;&#x4EF6;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x65F6;&#xFF0C;&#x5B83;&#x8BFB;&#x53D6;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x7684;&#x5168;&#x90E8;&#x5185;&#x5BB9;&#xFF1B;&#x6570;&#x636E;&#x5E93;&#x4F1A;&#x5C06;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x79F0;&#x4E3A;<strong>&#x5168;&#x8868;&#x626B;&#x63CF;</strong>&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x60F3;&#x8BFB;&#x53D6;&#x5C11;&#x91CF;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x5219;&#x5168;&#x8868;&#x626B;&#x63CF;&#x4E0E;&#x7D22;&#x5F15;&#x67E5;&#x8BE2;&#x76F8;&#x6BD4;&#xFF0C;&#x4EE3;&#x4EF7;&#x975E;&#x5E38;&#x9AD8;&#x6602;&#x3002;&#x4F46;&#x662F;&#x5728;&#x5206;&#x6790;&#x67E5;&#x8BE2;&#x4E2D;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x8FD8;&#x662F;&#x5206;&#x6790;&#xFF1F;">&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x6216;&#x5206;&#x6790;&#xFF1F;</a>&#x201D;&#xFF09;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x5927;&#x91CF;&#x8BB0;&#x5F55;&#x7684;&#x805A;&#x5408;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x80FD;&#x5728;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x5E76;&#x884C;&#x5904;&#x7406;&#x65F6;&#xFF0C;&#x626B;&#x63CF;&#x6574;&#x4E2A;&#x8F93;&#x5165;&#x53EF;&#x80FD;&#x662F;&#x76F8;&#x5F53;&#x5408;&#x7406;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x200B;    &#x5F53;&#x6211;&#x4EEC;&#x5728;&#x6279;&#x5904;&#x7406;&#x7684;&#x8BED;&#x5883;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6307;&#x7684;&#x662F;&#x5728;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x89E3;&#x6790;&#x67D0;&#x79CD;&#x5173;&#x8054;&#x7684;&#x5168;&#x91CF;&#x5B58;&#x5728;&#x3002; &#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x662F;&#x540C;&#x65F6;&#x5904;&#x7406;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x975E;&#x4EC5;&#x4EC5;&#x662F;&#x4E3A;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x67E5;&#x627E;&#x6570;&#x636E;&#xFF08;&#x800C;&#x8FD9;&#x80FD;&#x901A;&#x8FC7;&#x7D22;&#x5F15;&#x66F4;&#x9AD8;&#x6548;&#x5730;&#x5B8C;&#x6210;&#xFF09;&#x3002;</p>
<h4 id="&#x793A;&#x4F8B;&#xFF1A;&#x5206;&#x6790;&#x7528;&#x6237;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;">&#x793A;&#x4F8B;&#xFF1A;&#x5206;&#x6790;&#x7528;&#x6237;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;</h4>
<p>&#x200B;    <a href="img/fig10-2.png">&#x56FE;10-2</a>&#x7ED9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x4E2D;&#x8FDE;&#x63A5;&#x7684;&#x5178;&#x578B;&#x4F8B;&#x5B50;&#x3002;&#x5DE6;&#x4FA7;&#x662F;&#x4E8B;&#x4EF6;&#x65E5;&#x5FD7;&#xFF0C;&#x63CF;&#x8FF0;&#x767B;&#x5F55;&#x7528;&#x6237;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF08;&#x79F0;&#x4E3A;<strong>&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#xFF08;activity events&#xFF09;</strong>&#x6216;<strong>&#x70B9;&#x51FB;&#x6D41;&#x6570;&#x636E;&#xFF08;clickstream data&#xFF09;</strong>&#xFF09;&#xFF0C;&#x53F3;&#x4FA7;&#x662F;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x3002; &#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x6B64;&#x793A;&#x4F8B;&#x770B;&#x4F5C;&#x662F;&#x661F;&#x578B;&#x6A21;&#x5F0F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x661F;&#x578B;&#x548C;&#x96EA;&#x82B1;&#x578B;&#xFF1A;&#x5206;&#x6790;&#x7684;&#x6A21;&#x5F0F;">&#x661F;&#x578B;&#x548C;&#x96EA;&#x82B1;&#x578B;&#xFF1A;&#x5206;&#x6790;&#x7684;&#x6A21;&#x5F0F;</a>&#x201D;&#xFF09;&#xFF1A;&#x4E8B;&#x4EF6;&#x65E5;&#x5FD7;&#x662F;&#x4E8B;&#x5B9E;&#x8868;&#xFF0C;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x3002;</p>
<p><img src="img/fig10-2.png" alt=""></p>
<p><strong>&#x56FE;10-2 &#x7528;&#x6237;&#x884C;&#x4E3A;&#x65E5;&#x5FD7;&#x4E0E;&#x7528;&#x6237;&#x6863;&#x6848;&#x7684;&#x8FDE;&#x63A5;</strong></p>
<p>&#x200B;    &#x5206;&#x6790;&#x4EFB;&#x52A1;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5C06;&#x7528;&#x6237;&#x6D3B;&#x52A8;&#x4E0E;&#x7528;&#x6237;&#x7B80;&#x6863;&#x76F8;&#x5173;&#x8054;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6863;&#x6848;&#x5305;&#x542B;&#x7528;&#x6237;&#x7684;&#x5E74;&#x9F84;&#x6216;&#x51FA;&#x751F;&#x65E5;&#x671F;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x66F4;&#x53D7;&#x54EA;&#x4E9B;&#x5E74;&#x9F84;&#x6BB5;&#x7684;&#x7528;&#x6237;&#x6B22;&#x8FCE;&#x3002;&#x7136;&#x800C;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x4EC5;&#x5305;&#x542B;&#x7528;&#x6237;ID&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x5B8C;&#x6574;&#x7684;&#x7528;&#x6237;&#x6863;&#x6848;&#x4FE1;&#x606F;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x4E2D;&#x5D4C;&#x5165;&#x8FD9;&#x4E9B;&#x6863;&#x6848;&#x4FE1;&#x606F;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x6D6A;&#x8D39;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x9700;&#x8981;&#x4E0E;&#x7528;&#x6237;&#x6863;&#x6848;&#x6570;&#x636E;&#x5E93;&#x76F8;&#x8FDE;&#x63A5;&#x3002;</p>
<p>&#x200B;    &#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x8FDE;&#x63A5;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x9010;&#x4E2A;&#x904D;&#x5386;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E76;&#x4E3A;&#x6BCF;&#x4E2A;&#x9047;&#x5230;&#x7684;&#x7528;&#x6237;ID&#x67E5;&#x8BE2;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x5728;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x6027;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x975E;&#x5E38;&#x5DEE;&#xFF1A;&#x5904;&#x7406;&#x541E;&#x5410;&#x91CF;&#x5C06;&#x53D7;&#x9650;&#x4E8E;&#x53D7;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;&#xFF0C;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x7684;&#x6709;&#x6548;&#x6027;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53D6;&#x51B3;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#x5927;&#x91CF;&#x67E5;&#x8BE2;&#x53EF;&#x80FD;&#x4F1A;&#x8F7B;&#x6613;&#x538B;&#x57AE;&#x6570;&#x636E;&#x5E93;&#x3010;35&#x3011;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x5728;&#x6279;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B9E;&#x73B0;&#x826F;&#x597D;&#x7684;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x8BA1;&#x7B97;&#x5FC5;&#x987B;&#xFF08;&#x5C3D;&#x53EF;&#x80FD;&#xFF09;&#x9650;&#x4E8E;&#x5355;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8FDB;&#x884C;&#x3002;&#x4E3A;&#x5F85;&#x5904;&#x7406;&#x7684;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x53D1;&#x8D77;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x6162;&#x4E86;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x67E5;&#x8BE2;&#x8FDC;&#x7A0B;&#x6570;&#x636E;&#x5E93;&#x610F;&#x5473;&#x7740;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x53D8;&#x4E3A;<strong>&#x975E;&#x786E;&#x5B9A;&#x7684;&#xFF08;nondeterministic&#xFF09;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x8FDC;&#x7A0B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4F1A;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x7684;&#x526F;&#x672C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;ETL&#x8FDB;&#x7A0B;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x5907;&#x4EFD;&#x4E2D;&#x63D0;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x6570;&#x636E;&#x4ED3;&#x5E93;">&#x6570;&#x636E;&#x4ED3;&#x5E93;</a>&#x201D;&#xFF09;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x548C;&#x7528;&#x6237;&#x884C;&#x4E3A;&#x65E5;&#x5FD7;&#x653E;&#x5165;&#x540C;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#x5728;HDFS&#x4E2D;&#x7684;&#x4E00;&#x7EC4;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x800C;&#x7528;&#x6237;&#x6D3B;&#x52A8;&#x8BB0;&#x5F55;&#x5B58;&#x50A8;&#x5728;&#x53E6;&#x4E00;&#x7EC4;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5E76;&#x80FD;&#x7528;MapReduce&#x5C06;&#x6240;&#x6709;&#x76F8;&#x5173;&#x8BB0;&#x5F55;&#x96C6;&#x4E2D;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x9AD8;&#x6548;&#x5904;&#x7406;&#x3002;</p>
<h4 id="&#x6392;&#x5E8F;&#x5408;&#x5E76;&#x8FDE;&#x63A5;">&#x6392;&#x5E8F;&#x5408;&#x5E76;&#x8FDE;&#x63A5;</h4>
<p>&#x200B;    &#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;Mapper&#x7684;&#x76EE;&#x7684;&#x662F;&#x4ECE;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x8BB0;&#x5F55;&#x4E2D;&#x63D0;&#x53D6;&#x4E00;&#x5BF9;&#x952E;&#x503C;&#x3002;&#x5728;<a href="img/fig10-2.png">&#x56FE;10-2</a>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E2A;&#x952E;&#x5C31;&#x662F;&#x7528;&#x6237;ID&#xFF1A;&#x4E00;&#x7EC4;Mapper&#x4F1A;&#x626B;&#x8FC7;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#xFF08;&#x63D0;&#x53D6;&#x7528;&#x6237;ID&#x4F5C;&#x4E3A;&#x952E;&#xFF0C;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x4F5C;&#x4E3A;&#x503C;&#xFF09;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x7EC4;Mapper&#x5C06;&#x4F1A;&#x626B;&#x8FC7;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x63D0;&#x53D6;&#x7528;&#x6237;ID&#x4F5C;&#x4E3A;&#x952E;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x51FA;&#x751F;&#x65E5;&#x671F;&#x4F5C;&#x4E3A;&#x503C;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5982;<a href="img/fig10-3.png">&#x56FE;10-3</a>&#x6240;&#x793A;&#x3002;</p>
<p><img src="img/fig10-3.png" alt=""></p>
<p><strong>&#x56FE;10-3 &#x5728;&#x7528;&#x6237;ID&#x4E0A;&#x8FDB;&#x884C;&#x7684;Reduce&#x7AEF;&#x8FDE;&#x63A5;&#x3002;&#x5982;&#x679C;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#x5206;&#x533A;&#x4E3A;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x90FD;&#x4F1A;&#x88AB;&#x591A;&#x4E2A;Mapper&#x5E76;&#x884C;&#x5904;&#x7406;</strong></p>
<p>&#x200B;    &#x5F53;MapReduce&#x6846;&#x67B6;&#x901A;&#x8FC7;&#x952E;&#x5BF9;Mapper&#x8F93;&#x51FA;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x952E;&#x503C;&#x5BF9;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x65F6;&#xFF0C;&#x6548;&#x679C;&#x662F;&#x5177;&#x6709;&#x76F8;&#x540C;ID&#x7684;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x548C;&#x7528;&#x6237;&#x8BB0;&#x5F55;&#x5728;Reducer&#x8F93;&#x5165;&#x4E2D;&#x5F7C;&#x6B64;&#x76F8;&#x90BB;&#x3002; Map-Reduce&#x4F5C;&#x4E1A;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x4E5F;&#x8BA9;&#x8FD9;&#x4E9B;&#x8BB0;&#x5F55;&#x6392;&#x5E8F;&#xFF0C;&#x4F7F;Reducer&#x603B;&#x80FD;&#x5148;&#x770B;&#x5230;&#x6765;&#x81EA;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x7D27;&#x63A5;&#x7740;&#x662F;&#x6309;&#x65F6;&#x95F4;&#x6233;&#x987A;&#x5E8F;&#x6392;&#x5E8F;&#x7684;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6; &#x2014;&#x2014;  &#x8FD9;&#x79CD;&#x6280;&#x672F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x4E8C;&#x6B21;&#x6392;&#x5E8F;&#xFF08;secondary sort&#xFF09;</strong>&#x3010;26&#x3011;&#x3002;</p>
<p>&#x200B;    &#x7136;&#x540E;Reducer&#x53EF;&#x4EE5;&#x5BB9;&#x6613;&#x5730;&#x6267;&#x884C;&#x5B9E;&#x9645;&#x7684;&#x8FDE;&#x63A5;&#x903B;&#x8F91;&#xFF1A;&#x6BCF;&#x4E2A;&#x7528;&#x6237;ID&#x90FD;&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x4E00;&#x6B21;Reducer&#x51FD;&#x6570;&#xFF0C;&#x4E14;&#x56E0;&#x4E3A;&#x4E8C;&#x6B21;&#x6392;&#x5E8F;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#x5E94;&#x8BE5;&#x662F;&#x6765;&#x81EA;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x7684;&#x51FA;&#x751F;&#x65E5;&#x671F;&#x8BB0;&#x5F55;&#x3002; Reducer&#x5C06;&#x51FA;&#x751F;&#x65E5;&#x671F;&#x5B58;&#x50A8;&#x5728;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x7528;&#x6237;ID&#x904D;&#x5386;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#xFF0C;&#x8F93;&#x51FA;<strong>&#x5DF2;&#x89C2;&#x770B;&#x7F51;&#x5740;</strong>&#x548C;<strong>&#x89C2;&#x770B;&#x8005;&#x5E74;&#x9F84;</strong>&#x7684;&#x7ED3;&#x679C;&#x5BF9;&#x3002;&#x968F;&#x540E;&#x7684;Map-Reduce&#x4F5C;&#x4E1A;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x6BCF;&#x4E2A;URL&#x7684;&#x67E5;&#x770B;&#x8005;&#x5E74;&#x9F84;&#x5206;&#x5E03;&#xFF0C;&#x5E76;&#x6309;&#x5E74;&#x9F84;&#x6BB5;&#x8FDB;&#x884C;&#x805A;&#x96C6;&#x3002;</p>
<p>&#x200B;    &#x7531;&#x4E8E;Reducer&#x4E00;&#x6B21;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7528;&#x6237;ID&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x6B21;&#x53EA;&#x9700;&#x8981;&#x5C06;&#x4E00;&#x6761;&#x7528;&#x6237;&#x8BB0;&#x5F55;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x51FA;&#x4EFB;&#x4F55;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6392;&#x5E8F;&#x5408;&#x5E76;&#x8FDE;&#x63A5;&#xFF08;sort-merge join&#xFF09;</strong>&#xFF0C;&#x56E0;&#x4E3A;Mapper&#x7684;&#x8F93;&#x51FA;&#x662F;&#x6309;&#x952E;&#x6392;&#x5E8F;&#x7684;&#xFF0C;&#x7136;&#x540E;Reducer&#x5C06;&#x6765;&#x81EA;&#x8FDE;&#x63A5;&#x4E24;&#x4FA7;&#x7684;&#x6709;&#x5E8F;&#x8BB0;&#x5F55;&#x5217;&#x8868;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<h4 id="&#x628A;&#x76F8;&#x5173;&#x6570;&#x636E;&#x653E;&#x5728;&#x4E00;&#x8D77;">&#x628A;&#x76F8;&#x5173;&#x6570;&#x636E;&#x653E;&#x5728;&#x4E00;&#x8D77;</h4>
<p>&#x200B;    &#x5728;&#x6392;&#x5E8F;&#x5408;&#x5E76;&#x8FDE;&#x63A5;&#x4E2D;&#xFF0C;Mapper&#x548C;&#x6392;&#x5E8F;&#x8FC7;&#x7A0B;&#x786E;&#x4FDD;&#x4E86;&#x6240;&#x6709;&#x5BF9;&#x7279;&#x5B9A;&#x7528;&#x6237;ID&#x6267;&#x884C;&#x8FDE;&#x63A5;&#x64CD;&#x4F5C;&#x7684;&#x5FC5;&#x987B;&#x6570;&#x636E;&#x90FD;&#x88AB;&#x653E;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF1A;&#x5355;&#x6B21;&#x8C03;&#x7528;Reducer&#x7684;&#x5730;&#x65B9;&#x3002;&#x9884;&#x5148;&#x6392;&#x597D;&#x4E86;&#x6240;&#x6709;&#x9700;&#x8981;&#x7684;&#x6570;&#x636E;&#xFF0C;Reducer&#x53EF;&#x4EE5;&#x662F;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x5355;&#x7EBF;&#x7A0B;&#x4EE3;&#x7801;&#xFF0C;&#x80FD;&#x591F;&#x4EE5;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x548C;&#x4E0E;&#x4F4E;&#x5185;&#x5B58;&#x5F00;&#x9500;&#x626B;&#x8FC7;&#x8FD9;&#x4E9B;&#x8BB0;&#x5F55;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#xFF0C;Mapper&#x5C06;&#x201C;&#x6D88;&#x606F;&#x201D;&#x53D1;&#x9001;&#x7ED9;Reducer&#x3002;&#x5F53;&#x4E00;&#x4E2A;Mapper&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x952E;&#x503C;&#x5BF9;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x952E;&#x7684;&#x4F5C;&#x7528;&#x5C31;&#x50CF;&#x503C;&#x5E94;&#x8BE5;&#x4F20;&#x9012;&#x5230;&#x7684;&#x76EE;&#x6807;&#x5730;&#x5740;&#x3002;&#x5373;&#x4F7F;&#x952E;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x4E0D;&#x662F;&#x50CF;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#x90A3;&#x6837;&#x7684;&#x5B9E;&#x9645;&#x7684;&#x7F51;&#x7EDC;&#x5730;&#x5740;&#xFF09;&#xFF0C;&#x5B83;&#x8868;&#x73B0;&#x7684;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#xFF1A;&#x6240;&#x6709;&#x5177;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x5C06;&#x88AB;&#x4F20;&#x9012;&#x5230;&#x76F8;&#x540C;&#x7684;&#x76EE;&#x6807;&#xFF08;&#x4E00;&#x6B21;Reduce&#x7684;&#x8C03;&#x7528;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x4F7F;&#x7528;MapReduce&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x80FD;&#x5C06;&#x8BA1;&#x7B97;&#x7684;&#x7269;&#x7406;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x5C42;&#x9762;&#xFF08;&#x4ECE;&#x6B63;&#x786E;&#x7684;&#x673A;&#x5668;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF09;&#x4ECE;&#x5E94;&#x7528;&#x903B;&#x8F91;&#x4E2D;&#x5265;&#x79BB;&#x51FA;&#x6765;&#xFF08;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x540E;&#x6267;&#x884C;&#x5904;&#x7406;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x5206;&#x79BB;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5178;&#x578B;&#x7528;&#x6CD5;&#x5F62;&#x6210;&#x4E86;&#x9C9C;&#x660E;&#x5BF9;&#x6BD4;&#xFF0C;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x8BF7;&#x6C42;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x5728;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x5185;&#x90E8;&#x3010;36&#x3011;&#x3002;&#x7531;&#x4E8E;MapReduce&#x80FD;&#x591F;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4E5F;&#x907F;&#x514D;&#x4E86;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x53BB;&#x62C5;&#x5FC3;&#x90E8;&#x5206;&#x6545;&#x969C;&#xFF0C;&#x4F8B;&#x5982;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5D29;&#x6E83;&#xFF1A;MapReduce&#x5728;&#x4E0D;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x903B;&#x8F91;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x80FD;&#x900F;&#x660E;&#x5730;&#x91CD;&#x8BD5;&#x5931;&#x8D25;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<h3 id="group-by">GROUP BY</h3>
<p>&#x200B;    &#x9664;&#x4E86;&#x8FDE;&#x63A5;&#x4E4B;&#x5916;&#xFF0C;&#x201C;&#x628A;&#x76F8;&#x5173;&#x6570;&#x636E;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x201D;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x6A21;&#x5F0F;&#x662F;&#xFF0C;&#x6309;&#x67D0;&#x4E2A;&#x952E;&#x5BF9;&#x8BB0;&#x5F55;&#x5206;&#x7EC4;&#xFF08;&#x5982;SQL&#x4E2D;&#x7684;GROUP BY&#x5B50;&#x53E5;&#xFF09;&#x3002;&#x6240;&#x6709;&#x5E26;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;&#x8BB0;&#x5F55;&#x6784;&#x6210;&#x4E00;&#x4E2A;&#x7EC4;&#xFF0C;&#x800C;&#x4E0B;&#x4E00;&#x6B65;&#x5F80;&#x5F80;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x7EC4;&#x5185;&#x8FDB;&#x884C;&#x67D0;&#x79CD;&#x805A;&#x5408;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x7EDF;&#x8BA1;&#x6BCF;&#x4E2A;&#x7EC4;&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x6570;&#x91CF;&#xFF08;&#x4F8B;&#x5982;&#x5728;&#x7EDF;&#x8BA1;PV&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5728;SQL&#x4E2D;&#x8868;&#x793A;&#x4E3A;<code>COUNT(*)</code>&#x805A;&#x5408;&#xFF09;</li>
<li>&#x5BF9;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x5B57;&#x6BB5;&#x6C42;&#x548C;&#xFF08;SQL&#x4E2D;&#x7684;<code>SUM(fieldname)</code>&#xFF09;</li>
<li>&#x6309;&#x67D0;&#x79CD;&#x5206;&#x7EA7;&#x51FD;&#x6570;&#x53D6;&#x51FA;&#x6392;&#x540D;&#x524D;k&#x6761;&#x8BB0;&#x5F55;&#x3002;</li>
</ul>
<p>&#x4F7F;&#x7528;MapReduce&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x5206;&#x7EC4;&#x64CD;&#x4F5C;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x662F;&#x8BBE;&#x7F6E;Mapper&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x4EEC;&#x751F;&#x6210;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x4F7F;&#x7528;&#x6240;&#x9700;&#x7684;&#x5206;&#x7EC4;&#x952E;&#x3002;&#x7136;&#x540E;&#x5206;&#x533A;&#x548C;&#x6392;&#x5E8F;&#x8FC7;&#x7A0B;&#x5C06;&#x6240;&#x6709;&#x5177;&#x6709;&#x76F8;&#x540C;&#x5206;&#x533A;&#x952E;&#x7684;&#x8BB0;&#x5F55;&#x5BFC;&#x5411;&#x540C;&#x4E00;&#x4E2A;Reducer&#x3002;&#x56E0;&#x6B64;&#x5728;MapReduce&#x4E4B;&#x4E0A;&#x5B9E;&#x73B0;&#x5206;&#x7EC4;&#x548C;&#x8FDE;&#x63A5;&#x770B;&#x4E0A;&#x53BB;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x200B;    &#x5206;&#x7EC4;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7528;&#x9014;&#x662F;&#x6574;&#x7406;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x4F1A;&#x8BDD;&#x7684;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#xFF0C;&#x4EE5;&#x627E;&#x51FA;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#xFF08;&#x79F0;&#x4E3A;<strong>&#x4F1A;&#x8BDD;&#x5316;&#xFF08;sessionization&#xFF09;</strong>&#x3010;37&#x3011;&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x5206;&#x6790;&#x6765;&#x786E;&#x5B9A;&#x663E;&#x793A;&#x65B0;&#x7248;&#x7F51;&#x7AD9;&#x7684;&#x7528;&#x6237;&#x662F;&#x5426;&#x6BD4;&#x90A3;&#x4E9B;&#x663E;&#x793A;&#x65E7;&#x7248;&#x672C;&#xFF08;A/B&#x6D4B;&#x8BD5;&#xFF09;&#x7684;&#x7528;&#x6237;&#x66F4;&#x6709;&#x8D2D;&#x4E70;&#x6B32;&#xFF0C;&#x6216;&#x8005;&#x8BA1;&#x7B97;&#x67D0;&#x4E2A;&#x8425;&#x9500;&#x6D3B;&#x52A8;&#x662F;&#x5426;&#x503C;&#x5F97;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x4F60;&#x6709;&#x591A;&#x4E2A;Web&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x7684;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x5F88;&#x53EF;&#x80FD;&#x5206;&#x6563;&#x5728;&#x5404;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4F1A;&#x8BDD;cookie&#xFF0C;&#x7528;&#x6237;ID&#x6216;&#x7C7B;&#x4F3C;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x4F5C;&#x4E3A;&#x5206;&#x7EC4;&#x952E;&#xFF0C;&#x4EE5;&#x5C06;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x7684;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x653E;&#x5728;&#x4E00;&#x8D77;&#x6765;&#x5B9E;&#x73B0;&#x4F1A;&#x8BDD;&#x5316;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x4E0D;&#x540C;&#x7528;&#x6237;&#x7684;&#x4E8B;&#x4EF6;&#x4ECD;&#x7136;&#x6563;&#x6B65;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x533A;&#x4E2D;&#x3002;</p>
<h4 id="&#x5904;&#x7406;&#x503E;&#x659C;">&#x5904;&#x7406;&#x503E;&#x659C;</h4>
<p>&#x200B;    &#x5982;&#x679C;&#x5B58;&#x5728;&#x4E0E;&#x5355;&#x4E2A;&#x952E;&#x5173;&#x8054;&#x7684;&#x5927;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x201C;&#x5C06;&#x5177;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x653E;&#x5230;&#x76F8;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x201D;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x5C31;&#x88AB;&#x7834;&#x574F;&#x4E86;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x4E0E;&#x51E0;&#x767E;&#x4EBA;&#x6709;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x5C11;&#x6570;&#x540D;&#x4EBA;&#x53EF;&#x80FD;&#x6709;&#x6570;&#x767E;&#x4E07;&#x7684;&#x8FFD;&#x968F;&#x8005;&#x3002;&#x8FD9;&#x79CD;&#x4E0D;&#x6210;&#x6BD4;&#x4F8B;&#x7684;&#x6D3B;&#x52A8;&#x6570;&#x636E;&#x5E93;&#x8BB0;&#x5F55;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5173;&#x952E;&#x5BF9;&#x8C61;&#xFF08;linchpin object&#xFF09;</strong>&#x3010;38&#x3011;&#x6216;<strong>&#x70ED;&#x952E;&#xFF08;hot key&#xFF09;</strong>&#x3002;</p>
<p>&#x200B;    &#x5728;&#x5355;&#x4E2A;Reducer&#x4E2D;&#x6536;&#x96C6;&#x4E0E;&#x67D0;&#x4E2A;&#x540D;&#x6D41;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#xFF08;&#x4F8B;&#x5982;&#x4ED6;&#x4EEC;&#x53D1;&#x5E03;&#x5185;&#x5BB9;&#x7684;&#x56DE;&#x590D;&#xFF09;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4E25;&#x91CD;&#x7684;&#x503E;&#x659C;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x70ED;&#x70B9;&#xFF08;hot spot&#xFF09;</strong>&#xFF09;&#x2014;&#x2014; &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;Reducer&#x5FC5;&#x987B;&#x6BD4;&#x5176;&#x4ED6;Reducer&#x5904;&#x7406;&#x66F4;&#x591A;&#x7684;&#x8BB0;&#x5F55;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="ch6.html#&#x8D1F;&#x8F7D;&#x503E;&#x659C;&#x4E0E;&#x6D88;&#x9664;&#x70ED;&#x70B9;">&#x8D1F;&#x8F7D;&#x503E;&#x659C;&#x4E0E;&#x6D88;&#x9664;&#x70ED;&#x70B9;</a>&#x201C;&#xFF09;&#x3002;&#x7531;&#x4E8E;MapReduce&#x4F5C;&#x4E1A;&#x53EA;&#x6709;&#x5728;&#x6240;&#x6709;Mapper&#x548C;Reducer&#x90FD;&#x5B8C;&#x6210;&#x65F6;&#x624D;&#x5B8C;&#x6210;&#xFF0C;&#x6240;&#x6709;&#x540E;&#x7EED;&#x4F5C;&#x4E1A;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x6700;&#x6162;&#x7684;Reducer&#x624D;&#x80FD;&#x542F;&#x52A8;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x8FDE;&#x63A5;&#x7684;&#x8F93;&#x5165;&#x5B58;&#x5728;&#x70ED;&#x70B9;&#x952E;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E9B;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8865;&#x507F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Pig&#x4E2D;&#x7684;<strong>&#x503E;&#x659C;&#x8FDE;&#x63A5;&#xFF08;skewed join&#xFF09;</strong>&#x65B9;&#x6CD5;&#x9996;&#x5148;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x62BD;&#x6837;&#x4F5C;&#x4E1A;&#x6765;&#x786E;&#x5B9A;&#x54EA;&#x4E9B;&#x952E;&#x662F;&#x70ED;&#x952E;&#x3010;39&#x3011;&#x3002;&#x8FDE;&#x63A5;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x65F6;&#xFF0C;Mapper&#x4F1A;&#x5C06;&#x70ED;&#x952E;&#x7684;&#x5173;&#x8054;&#x8BB0;&#x5F55;<strong>&#x968F;&#x673A;</strong>&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;&#x4F20;&#x7EDF;MapReduce&#x57FA;&#x4E8E;&#x952E;&#x6563;&#x5217;&#x7684;&#x786E;&#x5B9A;&#x6027;&#x65B9;&#x6CD5;&#xFF09;&#x53D1;&#x9001;&#x5230;&#x51E0;&#x4E2A;Reducer&#x4E4B;&#x4E00;&#x3002;&#x5BF9;&#x4E8E;&#x53E6;&#x5916;&#x4E00;&#x4FA7;&#x7684;&#x8FDE;&#x63A5;&#x8F93;&#x5165;&#xFF0C;&#x4E0E;&#x70ED;&#x952E;&#x76F8;&#x5173;&#x7684;&#x8BB0;&#x5F55;&#x9700;&#x8981;&#x88AB;&#x590D;&#x5236;&#x5230;&#x6240;&#x6709;&#x5904;&#x7406;&#x8BE5;&#x952E;&#x7684;Reducer&#x4E0A;&#x3010;40&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x6280;&#x672F;&#x5C06;&#x5904;&#x7406;&#x70ED;&#x952E;&#x7684;&#x5DE5;&#x4F5C;&#x5206;&#x6563;&#x5230;&#x591A;&#x4E2A;Reducer&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x5176;&#x66F4;&#x597D;&#x5730;&#x5E76;&#x884C;&#x5316;&#xFF0C;&#x4EE3;&#x4EF7;&#x662F;&#x9700;&#x8981;&#x5C06;&#x8FDE;&#x63A5;&#x53E6;&#x4E00;&#x4FA7;&#x7684;&#x8F93;&#x5165;&#x8BB0;&#x5F55;&#x590D;&#x5236;&#x5230;&#x591A;&#x4E2A;Reducer&#x4E0A;&#x3002; Crunch&#x4E2D;&#x7684;<strong>&#x5206;&#x7247;&#x8FDE;&#x63A5;&#xFF08;sharded join&#xFF09;</strong>&#x65B9;&#x6CD5;&#x4E0E;&#x4E4B;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x70ED;&#x952E;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x91C7;&#x6837;&#x4F5C;&#x4E1A;&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x4E5F;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x5728;&#x201C;<a href="ch6.html#&#x8D1F;&#x8F7D;&#x503E;&#x659C;&#x4E0E;&#x6D88;&#x9664;&#x70ED;&#x70B9;">&#x8D1F;&#x8F7D;&#x503E;&#x659C;&#x4E0E;&#x6D88;&#x9664;&#x70ED;&#x70B9;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4F7F;&#x7528;&#x968F;&#x673A;&#x5316;&#x6765;&#x7F13;&#x89E3;&#x5206;&#x533A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x70ED;&#x70B9;&#x3002;</p>
<p>&#x200B;    Hive&#x7684;&#x504F;&#x659C;&#x8FDE;&#x63A5;&#x4F18;&#x5316;&#x91C7;&#x53D6;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x9700;&#x8981;&#x5728;&#x8868;&#x683C;&#x5143;&#x6570;&#x636E;&#x4E2D;&#x663E;&#x5F0F;&#x6307;&#x5B9A;&#x70ED;&#x952E;&#xFF0C;&#x5E76;&#x5C06;&#x4E0E;&#x8FD9;&#x4E9B;&#x952E;&#x76F8;&#x5173;&#x7684;&#x8BB0;&#x5F55;&#x5355;&#x72EC;&#x5B58;&#x653E;&#xFF0C;&#x4E0E;&#x5176;&#x5B83;&#x6587;&#x4EF6;&#x5206;&#x5F00;&#x3002;&#x5F53;&#x5728;&#x8BE5;&#x8868;&#x4E0A;&#x6267;&#x884C;&#x8FDE;&#x63A5;&#x65F6;&#xFF0C;&#x5BF9;&#x4E8E;&#x70ED;&#x952E;&#xFF0C;&#x5B83;&#x4F1A;&#x4F7F;&#x7528;Map&#x7AEF;&#x8FDE;&#x63A5;&#xFF08;&#x53C2;&#x9605;<a href="#Map&#x7AEF;&#x8FDE;&#x63A5;">&#x4E0B;&#x4E00;&#x8282;</a>&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5F53;&#x6309;&#x7167;&#x70ED;&#x952E;&#x8FDB;&#x884C;&#x5206;&#x7EC4;&#x5E76;&#x805A;&#x5408;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5206;&#x7EC4;&#x5206;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;MapReduce&#x9636;&#x6BB5;&#x5C06;&#x8BB0;&#x5F55;&#x53D1;&#x9001;&#x5230;&#x968F;&#x673A;Reducer&#xFF0C;&#x4EE5;&#x4FBF;&#x6BCF;&#x4E2A;Reducer&#x53EA;&#x5BF9;&#x70ED;&#x952E;&#x7684;&#x5B50;&#x96C6;&#x6267;&#x884C;&#x5206;&#x7EC4;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x952E;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x66F4;&#x7D27;&#x51D1;&#x7684;&#x4E2D;&#x95F4;&#x805A;&#x5408;&#x7ED3;&#x679C;&#x3002;&#x7136;&#x540E;&#x7B2C;&#x4E8C;&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x5C06;&#x6240;&#x6709;&#x6765;&#x81EA;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;Reducer&#x7684;&#x4E2D;&#x95F4;&#x805A;&#x5408;&#x7ED3;&#x679C;&#x5408;&#x5E76;&#x4E3A;&#x6BCF;&#x4E2A;&#x952E;&#x4E00;&#x4E2A;&#x503C;&#x3002;</p>
<h3 id="map&#x4FA7;&#x8FDE;&#x63A5;">Map&#x4FA7;&#x8FDE;&#x63A5;</h3>
<p>&#x200B;    &#x4E0A;&#x4E00;&#x8282;&#x63CF;&#x8FF0;&#x7684;&#x8FDE;&#x63A5;&#x7B97;&#x6CD5;&#x5728;Reducer&#x4E2D;&#x6267;&#x884C;&#x5B9E;&#x9645;&#x7684;&#x8FDE;&#x63A5;&#x903B;&#x8F91;&#xFF0C;&#x56E0;&#x6B64;&#x88AB;&#x79F0;&#x4E3A;Reduce&#x7AEF;&#x8FDE;&#x63A5;&#x3002;Mapper&#x626E;&#x6F14;&#x7740;&#x9884;&#x5904;&#x7406;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x89D2;&#x8272;&#xFF1A;&#x4ECE;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x8BB0;&#x5F55;&#x4E2D;&#x63D0;&#x53D6;&#x952E;&#x503C;&#xFF0C;&#x5C06;&#x952E;&#x503C;&#x5BF9;&#x5206;&#x914D;&#x7ED9;Reducer&#x5206;&#x533A;&#xFF0C;&#x5E76;&#x6309;&#x952E;&#x6392;&#x5E8F;&#x3002;</p>
<p>&#x200B;    Reduce&#x7AEF;&#x65B9;&#x6CD5;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x5BF9;&#x8F93;&#x5165;&#x6570;&#x636E;&#x505A;&#x4EFB;&#x4F55;&#x5047;&#x8BBE;&#xFF1A;&#x65E0;&#x8BBA;&#x5176;&#x5C5E;&#x6027;&#x548C;&#x7ED3;&#x6784;&#x5982;&#x4F55;&#xFF0C;Mapper&#x90FD;&#x53EF;&#x4EE5;&#x5BF9;&#x5176;&#x9884;&#x5904;&#x7406;&#x4EE5;&#x5907;&#x8FDE;&#x63A5;&#x3002;&#x7136;&#x800C;&#x4E0D;&#x5229;&#x7684;&#x4E00;&#x9762;&#x662F;&#xFF0C;&#x6392;&#x5E8F;&#xFF0C;&#x590D;&#x5236;&#x81F3;Reducer&#xFF0C;&#x4EE5;&#x53CA;&#x5408;&#x5E76;Reducer&#x8F93;&#x5165;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x5F00;&#x9500;&#x5DE8;&#x5927;&#x3002;&#x5F53;&#x6570;&#x636E;&#x901A;&#x8FC7;MapReduce &#x9636;&#x6BB5;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x843D;&#x76D8;&#x597D;&#x51E0;&#x6B21;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x53EF;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7F13;&#x51B2;&#x533A;&#x3010;37&#x3011;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x4F60;<strong>&#x80FD;</strong>&#x5BF9;&#x8F93;&#x5165;&#x6570;&#x636E;&#x4F5C;&#x51FA;&#x67D0;&#x4E9B;&#x5047;&#x8BBE;&#xFF0C;&#x5219;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x6240;&#x8C13;&#x7684;Map&#x7AEF;&#x8FDE;&#x63A5;&#x6765;&#x52A0;&#x5FEB;&#x8FDE;&#x63A5;&#x901F;&#x5EA6;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x9609;&#x6389;Reduce&#x4E0E;&#x6392;&#x5E8F;&#x7684;MapReduce&#x4F5C;&#x4E1A;&#xFF0C;&#x6BCF;&#x4E2A;Mapper&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x4ECE;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#x3002;</p>
<h4 id="&#x5E7F;&#x64AD;&#x6563;&#x5217;&#x8FDE;&#x63A5;">&#x5E7F;&#x64AD;&#x6563;&#x5217;&#x8FDE;&#x63A5;</h4>
<p>&#x200B;    &#x9002;&#x7528;&#x4E8E;&#x6267;&#x884C;Map&#x7AEF;&#x8FDE;&#x63A5;&#x7684;&#x6700;&#x7B80;&#x5355;&#x573A;&#x666F;&#x662F;&#x5927;&#x6570;&#x636E;&#x96C6;&#x4E0E;&#x5C0F;&#x6570;&#x636E;&#x96C6;&#x8FDE;&#x63A5;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8981;&#x70B9;&#x5728;&#x4E8E;&#x5C0F;&#x6570;&#x636E;&#x96C6;&#x9700;&#x8981;&#x8DB3;&#x591F;&#x5C0F;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x5168;&#x90E8;&#x52A0;&#x8F7D;&#x5230;&#x6BCF;&#x4E2A;Mapper&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<p>&#x200B;    &#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x5728;<a href="img/fig10-2.png">&#x56FE;10-2</a>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x5C0F;&#x5230;&#x8DB3;&#x4EE5;&#x653E;&#x8FDB;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;Mapper&#x542F;&#x52A8;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9996;&#x5148;&#x5C06;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x4ECE;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8BFB;&#x53D6;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6563;&#x5217;&#x4E2D;&#x3002;&#x5B8C;&#x6210;&#x6B64;&#x64CD;&#x4F5C;&#x540E;&#xFF0C;Map&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x626B;&#x63CF;&#x7528;&#x6237;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#xFF0C;&#x5E76;&#x7B80;&#x5355;&#x5730;&#x5728;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x67E5;&#x627E;&#x6BCF;&#x4E2A;&#x4E8B;&#x4EF6;&#x7684;&#x7528;&#x6237;ID<sup><a href="#fn_vi" id="reffn_vi">vi</a></sup>&#x3002;</p>
<blockquote id="fn_vi">
<sup>vi</sup>. &#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5047;&#x5B9A;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x952E;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#xFF0C;&#x8FD9;&#x5BF9;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x7528;&#x6237;ID&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#xFF09;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x54C8;&#x5E0C;&#x8868;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5305;&#x542B;&#x5177;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;&#x591A;&#x4E2A;&#x6761;&#x76EE;&#xFF0C;&#x800C;&#x8FDE;&#x63A5;&#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x5BF9;&#x6BCF;&#x4E2A;&#x952E;&#x8F93;&#x51FA;&#x6240;&#x6709;&#x7684;&#x5339;&#x914D;&#x3002;<a href="#reffn_vi" title="Jump back to footnote [vi] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x53C2;&#x4E0E;&#x8FDE;&#x63A5;&#x7684;&#x8F83;&#x5927;&#x8F93;&#x5165;&#x7684;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x5757;&#x5404;&#x6709;&#x4E00;&#x4E2A;Mapper&#xFF08;&#x5728;<a href="img/fig10-2.png">&#x56FE;10-2</a>&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x662F;&#x8F83;&#x5927;&#x7684;&#x8F93;&#x5165;&#xFF09;&#x3002;&#x6BCF;&#x4E2A;Mapper&#x90FD;&#x4F1A;&#x5C06;&#x8F83;&#x5C0F;&#x8F93;&#x5165;&#x6574;&#x4E2A;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x7B80;&#x5355;&#x6709;&#x6548;&#x7684;&#x7B97;&#x6CD5;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5E7F;&#x64AD;&#x6563;&#x5217;&#x8FDE;&#x63A5;&#xFF08;broadcast hash join&#xFF09;</strong>&#xFF1A;<strong>&#x5E7F;&#x64AD;</strong>&#x4E00;&#x8BCD;&#x53CD;&#x6620;&#x4E86;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FDE;&#x63A5;&#x8F83;&#x5927;&#x8F93;&#x5165;&#x7AEF;&#x5206;&#x533A;&#x7684;Mapper&#x90FD;&#x4F1A;&#x5C06;&#x8F83;&#x5C0F;&#x8F93;&#x5165;&#x7AEF;&#x6570;&#x636E;&#x96C6;&#x6574;&#x4E2A;&#x8BFB;&#x5165;&#x5185;&#x5B58;&#x4E2D;&#xFF08;&#x6240;&#x4EE5;&#x8F83;&#x5C0F;&#x8F93;&#x5165;&#x5B9E;&#x9645;&#x4E0A;&#x201C;&#x5E7F;&#x64AD;&#x201D;&#x5230;&#x8F83;&#x5927;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x5206;&#x533A;&#x4E0A;&#xFF09;&#xFF0C;<strong>&#x6563;&#x5217;</strong>&#x4E00;&#x8BCD;&#x53CD;&#x6620;&#x4E86;&#x5B83;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6563;&#x5217;&#x8868;&#x3002; Pig&#xFF08;&#x540D;&#x4E3A;&#x201C;<strong>&#x590D;&#x5236;&#x94FE;&#x63A5;&#xFF08;replicated join&#xFF09;</strong>&#x201D;&#xFF09;&#xFF0C;Hive&#xFF08;&#x201C;<strong>MapJoin</strong>&#x201D;&#xFF09;&#xFF0C;Cascading&#x548C;Crunch&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x8FDE;&#x63A5;&#x3002;&#x5B83;&#x4E5F;&#x88AB;&#x8BF8;&#x5982;Impala&#x7684;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x67E5;&#x8BE2;&#x5F15;&#x64CE;&#x4F7F;&#x7528;&#x3010;41&#x3011;&#x3002;</p>
<p>&#x200B;    &#x9664;&#x4E86;&#x5C06;&#x8FDE;&#x63A5;&#x8F83;&#x5C0F;&#x8F93;&#x5165;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x6563;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x8F83;&#x5C0F;&#x8F93;&#x5165;&#x5B58;&#x50A8;&#x5728;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x53EA;&#x8BFB;&#x7D22;&#x5F15;&#x4E2D;&#x3010;42&#x3011;&#x3002;&#x7D22;&#x5F15;&#x4E2D;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x90E8;&#x5206;&#x5C06;&#x4FDD;&#x7559;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x9875;&#x9762;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x56E0;&#x800C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E0E;&#x5185;&#x5B58;&#x6563;&#x5217;&#x8868;&#x51E0;&#x4E4E;&#x4E00;&#x6837;&#x5FEB;&#x7684;&#x968F;&#x673A;&#x67E5;&#x627E;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x6570;&#x636E;&#x96C6;&#x80FD;&#x653E;&#x5165;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<h4 id="&#x5206;&#x533A;&#x6563;&#x5217;&#x8FDE;&#x63A5;">&#x5206;&#x533A;&#x6563;&#x5217;&#x8FDE;&#x63A5;</h4>
<p>&#x200B;    &#x5982;&#x679C;Map&#x7AEF;&#x8FDE;&#x63A5;&#x7684;&#x8F93;&#x5165;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x5219;&#x6563;&#x5217;&#x8FDE;&#x63A5;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5E94;&#x7528;&#x4E8E;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x3002;&#x5728;<a href="img/fig10-2.png">&#x56FE;10-2</a>&#x7684;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7528;&#x6237;ID&#x7684;&#x6700;&#x540E;&#x4E00;&#x4F4D;&#x5341;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x6765;&#x5BF9;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x548C;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF08;&#x56E0;&#x6B64;&#x8FDE;&#x63A5;&#x4E24;&#x4FA7;&#x5404;&#x6709;10&#x4E2A;&#x5206;&#x533A;&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Mapper3&#x9996;&#x5148;&#x5C06;&#x6240;&#x6709;&#x5177;&#x6709;&#x4EE5;3&#x7ED3;&#x5C3E;&#x7684;ID&#x7684;&#x7528;&#x6237;&#x52A0;&#x8F7D;&#x5230;&#x6563;&#x5217;&#x8868;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x626B;&#x63CF;ID&#x4E3A;3&#x7684;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x6240;&#x6709;&#x6D3B;&#x52A8;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x5206;&#x533A;&#x6B63;&#x786E;&#x65E0;&#x8BEF;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x7684;&#x662F;&#xFF0C;&#x6240;&#x6709;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8FDE;&#x63A5;&#x7684;&#x8BB0;&#x5F55;&#x90FD;&#x843D;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x7F16;&#x53F7;&#x7684;&#x5206;&#x533A;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#x6BCF;&#x4E2A;Mapper&#x53EA;&#x9700;&#x8981;&#x4ECE;&#x8F93;&#x5165;&#x4E24;&#x7AEF;&#x5404;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x597D;&#x5904;&#x662F;&#x6BCF;&#x4E2A;Mapper&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x5185;&#x5B58;&#x6563;&#x5217;&#x8868;&#x4E2D;&#x5C11;&#x653E;&#x70B9;&#x6570;&#x636E;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EA;&#x6709;&#x5F53;&#x8FDE;&#x63A5;&#x4E24;&#x7AEF;&#x8F93;&#x5165;&#x6709;&#x76F8;&#x540C;&#x7684;&#x5206;&#x533A;&#x6570;&#xFF0C;&#x4E14;&#x4E24;&#x4FA7;&#x7684;&#x8BB0;&#x5F55;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x952E;&#x4E0E;&#x76F8;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x505A;&#x5206;&#x533A;&#x65F6;&#x624D;&#x9002;&#x7528;&#x3002;&#x5982;&#x679C;&#x8F93;&#x5165;&#x662F;&#x7531;&#x4E4B;&#x524D;&#x6267;&#x884C;&#x8FC7;&#x8FD9;&#x79CD;&#x5206;&#x7EC4;&#x7684;MapReduce&#x4F5C;&#x4E1A;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x5047;&#x8BBE;&#x3002;</p>
<p>&#x200B;    &#x5206;&#x533A;&#x6563;&#x5217;&#x8FDE;&#x63A5;&#x5728;Hive&#x4E2D;&#x79F0;&#x4E3A;<strong>Map&#x7AEF;&#x6876;&#x8FDE;&#x63A5;&#xFF08;bucketed map joins&#xFF09;&#x3010;37&#x3011;</strong>&#x3002;</p>
<h4 id="map&#x4FA7;&#x5408;&#x5E76;&#x8FDE;&#x63A5;">Map&#x4FA7;&#x5408;&#x5E76;&#x8FDE;&#x63A5;</h4>
<p>&#x200B;    &#x5982;&#x679C;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#x4E0D;&#x4EC5;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x57FA;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x952E;&#x8FDB;&#x884C;<strong>&#x6392;&#x5E8F;</strong>&#xFF0C;&#x5219;&#x53EF;&#x9002;&#x7528;&#x53E6;&#x4E00;&#x79CD;Map&#x7AEF;&#x8054;&#x63A5;&#x7684;&#x53D8;&#x4F53;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x5426;&#x5C0F;&#x5230;&#x80FD;&#x653E;&#x5165;&#x5185;&#x5B58;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x65F6;&#x5019;Mapper&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5F52;&#x5E76;&#x64CD;&#x4F5C;&#xFF08;&#x901A;&#x5E38;&#x7531;Reducer&#x6267;&#x884C;&#xFF09;&#x7684;&#x5F52;&#x5E76;&#x64CD;&#x4F5C;&#xFF1A;&#x6309;&#x952E;&#x9012;&#x589E;&#x7684;&#x987A;&#x5E8F;&#x4F9D;&#x6B21;&#x8BFB;&#x53D6;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x5C06;&#x5177;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;&#x8BB0;&#x5F55;&#x914D;&#x5BF9;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x80FD;&#x8FDB;&#x884C;Map&#x7AEF;&#x5408;&#x5E76;&#x8FDE;&#x63A5;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x524D;&#x4E00;&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x53EF;&#x80FD;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x5DF2;&#x7ECF;&#x628A;&#x8F93;&#x5165;&#x6570;&#x636E;&#x505A;&#x4E86;&#x5206;&#x533A;&#x5E76;&#x8FDB;&#x884C;&#x4E86;&#x6392;&#x5E8F;&#x3002;&#x539F;&#x5219;&#x4E0A;&#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x524D;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;Reduce&#x9636;&#x6BB5;&#x8FDB;&#x884C;&#x3002;&#x4F46;&#x4F7F;&#x7528;&#x72EC;&#x7ACB;&#x7684;&#x4EC5;Map&#x4F5C;&#x4E1A;&#x6709;&#x65F6;&#x4E5F;&#x662F;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5206;&#x597D;&#x533A;&#x4E14;&#x6392;&#x597D;&#x5E8F;&#x7684;&#x4E2D;&#x95F4;&#x6570;&#x636E;&#x96C6;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x76EE;&#x7684;&#x3002;</p>
<h4 id="mapreduce&#x5DE5;&#x4F5C;&#x6D41;&#x4E0E;map&#x4FA7;&#x8FDE;&#x63A5;">MapReduce&#x5DE5;&#x4F5C;&#x6D41;&#x4E0E;Map&#x4FA7;&#x8FDE;&#x63A5;</h4>
<p>&#x200B;    &#x5F53;&#x4E0B;&#x6E38;&#x4F5C;&#x4E1A;&#x4F7F;&#x7528;MapReduce&#x8FDE;&#x63A5;&#x7684;&#x8F93;&#x51FA;&#x65F6;&#xFF0C;&#x9009;&#x62E9;Map&#x7AEF;&#x8FDE;&#x63A5;&#x6216;Reduce&#x7AEF;&#x8FDE;&#x63A5;&#x4F1A;&#x5F71;&#x54CD;&#x8F93;&#x51FA;&#x7684;&#x7ED3;&#x6784;&#x3002;Reduce&#x7AEF;&#x8FDE;&#x63A5;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x6309;&#x7167;<strong>&#x8FDE;&#x63A5;&#x952E;</strong>&#x8FDB;&#x884C;&#x5206;&#x533A;&#x548C;&#x6392;&#x5E8F;&#x7684;&#xFF0C;&#x800C;Map&#x7AEF;&#x8FDE;&#x63A5;&#x7684;&#x8F93;&#x51FA;&#x5219;&#x6309;&#x7167;&#x4E0E;&#x8F83;&#x5927;&#x8F93;&#x5165;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5206;&#x533A;&#x548C;&#x6392;&#x5E8F;&#xFF08;&#x56E0;&#x4E3A;&#x65E0;&#x8BBA;&#x662F;&#x4F7F;&#x7528;&#x5206;&#x533A;&#x8FDE;&#x63A5;&#x8FD8;&#x662F;&#x5E7F;&#x64AD;&#x8FDE;&#x63A5;&#xFF0C;&#x8FDE;&#x63A5;&#x8F83;&#x5927;&#x8F93;&#x5165;&#x7AEF;&#x7684;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x5757;&#x90FD;&#x4F1A;&#x542F;&#x52A8;&#x4E00;&#x4E2A;Map&#x4EFB;&#x52A1;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;Map&#x7AEF;&#x8FDE;&#x63A5;&#x4E5F;&#x5BF9;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6709;&#x5E8F;&#x6027;&#x548C;&#x5206;&#x533A;&#x65B9;&#x5F0F;&#x505A;&#x51FA;&#x4E86;&#x66F4;&#x591A;&#x5047;&#x8BBE;&#x3002;&#x5728;&#x4F18;&#x5316;&#x8FDE;&#x63A5;&#x7B56;&#x7565;&#x65F6;&#xFF0C;&#x4E86;&#x89E3;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7269;&#x7406;&#x5E03;&#x5C40;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF1A;&#x4EC5;&#x4EC5;&#x77E5;&#x9053;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x548C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x76EE;&#x5F55;&#x7684;&#x540D;&#x79F0;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF1B;&#x4F60;&#x8FD8;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x6570;&#x636E;&#x662F;&#x6309;&#x54EA;&#x4E9B;&#x952E;&#x505A;&#x7684;&#x5206;&#x533A;&#x548C;&#x6392;&#x5E8F;&#xFF0C;&#x4EE5;&#x53CA;&#x5206;&#x533A;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x200B;    &#x5728;Hadoop&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x5173;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#x5206;&#x533A;&#x7684;&#x5143;&#x6570;&#x636E;&#x901A;&#x5E38;&#x5728;HCatalog&#x548C;Hive Metastore&#x4E2D;&#x7EF4;&#x62A4;&#x3010;37&#x3011;&#x3002;</p>
<h3 id="&#x6279;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x6D41;&#x7684;&#x8F93;&#x51FA;">&#x6279;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x6D41;&#x7684;&#x8F93;&#x51FA;</h3>
<p>&#x200B;    &#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BF4;&#x4E86;&#x5F88;&#x591A;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;MapReduce&#x5DE5;&#x4F5C;&#x6D41;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x5374;&#x5FFD;&#x7565;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x8FD9;&#x4E9B;&#x5904;&#x7406;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x7684;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x6211;&#x4EEC;&#x6700;&#x5F00;&#x59CB;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8DD1;&#x8FD9;&#x4E9B;&#x4F5C;&#x4E1A;&#xFF1F;</p>
<p>&#x200B;    &#x5728;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#xFF08;OLTP&#xFF09;&#x4E0E;&#x5206;&#x6790;&#x4E24;&#x79CD;&#x76EE;&#x7684;&#x533A;&#x5206;&#x5F00;&#x6765;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x6216;&#x5206;&#x6790;&#xFF1F;">&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x6216;&#x5206;&#x6790;&#xFF1F;</a>&#x201D;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;OLTP&#x67E5;&#x8BE2;&#x901A;&#x5E38;&#x6839;&#x636E;&#x952E;&#x67E5;&#x627E;&#x5C11;&#x91CF;&#x8BB0;&#x5F55;&#xFF0C;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#xFF08;&#x6BD4;&#x5982;&#x5728;&#x7F51;&#x9875;&#x4E0A;&#xFF09;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5206;&#x6790;&#x67E5;&#x8BE2;&#x901A;&#x5E38;&#x4F1A;&#x626B;&#x63CF;&#x5927;&#x91CF;&#x8BB0;&#x5F55;&#xFF0C;&#x6267;&#x884C;&#x5206;&#x7EC4;&#x4E0E;&#x805A;&#x5408;&#xFF0C;&#x8F93;&#x51FA;&#x901A;&#x5E38;&#x6709;&#x7740;&#x62A5;&#x544A;&#x7684;&#x5F62;&#x5F0F;&#xFF1A;&#x663E;&#x793A;&#x67D0;&#x4E2A;&#x6307;&#x6807;&#x968F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#x7684;&#x56FE;&#x8868;&#xFF0C;&#x6216;&#x6309;&#x7167;&#x67D0;&#x79CD;&#x6392;&#x4F4D;&#x53D6;&#x524D;10&#x9879;&#xFF0C;&#x6216;&#x4E00;&#x4E9B;&#x6570;&#x5B57;&#x7EC6;&#x5316;&#x4E3A;&#x5B50;&#x7C7B;&#x3002;&#x8FD9;&#x79CD;&#x62A5;&#x544A;&#x7684;&#x6D88;&#x8D39;&#x8005;&#x901A;&#x5E38;&#x662F;&#x9700;&#x8981;&#x505A;&#x51FA;&#x5546;&#x4E1A;&#x51B3;&#x7B56;&#x7684;&#x5206;&#x6790;&#x5E08;&#x6216;&#x7ECF;&#x7406;&#x3002;</p>
<p>&#x200B;    &#x6279;&#x5904;&#x7406;&#x653E;&#x54EA;&#x91CC;&#x5408;&#x9002;&#xFF1F;&#x5B83;&#x4E0D;&#x5C5E;&#x4E8E;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5206;&#x6790;&#x3002;&#x5B83;&#x548C;&#x5206;&#x6790;&#x6BD4;&#x8F83;&#x63A5;&#x8FD1;&#xFF0C;&#x56E0;&#x4E3A;&#x6279;&#x5904;&#x7406;&#x901A;&#x5E38;&#x4F1A;&#x626B;&#x8FC7;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x3002;&#x7136;&#x800C;MapReduce&#x4F5C;&#x4E1A;&#x5DE5;&#x4F5C;&#x6D41;&#x4E0E;&#x7528;&#x4E8E;&#x5206;&#x6790;&#x76EE;&#x7684;&#x7684;SQL&#x67E5;&#x8BE2;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#Hadoop&#x4E0E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5BF9;&#x6BD4;">Hadoop&#x4E0E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5BF9;&#x6BD4;</a>&#x201D;&#xFF09;&#x3002;&#x6279;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x7684;&#x8F93;&#x51FA;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x62A5;&#x8868;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x7ED3;&#x6784;&#x3002;</p>
<h4 id="&#x5EFA;&#x7ACB;&#x641C;&#x7D22;&#x7D22;&#x5F15;">&#x5EFA;&#x7ACB;&#x641C;&#x7D22;&#x7D22;&#x5F15;</h4>
<p>&#x200B;    Google&#x6700;&#x521D;&#x4F7F;&#x7528;MapReduce&#x662F;&#x4E3A;&#x5176;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#xFF0C;&#x7528;&#x4E86;&#x7531;5&#x5230;10&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x7EC4;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x5B9E;&#x73B0;&#x3010;1&#x3011;&#x3002;&#x867D;&#x7136;Google&#x540E;&#x6765;&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E3A;&#x8FD9;&#x4E2A;&#x76EE;&#x7684;&#x800C;&#x4F7F;&#x7528;MapReduce &#x3010;43&#x3011;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4ECE;&#x6784;&#x5EFA;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x66F4;&#x80FD;&#x5E2E;&#x52A9;&#x7406;&#x89E3;MapReduce&#x3002; &#xFF08;&#x76F4;&#x81F3;&#x4ECA;&#x65E5;&#xFF0C;Hadoop MapReduce&#x4ECD;&#x7136;&#x662F;&#x4E3A;Lucene/Solr&#x6784;&#x5EFA;&#x7D22;&#x5F15;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3010;44&#x3011;&#xFF09;</p>
<p>&#x200B;    &#x6211;&#x4EEC;&#x5728;&#x201C;<a href="ch3.html#&#x5168;&#x6587;&#x641C;&#x7D22;&#x548C;&#x6A21;&#x7CCA;&#x7D22;&#x5F15;">&#x5168;&#x6587;&#x641C;&#x7D22;&#x548C;&#x6A21;&#x7CCA;&#x7D22;&#x5F15;</a>&#x201D;&#x4E2D;&#x7B80;&#x8981;&#x5730;&#x4E86;&#x89E3;&#x4E86;Lucene&#x8FD9;&#x6837;&#x7684;&#x5168;&#x6587;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF1A;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF08;&#x5173;&#x952E;&#x8BCD;&#x5B57;&#x5178;&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4E2D;&#x9AD8;&#x6548;&#x5730;&#x67E5;&#x627E;&#x7279;&#x5B9A;&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x5E76;&#x627E;&#x5230;&#x5305;&#x542B;&#x8BE5;&#x5173;&#x952E;&#x5B57;&#x7684;&#x6240;&#x6709;&#x6587;&#x6863;ID&#x5217;&#x8868;&#xFF08;&#x6587;&#x7AE0;&#x5217;&#x8868;&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7B80;&#x5316;&#x7684;&#x770B;&#x6CD5; &#x2014;&#x2014; &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#x9700;&#x8981;&#x5404;&#x79CD;&#x989D;&#x5916;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x4FBF;&#x6839;&#x636E;&#x76F8;&#x5173;&#x6027;&#x5BF9;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x6392;&#x540D;&#xFF0C;&#x7EA0;&#x6B63;&#x62FC;&#x5199;&#x9519;&#x8BEF;&#xFF0C;&#x89E3;&#x6790;&#x540C;&#x4E49;&#x8BCD;&#x7B49;&#x7B49; &#x2014;&#x2014; &#x4F46;&#x8FD9;&#x4E2A;&#x539F;&#x5219;&#x662F;&#x6210;&#x7ACB;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x9700;&#x8981;&#x5BF9;&#x4E00;&#x7EC4;&#x56FA;&#x5B9A;&#x6587;&#x6863;&#x6267;&#x884C;&#x5168;&#x6587;&#x641C;&#x7D22;&#xFF0C;&#x5219;&#x6279;&#x5904;&#x7406;&#x662F;&#x4E00;&#x79CD;&#x6784;&#x5EFA;&#x7D22;&#x5F15;&#x7684;&#x9AD8;&#x6548;&#x65B9;&#x6CD5;&#xFF1A;Mapper&#x6839;&#x636E;&#x9700;&#x8981;&#x5BF9;&#x6587;&#x6863;&#x96C6;&#x5408;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x6BCF;&#x4E2A;Reducer&#x6784;&#x5EFA;&#x8BE5;&#x5206;&#x533A;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x5E76;&#x5C06;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x6784;&#x5EFA;&#x8FD9;&#x6837;&#x7684;&#x6587;&#x6863;&#x5206;&#x533A;&#x7D22;&#x5F15;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch6.html#&#x5206;&#x533A;&#x548C;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;">&#x5206;&#x533A;&#x548C;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;</a>&#x201D;&#xFF09;&#x5E76;&#x884C;&#x5904;&#x7406;&#x6548;&#x679C;&#x62D4;&#x7FA4;&#x3002;</p>
<p>&#x200B;    &#x7531;&#x4E8E;&#x6309;&#x5173;&#x952E;&#x5B57;&#x67E5;&#x8BE2;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#x662F;&#x53EA;&#x8BFB;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x800C;&#x8FD9;&#x4E9B;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x4E00;&#x65E6;&#x521B;&#x5EFA;&#x5C31;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x7D22;&#x5F15;&#x7684;&#x6587;&#x6863;&#x96C6;&#x5408;&#x53D1;&#x751F;&#x66F4;&#x6539;&#xFF0C;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x5B9A;&#x671F;&#x91CD;&#x8DD1;&#x6574;&#x4E2A;&#x7D22;&#x5F15;&#x5DE5;&#x4F5C;&#x6D41;&#xFF0C;&#x5E76;&#x5728;&#x5B8C;&#x6210;&#x540E;&#x7528;&#x65B0;&#x7684;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x6279;&#x91CF;&#x66FF;&#x6362;&#x4EE5;&#x524D;&#x7684;&#x7D22;&#x5F15;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x53EA;&#x6709;&#x5C11;&#x91CF;&#x7684;&#x6587;&#x6863;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x9AD8;&#x3002;&#x4F46;&#x5B83;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x7D22;&#x5F15;&#x8FC7;&#x7A0B;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF1A;&#x6587;&#x6863;&#x8FDB;&#xFF0C;&#x7D22;&#x5F15;&#x51FA;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x91CF;&#x5EFA;&#x7ACB;&#x7D22;&#x5F15;&#x3002;&#x5982;<a href="ch3.html">&#x7B2C;3&#x7AE0;</a>&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5728;&#x7D22;&#x5F15;&#x4E2D;&#x6DFB;&#x52A0;&#xFF0C;&#x5220;&#x9664;&#x6216;&#x66F4;&#x65B0;&#x6587;&#x6863;&#xFF0C;Lucene&#x4F1A;&#x5199;&#x65B0;&#x7684;&#x6BB5;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5728;&#x540E;&#x53F0;&#x5F02;&#x6B65;&#x5408;&#x5E76;&#x538B;&#x7F29;&#x6BB5;&#x6587;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch11.html">&#x7B2C;11&#x7AE0;</a>&#x4E2D;&#x770B;&#x5230;&#x66F4;&#x591A;&#x8FD9;&#x79CD;&#x589E;&#x91CF;&#x5904;&#x7406;&#x3002;</p>
<h4 id="&#x952E;&#x503C;&#x5B58;&#x50A8;&#x4F5C;&#x4E3A;&#x6279;&#x5904;&#x7406;&#x8F93;&#x51FA;">&#x952E;&#x503C;&#x5B58;&#x50A8;&#x4F5C;&#x4E3A;&#x6279;&#x5904;&#x7406;&#x8F93;&#x51FA;</h4>
<p>&#x200B;    &#x641C;&#x7D22;&#x7D22;&#x5F15;&#x53EA;&#x662F;&#x6279;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x6D41;&#x53EF;&#x80FD;&#x8F93;&#x51FA;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x6279;&#x5904;&#x7406;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7528;&#x9014;&#x662F;&#x6784;&#x5EFA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982;&#x5206;&#x7C7B;&#x5668;&#xFF08;&#x6BD4;&#x5982;&#x5783;&#x573E;&#x90AE;&#x4EF6;&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#xFF0C;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#xFF09;&#x4E0E;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x8BA4;&#x8BC6;&#x7684;&#x4EBA;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4EA7;&#x54C1;&#x6216;&#x76F8;&#x5173;&#x7684;&#x641C;&#x7D22;&#x3010;29&#x3011;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E9B;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x901A;&#x5E38;&#x662F;&#x67D0;&#x79CD;&#x6570;&#x636E;&#x5E93;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7ED9;&#x5B9A;&#x7528;&#x6237;ID&#x67E5;&#x8BE2;&#x8BE5;&#x7528;&#x6237;&#x63A8;&#x8350;&#x597D;&#x53CB;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EA7;&#x54C1;ID&#x67E5;&#x8BE2;&#x76F8;&#x5173;&#x4EA7;&#x54C1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3010;45&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x9700;&#x8981;&#x88AB;&#x5904;&#x7406;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x7684;Web&#x5E94;&#x7528;&#x6240;&#x67E5;&#x8BE2;&#xFF0C;&#x800C;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x662F;&#x72EC;&#x7ACB;&#x4E8E;Hadoop&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x3002;&#x90A3;&#x4E48;&#x6279;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x7684;&#x8F93;&#x51FA;&#x5982;&#x4F55;&#x56DE;&#x5230;Web&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5462;&#xFF1F;</p>
<p>&#x200B;    &#x6700;&#x76F4;&#x63A5;&#x7684;&#x9009;&#x62E9;&#x53EF;&#x80FD;&#x662F;&#xFF0C;&#x76F4;&#x63A5;&#x5728;Mapper&#x6216;Reducer&#x4E2D;&#x4F7F;&#x7528;&#x4F60;&#x6700;&#x7231;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5E93;&#xFF0C;&#x5E76;&#x4ECE;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x76F4;&#x63A5;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4E00;&#x6B21;&#x5199;&#x5165;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x3002;&#x5B83;&#x80FD;&#x5DE5;&#x4F5C;&#xFF08;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x9632;&#x706B;&#x5899;&#x89C4;&#x5219;&#x5141;&#x8BB8;&#x4ECE;&#x4F60;&#x7684;Hadoop&#x73AF;&#x5883;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x4F60;&#x7684;&#x751F;&#x4EA7;&#x6570;&#x636E;&#x5E93;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF0C;&#x51FA;&#x4E8E;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;</p>
<ul>
<li>&#x6B63;&#x5982;&#x524D;&#x9762;&#x5728;&#x8FDE;&#x63A5;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x4E3A;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x53D1;&#x8D77;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#xFF0C;&#x8981;&#x6BD4;&#x6279;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x7684;&#x6B63;&#x5E38;&#x541E;&#x5410;&#x91CF;&#x6162;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;&#x5373;&#x4F7F;&#x5BA2;&#x6237;&#x7AEF;&#x5E93;&#x652F;&#x6301;&#x6279;&#x5904;&#x7406;&#xFF0C;&#x6027;&#x80FD;&#x4E5F;&#x53EF;&#x80FD;&#x5F88;&#x5DEE;&#x3002;</li>
<li>MapReduce&#x4F5C;&#x4E1A;&#x7ECF;&#x5E38;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#x8BB8;&#x591A;&#x4EFB;&#x52A1;&#x3002;&#x5982;&#x679C;&#x6240;&#x6709;Mapper&#x6216;Reducer&#x90FD;&#x540C;&#x65F6;&#x5199;&#x5165;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x51FA;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x4EE5;&#x6279;&#x5904;&#x7406;&#x7684;&#x9884;&#x671F;&#x901F;&#x7387;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x6570;&#x636E;&#x5E93;&#x5F88;&#x53EF;&#x80FD;&#x88AB;&#x8F7B;&#x6613;&#x538B;&#x57AE;&#xFF0C;&#x5176;&#x67E5;&#x8BE2;&#x6027;&#x80FD;&#x53EF;&#x80FD;&#x53D8;&#x5DEE;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x7684;&#x8FD0;&#x884C;&#x95EE;&#x9898;&#x3010;35&#x3011;&#x3002;</li>
<li>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;MapReduce&#x4E3A;&#x4F5C;&#x4E1A;&#x8F93;&#x51FA;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x5229;&#x843D;&#x7684;&#x201C;&#x5168;&#x6709;&#x6216;&#x5168;&#x65E0;&#x201D;&#x4FDD;&#x8BC1;&#xFF1A;&#x5982;&#x679C;&#x4F5C;&#x4E1A;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x6070;&#x597D;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x5373;&#x4F7F;&#x67D0;&#x4E9B;&#x4EFB;&#x52A1;&#x5931;&#x8D25;&#x4E14;&#x5FC5;&#x987B;&#x4E00;&#x8DEF;&#x91CD;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x6574;&#x4E2A;&#x4F5C;&#x4E1A;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x4E0D;&#x4F1A;&#x751F;&#x6210;&#x8F93;&#x51FA;&#x3002;&#x7136;&#x800C;&#x4ECE;&#x4F5C;&#x4E1A;&#x5185;&#x90E8;&#x5199;&#x5165;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F1A;&#x4EA7;&#x751F;&#x5916;&#x90E8;&#x53EF;&#x89C1;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x79CD;&#x526F;&#x4F5C;&#x7528;&#x662F;&#x4E0D;&#x80FD;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x88AB;&#x9690;&#x85CF;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x53BB;&#x64CD;&#x5FC3;&#x90E8;&#x5206;&#x5B8C;&#x6210;&#x7684;&#x4F5C;&#x4E1A;&#x5BF9;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x53EF;&#x89C1;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x9700;&#x8981;&#x7406;&#x89E3;Hadoop&#x4EFB;&#x52A1;&#x5C1D;&#x8BD5;&#x4E0E;&#x9884;&#x6D4B;&#x6267;&#x884C;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</li>
</ul>
<p>&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5728;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;<strong>&#x5185;</strong>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x76EE;&#x5F55;&#xFF0C;&#x5C31;&#x50CF;&#x4E0A;&#x8282;&#x4E2D;&#x7684;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#x4E00;&#x6837;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4E00;&#x65E6;&#x5199;&#x5165;&#x5C31;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x6279;&#x91CF;&#x52A0;&#x8F7D;&#x5230;&#x5904;&#x7406;&#x53EA;&#x8BFB;&#x67E5;&#x8BE2;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x3002;&#x4E0D;&#x5C11;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x90FD;&#x652F;&#x6301;&#x5728;MapReduce&#x4F5C;&#x4E1A;&#x4E2D;&#x6784;&#x5EFA;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#xFF0C;&#x5305;&#x62EC;Voldemort &#x3010;46&#x3011;&#xFF0C;Terrapin &#x3010;47&#x3011;&#xFF0C;ElephantDB &#x3010;48&#x3011;&#x548C;HBase&#x6279;&#x91CF;&#x52A0;&#x8F7D;&#x3010;49&#x3011;&#x3002;</p>
<p>&#x200B;    &#x6784;&#x5EFA;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x6587;&#x4EF6;&#x662F;MapReduce&#x7684;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7528;&#x6CD5;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#xFF1A;&#x4F7F;&#x7528;Mapper&#x63D0;&#x53D6;&#x51FA;&#x952E;&#x5E76;&#x6309;&#x8BE5;&#x952E;&#x6392;&#x5E8F;&#xFF0C;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x662F;&#x6784;&#x5EFA;&#x7D22;&#x5F15;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x5927;&#x91CF;&#x5DE5;&#x4F5C;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x5927;&#x591A;&#x90FD;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF08;&#x6587;&#x4EF6;&#x53EA;&#x80FD;&#x7531;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x4E00;&#x6B21;&#x6027;&#x5199;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x4E0D;&#x53EF;&#x53D8;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x3002;&#x6BD4;&#x5982;&#x5B83;&#x4EEC;&#x5C31;&#x4E0D;&#x9700;&#x8981;WAL&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x4F7F;B&#x6811;&#x53EF;&#x9760;">&#x4F7F;B&#x6811;&#x53EF;&#x9760;</a>&#x201D;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5C06;&#x6570;&#x636E;&#x52A0;&#x8F7D;&#x5230;Voldemort&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x7EE7;&#x7EED;&#x7528;&#x65E7;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x8BF7;&#x6C42;&#xFF0C;&#x540C;&#x65F6;&#x5C06;&#x65B0;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4ECE;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x590D;&#x5236;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x3002;&#x4E00;&#x65E6;&#x590D;&#x5236;&#x5B8C;&#x6210;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x5C06;&#x67E5;&#x8BE2;&#x5207;&#x6362;&#x5230;&#x65B0;&#x6587;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#x51FA;&#x73B0;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x56DE;&#x6EDA;&#x81F3;&#x65E7;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x800C;&#x4E14;&#x4E0D;&#x53EF;&#x53D8;&#x3010;46&#x3011;&#x3002;</p>
<h4 id="&#x6279;&#x5904;&#x7406;&#x8F93;&#x51FA;&#x7684;&#x54F2;&#x5B66;">&#x6279;&#x5904;&#x7406;&#x8F93;&#x51FA;&#x7684;&#x54F2;&#x5B66;</h4>
<p>&#x200B;    &#x672C;&#x7AE0;&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;Unix&#x54F2;&#x5B66;&#xFF08;&#x201C;<a href="#Unix&#x54F2;&#x5B66;">Unix&#x54F2;&#x5B66;</a>&#x201D;&#xFF09;&#x9F13;&#x52B1;&#x4EE5;&#x663E;&#x5F0F;&#x6307;&#x660E;&#x6570;&#x636E;&#x6D41;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5B9E;&#x9A8C;&#xFF1A;&#x7A0B;&#x5E8F;&#x8BFB;&#x53D6;&#x8F93;&#x5165;&#x5E76;&#x5199;&#x5165;&#x8F93;&#x51FA;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8F93;&#x5165;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x4EFB;&#x4F55;&#x5148;&#x524D;&#x7684;&#x8F93;&#x51FA;&#x90FD;&#x88AB;&#x65B0;&#x8F93;&#x51FA;&#x5B8C;&#x5168;&#x66FF;&#x6362;&#xFF0C;&#x4E14;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x968F;&#x5FC3;&#x6240;&#x6B32;&#x5730;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#xFF0C;&#x7565;&#x505A;&#x6539;&#x52A8;&#x6216;&#x8FDB;&#x884C;&#x8C03;&#x8BD5;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x6405;&#x4E71;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x200B;    MapReduce&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x5904;&#x7406;&#x9075;&#x5FAA;&#x540C;&#x6837;&#x7684;&#x539F;&#x7406;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x8F93;&#x5165;&#x89C6;&#x4E3A;&#x4E0D;&#x53EF;&#x53D8;&#x4E14;&#x907F;&#x514D;&#x526F;&#x4F5C;&#x7528;&#xFF08;&#x5982;&#x5199;&#x5165;&#x5916;&#x90E8;&#x6570;&#x636E;&#x5E93;&#xFF09;&#xFF0C;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x4E0D;&#x4EC5;&#x5B9E;&#x73B0;&#x4E86;&#x826F;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x800C;&#x4E14;&#x66F4;&#x5BB9;&#x6613;&#x7EF4;&#x62A4;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x800C;&#x8F93;&#x51FA;&#x9519;&#x8BEF;&#x6216;&#x635F;&#x574F;&#x4E86;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x56DE;&#x6EDA;&#x5230;&#x4EE3;&#x7801;&#x7684;&#x5148;&#x524D;&#x7248;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x8BE5;&#x4F5C;&#x4E1A;&#xFF0C;&#x8F93;&#x51FA;&#x5C06;&#x91CD;&#x65B0;&#x88AB;&#x7EA0;&#x6B63;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x65E7;&#x7684;&#x8F93;&#x51FA;&#x4FDD;&#x5B58;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x5F55;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5207;&#x6362;&#x56DE;&#x539F;&#x6765;&#x7684;&#x76EE;&#x5F55;&#x3002;&#x5177;&#x6709;&#x8BFB;&#x5199;&#x4E8B;&#x52A1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x90E8;&#x7F72;&#x4E86;&#x9519;&#x8BEF;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5C06;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x90A3;&#x4E48;&#x56DE;&#x6EDA;&#x4EE3;&#x7801;&#x5C06;&#x65E0;&#x6CD5;&#x4FEE;&#x590D;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002; &#xFF08;&#x80FD;&#x591F;&#x4ECE;&#x9519;&#x8BEF;&#x4EE3;&#x7801;&#x4E2D;&#x6062;&#x590D;&#x7684;&#x6982;&#x5FF5;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x4EBA;&#x7C7B;&#x5BB9;&#x9519;&#xFF08;human fault tolerance&#xFF09;</strong>&#x3010;50&#x3011;&#xFF09;</li>
<li>&#x7531;&#x4E8E;&#x56DE;&#x6EDA;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x6BD4;&#x8D77;&#x5728;&#x9519;&#x8BEF;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x53EF;&#x633D;&#x56DE;&#x7684;&#x4F24;&#x5BB3;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x8FDB;&#x5C55;&#x80FD;&#x5FEB;&#x5F88;&#x591A;&#x3002;&#x8FD9;&#x79CD;<strong>&#x6700;&#x5C0F;&#x5316;&#x4E0D;&#x53EF;&#x9006;&#x6027;&#xFF08;minimizing irreversibility&#xFF09;</strong>&#x7684;&#x539F;&#x5219;&#x6709;&#x5229;&#x4E8E;&#x654F;&#x6377;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x3010;51&#x3011;&#x3002;</li>
<li>&#x5982;&#x679C;Map&#x6216;Reduce&#x4EFB;&#x52A1;&#x5931;&#x8D25;&#xFF0C;MapReduce&#x6846;&#x67B6;&#x5C06;&#x81EA;&#x52A8;&#x91CD;&#x65B0;&#x8C03;&#x5EA6;&#xFF0C;&#x5E76;&#x5728;&#x540C;&#x6837;&#x7684;&#x8F93;&#x5165;&#x4E0A;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x5B83;&#x3002;&#x5982;&#x679C;&#x5931;&#x8D25;&#x662F;&#x7531;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x9020;&#x6210;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4F1A;&#x4E0D;&#x65AD;&#x5D29;&#x6E83;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x5BFC;&#x81F4;&#x4F5C;&#x4E1A;&#x5728;&#x51E0;&#x6B21;&#x5C1D;&#x8BD5;&#x4E4B;&#x540E;&#x5931;&#x8D25;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6545;&#x969C;&#x662F;&#x7531;&#x4E8E;&#x4E34;&#x65F6;&#x95EE;&#x9898;&#x5BFC;&#x81F4;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6545;&#x969C;&#x5C31;&#x4F1A;&#x88AB;&#x5BB9;&#x5FCD;&#x3002;&#x56E0;&#x4E3A;&#x8F93;&#x5165;&#x4E0D;&#x53EF;&#x53D8;&#xFF0C;&#x8FD9;&#x79CD;&#x81EA;&#x52A8;&#x91CD;&#x8BD5;&#x662F;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x800C;&#x5931;&#x8D25;&#x4EFB;&#x52A1;&#x7684;&#x8F93;&#x51FA;&#x4F1A;&#x88AB;MapReduce&#x6846;&#x67B6;&#x4E22;&#x5F03;&#x3002;</li>
<li>&#x540C;&#x4E00;&#x7EC4;&#x6587;&#x4EF6;&#x53EF;&#x7528;&#x4F5C;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5305;&#x62EC;&#x8BA1;&#x7B97;&#x6307;&#x6807;&#x7684;&#x76D1;&#x63A7;&#x4F5C;&#x4E1A;&#x53EF;&#x4EE5;&#x8BC4;&#x4F30;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x5426;&#x5177;&#x6709;&#x9884;&#x671F;&#x7684;&#x6027;&#x8D28;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x5176;&#x4E0E;&#x524D;&#x4E00;&#x6B21;&#x8FD0;&#x884C;&#x7684;&#x8F93;&#x51FA;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x5E76;&#x6D4B;&#x91CF;&#x5DEE;&#x5F02;&#xFF09; &#x3002;</li>
<li>&#x4E0E;Unix&#x5DE5;&#x5177;&#x7C7B;&#x4F3C;&#xFF0C;MapReduce&#x4F5C;&#x4E1A;&#x5C06;&#x903B;&#x8F91;&#x4E0E;&#x5E03;&#x7EBF;&#xFF08;&#x914D;&#x7F6E;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x76EE;&#x5F55;&#xFF09;&#x5206;&#x79BB;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x5173;&#x6CE8;&#x70B9;&#x5206;&#x79BB;&#xFF0C;&#x53EF;&#x4EE5;&#x91CD;&#x7528;&#x4EE3;&#x7801;&#xFF1A;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x4E13;&#x6CE8;&#x505A;&#x597D;&#x4E00;&#x4EF6;&#x4E8B;&#x7684;&#x4F5C;&#x4E1A;&#xFF1B;&#x800C;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x4F55;&#x65F6;&#x4F55;&#x5730;&#x8FD0;&#x884C;&#x8FD9;&#x9879;&#x4F5C;&#x4E1A;&#x3002;</li>
</ul>
<p>&#x5728;&#x8FD9;&#x4E9B;&#x9886;&#x57DF;&#xFF0C;&#x5728;Unix&#x4E0A;&#x8868;&#x73B0;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x4F3C;&#x4E4E;&#x4E5F;&#x9002;&#x7528;&#x4E8E;Hadoop&#xFF0C;&#x4F46;Unix&#x548C;Hadoop&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x4E5F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;Unix&#x5DE5;&#x5177;&#x90FD;&#x5047;&#x8BBE;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x662F;&#x65E0;&#x7C7B;&#x578B;&#x6587;&#x672C;&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x505A;&#x5927;&#x91CF;&#x7684;&#x8F93;&#x5165;&#x89E3;&#x6790;&#x5DE5;&#x4F5C;&#xFF08;&#x672C;&#x7AE0;&#x5F00;&#x5934;&#x7684;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x793A;&#x4F8B;&#x4F7F;&#x7528;<code>{print $7}</code>&#x6765;&#x63D0;&#x53D6;URL&#xFF09;&#x3002;&#x5728;Hadoop&#x4E0A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x66F4;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x6D88;&#x9664;&#x4E00;&#x4E9B;&#x4F4E;&#x4EF7;&#x503C;&#x7684;&#x8BED;&#x6CD5;&#x8F6C;&#x6362;&#xFF1A;&#x6BD4;&#x5982;Avro&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch4.html#Avro">Avro</a>&#x201D;&#xFF09;&#x548C;Parquet&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x5217;&#x5B58;&#x50A8;">&#x5217;&#x5B58;&#x50A8;</a>&#x201D;&#xFF09;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x4E8E;&#x6A21;&#x5F0F;&#x7684;&#x9AD8;&#x6548;&#x7F16;&#x7801;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x6A21;&#x5F0F;&#x968F;&#x65F6;&#x95F4;&#x63A8;&#x79FB;&#x800C;&#x6F14;&#x8FDB;&#xFF08;&#x89C1;&#x7B2C;4&#x7AE0;&#xFF09;&#x3002;</p>
<h3 id="hadoop&#x4E0E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5BF9;&#x6BD4;">Hadoop&#x4E0E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5BF9;&#x6BD4;</h3>
<p>&#x200B;    &#x6B63;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;Hadoop&#x6709;&#x70B9;&#x50CF;Unix&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7248;&#x672C;&#xFF0C;&#x5176;&#x4E2D;HDFS&#x662F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;MapReduce&#x662F;Unix&#x8FDB;&#x7A0B;&#x7684;&#x602A;&#x5F02;&#x5B9E;&#x73B0;&#xFF08;&#x603B;&#x662F;&#x5728;Map&#x9636;&#x6BB5;&#x548C;Reduce&#x9636;&#x6BB5;&#x8FD0;&#x884C;<code>sort</code>&#x5DE5;&#x5177;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x4E86;&#x5982;&#x4F55;&#x5728;&#x8FD9;&#x4E9B;&#x539F;&#x8BED;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x5B9E;&#x73B0;&#x5404;&#x79CD;&#x8FDE;&#x63A5;&#x548C;&#x5206;&#x7EC4;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x5F53;MapReduce&#x8BBA;&#x6587;&#x53D1;&#x8868;&#x65F6;&#x3010;1&#x3011;&#xFF0C;&#x5B83;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4; &#x2014;&#x2014; &#x5E76;&#x4E0D;&#x65B0;&#x9C9C;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x51E0;&#x8282;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x6240;&#x6709;&#x5904;&#x7406;&#x548C;&#x5E76;&#x884C;&#x8FDE;&#x63A5;&#x7B97;&#x6CD5;&#x5DF2;&#x7ECF;&#x5728;&#x5341;&#x591A;&#x5E74;&#x524D;&#x6240;&#x8C13;&#x7684;<strong>&#x5927;&#x89C4;&#x6A21;&#x5E76;&#x884C;&#x5904;&#x7406;&#xFF08;MPP&#xFF0C; massively parallel processing&#xFF09;</strong>&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x3010;3,40&#x3011;&#x3002;&#x6BD4;&#x5982;Gamma database machine&#xFF0C;Teradata&#x548C;Tandem NonStop SQL&#x5C31;&#x662F;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x5148;&#x9A71;&#x3010;52&#x3011;&#x3002;</p>
<p>&#x200B;    &#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x662F;&#xFF0C;MPP&#x6570;&#x636E;&#x5E93;&#x4E13;&#x6CE8;&#x4E8E;&#x5728;&#x4E00;&#x7EC4;&#x673A;&#x5668;&#x4E0A;&#x5E76;&#x884C;&#x6267;&#x884C;&#x5206;&#x6790;SQL&#x67E5;&#x8BE2;&#xFF0C;&#x800C;MapReduce&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3010;19&#x3011;&#x7684;&#x7EC4;&#x5408;&#x5219;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4EFB;&#x610F;&#x7A0B;&#x5E8F;&#x7684;&#x901A;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3002;</p>
<h4 id="&#x5B58;&#x50A8;&#x591A;&#x6837;&#x6027;">&#x5B58;&#x50A8;&#x591A;&#x6837;&#x6027;</h4>
<p>&#x200B;    &#x6570;&#x636E;&#x5E93;&#x8981;&#x6C42;&#x4F60;&#x6839;&#x636E;&#x7279;&#x5B9A;&#x7684;&#x6A21;&#x578B;&#xFF08;&#x4F8B;&#x5982;&#x5173;&#x7CFB;&#x6216;&#x6587;&#x6863;&#xFF09;&#x6765;&#x6784;&#x9020;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x53EA;&#x662F;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x6A21;&#x578B;&#x548C;&#x7F16;&#x7801;&#x6765;&#x7F16;&#x5199;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x662F;&#x6570;&#x636E;&#x5E93;&#x8BB0;&#x5F55;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x4F46;&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x662F;&#x6587;&#x672C;&#xFF0C;&#x56FE;&#x50CF;&#xFF0C;&#x89C6;&#x9891;&#xFF0C;&#x4F20;&#x611F;&#x5668;&#x8BFB;&#x6570;&#xFF0C;&#x7A00;&#x758F;&#x77E9;&#x9635;&#xFF0C;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF0C;&#x57FA;&#x56E0;&#x7EC4;&#x5E8F;&#x5217;&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x200B;    &#x8BF4;&#x767D;&#x4E86;&#xFF0C;Hadoop&#x5F00;&#x653E;&#x4E86;&#x5C06;&#x6570;&#x636E;&#x4E0D;&#x52A0;&#x533A;&#x5206;&#x5730;&#x8F6C;&#x50A8;&#x5230;HDFS&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5141;&#x8BB8;&#x540E;&#x7EED;&#x518D;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x8FDB;&#x4E00;&#x6B65;&#x5904;&#x7406;&#x3010;53&#x3011;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x5728;&#x5C06;&#x6570;&#x636E;&#x5BFC;&#x5165;&#x6570;&#x636E;&#x5E93;&#x4E13;&#x6709;&#x5B58;&#x50A8;&#x683C;&#x5F0F;&#x4E4B;&#x524D;&#xFF0C;MPP&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x548C;&#x67E5;&#x8BE2;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x4ED4;&#x7EC6;&#x7684;&#x524D;&#x671F;&#x5EFA;&#x6A21;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x7EAF;&#x7CB9;&#x4E3B;&#x4E49;&#x8005;&#x770B;&#x6765;&#xFF0C;&#x8FD9;&#x79CD;&#x4ED4;&#x7EC6;&#x7684;&#x5EFA;&#x6A21;&#x548C;&#x5BFC;&#x5165;&#x4F3C;&#x4E4E;&#x662F;&#x53EF;&#x53D6;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7528;&#x6237;&#x6709;&#x66F4;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6570;&#x636E;&#x6765;&#x5904;&#x7406;&#x3002;&#x7136;&#x800C;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x8868;&#x660E;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x6570;&#x636E;&#x5FEB;&#x901F;&#x53EF;&#x7528; &#x2014;&#x2014; &#x5373;&#x4F7F;&#x5B83;&#x5F88;&#x53E4;&#x602A;&#xFF0C;&#x96BE;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x4F7F;&#x7528;&#x539F;&#x59CB;&#x683C;&#x5F0F; &#x2014;&#x2014; &#x4E5F;&#x901A;&#x5E38;&#x8981;&#x6BD4;&#x4E8B;&#x5148;&#x51B3;&#x5B9A;&#x7406;&#x60F3;&#x6570;&#x636E;&#x6A21;&#x578B;&#x8981;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#x3010;54&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x4E0E;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x7C7B;&#x4F3C;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x6570;&#x636E;&#x4ED3;&#x5E93;">&#x6570;&#x636E;&#x4ED3;&#x5E93;</a>&#x201D;&#xFF09;&#xFF1A;&#x5C06;&#x5927;&#x578B;&#x7EC4;&#x7EC7;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x5728;&#x4E00;&#x8D77;&#x662F;&#x5F88;&#x6709;&#x4EF7;&#x503C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x8DE8;&#x8D8A;&#x4EE5;&#x524D;&#x76F8;&#x5206;&#x79BB;&#x7684;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x3002; MPP&#x6570;&#x636E;&#x5E93;&#x6240;&#x8981;&#x6C42;&#x7684;&#x8C28;&#x614E;&#x6A21;&#x5F0F;&#x8BBE;&#x8BA1;&#x62D6;&#x6162;&#x4E86;&#x96C6;&#x4E2D;&#x5F0F;&#x6570;&#x636E;&#x6536;&#x96C6;&#x901F;&#x5EA6;&#xFF1B;&#x4EE5;&#x539F;&#x59CB;&#x5F62;&#x5F0F;&#x6536;&#x96C6;&#x6570;&#x636E;&#xFF0C;&#x7A0D;&#x540E;&#x518D;&#x64CD;&#x5FC3;&#x6A21;&#x5F0F;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x80FD;&#x4F7F;&#x6570;&#x636E;&#x6536;&#x96C6;&#x901F;&#x5EA6;&#x52A0;&#x5FEB;&#xFF08;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;&#x201C;<strong>&#x6570;&#x636E;&#x6E56;&#xFF08;data lake&#xFF09;</strong>&#x201D;&#x6216;&#x201C;<strong>&#x4F01;&#x4E1A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF08;enterprise data hub&#xFF09;</strong>&#x201D;&#x3010;55&#x3011;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x4E0D;&#x52A0;&#x533A;&#x5206;&#x7684;&#x6570;&#x636E;&#x8F6C;&#x50A8;&#x8F6C;&#x79FB;&#x4E86;&#x89E3;&#x91CA;&#x6570;&#x636E;&#x7684;&#x8D1F;&#x62C5;&#xFF1A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x751F;&#x4EA7;&#x8005;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x5F3A;&#x5236;&#x5C06;&#x5176;&#x8F6C;&#x5316;&#x4E3A;&#x6807;&#x51C6;&#x683C;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x7684;&#x89E3;&#x91CA;&#x6210;&#x4E3A;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x95EE;&#x9898;&#xFF08;<strong>&#x8BFB;&#x65F6;&#x6A21;&#x5F0F;</strong>&#x65B9;&#x6CD5;&#x3010;56&#x3011;&#xFF1B;&#x53C2;&#x9605;&#x201C;<a href="ch2.html#&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x67B6;&#x6784;&#x7075;&#x6D3B;&#x6027;">&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x67B6;&#x6784;&#x7075;&#x6D3B;&#x6027;</a>&#x201D;&#xFF09;&#x3002;&#x5982;&#x679C;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x662F;&#x4E0D;&#x540C;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4E0D;&#x540C;&#x56E2;&#x961F;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x79CD;&#x4F18;&#x52BF;&#x3002;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4E0D;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x76EE;&#x7684;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5408;&#x9002;&#x89C6;&#x89D2;&#x3002;&#x4EE5;&#x539F;&#x59CB;&#x5F62;&#x5F0F;&#x7B80;&#x5355;&#x5730;&#x8F6C;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x591A;&#x79CD;&#x8FD9;&#x6837;&#x7684;&#x8F6C;&#x6362;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5BFF;&#x53F8;&#x539F;&#x5219;&#xFF08;sushi principle&#xFF09;</strong>&#xFF1A;&#x201C;&#x539F;&#x59CB;&#x6570;&#x636E;&#x66F4;&#x597D;&#x201D;&#x3010;57&#x3011;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;Hadoop&#x7ECF;&#x5E38;&#x88AB;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;ETL&#x8FC7;&#x7A0B;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x6570;&#x636E;&#x4ED3;&#x5E93;">&#x6570;&#x636E;&#x4ED3;&#x5E93;</a>&#x201D;&#xFF09;&#xFF1A;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4EE5;&#x67D0;&#x79CD;&#x539F;&#x59CB;&#x5F62;&#x5F0F;&#x8F6C;&#x50A8;&#x5230;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7F16;&#x5199;MapReduce&#x4F5C;&#x4E1A;&#x6765;&#x6E05;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x5173;&#x7CFB;&#x5F62;&#x5F0F;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5BFC;&#x5165;MPP&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4EE5;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3002;&#x6570;&#x636E;&#x5EFA;&#x6A21;&#x4ECD;&#x7136;&#x5728;&#x8FDB;&#x884C;&#xFF0C;&#x4F46;&#x5B83;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6B65;&#x9AA4;&#x4E2D;&#x8FDB;&#x884C;&#xFF0C;&#x4E0E;&#x6570;&#x636E;&#x6536;&#x96C6;&#x76F8;&#x89E3;&#x8026;&#x3002;&#x8FD9;&#x79CD;&#x89E3;&#x8026;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x652F;&#x6301;&#x4EE5;&#x4EFB;&#x4F55;&#x683C;&#x5F0F;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<h4 id="&#x5904;&#x7406;&#x6A21;&#x578B;&#x591A;&#x6837;&#x6027;">&#x5904;&#x7406;&#x6A21;&#x578B;&#x591A;&#x6837;&#x6027;</h4>
<p>&#x200B;    MPP&#x6570;&#x636E;&#x5E93;&#x662F;&#x5355;&#x4F53;&#x7684;&#xFF0C;&#x7D27;&#x5BC6;&#x96C6;&#x6210;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x8D1F;&#x8D23;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;&#xFF0C;&#x67E5;&#x8BE2;&#x8BA1;&#x5212;&#xFF0C;&#x8C03;&#x5EA6;&#x548C;&#x6267;&#x884C;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7279;&#x5B9A;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x548C;&#x4F18;&#x5316;&#xFF0C;&#x56E0;&#x6B64;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x8BBE;&#x8BA1;&#x9488;&#x5BF9;&#x7684;&#x67E5;&#x8BE2;&#x7C7B;&#x578B;&#x4E0A;&#x53D6;&#x5F97;&#x975E;&#x5E38;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x800C;&#x4E14;&#xFF0C;SQL&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x5141;&#x8BB8;&#x4EE5;&#x4F18;&#x96C5;&#x7684;&#x8BED;&#x6CD5;&#x8868;&#x8FBE;&#x67E5;&#x8BE2;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x4E1A;&#x52A1;&#x5206;&#x6790;&#x5E08;&#x7528;&#x6765;&#x505A;&#x5546;&#x4E1A;&#x5206;&#x6790;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x5DE5;&#x5177;&#xFF08;&#x4F8B;&#x5982;Tableau&#xFF09;&#x80FD;&#x591F;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x90FD;&#x53EF;&#x4EE5;&#x5408;&#x7406;&#x5730;&#x8868;&#x8FBE;&#x4E3A;SQL&#x67E5;&#x8BE2;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x6784;&#x5EFA;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x548C;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x76F8;&#x5173;&#x6027;&#x6392;&#x540D;&#x6A21;&#x578B;&#x7684;&#x5168;&#x6587;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#xFF0C;&#x6216;&#x8005;&#x6267;&#x884C;&#x56FE;&#x50CF;&#x5206;&#x6790;&#xFF0C;&#x5219;&#x5F88;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x4E00;&#x822C;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x6A21;&#x578B;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x901A;&#x5E38;&#x662F;&#x7279;&#x522B;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x7279;&#x5F81;&#x5DE5;&#x7A0B;&#xFF0C;&#x673A;&#x5668;&#x7FFB;&#x8BD1;&#x7684;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x6A21;&#x578B;&#xFF0C;&#x6B3A;&#x8BC8;&#x9884;&#x6D4B;&#x7684;&#x98CE;&#x9669;&#x8BC4;&#x4F30;&#x51FD;&#x6570;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x9700;&#x8981;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x67E5;&#x8BE2;&#x3002;</p>
<p>&#x200B;    MapReduce&#x4F7F;&#x5DE5;&#x7A0B;&#x5E08;&#x80FD;&#x591F;&#x8F7B;&#x677E;&#x5730;&#x5728;&#x5927;&#x578B;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x8FD0;&#x884C;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;HDFS&#x548C;MapReduce&#xFF0C;&#x90A3;&#x4E48;&#x4F60;<strong>&#x53EF;&#x4EE5;</strong>&#x5728;&#x5B83;&#x4E4B;&#x4E0A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;SQL&#x67E5;&#x8BE2;&#x6267;&#x884C;&#x5F15;&#x64CE;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x6B63;&#x662F;Hive&#x9879;&#x76EE;&#x6240;&#x505A;&#x7684;&#x3010;31&#x3011;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x6279;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x4E9B;&#x6279;&#x5904;&#x7406;&#x4E0D;&#x5FC5;&#x975E;&#x8981;&#x7528;SQL&#x67E5;&#x8BE2;&#x8868;&#x793A;&#x3002;</p>
<p>&#x200B;    &#x968F;&#x540E;&#xFF0C;&#x4EBA;&#x4EEC;&#x53D1;&#x73B0;MapReduce&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x800C;&#x8A00;&#x5C40;&#x9650;&#x6027;&#x5F88;&#x5927;&#xFF0C;&#x8868;&#x73B0;&#x5F88;&#x5DEE;&#xFF0C;&#x56E0;&#x6B64;&#x5728;Hadoop&#x4E4B;&#x4E0A;&#x5176;&#x4ED6;&#x5404;&#x79CD;&#x5904;&#x7406;&#x6A21;&#x578B;&#x4E5F;&#x88AB;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="#&#x540E;MapReduce&#x65F6;&#x4EE3;">MapReduce&#x4E4B;&#x540E;</a>&#x201D;&#x4E2D;&#x770B;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#xFF09;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x5904;&#x7406;&#x6A21;&#x578B;&#xFF0C;SQL&#x548C;MapReduce&#xFF0C;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#xFF01;&#x800C;&#x4E14;&#x7531;&#x4E8E;Hadoop&#x5E73;&#x53F0;&#x7684;&#x5F00;&#x653E;&#x6027;&#xFF0C;&#x5B9E;&#x65BD;&#x4E00;&#x6574;&#x5957;&#x65B9;&#x6CD5;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x5728;&#x5355;&#x4F53;MPP&#x6570;&#x636E;&#x5E93;&#x7684;&#x8303;&#x7574;&#x5185;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3010;58&#x3011;&#x3002;</p>
<p>&#x200B;    &#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x6A21;&#x578B;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x5171;&#x4EAB;&#x7684;&#x5355;&#x4E2A;&#x673A;&#x5668;&#x96C6;&#x7FA4;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x673A;&#x5668;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x76F8;&#x540C;&#x6587;&#x4EF6;&#x3002;&#x5728;Hadoop&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5C06;&#x6570;&#x636E;&#x5BFC;&#x5165;&#x5230;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4E13;&#x7528;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#xFF1A;&#x7CFB;&#x7EDF;&#x8DB3;&#x591F;&#x7075;&#x6D3B;&#xFF0C;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x540C;&#x4E00;&#x4E2A;&#x7FA4;&#x96C6;&#x5185;&#x4E0D;&#x540C;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x3002;&#x4E0D;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x6570;&#x636E;&#xFF0C;&#x4F7F;&#x5F97;&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x6316;&#x6398;&#x4EF7;&#x503C;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#xFF0C;&#x4E5F;&#x4F7F;&#x91C7;&#x7528;&#x65B0;&#x7684;&#x5904;&#x7406;&#x6A21;&#x578B;&#x5BB9;&#x6613;&#x7684;&#x591A;&#x3002;</p>
<p>&#x200B;    Hadoop&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x5305;&#x62EC;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x7684;OLTP&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5982;HBase&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#SSTables&#x548C;LSM&#x6811;">SSTables&#x548C;LSM&#x6811;</a>&#x201D;&#xFF09;&#x548C;MPP&#x98CE;&#x683C;&#x7684;&#x5206;&#x6790;&#x578B;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5982;Impala &#x3010;41&#x3011;&#x3002; HBase&#x4E0E;Impala&#x90FD;&#x4E0D;&#x4F7F;&#x7528;MapReduce&#xFF0C;&#x4F46;&#x90FD;&#x4F7F;&#x7528;HDFS&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x3002;&#x5B83;&#x4EEC;&#x662F;&#x8FE5;&#x5F02;&#x7684;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x4E0E;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5171;&#x5B58;&#xFF0C;&#x5E76;&#x88AB;&#x96C6;&#x6210;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;</p>
<h4 id="&#x9488;&#x5BF9;&#x9891;&#x7E41;&#x6545;&#x969C;&#x8BBE;&#x8BA1;">&#x9488;&#x5BF9;&#x9891;&#x7E41;&#x6545;&#x969C;&#x8BBE;&#x8BA1;</h4>
<p>&#x200B;    &#x5F53;&#x6BD4;&#x8F83;MapReduce&#x548C;MPP&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#x51FA;&#x73B0;&#x4E86;&#xFF1A;&#x5904;&#x7406;&#x6545;&#x969C;&#x548C;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x4E0E;&#x78C1;&#x76D8;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x4E0E;&#x5728;&#x7EBF;&#x7CFB;&#x7EDF;&#x76F8;&#x6BD4;&#xFF0C;&#x6279;&#x5904;&#x7406;&#x5BF9;&#x6545;&#x969C;&#x4E0D;&#x592A;&#x654F;&#x611F;&#xFF0C;&#x56E0;&#x4E3A;&#x5C31;&#x7B97;&#x5931;&#x8D25;&#x4E5F;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x5F71;&#x54CD;&#x5230;&#x7528;&#x6237;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x4EEC;&#x603B;&#x662F;&#x80FD;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5728;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#x65F6;&#x5D29;&#x6E83;&#xFF0C;&#x5927;&#x591A;&#x6570;MPP&#x6570;&#x636E;&#x5E93;&#x4F1A;&#x4E2D;&#x6B62;&#x6574;&#x4E2A;&#x67E5;&#x8BE2;&#xFF0C;&#x5E76;&#x8BA9;&#x7528;&#x6237;&#x91CD;&#x65B0;&#x63D0;&#x4EA4;&#x67E5;&#x8BE2;&#x6216;&#x81EA;&#x52A8;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x5B83;&#x3010;3&#x3011;&#x3002;&#x7531;&#x4E8E;&#x67E5;&#x8BE2;&#x901A;&#x5E38;&#x6700;&#x591A;&#x8FD0;&#x884C;&#x51E0;&#x79D2;&#x949F;&#x6216;&#x51E0;&#x5206;&#x949F;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x91CD;&#x8BD5;&#x7684;&#x4EE3;&#x4EF7;&#x4E0D;&#x662F;&#x592A;&#x5927;&#x3002; MPP&#x6570;&#x636E;&#x5E93;&#x8FD8;&#x503E;&#x5411;&#x4E8E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x7559;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x6570;&#x636E;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x6563;&#x5217;&#x8FDE;&#x63A5;&#xFF09;&#x4EE5;&#x907F;&#x514D;&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x7684;&#x5F00;&#x9500;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;MapReduce&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x5355;&#x4E2A;Map&#x6216;Reduce&#x4EFB;&#x52A1;&#x7684;&#x5931;&#x8D25;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x4F5C;&#x4E1A;&#x7684;&#x6574;&#x4F53;&#xFF0C;&#x901A;&#x8FC7;&#x4EE5;&#x5355;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x7C92;&#x5EA6;&#x91CD;&#x8BD5;&#x5DE5;&#x4F5C;&#x3002;&#x5B83;&#x4E5F;&#x4F1A;&#x975E;&#x5E38;&#x6025;&#x5207;&#x5730;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x4E3A;&#x4E86;&#x5BB9;&#x9519;&#xFF0C;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x56E0;&#x4E3A;&#x5047;&#x8BBE;&#x6570;&#x636E;&#x96C6;&#x592A;&#x5927;&#x800C;&#x4E0D;&#x80FD;&#x9002;&#x5E94;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x200B;    MapReduce&#x65B9;&#x5F0F;&#x66F4;&#x9002;&#x7528;&#x4E8E;&#x8F83;&#x5927;&#x7684;&#x4F5C;&#x4E1A;&#xFF1A;&#x8981;&#x5904;&#x7406;&#x5982;&#x6B64;&#x4E4B;&#x591A;&#x7684;&#x6570;&#x636E;&#x5E76;&#x8FD0;&#x884C;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x4F5C;&#x4E1A;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F88;&#x53EF;&#x80FD;&#x81F3;&#x5C11;&#x9047;&#x5230;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x6545;&#x969C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x5355;&#x4E2A;&#x4EFB;&#x52A1;&#x5931;&#x8D25;&#x800C;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x6574;&#x4E2A;&#x4F5C;&#x4E1A;&#x5C06;&#x662F;&#x975E;&#x5E38;&#x6D6A;&#x8D39;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x4EE5;&#x5355;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x7C92;&#x5EA6;&#x8FDB;&#x884C;&#x6062;&#x590D;&#x5F15;&#x5165;&#x4E86;&#x4F7F;&#x5F97;&#x65E0;&#x6545;&#x969C;&#x5904;&#x7406;&#x66F4;&#x6162;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x5931;&#x8D25;&#x7387;&#x8DB3;&#x591F;&#x9AD8;&#xFF0C;&#x8FD9;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x5408;&#x7406;&#x7684;&#x6743;&#x8861;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#x6709;&#x591A;&#x4E48;&#x73B0;&#x5B9E;&#x5462;&#xFF1F;&#x5728;&#x5927;&#x591A;&#x6570;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x673A;&#x5668;&#x6545;&#x969C;&#x786E;&#x5B9E;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x5F88;&#x9891;&#x7E41; &#x2014;&#x2014; &#x53EF;&#x80FD;&#x5C11;&#x5230;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4F5C;&#x4E1A;&#x90FD;&#x4E0D;&#x4F1A;&#x7ECF;&#x5386;&#x673A;&#x5668;&#x6545;&#x969C;&#x3002;&#x4E3A;&#x4E86;&#x5BB9;&#x9519;&#xFF0C;&#x771F;&#x7684;&#x503C;&#x5F97;&#x5E26;&#x6765;&#x8FD9;&#x4E48;&#x5927;&#x7684;&#x989D;&#x5916;&#x5F00;&#x9500;&#x5417;&#xFF1F;</p>
<p>&#x200B;    &#x8981;&#x4E86;&#x89E3;MapReduce&#x8282;&#x7EA6;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x548C;&#x5728;&#x4EFB;&#x52A1;&#x7684;&#x5C42;&#x6B21;&#x8FDB;&#x884C;&#x6062;&#x590D;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4E86;&#x89E3;&#x6700;&#x521D;&#x8BBE;&#x8BA1;MapReduce&#x7684;&#x73AF;&#x5883;&#x662F;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002; Google&#x6709;&#x7740;&#x6DF7;&#x7528;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5728;&#x7EBF;&#x751F;&#x4EA7;&#x670D;&#x52A1;&#x548C;&#x79BB;&#x7EBF;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x5728;&#x540C;&#x6837;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;&#x5BB9;&#x5668;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x7684;&#x8D44;&#x6E90;&#x914D;&#x7ED9;&#xFF08;CPU&#x6838;&#x5FC3;&#xFF0C;RAM&#xFF0C;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x7B49;&#xFF09;&#x3002;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x4E5F;&#x5177;&#x6709;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5982;&#x679C;&#x4F18;&#x5148;&#x7EA7;&#x8F83;&#x9AD8;&#x7684;&#x4EFB;&#x52A1;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7EC8;&#x6B62;&#xFF08;&#x62A2;&#x5360;&#xFF09;&#x540C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8F83;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x4EFB;&#x52A1;&#x4EE5;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x3002;&#x4F18;&#x5148;&#x7EA7;&#x8FD8;&#x51B3;&#x5B9A;&#x4E86;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x7684;&#x5B9A;&#x4EF7;&#xFF1A;&#x56E2;&#x961F;&#x5FC5;&#x987B;&#x4E3A;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x4ED8;&#x8D39;&#xFF0C;&#x800C;&#x4F18;&#x5148;&#x7EA7;&#x66F4;&#x9AD8;&#x7684;&#x8FDB;&#x7A0B;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x3010;59&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x5141;&#x8BB8;&#x975E;&#x751F;&#x4EA7;&#xFF08;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#xFF09;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x88AB;<strong>&#x8FC7;&#x91CF;&#x4F7F;&#x7528;&#xFF08;overcommitted&#xFF09;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x7CFB;&#x7EDF;&#x77E5;&#x9053;&#x5FC5;&#x8981;&#x65F6;&#x5B83;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#x8D44;&#x6E90;&#x3002;&#x4E0E;&#x5206;&#x79BB;&#x751F;&#x4EA7;&#x548C;&#x975E;&#x751F;&#x4EA7;&#x4EFB;&#x52A1;&#x7684;&#x7CFB;&#x7EDF;&#x76F8;&#x6BD4;&#xFF0C;&#x8FC7;&#x91CF;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x5229;&#x7528;&#x673A;&#x5668;&#x5E76;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x3002;&#x4F46;&#x7531;&#x4E8E;MapReduce&#x4F5C;&#x4E1A;&#x4EE5;&#x4F4E;&#x4F18;&#x5148;&#x7EA7;&#x8FD0;&#x884C;&#xFF0C;&#x5B83;&#x4EEC;&#x968F;&#x65F6;&#x90FD;&#x6709;&#x88AB;&#x62A2;&#x5360;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x56E0;&#x4E3A;&#x4F18;&#x5148;&#x7EA7;&#x8F83;&#x9AD8;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5176;&#x8D44;&#x6E90;&#x3002;&#x5728;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x8FDB;&#x7A0B;&#x62FF;&#x8D70;&#x6240;&#x9700;&#x8D44;&#x6E90;&#x540E;&#xFF0C;&#x6279;&#x91CF;&#x4F5C;&#x4E1A;&#x80FD;&#x6709;&#x6548;&#x5730;&#x201C;&#x6361;&#x9762;&#x5305;&#x5C51;&#x201D;&#xFF0C;&#x5229;&#x7528;&#x5269;&#x4E0B;&#x7684;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8C37;&#x6B4C;&#xFF0C;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x5C0F;&#x65F6;&#x7684;MapReduce&#x4EFB;&#x52A1;&#x6709;&#x5927;&#x7EA6;&#x6709;5&#xFF05;&#x7684;&#x98CE;&#x9669;&#x88AB;&#x7EC8;&#x6B62;&#xFF0C;&#x4E3A;&#x4E86;&#x7ED9;&#x66F4;&#x9AD8;&#x4F18;&#x5148;&#x7EA7;&#x7684;&#x8FDB;&#x7A0B;&#x632A;&#x5730;&#x65B9;&#x3002;&#x8FD9;&#x4E00;&#x6982;&#x7387;&#x6BD4;&#x786C;&#x4EF6;&#x95EE;&#x9898;&#xFF0C;&#x673A;&#x5668;&#x91CD;&#x542F;&#x6216;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x7684;&#x6982;&#x7387;&#x9AD8;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3010;59&#x3011;&#x3002;&#x6309;&#x7167;&#x8FD9;&#x79CD;&#x62A2;&#x5360;&#x7387;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x6709;100&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x8FD0;&#x884C;10&#x5206;&#x949F;&#xFF0C;&#x90A3;&#x4E48;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5728;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#x88AB;&#x7EC8;&#x6B62;&#x7684;&#x98CE;&#x9669;&#x5927;&#x4E8E;50&#xFF05;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x5C31;&#x662F;MapReduce&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x5BB9;&#x5FCD;&#x9891;&#x7E41;&#x610F;&#x5916;&#x4EFB;&#x52A1;&#x7EC8;&#x6B62;&#x7684;&#x539F;&#x56E0;&#xFF1A;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x786C;&#x4EF6;&#x5F88;&#x4E0D;&#x53EF;&#x9760;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x4EFB;&#x610F;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;&#x7684;&#x81EA;&#x7531;&#x6709;&#x5229;&#x4E8E;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x7387;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x5F00;&#x6E90;&#x7684;&#x96C6;&#x7FA4;&#x8C03;&#x5EA6;&#x5668;&#x4E2D;&#xFF0C;&#x62A2;&#x5360;&#x7684;&#x4F7F;&#x7528;&#x8F83;&#x5C11;&#x3002; YARN&#x7684;CapacityScheduler&#x652F;&#x6301;&#x62A2;&#x5360;&#xFF0C;&#x4EE5;&#x5E73;&#x8861;&#x4E0D;&#x540C;&#x961F;&#x5217;&#x7684;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x3010;58&#x3011;&#xFF0C;&#x4F46;&#x5728;&#x7F16;&#x5199;&#x672C;&#x6587;&#x65F6;&#xFF0C;YARN&#xFF0C;Mesos&#x6216;Kubernetes&#x4E0D;&#x652F;&#x6301;&#x901A;&#x7528;&#x4F18;&#x5148;&#x7EA7;&#x62A2;&#x5360;&#x3010;60&#x3011;&#x3002;&#x5728;&#x4EFB;&#x52A1;&#x4E0D;&#x7ECF;&#x5E38;&#x88AB;&#x7EC8;&#x6B62;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;MapReduce&#x7684;&#x8FD9;&#x4E00;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x5C31;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x610F;&#x4E49;&#x4E86;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x4E00;&#x4E9B;&#x4E0E;MapReduce&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x76F8;&#x5F02;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="mapreduce&#x4E4B;&#x540E;">MapReduce&#x4E4B;&#x540E;</h2>
<p>&#x200B;    &#x867D;&#x7136;MapReduce&#x5728;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x4E8C;&#x5341;&#x5E74;&#x4EE3;&#x540E;&#x671F;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6D41;&#x884C;&#xFF0C;&#x5E76;&#x53D7;&#x5230;&#x5927;&#x91CF;&#x7684;&#x7092;&#x4F5C;&#xFF0C;&#x4F46;&#x5B83;&#x53EA;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x8BB8;&#x591A;&#x53EF;&#x80FD;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x4E4B;&#x4E00;&#x3002;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x5904;&#x7406;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x4ED6;&#x5DE5;&#x5177;&#x53EF;&#x80FD;&#x66F4;&#x9002;&#x5408;&#x8868;&#x793A;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#x200B;    &#x4E0D;&#x7BA1;&#x5982;&#x4F55;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x4E00;&#x7AE0;&#x82B1;&#x4E86;&#x5927;&#x628A;&#x65F6;&#x95F4;&#x6765;&#x8BA8;&#x8BBA;MapReduce&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x7528;&#x7684;&#x5B66;&#x4E60;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x79CD;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x660E;&#x6670;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;<strong>&#x7B80;&#x5355;</strong>&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x80FD;&#x7406;&#x89E3;&#x5B83;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x610F;&#x5473;&#x7740;&#x4F7F;&#x7528;&#x5B83;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x6070;&#x6070;&#x76F8;&#x53CD;&#xFF1A;&#x4F7F;&#x7528;&#x539F;&#x59CB;&#x7684;MapReduce API&#x6765;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x7684;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x548C;&#x8D39;&#x529B;&#x7684; &#x2014;&#x2014; &#x4F8B;&#x5982;&#xFF0C;&#x4EFB;&#x610F;&#x4E00;&#x79CD;&#x8FDE;&#x63A5;&#x7B97;&#x6CD5;&#x90FD;&#x9700;&#x8981;&#x4F60;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x5B9E;&#x73B0;&#x3010;37&#x3011;&#x3002;</p>
<p>&#x200B;    &#x9488;&#x5BF9;&#x76F4;&#x63A5;&#x4F7F;&#x7528;MapReduce&#x7684;&#x56F0;&#x96BE;&#xFF0C;&#x5728;MapReduce&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x9AD8;&#x7EA7;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF08;Pig&#xFF0C;Hive&#xFF0C;Cascading&#xFF0C;Crunch&#xFF09;&#x88AB;&#x521B;&#x9020;&#x51FA;&#x6765;&#xFF0C;&#x4F5C;&#x4E3A;&#x5EFA;&#x7ACB;&#x5728;MapReduce&#x4E4B;&#x4E0A;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4E86;&#x89E3;MapReduce&#x7684;&#x539F;&#x7406;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x5B66;&#x8D77;&#x6765;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x3002;&#x800C;&#x4E14;&#x5B83;&#x4EEC;&#x7684;&#x9AD8;&#x7EA7;&#x7ED3;&#x6784;&#x80FD;&#x663E;&#x8457;&#x7B80;&#x5316;&#x8BB8;&#x591A;&#x5E38;&#x89C1;&#x6279;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;MapReduce&#x6267;&#x884C;&#x6A21;&#x578B;&#x672C;&#x8EAB;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5E76;&#x6CA1;&#x6709;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x53E6;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5C42;&#x6B21;&#x800C;&#x89E3;&#x51B3;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x5B83;&#x8868;&#x73B0;&#x5F97;&#x975E;&#x5E38;&#x5DEE;&#x52B2;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;MapReduce&#x975E;&#x5E38;&#x7A33;&#x5065;&#xFF1A;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x5728;&#x4EFB;&#x52A1;&#x4F1A;&#x9891;&#x7E41;&#x7EC8;&#x6B62;&#x7684;&#x591A;&#x79DF;&#x6237;&#x7CFB;&#x7EDF;&#x4E0A;&#x5904;&#x7406;&#x51E0;&#x4E4E;&#x4EFB;&#x610F;&#x5927;&#x91CF;&#x7EA7;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#xFF08;&#x867D;&#x7136;&#x901F;&#x5EA6;&#x5F88;&#x6162;&#xFF09;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x800C;&#x8A00;&#xFF0C;&#x5176;&#x4ED6;&#x5DE5;&#x5177;&#x6709;&#x65F6;&#x4F1A;&#x5FEB;&#x4E0A;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x6279;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x3002;&#x5728;<a href="ch11.html">&#x7B2C;11&#x7AE0;</a>&#x6211;&#x4EEC;&#x5C06;&#x8F6C;&#x5411;&#x6D41;&#x5904;&#x7406;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x52A0;&#x901F;&#x6279;&#x5904;&#x7406;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="&#x7269;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;">&#x7269;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;</h3>
<p>&#x200B;    &#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x6BCF;&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x90FD;&#x72EC;&#x7ACB;&#x4E8E;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x4F5C;&#x4E1A;&#x3002;&#x4F5C;&#x4E1A;&#x4E0E;&#x4E16;&#x754C;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x7684;&#x4E3B;&#x8981;&#x8FDE;&#x63A5;&#x70B9;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x76EE;&#x5F55;&#x3002;&#x5982;&#x679C;&#x5E0C;&#x671B;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x6210;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5C06;&#x7B2C;&#x4E8C;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#x76EE;&#x5F55;&#x914D;&#x7F6E;&#x4E3A;&#x7B2C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x8F93;&#x51FA;&#x76EE;&#x5F55;&#xFF0C;&#x4E14;&#x5916;&#x90E8;&#x5DE5;&#x4F5C;&#x6D41;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x5B8C;&#x6210;&#x540E;&#x518D;&#x542F;&#x52A8;&#x7B2C;&#x4E8C;&#x4E2A;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x7B2C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x8981;&#x5728;&#x7EC4;&#x7EC7;&#x5185;&#x5E7F;&#x6CDB;&#x53D1;&#x5E03;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5219;&#x8FD9;&#x79CD;&#x914D;&#x7F6E;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x540D;&#x79F0;&#x5F15;&#x7528;&#x5B83;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x91CD;&#x7528;&#x4E3A;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#xFF08;&#x5305;&#x62EC;&#x7531;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#x5F00;&#x53D1;&#x7684;&#x4F5C;&#x4E1A;&#xFF09;&#x3002;&#x5C06;&#x6570;&#x636E;&#x53D1;&#x5E03;&#x5230;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x4F4D;&#x7F6E;&#x80FD;&#x591F;&#x5E26;&#x6765;<strong>&#x677E;&#x8026;&#x5408;</strong>&#xFF0C;&#x8FD9;&#x6837;&#x4F5C;&#x4E1A;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x662F;&#x8C01;&#x5728;&#x63D0;&#x4F9B;&#x8F93;&#x5165;&#x6216;&#x8C01;&#x5728;&#x6D88;&#x8D39;&#x8F93;&#x51FA;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x903B;&#x8F91;&#x4E0E;&#x5E03;&#x7EBF;&#x76F8;&#x5206;&#x79BB;">&#x903B;&#x8F91;&#x4E0E;&#x5E03;&#x7EBF;&#x76F8;&#x5206;&#x79BB;</a>&#x201D;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x77E5;&#x9053;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x51FA;&#x53EA;&#x80FD;&#x7528;&#x4F5C;&#x53E6;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x8FD9;&#x4E9B;&#x4F5C;&#x4E1A;&#x7531;&#x540C;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x7EF4;&#x62A4;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;<strong>&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#xFF08;intermediate state&#xFF09;</strong>&#xFF1A;&#x4E00;&#x79CD;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x4F20;&#x9012;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x7684;&#xFF0C;&#x7531;50&#x6216;100&#x4E2A;MapReduce&#x4F5C;&#x4E1A;&#x7EC4;&#x6210;&#x7684;&#x590D;&#x6742;&#x5DE5;&#x4F5C;&#x6D41;&#x4E2D;&#xFF0C;&#x5B58;&#x5728;&#x7740;&#x5F88;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x3010;29&#x3011;&#x3002;</p>
<p>&#x200B;    &#x5C06;&#x8FD9;&#x4E2A;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;<strong>&#x7269;&#x5316;&#xFF08;materialization&#xFF09;</strong>&#x3002; &#xFF08;&#x5728;&#x201C;<a href="ch2.html#&#x805A;&#x5408;&#xFF1A;&#x6570;&#x636E;&#x7ACB;&#x65B9;&#x4F53;&#x548C;&#x7269;&#x5316;&#x89C6;&#x56FE;">&#x805A;&#x5408;&#xFF1A;&#x6570;&#x636E;&#x7ACB;&#x65B9;&#x4F53;&#x548C;&#x7269;&#x5316;&#x89C6;&#x56FE;</a>&#x201D;&#x4E2D;&#x5DF2;&#x7ECF;&#x5728;&#x7269;&#x5316;&#x89C6;&#x56FE;&#x7684;&#x80CC;&#x666F;&#x4E2D;&#x9047;&#x5230;&#x8FC7;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x3002;&#x5B83;&#x610F;&#x5473;&#x7740;&#x5BF9;&#x67D0;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x7ED3;&#x679C;&#x7ACB;&#x5373;&#x6C42;&#x503C;&#x5E76;&#x5199;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x8BF7;&#x6C42;&#x65F6;&#x6309;&#x9700;&#x8BA1;&#x7B97;&#xFF09;</p>
<p>&#x200B;    &#x4F5C;&#x4E3A;&#x5BF9;&#x7167;&#xFF0C;&#x672C;&#x7AE0;&#x5F00;&#x5934;&#x7684;&#x65E5;&#x5FD7;&#x5206;&#x6790;&#x793A;&#x4F8B;&#x4F7F;&#x7528;Unix&#x7BA1;&#x9053;&#x5C06;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x8F93;&#x51FA;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x8F93;&#x5165;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;&#x7BA1;&#x9053;&#x5E76;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x7269;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x662F;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x5185;&#x5B58;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x5C06;&#x8F93;&#x51FA;&#x589E;&#x91CF;&#x5730;<strong>&#x6D41;&#xFF08;stream&#xFF09;</strong>&#x5411;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x200B;    &#x4E0E;Unix&#x7BA1;&#x9053;&#x76F8;&#x6BD4;&#xFF0C;MapReduce&#x5B8C;&#x5168;&#x7269;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x7684;&#x65B9;&#x6CD5;&#x5B58;&#x5728;&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#xFF1A;</p>
<ul>
<li>MapReduce&#x4F5C;&#x4E1A;&#x53EA;&#x6709;&#x5728;&#x524D;&#x9A71;&#x4F5C;&#x4E1A;&#xFF08;&#x751F;&#x6210;&#x5176;&#x8F93;&#x5165;&#xFF09;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x90FD;&#x5B8C;&#x6210;&#x65F6;&#x624D;&#x80FD;&#x542F;&#x52A8;&#xFF0C;&#x800C;&#x7531;Unix&#x7BA1;&#x9053;&#x8FDE;&#x63A5;&#x7684;&#x8FDB;&#x7A0B;&#x4F1A;&#x540C;&#x65F6;&#x542F;&#x52A8;&#xFF0C;&#x8F93;&#x51FA;&#x4E00;&#x65E6;&#x751F;&#x6210;&#x5C31;&#x4F1A;&#x88AB;&#x6D88;&#x8D39;&#x3002;&#x4E0D;&#x540C;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x503E;&#x659C;&#x6216;&#x8D1F;&#x8F7D;&#x4E0D;&#x5747;&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x5F80;&#x5F80;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x6389;&#x961F;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6BD4;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x8981;&#x6162;&#x5F97;&#x591A;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x3002;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x81F3;&#x524D;&#x9A71;&#x4F5C;&#x4E1A;&#x7684;&#x6240;&#x6709;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#xFF0C;&#x62D6;&#x6162;&#x4E86;&#x6574;&#x4E2A;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x3002;</li>
<li>Mapper&#x901A;&#x5E38;&#x662F;&#x591A;&#x4F59;&#x7684;&#xFF1A;&#x5B83;&#x4EEC;&#x4EC5;&#x4EC5;&#x662F;&#x8BFB;&#x53D6;&#x521A;&#x521A;&#x7531;Reducer&#x5199;&#x5165;&#x7684;&#x540C;&#x6837;&#x6587;&#x4EF6;&#xFF0C;&#x4E3A;&#x4E0B;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x5206;&#x533A;&#x548C;&#x6392;&#x5E8F;&#x505A;&#x51C6;&#x5907;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Mapper&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x662F;&#x524D;&#x9A71;Reducer&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1A;&#x5982;&#x679C;Reducer&#x548C;Mapper&#x7684;&#x8F93;&#x51FA;&#x6709;&#x7740;&#x76F8;&#x540C;&#x7684;&#x5206;&#x533A;&#x4E0E;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;Reducer&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4E32;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x4E0E;Mapper&#x76F8;&#x4E92;&#x4EA4;&#x7EC7;&#x3002;</li>
<li>&#x5C06;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x5B58;&#x50A8;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x88AB;&#x590D;&#x5236;&#x5230;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E34;&#x65F6;&#x6570;&#x636E;&#x8FD9;&#x4E48;&#x641E;&#x5C31;&#x6BD4;&#x8F83;&#x8FC7;&#x5206;&#x4E86;&#x3002;</li>
</ul>
<h4 id="&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;">&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;</h4>
<p>&#x200B;    &#x4E86;&#x89E3;&#x51B3;MapReduce&#x7684;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x51E0;&#x79CD;&#x7528;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x6279;&#x5904;&#x7406;&#x7684;&#x65B0;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x88AB;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x8457;&#x540D;&#x7684;&#x662F;Spark &#x3010;61,62&#x3011;&#xFF0C;Tez &#x3010;63,64&#x3011;&#x548C;Flink &#x3010;65,66&#x3011;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x5F0F;&#x6709;&#x5F88;&#x591A;&#x533A;&#x522B;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x70B9;&#xFF1A;&#x628A;&#x6574;&#x4E2A;&#x5DE5;&#x4F5C;&#x6D41;&#x4F5C;&#x4E3A;&#x5355;&#x4E2A;&#x4F5C;&#x4E1A;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x628A;&#x5B83;&#x5206;&#x89E3;&#x4E3A;&#x72EC;&#x7ACB;&#x7684;&#x5B50;&#x4F5C;&#x4E1A;&#x3002;</p>
<p>&#x200B;    &#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x5C06;&#x5DE5;&#x4F5C;&#x6D41;&#x663E;&#x5F0F;&#x5EFA;&#x6A21;&#x4E3A; &#x6570;&#x636E;&#x4ECE;&#x51E0;&#x4E2A;&#x5904;&#x7406;&#x9636;&#x6BB5;&#x7A7F;&#x8FC7;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#xFF08;dataflow engines&#xFF09;</strong>&#x3002;&#x50CF;MapReduce&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x4E00;&#x6761;&#x7EBF;&#x4E0A;&#x901A;&#x8FC7;&#x53CD;&#x590D;&#x8C03;&#x7528;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#x6765;&#x4E00;&#x6B21;&#x5904;&#x7406;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x5B83;&#x4EEC;&#x901A;&#x8FC7;&#x8F93;&#x5165;&#x5206;&#x533A;&#x6765;&#x5E76;&#x884C;&#x5316;&#x8F7D;&#x8377;&#xFF0C;&#x5B83;&#x4EEC;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5C06;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x51FA;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x200B;    &#x4E0E;MapReduce&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x4E0D;&#x9700;&#x8981;&#x4E25;&#x683C;&#x626E;&#x6F14;&#x4EA4;&#x7EC7;&#x7684;Map&#x4E0E;Reduce&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x800C;&#x662F;&#x53EF;&#x4EE5;&#x4EE5;&#x66F4;&#x7075;&#x6D3B;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x4E9B;&#x51FD;&#x6570;&#x4E3A;<strong>&#x7B97;&#x5B50;&#xFF08;operators&#xFF09;</strong>&#xFF0C;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x63D0;&#x4F9B;&#x4E86;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x9009;&#x9879;&#x6765;&#x5C06;&#x4E00;&#x4E2A;&#x7B97;&#x5B50;&#x7684;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7B97;&#x5B50;&#x7684;&#x8F93;&#x5165;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x79CD;&#x9009;&#x9879;&#x662F;&#x5BF9;&#x8BB0;&#x5F55;&#x6309;&#x952E;&#x91CD;&#x65B0;&#x5206;&#x533A;&#x5E76;&#x6392;&#x5E8F;&#xFF0C;&#x5C31;&#x50CF;&#x5728;MapReduce&#x7684;&#x6DF7;&#x6D17;&#x9636;&#x6BB5;&#x4E00;&#x6837;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x5206;&#x5E03;&#x5F0F;&#x6267;&#x884C;MapReduce">&#x5206;&#x5E03;&#x5F0F;&#x6267;&#x884C;MapReduce</a>&#x201D;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x6392;&#x5E8F;&#x5408;&#x5E76;&#x8FDE;&#x63A5;&#x548C;&#x5206;&#x7EC4;&#xFF0C;&#x5C31;&#x50CF;&#x5728;MapReduce&#x4E2D;&#x4E00;&#x6837;&#x3002;</li>
<li>&#x53E6;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x662F;&#x63A5;&#x53D7;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x4F46;&#x8DF3;&#x8FC7;&#x6392;&#x5E8F;&#x3002;&#x5F53;&#x8BB0;&#x5F55;&#x7684;&#x5206;&#x533A;&#x91CD;&#x8981;&#x4F46;&#x987A;&#x5E8F;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x65F6;&#xFF0C;&#x8FD9;&#x7701;&#x53BB;&#x4E86;&#x5206;&#x533A;&#x6563;&#x5217;&#x8FDE;&#x63A5;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x6784;&#x5EFA;&#x6563;&#x5217;&#x8868;&#x8FD8;&#x662F;&#x4F1A;&#x628A;&#x987A;&#x5E8F;&#x968F;&#x673A;&#x6253;&#x4E71;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x5E7F;&#x64AD;&#x6563;&#x5217;&#x8FDE;&#x63A5;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E2A;&#x7B97;&#x5B50;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x53D1;&#x9001;&#x5230;&#x8FDE;&#x63A5;&#x7B97;&#x5B50;&#x7684;&#x6240;&#x6709;&#x5206;&#x533A;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5904;&#x7406;&#x5F15;&#x64CE;&#x662F;&#x57FA;&#x4E8E;&#x50CF;Dryad &#x3010;67&#x3011;&#x548C;Nephele &#x3010;68&#x3011;&#x8FD9;&#x6837;&#x7684;&#x7814;&#x7A76;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E0E;MapReduce&#x6A21;&#x578B;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x6709;&#x51E0;&#x4E2A;&#x4F18;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x6392;&#x5E8F;&#x7B49;&#x6602;&#x8D35;&#x7684;&#x5DE5;&#x4F5C;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x7684;&#x5730;&#x65B9;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9ED8;&#x8BA4;&#x5730;&#x5728;&#x6BCF;&#x4E2A;Map&#x548C;Reduce&#x9636;&#x6BB5;&#x4E4B;&#x95F4;&#x51FA;&#x73B0;&#x3002;</li>
<li>&#x6CA1;&#x6709;&#x4E0D;&#x5FC5;&#x8981;&#x7684;Map&#x4EFB;&#x52A1;&#xFF0C;&#x56E0;&#x4E3A;Mapper&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5408;&#x5E76;&#x5230;&#x524D;&#x9762;&#x7684;Reduce&#x7B97;&#x5B50;&#x4E2D;&#xFF08;&#x56E0;&#x4E3A;Mapper&#x4E0D;&#x4F1A;&#x66F4;&#x6539;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5206;&#x533A;&#xFF09;&#x3002;</li>
<li>&#x7531;&#x4E8E;&#x5DE5;&#x4F5C;&#x6D41;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x548C;&#x6570;&#x636E;&#x4F9D;&#x8D56;&#x90FD;&#x662F;&#x663E;&#x5F0F;&#x58F0;&#x660E;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x603B;&#x89C8;&#x5168;&#x5C40;&#xFF0C;&#x77E5;&#x9053;&#x54EA;&#x91CC;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x800C;&#x80FD;&#x591F;&#x5229;&#x7528;&#x5C40;&#x90E8;&#x6027;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x5C06;&#x6D88;&#x8D39;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x4EFB;&#x52A1;&#x653E;&#x5728;&#x4E0E;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x4EFB;&#x52A1;&#x76F8;&#x540C;&#x7684;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x4ECE;&#x800C;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x7F13;&#x51B2;&#x533A;&#x4F20;&#x8F93;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x590D;&#x5236;&#x3002;</li>
<li>&#x901A;&#x5E38;&#xFF0C;&#x7B97;&#x5B50;&#x95F4;&#x7684;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x8DB3;&#x4EE5;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x6216;&#x5199;&#x5165;&#x672C;&#x5730;&#x78C1;&#x76D8;&#xFF0C;&#x8FD9;&#x6BD4;&#x5199;&#x5165;HDFS&#x9700;&#x8981;&#x66F4;&#x5C11;&#x7684;I/O&#xFF08;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x590D;&#x5236;&#x5230;&#x591A;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x5E76;&#x5C06;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF09;&#x3002; MapReduce&#x5DF2;&#x7ECF;&#x5BF9;Mapper&#x7684;&#x8F93;&#x51FA;&#x505A;&#x4E86;&#x8FD9;&#x79CD;&#x4F18;&#x5316;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x5C06;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x63A8;&#x5E7F;&#x81F3;&#x6240;&#x6709;&#x7684;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x3002;</li>
<li>&#x7B97;&#x5B50;&#x53EF;&#x4EE5;&#x5728;&#x8F93;&#x5165;&#x5C31;&#x7EEA;&#x540E;&#x7ACB;&#x5373;&#x5F00;&#x59CB;&#x6267;&#x884C;&#xFF1B;&#x540E;&#x7EED;&#x9636;&#x6BB5;&#x65E0;&#x9700;&#x7B49;&#x5F85;&#x524D;&#x9A71;&#x9636;&#x6BB5;&#x6574;&#x4E2A;&#x5B8C;&#x6210;&#x540E;&#x518D;&#x5F00;&#x59CB;&#x3002;</li>
<li>&#x4E0E;MapReduce&#xFF08;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x65B0;&#x7684;JVM&#xFF09;&#x76F8;&#x6BD4;&#xFF0C;&#x73B0;&#x6709;Java&#x865A;&#x62DF;&#x673A;&#xFF08;JVM&#xFF09;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x91CD;&#x7528;&#x6765;&#x8FD0;&#x884C;&#x65B0;&#x7B97;&#x5B50;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x542F;&#x52A8;&#x5F00;&#x9500;&#x3002;</li>
</ul>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x6267;&#x884C;&#x4E0E;MapReduce&#x5DE5;&#x4F5C;&#x6D41;&#x540C;&#x6837;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x800C;&#x4E14;&#x7531;&#x4E8E;&#x6B64;&#x5904;&#x6240;&#x8FF0;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x901A;&#x5E38;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x8981;&#x660E;&#x663E;&#x5FEB;&#x5F97;&#x591A;&#x3002;&#x65E2;&#x7136;&#x7B97;&#x5B50;&#x662F;Map&#x548C;Reduce&#x7684;&#x6CDB;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x76F8;&#x540C;&#x7684;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4E00;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x4E0A;&#x8FD0;&#x884C;&#xFF1A;Pig&#xFF0C;Hive&#x6216;Cascading&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x53EF;&#x4EE5;&#x65E0;&#x9700;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x914D;&#x7F6E;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x4ECE;MapReduce&#x5207;&#x6362;&#x5230;Tez&#x6216;Spark&#x3010;64&#x3011;&#x3002;</p>
<p>&#x200B;    Tez&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x8584;&#x7684;&#x5E93;&#xFF0C;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;YARN shuffle&#x670D;&#x52A1;&#x6765;&#x5B9E;&#x73B0;&#x8282;&#x70B9;&#x95F4;&#x6570;&#x636E;&#x7684;&#x5B9E;&#x9645;&#x590D;&#x5236;&#x3010;58&#x3011;&#xFF0C;&#x800C;Spark&#x548C;Flink&#x5219;&#x662F;&#x5305;&#x542B;&#x4E86;&#x72EC;&#x7ACB;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x5C42;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x53CA;&#x7528;&#x6237;&#x5411;API&#x7684;&#x5927;&#x578B;&#x6846;&#x67B6;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x7B80;&#x8981;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x9AD8;&#x7EA7;API&#x3002;</p>
<h4 id="&#x5BB9;&#x9519;">&#x5BB9;&#x9519;</h4>
<p>&#x200B;    &#x5B8C;&#x5168;&#x7269;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x81F3;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x6301;&#x4E45;&#x6027;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;MapReduce&#x4E2D;&#x7684;&#x5BB9;&#x9519;&#x76F8;&#x5F53;&#x5BB9;&#x6613;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5931;&#x8D25;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#xFF0C;&#x5E76;&#x4ECE;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x91CD;&#x65B0;&#x8BFB;&#x53D6;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x200B;    Spark&#xFF0C;Flink&#x548C;Tez&#x907F;&#x514D;&#x5C06;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x5199;&#x5165;HDFS&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x91C7;&#x53D6;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5BB9;&#x9519;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x4E22;&#x5931;&#xFF0C;&#x5219;&#x5B83;&#x4F1A;&#x4ECE;&#x5176;&#x4ED6;&#x4ECD;&#x7136;&#x53EF;&#x7528;&#x7684;&#x6570;&#x636E;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#xFF08;&#x5728;&#x53EF;&#x884C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x5148;&#x524D;&#x7684;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x53EA;&#x80FD;&#x662F;&#x539F;&#x59CB;&#x8F93;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x5E38;&#x5728;HDFS&#x4E0A;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#xFF0C;&#x6846;&#x67B6;&#x5FC5;&#x987B;&#x8DDF;&#x8E2A;&#x4E00;&#x4E2A;&#x7ED9;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x662F;&#x5982;&#x4F55;&#x8BA1;&#x7B97;&#x7684; &#x2014;&#x2014; &#x4F7F;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x8F93;&#x5165;&#x5206;&#x533A;&#xFF1F;&#x5E94;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x7B97;&#x5B50;&#xFF1F; Spark&#x4F7F;&#x7528;<strong>&#x5F39;&#x6027;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x96C6;&#xFF08;RDD&#xFF09;</strong>&#x7684;&#x62BD;&#x8C61;&#x6765;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x7684;&#x8C31;&#x7CFB;&#x3010;61&#x3011;&#xFF0C;&#x800C;Flink&#x5BF9;&#x7B97;&#x5B50;&#x72B6;&#x6001;&#x5B58;&#x6863;&#xFF0C;&#x5141;&#x8BB8;&#x6062;&#x590D;&#x8FD0;&#x884C;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x9519;&#x8BEF;&#x7684;&#x7B97;&#x5B50;&#x3010;66&#x3011;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x77E5;&#x9053;&#x8BA1;&#x7B97;&#x662F;&#x5426;&#x662F;<strong>&#x786E;&#x5B9A;&#x6027;&#x7684;</strong>&#xFF1A;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x7ED9;&#x5B9A;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x7B97;&#x5B50;&#x662F;&#x5426;&#x59CB;&#x7EC8;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x51FA;&#xFF1F;&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x53D1;&#x9001;&#x7ED9;&#x4E0B;&#x6E38;&#x7B97;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5982;&#x679C;&#x7B97;&#x5B50;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#xFF0C;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x7684;&#x6570;&#x636E;&#x4E0E;&#x539F;&#x6709;&#x7684;&#x4E22;&#x5931;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x4E0B;&#x6E38;&#x7B97;&#x5B50;&#x5F88;&#x96BE;&#x89E3;&#x51B3;&#x65B0;&#x65E7;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x77DB;&#x76FE;&#x3002;&#x5BF9;&#x4E8E;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7B97;&#x5B50;&#x6765;&#x8BF4;&#xFF0C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x901A;&#x5E38;&#x662F;&#x6740;&#x6B7B;&#x4E0B;&#x6E38;&#x7B97;&#x5B50;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x91CD;&#x8DD1;&#x65B0;&#x6570;&#x636E;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x7EA7;&#x8054;&#x6545;&#x969C;&#xFF0C;&#x6700;&#x597D;&#x8BA9;&#x7B97;&#x5B50;&#x5177;&#x6709;&#x786E;&#x5B9A;&#x6027;&#x3002;&#x4F46;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x884C;&#x4E3A;&#x5F88;&#x5BB9;&#x6613;&#x6084;&#x6084;&#x6E9C;&#x8FDB;&#x6765;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x8BB8;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5728;&#x8FED;&#x4EE3;&#x54C8;&#x5E0C;&#x8868;&#x7684;&#x5143;&#x7D20;&#x65F6;&#x4E0D;&#x80FD;&#x5BF9;&#x987A;&#x5E8F;&#x4F5C;&#x51FA;&#x4FDD;&#x8BC1;&#xFF0C;&#x8BB8;&#x591A;&#x6982;&#x7387;&#x548C;&#x7EDF;&#x8BA1;&#x7B97;&#x6CD5;&#x663E;&#x5F0F;&#x4F9D;&#x8D56;&#x4E8E;&#x4F7F;&#x7528;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x4EE5;&#x53CA;&#x7528;&#x5230;&#x7CFB;&#x7EDF;&#x65F6;&#x949F;&#x6216;&#x5916;&#x90E8;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x90FD;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x53EF;&#x9760;&#x5730;&#x4ECE;&#x6545;&#x969C;&#x4E2D;&#x6062;&#x590D;&#xFF0C;&#x9700;&#x8981;&#x6D88;&#x9664;&#x8FD9;&#x79CD;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x56E0;&#x7D20;&#xFF0C;&#x4F8B;&#x5982;&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x7684;&#x79CD;&#x5B50;&#x751F;&#x6210;&#x4F2A;&#x968F;&#x673A;&#x6570;&#x3002;</p>
<p>&#x200B;    &#x901A;&#x8FC7;&#x91CD;&#x7B97;&#x6570;&#x636E;&#x6765;&#x4ECE;&#x6545;&#x969C;&#x4E2D;&#x6062;&#x590D;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x6B63;&#x786E;&#x7684;&#x7B54;&#x6848;&#xFF1A;&#x5982;&#x679C;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x6570;&#x636E;&#x8981;&#x6BD4;&#x6E90;&#x6570;&#x636E;&#x5C0F;&#x5F97;&#x591A;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x91CF;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x4E2D;&#x95F4;&#x6570;&#x636E;&#x7269;&#x5316;&#x4E3A;&#x6587;&#x4EF6;&#x53EF;&#x80FD;&#x8981;&#x6BD4;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x5EC9;&#x4EF7;&#x7684;&#x591A;&#x3002;</p>
<h4 id="&#x5173;&#x4E8E;&#x7269;&#x5316;&#x7684;&#x8BA8;&#x8BBA;">&#x5173;&#x4E8E;&#x7269;&#x5316;&#x7684;&#x8BA8;&#x8BBA;</h4>
<p>&#x200B;    &#x56DE;&#x5230;Unix&#x7684;&#x7C7B;&#x6BD4;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;MapReduce&#x5C31;&#x50CF;&#x662F;&#x5C06;&#x6BCF;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x8F93;&#x51FA;&#x5199;&#x5165;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x770B;&#x8D77;&#x6765;&#x66F4;&#x50CF;&#x662F;Unix&#x7BA1;&#x9053;&#x3002;&#x5C24;&#x5176;&#x662F;Flink&#x662F;&#x57FA;&#x4E8E;&#x7BA1;&#x9053;&#x6267;&#x884C;&#x7684;&#x601D;&#x60F3;&#x800C;&#x5EFA;&#x7ACB;&#x7684;&#xFF1A;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5C06;&#x7B97;&#x5B50;&#x7684;&#x8F93;&#x51FA;&#x589E;&#x91CF;&#x5730;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x4ED6;&#x7B97;&#x5B50;&#xFF0C;&#x4E0D;&#x5F85;&#x8F93;&#x5165;&#x5B8C;&#x6210;&#x4FBF;&#x5F00;&#x59CB;&#x5904;&#x7406;&#x3002;</p>
<p>&#x200B;    &#x6392;&#x5E8F;&#x7B97;&#x5B50;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x9700;&#x8981;&#x6D88;&#x8D39;&#x5168;&#x90E8;&#x7684;&#x8F93;&#x5165;&#x540E;&#x624D;&#x80FD;&#x751F;&#x6210;&#x4EFB;&#x4F55;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x4E3A;&#x8F93;&#x5165;&#x4E2D;&#x6700;&#x540E;&#x4E00;&#x6761;&#x8F93;&#x5165;&#x8BB0;&#x5F55;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x6700;&#x5C0F;&#x7684;&#x952E;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x8F93;&#x51FA;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4EFB;&#x4F55;&#x9700;&#x8981;&#x6392;&#x5E8F;&#x7684;&#x7B97;&#x5B50;&#x90FD;&#x9700;&#x8981;&#x81F3;&#x5C11;&#x6682;&#x65F6;&#x5730;&#x7D2F;&#x79EF;&#x72B6;&#x6001;&#x3002;&#x4F46;&#x662F;&#x5DE5;&#x4F5C;&#x6D41;&#x7684;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x4EE5;&#x6D41;&#x6C34;&#x7EBF;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x3002;</p>
<p>&#x200B;    &#x5F53;&#x4F5C;&#x4E1A;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x8F93;&#x51FA;&#x9700;&#x8981;&#x6301;&#x7EED;&#x5230;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x4EE5;&#x4FBF;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x2014;&#x2014; &#x5F88;&#x53EF;&#x80FD;&#x5B83;&#x4F1A;&#x518D;&#x6B21;&#x5199;&#x5165;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x65F6;&#xFF0C;HDFS&#x4E0A;&#x7684;&#x7269;&#x5316;&#x6570;&#x636E;&#x96C6;&#x901A;&#x5E38;&#x4ECD;&#x662F;&#x4F5C;&#x4E1A;&#x7684;&#x8F93;&#x5165;&#x548C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x3002;&#x548C;MapReduce&#x4E00;&#x6837;&#xFF0C;&#x8F93;&#x5165;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x8F93;&#x51FA;&#x88AB;&#x5B8C;&#x5168;&#x66FF;&#x6362;&#x3002;&#x6BD4;&#x8D77;MapReduce&#x7684;&#x6539;&#x8FDB;&#x662F;&#xFF0C;&#x4F60;&#x4E0D;&#x7528;&#x518D;&#x81EA;&#x5DF1;&#x53BB;&#x5C06;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E86;&#x3002;</p>
<h3 id="&#x56FE;&#x4E0E;&#x8FED;&#x4EE3;&#x5904;&#x7406;">&#x56FE;&#x4E0E;&#x8FED;&#x4EE3;&#x5904;&#x7406;</h3>
<p>&#x200B;    &#x5728;&#x201C;<a href="ch2.html#&#x56FE;&#x6570;&#x636E;&#x6A21;&#x578B;">&#x56FE;&#x6570;&#x636E;&#x6A21;&#x578B;</a>&#x201D;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x4F7F;&#x7528;&#x56FE;&#x6765;&#x5EFA;&#x6A21;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x56FE;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x6765;&#x904D;&#x5386;&#x56FE;&#x4E2D;&#x7684;&#x8FB9;&#x4E0E;&#x70B9;&#x3002;<a href="ch2.html">&#x7B2C;2&#x7AE0;</a>&#x7684;&#x8BA8;&#x8BBA;&#x96C6;&#x4E2D;&#x5728;OLTP&#x98CE;&#x683C;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x5FEB;&#x901F;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#x6765;&#x67E5;&#x627E;&#x5C11;&#x91CF;&#x7B26;&#x5408;&#x7279;&#x5B9A;&#x6761;&#x4EF6;&#x7684;&#x9876;&#x70B9;&#x3002;</p>
<p>&#x200B;    &#x6279;&#x5904;&#x7406;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x7684;&#x56FE;&#x4E5F;&#x5F88;&#x6709;&#x8DA3;&#xFF0C;&#x5176;&#x76EE;&#x6807;&#x662F;&#x5728;&#x6574;&#x4E2A;&#x56FE;&#x4E0A;&#x6267;&#x884C;&#x67D0;&#x79CD;&#x79BB;&#x7EBF;&#x5904;&#x7406;&#x6216;&#x5206;&#x6790;&#x3002;&#x8FD9;&#x79CD;&#x9700;&#x6C42;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#xFF08;&#x5982;&#x63A8;&#x8350;&#x5F15;&#x64CE;&#xFF09;&#x6216;&#x6392;&#x5E8F;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6700;&#x7740;&#x540D;&#x7684;&#x56FE;&#x5F62;&#x5206;&#x6790;&#x7B97;&#x6CD5;&#x4E4B;&#x4E00;&#x662F;PageRank &#x3010;69&#x3011;&#xFF0C;&#x5B83;&#x8BD5;&#x56FE;&#x6839;&#x636E;&#x94FE;&#x63A5;&#x5230;&#x67D0;&#x4E2A;&#x7F51;&#x9875;&#x7684;&#x5176;&#x4ED6;&#x7F51;&#x9875;&#x6765;&#x4F30;&#x8BA1;&#x8BE5;&#x7F51;&#x9875;&#x7684;&#x6D41;&#x884C;&#x5EA6;&#x3002;&#x5B83;&#x4F5C;&#x4E3A;&#x914D;&#x65B9;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x7F51;&#x7EDC;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5448;&#x73B0;&#x7ED3;&#x679C;&#x7684;&#x987A;&#x5E8F;</p>
<blockquote>
<p>&#x50CF;Spark&#xFF0C;Flink&#x548C;Tez&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x7684;&#x7269;&#x5316;">&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x7684;&#x7269;&#x5316;</a>&#x201D;&#xFF09;&#x901A;&#x5E38;&#x5C06;&#x7B97;&#x5B50;&#x4F5C;&#x4E3A;<strong>&#x6709;&#x5411;&#x65E0;&#x73AF;&#x56FE;&#xFF08;DAG&#xFF09;</strong>&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5B89;&#x6392;&#x5728;&#x4F5C;&#x4E1A;&#x4E2D;&#x3002;&#x8FD9;&#x4E0E;&#x56FE;&#x5904;&#x7406;&#x4E0D;&#x4E00;&#x6837;&#xFF1A;&#x5728;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x4E2D;&#xFF0C;<strong>&#x4ECE;&#x4E00;&#x4E2A;&#x7B97;&#x5B50;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7B97;&#x5B50;&#x7684;&#x6570;&#x636E;&#x6D41;</strong>&#x88AB;&#x6784;&#x9020;&#x6210;&#x4E00;&#x4E2A;&#x56FE;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x901A;&#x5E38;&#x7531;&#x5173;&#x7CFB;&#x578B;&#x5143;&#x7EC4;&#x6784;&#x6210;&#x3002;&#x5728;&#x56FE;&#x5904;&#x7406;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x672C;&#x8EAB;&#x5177;&#x6709;&#x56FE;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x53C8;&#x4E00;&#x4E2A;&#x4E0D;&#x5E78;&#x7684;&#x547D;&#x540D;&#x6DF7;&#x4E71;&#xFF01;</p>
</blockquote>
<p>&#x200B;    &#x8BB8;&#x591A;&#x56FE;&#x7B97;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x6B21;&#x904D;&#x5386;&#x4E00;&#x6761;&#x8FB9;&#x6765;&#x8868;&#x793A;&#x7684;&#xFF0C;&#x5C06;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x4E0E;&#x8FD1;&#x90BB;&#x7684;&#x9876;&#x70B9;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x4EE5;&#x4F20;&#x64AD;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#xFF0C;&#x76F4;&#x5230;&#x6EE1;&#x8DB3;&#x4E00;&#x4E9B;&#x6761;&#x4EF6;&#x4E3A;&#x6B62; &#x2014;&#x2014; &#x4F8B;&#x5982;&#xFF0C;&#x76F4;&#x5230;&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8FB9;&#x8981;&#x8DDF;&#x8FDB;&#xFF0C;&#x6216;&#x76F4;&#x5230;&#x4E00;&#x4E9B;&#x6307;&#x6807;&#x6536;&#x655B;&#x3002;&#x6211;&#x4EEC;&#x5728;<a href="img/fig2-6.png">&#x56FE;2-6</a>&#x4E2D;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x91CD;&#x590D;&#x8DDF;&#x8FDB;&#x6807;&#x660E;&#x5730;&#x70B9;&#x5F52;&#x5C5E;&#x5173;&#x7CFB;&#x7684;&#x8FB9;&#xFF0C;&#x751F;&#x6210;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5317;&#x7F8E;&#x5305;&#x542B;&#x7684;&#x6240;&#x6709;&#x5730;&#x70B9;&#x5217;&#x8868;&#xFF08;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x95ED;&#x5305;&#x4F20;&#x9012;&#xFF08;transitive closure&#xFF09;</strong>&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x53EF;&#x4EE5;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B58;&#x50A8;&#x56FE;&#xFF08;&#x5305;&#x542B;&#x9876;&#x70B9;&#x548C;&#x8FB9;&#x7684;&#x5217;&#x8868;&#x7684;&#x6587;&#x4EF6;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x201C;&#x91CD;&#x590D;&#x81F3;&#x5B8C;&#x6210;&#x201D;&#x7684;&#x60F3;&#x6CD5;&#x4E0D;&#x80FD;&#x7528;&#x666E;&#x901A;&#x7684;MapReduce&#x6765;&#x8868;&#x793A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x626B;&#x8FC7;&#x4E00;&#x8D9F;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x56E0;&#x6B64;&#x7ECF;&#x5E38;&#x4EE5;<strong>&#x8FED;&#x4EE3;</strong>&#x7684;&#x98CE;&#x683C;&#x5B9E;&#x73B0;&#xFF1A;</p>
<ol>
<li>&#x5916;&#x90E8;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x6279;&#x5904;&#x7406;&#x6765;&#x8BA1;&#x7B97;&#x7B97;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;</li>
<li>&#x5F53;&#x6279;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x65F6;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x68C0;&#x67E5;&#x5B83;&#x662F;&#x5426;&#x5B8C;&#x6210;&#xFF08;&#x57FA;&#x4E8E;&#x5B8C;&#x6210;&#x6761;&#x4EF6; &#x2014;&#x2014; &#x4F8B;&#x5982;&#xFF0C;&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x7684;&#x8FB9;&#x8981;&#x8DDF;&#x8FDB;&#xFF0C;&#x6216;&#x8005;&#x4E0E;&#x4E0A;&#x6B21;&#x8FED;&#x4EE3;&#x76F8;&#x6BD4;&#x7684;&#x53D8;&#x5316;&#x4F4E;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#xFF09;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5C1A;&#x672A;&#x5B8C;&#x6210;&#xFF0C;&#x5219;&#x8C03;&#x5EA6;&#x7A0B;&#x5E8F;&#x8FD4;&#x56DE;&#x5230;&#x6B65;&#x9AA4;1&#x5E76;&#x8FD0;&#x884C;&#x53E6;&#x4E00;&#x8F6E;&#x6279;&#x5904;&#x7406;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x7528;MapReduce&#x5B9E;&#x73B0;&#x5B83;&#x5F80;&#x5F80;&#x975E;&#x5E38;&#x4F4E;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;MapReduce&#x6CA1;&#x6709;&#x8003;&#x8651;&#x7B97;&#x6CD5;&#x7684;&#x8FED;&#x4EE3;&#x6027;&#x8D28;&#xFF1A;&#x5B83;&#x603B;&#x662F;&#x8BFB;&#x53D6;&#x6574;&#x4E2A;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x8F93;&#x51FA;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5373;&#x4F7F;&#x4E0E;&#x4E0A;&#x6B21;&#x8FED;&#x4EE3;&#x76F8;&#x6BD4;&#xFF0C;&#x6539;&#x53D8;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x56FE;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002;</p>
<h4 id="pregel&#x5904;&#x7406;&#x6A21;&#x578B;">Pregel&#x5904;&#x7406;&#x6A21;&#x578B;</h4>
<p>&#x200B;    &#x9488;&#x5BF9;&#x56FE;&#x6279;&#x5904;&#x7406;&#x7684;&#x4F18;&#x5316; &#x2014;&#x2014; <strong>&#x6279;&#x91CF;&#x540C;&#x6B65;&#x5E76;&#x884C;&#xFF08;BSP&#xFF09;</strong>&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x3010;70&#x3011;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x6D41;&#x884C;&#x8D77;&#x6765;&#x3002;&#x5176;&#x4E2D;&#xFF0C;Apache Giraph &#x3010;37&#x3011;&#xFF0C;Spark&#x7684;GraphX API&#x548C;Flink&#x7684;Gelly API &#x3010;71&#x3011;&#x5B9E;&#x73B0;&#x4E86;&#x5B83;&#x3002;&#x5B83;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>Pregel</strong>&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;Google&#x7684;Pregel&#x8BBA;&#x6587;&#x63A8;&#x5E7F;&#x4E86;&#x8FD9;&#x79CD;&#x5904;&#x7406;&#x56FE;&#x7684;&#x65B9;&#x6CD5;&#x3010;72&#x3011;&#x3002;</p>
<p>&#x200B;    &#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x5728;MapReduce&#x4E2D;&#xFF0C;Mapper&#x5728;&#x6982;&#x5FF5;&#x4E0A;&#x5411;Reducer&#x7684;&#x7279;&#x5B9A;&#x8C03;&#x7528;&#x201C;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x6846;&#x67B6;&#x5C06;&#x6240;&#x6709;&#x5177;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;Mapper&#x8F93;&#x51FA;&#x96C6;&#x4E2D;&#x5728;&#x4E00;&#x8D77;&#x3002; Pregel&#x80CC;&#x540E;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x7684;&#x60F3;&#x6CD5;&#xFF1A;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x53EF;&#x4EE5;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x201C;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x201D;&#xFF0C;&#x901A;&#x5E38;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x662F;&#x6CBF;&#x7740;&#x56FE;&#x7684;&#x8FB9;&#x53D1;&#x9001;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x4E3A;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x53D1;&#x9001;&#x7ED9;&#x5B83;&#x7684;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7ED9;&#x5B83; &#x2014;&#x2014; &#x5C31;&#x50CF;&#x8C03;&#x7528;Reducer&#x4E00;&#x6837;&#x3002;&#x4E0E;MapReduce&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5728;Pregel&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x9876;&#x70B9;&#x5728;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x5230;&#x4E0B;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x8BB0;&#x4F4F;&#x5B83;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x53EA;&#x9700;&#x8981;&#x5904;&#x7406;&#x65B0;&#x7684;&#x4F20;&#x5165;&#x6D88;&#x606F;&#x3002;&#x5982;&#x679C;&#x56FE;&#x7684;&#x67D0;&#x4E2A;&#x90E8;&#x5206;&#x6CA1;&#x6709;&#x88AB;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x90A3;&#x91CC;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x4EFB;&#x4F55;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E0E;Actor&#x6A21;&#x578B;&#x6709;&#x4E9B;&#x76F8;&#x4F3C;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch4.html#&#x5206;&#x5E03;&#x5F0F;&#x7684;Actor&#x6846;&#x67B6;">&#x5206;&#x5E03;&#x5F0F;&#x7684;Actor&#x6846;&#x67B6;</a>&#x201D;&#xFF09;&#xFF0C;&#x9664;&#x4E86;&#x9876;&#x70B9;&#x72B6;&#x6001;&#x548C;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6D88;&#x606F;&#x5177;&#x6709;&#x5BB9;&#x9519;&#x6027;&#x548C;&#x8010;&#x4E45;&#x6027;&#xFF0C;&#x4E14;&#x901A;&#x4FE1;&#x4EE5;&#x56FA;&#x5B9A;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#xFF1A;&#x5728;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x6846;&#x67B6;&#x9012;&#x9001;&#x4E0A;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#x53D1;&#x9001;&#x7684;&#x6240;&#x6709;&#x6D88;&#x606F;&#x3002;Actor&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;&#x3002;</p>
<h4 id="&#x5BB9;&#x9519;">&#x5BB9;&#x9519;</h4>
<p>&#x200B;    &#x9876;&#x70B9;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x76F8;&#x4E92;&#x67E5;&#x8BE2;&#xFF09;&#x7684;&#x4E8B;&#x5B9E;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;Pregel&#x4F5C;&#x4E1A;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x6D88;&#x606F;&#x53EF;&#x4EE5;&#x6210;&#x6279;&#x5904;&#x7406;&#xFF0C;&#x4E14;&#x7B49;&#x5F85;&#x901A;&#x4FE1;&#x7684;&#x6B21;&#x6570;&#x4E5F;&#x51CF;&#x5C11;&#x4E86;&#x3002;&#x552F;&#x4E00;&#x7684;&#x7B49;&#x5F85;&#x662F;&#x5728;&#x8FED;&#x4EE3;&#x4E4B;&#x95F4;&#xFF1A;&#x7531;&#x4E8E;Pregel&#x6A21;&#x578B;&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x5728;&#x4E00;&#x8F6E;&#x8FED;&#x4EE3;&#x4E2D;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x90FD;&#x5728;&#x4E0B;&#x8F6E;&#x8FED;&#x4EE3;&#x4E2D;&#x9001;&#x8FBE;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4E0B;&#x4E00;&#x8F6E;&#x8FED;&#x4EE3;&#x5F00;&#x59CB;&#x524D;&#xFF0C;&#x5148;&#x524D;&#x7684;&#x8FED;&#x4EE3;&#x5FC5;&#x987B;&#x5B8C;&#x5168;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x6240;&#x6709;&#x7684;&#x6D88;&#x606F;&#x5FC5;&#x987B;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x5B8C;&#x6210;&#x590D;&#x5236;&#x3002;</p>
<p>&#x200B;    &#x5373;&#x4F7F;&#x5E95;&#x5C42;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#xFF0C;&#x91CD;&#x590D;&#x6216;&#x4EFB;&#x610F;&#x5EF6;&#x8FDF;&#x6D88;&#x606F;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch8.html#&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7F51;&#x7EDC;">&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7F51;&#x7EDC;</a>&#x201D;&#xFF09;&#xFF0C;Pregel&#x7684;&#x5B9E;&#x73B0;&#x80FD;&#x4FDD;&#x8BC1;&#x5728;&#x540E;&#x7EED;&#x8FED;&#x4EE3;&#x4E2D;&#x6D88;&#x606F;&#x5728;&#x5176;&#x76EE;&#x6807;&#x9876;&#x70B9;&#x6070;&#x597D;&#x5904;&#x7406;&#x4E00;&#x6B21;&#x3002;&#x50CF;MapReduce&#x4E00;&#x6837;&#xFF0C;&#x6846;&#x67B6;&#x80FD;&#x4ECE;&#x6545;&#x969C;&#x4E2D;&#x900F;&#x660E;&#x5730;&#x6062;&#x590D;&#xFF0C;&#x4EE5;&#x7B80;&#x5316;&#x5728;Pregel&#x4E0A;&#x5B9E;&#x73B0;&#x7B97;&#x6CD5;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x5BB9;&#x9519;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x8FED;&#x4EE3;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x5B9A;&#x671F;&#x5B58;&#x6863;&#x6240;&#x6709;&#x9876;&#x70B9;&#x7684;&#x72B6;&#x6001;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5373;&#x5C06;&#x5176;&#x5168;&#x90E8;&#x72B6;&#x6001;&#x5199;&#x5165;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x6545;&#x969C;&#x5E76;&#x4E14;&#x5176;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x72B6;&#x6001;&#x4E22;&#x5931;&#xFF0C;&#x5219;&#x6700;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x6574;&#x4E2A;&#x56FE;&#x8BA1;&#x7B97;&#x56DE;&#x6EDA;&#x5230;&#x4E0A;&#x4E00;&#x4E2A;&#x5B58;&#x6863;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x542F;&#x8BA1;&#x7B97;&#x3002;&#x5982;&#x679C;&#x7B97;&#x6CD5;&#x662F;&#x786E;&#x5B9A;&#x6027;&#x7684;&#xFF0C;&#x4E14;&#x6D88;&#x606F;&#x8BB0;&#x5F55;&#x5728;&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6027;&#x5730;&#x53EA;&#x6062;&#x590D;&#x4E22;&#x5931;&#x7684;&#x5206;&#x533A;&#xFF08;&#x5C31;&#x50CF;&#x4E4B;&#x524D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#xFF09;&#x3010;72&#x3011;&#x3002;</p>
<h4 id="&#x5E76;&#x884C;&#x6267;&#x884C;">&#x5E76;&#x884C;&#x6267;&#x884C;</h4>
<p>&#x200B;    &#x9876;&#x70B9;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B83;&#x5728;&#x54EA;&#x53F0;&#x7269;&#x7406;&#x673A;&#x5668;&#x4E0A;&#x6267;&#x884C;&#xFF1B;&#x5F53;&#x5B83;&#x5411;&#x5176;&#x4ED6;&#x9876;&#x70B9;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x5F80;&#x67D0;&#x4E2A;&#x9876;&#x70B9;ID&#x3002;&#x56FE;&#x7684;&#x5206;&#x533A;&#x53D6;&#x51B3;&#x4E8E;&#x6846;&#x67B6; &#x2014;&#x2014; &#x5373;&#xFF0C;&#x786E;&#x5B9A;&#x54EA;&#x4E2A;&#x9876;&#x70B9;&#x8FD0;&#x884C;&#x5728;&#x54EA;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8DEF;&#x7531;&#x6D88;&#x606F;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x4EEC;&#x5230;&#x8FBE;&#x6B63;&#x786E;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x200B;    &#x7531;&#x4E8E;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x4E00;&#x6B21;&#x4EC5;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#xFF08;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x201C;&#x50CF;&#x9876;&#x70B9;&#x4E00;&#x6837;&#x601D;&#x8003;&#x201D;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x4EE5;&#x4EFB;&#x610F;&#x65B9;&#x5F0F;&#x5BF9;&#x56FE;&#x5206;&#x533A;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#x5982;&#x679C;&#x9876;&#x70B9;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x6700;&#x597D;&#x80FD;&#x88AB;&#x5206;&#x533A;&#x5230;&#x540C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x3002;&#x7136;&#x800C;&#x627E;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x4F18;&#x5316;&#x7684;&#x5206;&#x533A;&#x65B9;&#x6CD5;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#x7684; &#x2014;&#x2014; &#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x56FE;&#x7ECF;&#x5E38;&#x6309;&#x7167;&#x4EFB;&#x610F;&#x5206;&#x914D;&#x7684;&#x9876;&#x70B9;ID&#x5206;&#x533A;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5C1D;&#x8BD5;&#x5C06;&#x76F8;&#x5173;&#x7684;&#x9876;&#x70B9;&#x5206;&#x7EC4;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;&#x56FE;&#x7B97;&#x6CD5;&#x901A;&#x5E38;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x8DE8;&#x673A;&#x5668;&#x901A;&#x4FE1;&#x7684;&#x989D;&#x5916;&#x5F00;&#x9500;&#xFF0C;&#x800C;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#xFF08;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#xFF09;&#x5F80;&#x5F80;&#x6BD4;&#x539F;&#x59CB;&#x56FE;&#x5927;&#x3002;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x7684;&#x5F00;&#x9500;&#x4F1A;&#x663E;&#x8457;&#x62D6;&#x6162;&#x5206;&#x5E03;&#x5F0F;&#x56FE;&#x7B97;&#x6CD5;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x200B;    &#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x56FE;&#x53EF;&#x4EE5;&#x653E;&#x5165;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5355;&#x673A;&#xFF08;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x662F;&#x5355;&#x7EBF;&#x7A0B;&#xFF09;&#x7B97;&#x6CD5;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x8D85;&#x8D8A;&#x5206;&#x5E03;&#x5F0F;&#x6279;&#x5904;&#x7406;&#x3010;73,74&#x3011;&#x3002;&#x56FE;&#x6BD4;&#x5185;&#x5B58;&#x5927;&#x4E5F;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x653E;&#x5165;&#x5355;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x78C1;&#x76D8;&#xFF0C;&#x4F7F;&#x7528;GraphChi&#x7B49;&#x6846;&#x67B6;&#x8FDB;&#x884C;&#x5355;&#x673A;&#x5904;&#x7406;&#x662F;&#x5C31;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x7684;&#x9009;&#x62E9;&#x3010;75&#x3011;&#x3002;&#x5982;&#x679C;&#x56FE;&#x592A;&#x5927;&#xFF0C;&#x4E0D;&#x9002;&#x5408;&#x5355;&#x673A;&#x5904;&#x7406;&#xFF0C;&#x90A3;&#x4E48;&#x50CF;Pregel&#x8FD9;&#x6837;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x3002;&#x9AD8;&#x6548;&#x7684;&#x5E76;&#x884C;&#x56FE;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x884C;&#x4E2D;&#x7684;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x3010;76&#x3011;&#x3002;</p>
<h3 id="&#x9AD8;&#x7EA7;api&#x548C;&#x8BED;&#x8A00;">&#x9AD8;&#x7EA7;API&#x548C;&#x8BED;&#x8A00;</h3>
<p>&#x200B;    &#x81EA;MapReduce&#x5F00;&#x59CB;&#x6D41;&#x884C;&#x7684;&#x8FD9;&#x51E0;&#x5E74;&#x4EE5;&#x6765;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x6279;&#x5904;&#x7406;&#x7684;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x5DF2;&#x7ECF;&#x5F88;&#x6210;&#x719F;&#x4E86;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x5F3A;&#x5927;&#xFF0C;&#x80FD;&#x591F;&#x5B58;&#x50A8;&#x548C;&#x5904;&#x7406;&#x8D85;&#x8FC7;10,000&#x53F0;&#x673A;&#x5668;&#x7FA4;&#x96C6;&#x4E0A;&#x7684;&#x6570;PB&#x7684;&#x6570;&#x636E;&#x3002;&#x7531;&#x4E8E;&#x5728;&#x8FD9;&#x79CD;&#x89C4;&#x6A21;&#x4E0B;&#x7269;&#x7406;&#x6267;&#x884C;&#x6279;&#x5904;&#x7406;&#x7684;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x88AB;&#x8BA4;&#x4E3A;&#x6216;&#x591A;&#x6216;&#x5C11;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5173;&#x6CE8;&#x70B9;&#x5DF2;&#x7ECF;&#x8F6C;&#x5411;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#xFF1A;&#x6539;&#x8FDB;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x63D0;&#x9AD8;&#x5904;&#x7406;&#x6548;&#x7387;&#xFF0C;&#x6269;&#x5927;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x96C6;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;Hive&#xFF0C;Pig&#xFF0C;Cascading&#x548C;Crunch&#x7B49;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x548C;API&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x6D41;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x624B;&#x5199;MapReduce&#x4F5C;&#x4E1A;&#x5B9E;&#x5728;&#x662F;&#x4E2A;&#x82E6;&#x529B;&#x6D3B;&#x3002;&#x968F;&#x7740;Tez&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x8FD9;&#x4E9B;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x597D;&#x5904;&#xFF0C;&#x53EF;&#x4EE5;&#x8FC1;&#x79FB;&#x5230;&#x65B0;&#x7684;&#x6570;&#x636E;&#x6D41;&#x6267;&#x884C;&#x5F15;&#x64CE;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x91CD;&#x5199;&#x4F5C;&#x4E1A;&#x4EE3;&#x7801;&#x3002; Spark&#x548C;Flink&#x4E5F;&#x6709;&#x5B83;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x9AD8;&#x7EA7;&#x6570;&#x636E;&#x6D41;API&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x4ECE;FlumeJava&#x4E2D;&#x83B7;&#x53D6;&#x7684;&#x7075;&#x611F;&#x3010;34&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6D41;API&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x5173;&#x7CFB;&#x578B;&#x6784;&#x5EFA;&#x5757;&#x6765;&#x8868;&#x8FBE;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#xFF1A;&#x6309;&#x67D0;&#x4E2A;&#x5B57;&#x6BB5;&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x96C6;&#xFF1B;&#x6309;&#x952E;&#x5BF9;&#x5143;&#x7EC4;&#x505A;&#x5206;&#x7EC4;&#xFF1B;&#x6309;&#x67D0;&#x4E9B;&#x6761;&#x4EF6;&#x8FC7;&#x6EE4;&#xFF1B;&#x5E76;&#x901A;&#x8FC7;&#x8BA1;&#x6570;&#x6C42;&#x548C;&#x6216;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#x6765;&#x805A;&#x5408;&#x5143;&#x7EC4;&#x3002;&#x5728;&#x5185;&#x90E8;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x4F7F;&#x7528;&#x672C;&#x7AE0;&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x5404;&#x79CD;&#x8FDE;&#x63A5;&#x548C;&#x5206;&#x7EC4;&#x7B97;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x9664;&#x4E86;&#x5C11;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x660E;&#x663E;&#x4F18;&#x52BF;&#x4E4B;&#x5916;&#xFF0C;&#x8FD9;&#x4E9B;&#x9AD8;&#x7EA7;&#x63A5;&#x53E3;&#x8FD8;&#x652F;&#x6301;&#x4EA4;&#x4E92;&#x5F0F;&#x7528;&#x6CD5;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x4EA4;&#x4E92;&#x5F0F;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;Shell&#x4E2D;&#x589E;&#x91CF;&#x5F0F;&#x7F16;&#x5199;&#x5206;&#x6790;&#x4EE3;&#x7801;&#xFF0C;&#x9891;&#x7E41;&#x8FD0;&#x884C;&#x6765;&#x89C2;&#x5BDF;&#x5B83;&#x505A;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x79CD;&#x5F00;&#x53D1;&#x98CE;&#x683C;&#x5728;&#x63A2;&#x7D22;&#x6570;&#x636E;&#x96C6;&#x548C;&#x8BD5;&#x9A8C;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x65F6;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x8FD9;&#x4E5F;&#x8BA9;&#x4EBA;&#x8054;&#x60F3;&#x5230;Unix&#x54F2;&#x5B66;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x201C;<a href="#Unix&#x54F2;&#x5B66;">Unix&#x54F2;&#x5B66;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x200B;    &#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E9B;&#x9AD8;&#x7EA7;&#x63A5;&#x53E3;&#x4E0D;&#x4EC5;&#x63D0;&#x9AD8;&#x4E86;&#x4EBA;&#x7C7B;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86;&#x673A;&#x5668;&#x5C42;&#x9762;&#x7684;&#x4F5C;&#x4E1A;&#x6267;&#x884C;&#x6548;&#x7387;&#x3002;</p>
<h4 id="&#x5411;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x7684;&#x8F6C;&#x53D8;">&#x5411;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x7684;&#x8F6C;&#x53D8;</h4>
<p>&#x200B;    &#x4E0E;&#x786C;&#x5199;&#x6267;&#x884C;&#x8FDE;&#x63A5;&#x7684;&#x4EE3;&#x7801;&#x76F8;&#x6BD4;&#xFF0C;&#x6307;&#x5B9A;&#x8FDE;&#x63A5;&#x5173;&#x7CFB;&#x7B97;&#x5B50;&#x7684;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x5206;&#x6790;&#x8FDE;&#x63A5;&#x8F93;&#x5165;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5E76;&#x81EA;&#x52A8;&#x51B3;&#x5B9A;&#x54EA;&#x79CD;&#x4E0A;&#x8FF0;&#x8FDE;&#x63A5;&#x7B97;&#x6CD5;&#x6700;&#x9002;&#x5408;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x3002; Hive&#xFF0C;Spark&#x548C;Flink&#x90FD;&#x6709;&#x57FA;&#x4E8E;&#x4EE3;&#x4EF7;&#x7684;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x8FDE;&#x63A5;&#x987A;&#x5E8F;&#xFF0C;&#x6700;&#x5C0F;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x7684;&#x6570;&#x91CF;&#x3010;66,77,78,79&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8FDE;&#x63A5;&#x7B97;&#x6CD5;&#x7684;&#x9009;&#x62E9;&#x53EF;&#x4EE5;&#x5BF9;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x7684;&#x6027;&#x80FD;&#x4EA7;&#x751F;&#x5DE8;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7406;&#x89E3;&#x548C;&#x8BB0;&#x4F4F;&#x672C;&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x5404;&#x79CD;&#x8FDE;&#x63A5;&#x7B97;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x8FDE;&#x63A5;&#x662F;&#x4EE5;<strong>&#x58F0;&#x660E;&#x5F0F;&#xFF08;declarative&#xFF09;</strong>&#x7684;&#x65B9;&#x5F0F;&#x6307;&#x5B9A;&#x7684;&#xFF0C;&#x90A3;&#x8FD9;&#x5C31;&#x8FD9;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF1A;&#x5E94;&#x7528;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#x660E;&#x54EA;&#x4E9B;&#x8FDE;&#x63A5;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x51B3;&#x5B9A;&#x5982;&#x4F55;&#x6700;&#x597D;&#x5730;&#x6267;&#x884C;&#x8FDE;&#x63A5;&#x3002;&#x6211;&#x4EEC;&#x4EE5;&#x524D;&#x5728;&#x201C;<a href="ch2.html#&#x6570;&#x636E;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;">&#x6570;&#x636E;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;</a>&#x201D;&#x4E2D;&#x89C1;&#x8FC7;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x3002;</p>
<p>&#x200B;    &#x4F46;MapReduce&#x53CA;&#x5176;&#x540E;&#x7EE7;&#x8005;&#x6570;&#x636E;&#x6D41;&#x5728;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#xFF0C;&#x4E0E;SQL&#x7684;&#x5B8C;&#x5168;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x6A21;&#x578B;&#x6709;&#x5F88;&#x5927;&#x533A;&#x522B;&#x3002; MapReduce&#x662F;&#x56F4;&#x7ED5;&#x7740;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x7684;&#x6982;&#x5FF5;&#x5EFA;&#x7ACB;&#x7684;&#xFF1A;&#x5BF9;&#x4E8E;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x6216;&#x8005;&#x4E00;&#x7EC4;&#x8BB0;&#x5F55;&#xFF0C;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#xFF08;Mapper&#x6216;Reducer&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x8C03;&#x7528;&#x4EFB;&#x610F;&#x4EE3;&#x7801;&#x6765;&#x51B3;&#x5B9A;&#x8F93;&#x51FA;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4F18;&#x70B9;&#x662F;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x5927;&#x91CF;&#x5DF2;&#x6709;&#x5E93;&#x7684;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x521B;&#x4F5C;&#xFF1A;&#x89E3;&#x6790;&#xFF0C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x5206;&#x6790;&#xFF0C;&#x56FE;&#x50CF;&#x5206;&#x6790;&#x4EE5;&#x53CA;&#x8FD0;&#x884C;&#x6570;&#x503C;&#x7B97;&#x6CD5;&#x6216;&#x7EDF;&#x8BA1;&#x7B97;&#x6CD5;&#x7B49;&#x3002;</p>
<p>&#x200B;    &#x81EA;&#x7531;&#x8FD0;&#x884C;&#x4EFB;&#x610F;&#x4EE3;&#x7801;&#xFF0C;&#x957F;&#x671F;&#x4EE5;&#x6765;&#x90FD;&#x662F;&#x4F20;&#x7EDF;MapReduce&#x6279;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x4E0E;MPP&#x6570;&#x636E;&#x5E93;&#x7684;&#x533A;&#x522B;&#x6240;&#x5728;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x6BD4;&#x8F83;Hadoop&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;">&#x6BD4;&#x8F83;Hadoop&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;</a>&#x201D;&#x4E00;&#x8282;&#xFF09;&#x3002;&#x867D;&#x7136;&#x6570;&#x636E;&#x5E93;&#x5177;&#x6709;&#x7F16;&#x5199;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x51FD;&#x6570;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x800C;&#x4E14;&#x4E0E;&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x5305;&#x7BA1;&#x7406;&#x5668;&#x548C;&#x4F9D;&#x8D56;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x517C;&#x5BB9;&#x4E0D;&#x4F73;&#xFF08;&#x4F8B;&#x5982;Java&#x7684;Maven&#xFF0C; Javascript&#x7684;npm&#xFF0C;&#x4EE5;&#x53CA;Ruby&#x7684;gems&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x7136;&#x800C;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#xFF0C;&#x652F;&#x6301;&#x9664;&#x8FDE;&#x63A5;&#x4E4B;&#x5916;&#x7684;&#x66F4;&#x591A;<strong>&#x58F0;&#x660E;&#x5F0F;&#x7279;&#x6027;</strong>&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x8FC7;&#x6EE4;&#x6761;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x53EA;&#x662F;&#x4ECE;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x4E2D;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E9B;&#x5B57;&#x6BB5;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x4E3A;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x4F1A;&#x6709;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x989D;&#x5916;CPU&#x5F00;&#x9500;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x58F0;&#x660E;&#x65B9;&#x5F0F;&#x8868;&#x793A;&#x8FD9;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x8FC7;&#x6EE4;&#x548C;&#x6620;&#x5C04;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x9762;&#x5411;&#x5217;&#x7684;&#x5B58;&#x50A8;&#x5E03;&#x5C40;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x5217;&#x5B58;&#x50A8;">&#x5217;&#x5B58;&#x50A8;</a>&#x201D;&#xFF09;&#xFF0C;&#x53EA;&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x53D6;&#x6240;&#x9700;&#x7684;&#x5217;&#x3002; Hive&#xFF0C;Spark DataFrames&#x548C;Impala&#x8FD8;&#x4F7F;&#x7528;&#x4E86;&#x5411;&#x91CF;&#x5316;&#x6267;&#x884C;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x5185;&#x5B58;&#x5E26;&#x5BBD;&#x548C;&#x5411;&#x91CF;&#x5904;&#x7406;">&#x5185;&#x5B58;&#x5E26;&#x5BBD;&#x548C;&#x5411;&#x91CF;&#x5904;&#x7406;</a>&#x201D;&#xFF09;&#xFF1A;&#x5728;&#x5BF9;CPU&#x7F13;&#x5B58;&#x53CB;&#x597D;&#x7684;&#x5185;&#x90E8;&#x5FAA;&#x73AF;&#x4E2D;&#x8FED;&#x4EE3;&#x6570;&#x636E;&#xFF0C;&#x907F;&#x514D;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;Spark&#x751F;&#x6210;JVM&#x5B57;&#x8282;&#x7801;&#x3010;79&#x3011;&#xFF0C;Impala&#x4F7F;&#x7528;LLVM&#x4E3A;&#x8FD9;&#x4E9B;&#x5185;&#x90E8;&#x5FAA;&#x73AF;&#x751F;&#x6210;&#x672C;&#x673A;&#x4EE3;&#x7801;&#x3010;41&#x3011;&#x3002;</p>
<p>&#x200B;    &#x901A;&#x8FC7;&#x5728;&#x9AD8;&#x7EA7;API&#x4E2D;&#x5F15;&#x5165;&#x58F0;&#x660E;&#x5F0F;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4F7F;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#x6267;&#x884C;&#x671F;&#x95F4;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x6765;&#x505A;&#x4F18;&#x5316;&#xFF0C;&#x6279;&#x5904;&#x7406;&#x6846;&#x67B6;&#x770B;&#x8D77;&#x6765;&#x8D8A;&#x6765;&#x8D8A;&#x50CF;MPP&#x6570;&#x636E;&#x5E93;&#x4E86;&#xFF08;&#x5E76;&#x4E14;&#x80FD;&#x5B9E;&#x73B0;&#x53EF;&#x4E0E;&#x4E4B;&#x5AB2;&#x7F8E;&#x7684;&#x6027;&#x80FD;&#xFF09;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x62E5;&#x6709;&#x8FD0;&#x884C;&#x4EFB;&#x610F;&#x4EE3;&#x7801;&#x548C;&#x4EE5;&#x4EFB;&#x610F;&#x683C;&#x5F0F;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#xFF0C;&#x5B83;&#x4EEC;&#x4FDD;&#x6301;&#x4E86;&#x7075;&#x6D3B;&#x6027;&#x7684;&#x4F18;&#x52BF;&#x3002;</p>
<h4 id="&#x4E13;&#x4E1A;&#x5316;&#x7684;&#x4E0D;&#x540C;&#x9886;&#x57DF;">&#x4E13;&#x4E1A;&#x5316;&#x7684;&#x4E0D;&#x540C;&#x9886;&#x57DF;</h4>
<p>&#x200B;    &#x5C3D;&#x7BA1;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#x4EFB;&#x610F;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x5E38;&#x89C1;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x7740;&#x6807;&#x51C6;&#x7684;&#x5904;&#x7406;&#x6A21;&#x5F0F;&#x3002;&#x56E0;&#x800C;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x503C;&#x5F97;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x53EF;&#x91CD;&#x7528;&#x901A;&#x7528;&#x6784;&#x5EFA;&#x6A21;&#x5757;&#x5B9E;&#x73B0;&#xFF0C;&#x4F20;&#x7EDF;&#x4E0A;&#xFF0C;MPP&#x6570;&#x636E;&#x5E93;&#x6EE1;&#x8DB3;&#x4E86;&#x5546;&#x4E1A;&#x667A;&#x80FD;&#x5206;&#x6790;&#x548C;&#x4E1A;&#x52A1;&#x62A5;&#x8868;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x8FD9;&#x53EA;&#x662F;&#x8BB8;&#x591A;&#x4F7F;&#x7528;&#x6279;&#x5904;&#x7406;&#x7684;&#x9886;&#x57DF;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x4E00;&#x4E2A;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#x7684;&#x9886;&#x57DF;&#x662F;&#x7EDF;&#x8BA1;&#x548C;&#x6570;&#x503C;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x5E94;&#x7528;&#x6240;&#x9700;&#x8981;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#x5206;&#x7C7B;&#x5668;&#x548C;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#xFF09;&#x3002;&#x53EF;&#x91CD;&#x7528;&#x7684;&#x5B9E;&#x73B0;&#x6B63;&#x5728;&#x51FA;&#x73B0;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;Mahout&#x5728;MapReduce&#xFF0C;Spark&#x548C;Flink&#x4E4B;&#x4E0A;&#x5B9E;&#x73B0;&#x4E86;&#x7528;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x5404;&#x79CD;&#x7B97;&#x6CD5;&#xFF0C;&#x800C;MADlib&#x5728;&#x5173;&#x7CFB;&#x578B;MPP&#x6570;&#x636E;&#x5E93;&#xFF08;Apache HAWQ&#xFF09;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x3010;54&#x3011;&#x3002;</p>
<p>&#x200B;    &#x7A7A;&#x95F4;&#x7B97;&#x6CD5;&#x4E5F;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F8B;&#x5982;<strong>&#x6700;&#x8FD1;&#x90BB;&#x641C;&#x7D22;&#xFF08;k-nearest neghbors, kNN&#xFF09;</strong>&#x3010;80&#x3011;&#xFF0C;&#x5B83;&#x5728;&#x4E00;&#x4E9B;&#x591A;&#x7EF4;&#x7A7A;&#x95F4;&#x4E2D;&#x641C;&#x7D22;&#x4E0E;&#x7ED9;&#x5B9A;&#x9879;&#x6700;&#x8FD1;&#x7684;&#x9879;&#x76EE; &#x2014;&#x2014; &#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x76F8;&#x4F3C;&#x6027;&#x641C;&#x7D22;&#x3002;&#x8FD1;&#x4F3C;&#x641C;&#x7D22;&#x5BF9;&#x4E8E;&#x57FA;&#x56E0;&#x7EC4;&#x5206;&#x6790;&#x7B97;&#x6CD5;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x627E;&#x5230;&#x76F8;&#x4F3C;&#x4F46;&#x4E0D;&#x76F8;&#x540C;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3010;81&#x3011;&#x3002;</p>
<p>&#x200B;    &#x6279;&#x5904;&#x7406;&#x5F15;&#x64CE;&#x6B63;&#x88AB;&#x7528;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x6267;&#x884C;&#x65E5;&#x76CA;&#x5E7F;&#x6CDB;&#x7684;&#x5404;&#x9886;&#x57DF;&#x7B97;&#x6CD5;&#x3002;&#x968F;&#x7740;&#x6279;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x83B7;&#x5F97;&#x5404;&#x79CD;&#x5185;&#x7F6E;&#x529F;&#x80FD;&#x4EE5;&#x53CA;&#x9AD8;&#x7EA7;&#x58F0;&#x660E;&#x5F0F;&#x7B97;&#x5B50;&#xFF0C;&#x4E14;&#x968F;&#x7740;MPP&#x6570;&#x636E;&#x5E93;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x548C;&#x6613;&#x4E8E;&#x7F16;&#x7A0B;&#xFF0C;&#x4E24;&#x8005;&#x5F00;&#x59CB;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x4F3C;&#x4E86;&#xFF1A;&#x6700;&#x7EC8;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x53EA;&#x662F;&#x5B58;&#x50A8;&#x548C;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x200B;    &#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x63A2;&#x7D22;&#x4E86;&#x6279;&#x5904;&#x7406;&#x7684;&#x4E3B;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x770B;&#x5230;&#x4E86;&#x8BF8;&#x5982;awk&#xFF0C;grep&#x548C;sort&#x4E4B;&#x7C7B;&#x7684;Unix&#x5DE5;&#x5177;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x8BBE;&#x8BA1;&#x7406;&#x5FF5;&#x662F;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x5230;MapReduce&#x548C;&#x66F4;&#x8FD1;&#x7684;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x4E2D;&#x7684;&#x3002;&#x4E00;&#x4E9B;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x5305;&#x62EC;&#xFF1A;&#x8F93;&#x5165;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x8F93;&#x51FA;&#x662F;&#x4E3A;&#x4E86;&#x4F5C;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#xFF08;&#x4ECD;&#x672A;&#x77E5;&#x7684;&#xFF09;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x800C;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x662F;&#x901A;&#x8FC7;&#x7F16;&#x5199;&#x201C;&#x505A;&#x597D;&#x4E00;&#x4EF6;&#x4E8B;&#x201D;&#x7684;&#x5C0F;&#x5DE5;&#x5177;&#x6765;&#x89E3;&#x51B3;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5728;Unix&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x4E0E;&#x7A0B;&#x5E8F;&#x7EC4;&#x5408;&#x7684;&#x7EDF;&#x4E00;&#x63A5;&#x53E3;&#x662F;&#x6587;&#x4EF6;&#x4E0E;&#x7BA1;&#x9053;&#xFF1B;&#x5728;MapReduce&#x4E2D;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x662F;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x6DFB;&#x52A0;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x7BA1;&#x9053;&#x5F0F;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5C06;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x7269;&#x5316;&#x81F3;&#x5206;&#x5E03;&#x5F0F;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x4F5C;&#x4E1A;&#x7684;&#x521D;&#x59CB;&#x8F93;&#x5165;&#x548C;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x901A;&#x5E38;&#x4ECD;&#x662F;HDFS&#x3002;</p>
<p>&#x200B;    &#x5206;&#x5E03;&#x5F0F;&#x6279;&#x5904;&#x7406;&#x6846;&#x67B6;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x662F;&#xFF1A;</p>
<p><strong><em>&#x5206;&#x533A;</em></strong></p>
<p>&#x200B;    &#x5728;MapReduce&#x4E2D;&#xFF0C;Mapper&#x6839;&#x636E;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x5757;&#x8FDB;&#x884C;&#x5206;&#x533A;&#x3002;Mapper&#x7684;&#x8F93;&#x51FA;&#x88AB;&#x91CD;&#x65B0;&#x5206;&#x533A;&#xFF0C;&#x6392;&#x5E8F;&#xFF0C;&#x5E76;&#x5408;&#x5E76;&#x5230;&#x53EF;&#x914D;&#x7F6E;&#x6570;&#x91CF;&#x7684;Reducer&#x5206;&#x533A;&#x4E2D;&#x3002;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x7684;&#x76EE;&#x7684;&#x662F;&#x628A;&#x6240;&#x6709;&#x7684;<strong>&#x76F8;&#x5173;</strong>&#x6570;&#x636E;&#xFF08;&#x4F8B;&#x5982;&#x5E26;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#xFF09;&#x90FD;&#x653E;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x200B;    &#x540E;MapReduce&#x65F6;&#x4EE3;&#x7684;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x82E5;&#x975E;&#x5FC5;&#x8981;&#x4F1A;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x6392;&#x5E8F;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E5F;&#x91C7;&#x53D6;&#x4E86;&#x5927;&#x81F4;&#x7C7B;&#x4F3C;&#x7684;&#x5206;&#x533A;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong><em>&#x5BB9;&#x9519;</em></strong></p>
<p>&#x200B;    MapReduce&#x7ECF;&#x5E38;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x4ECE;&#x5355;&#x4E2A;&#x5931;&#x8D25;&#x7684;&#x4EFB;&#x52A1;&#x6062;&#x590D;&#x5F88;&#x8F7B;&#x677E;&#xFF0C;&#x65E0;&#x9700;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x6574;&#x4E2A;&#x4F5C;&#x4E1A;&#xFF0C;&#x4F46;&#x5728;&#x65E0;&#x6545;&#x969C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x51CF;&#x6162;&#x4E86;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x3002;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x66F4;&#x591A;&#x5730;&#x5C06;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x66F4;&#x5C11;&#x5730;&#x7269;&#x5316;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x91CD;&#x7B97;&#x66F4;&#x591A;&#x7684;&#x6570;&#x636E;&#x3002;&#x786E;&#x5B9A;&#x6027;&#x7B97;&#x5B50;&#x51CF;&#x5C11;&#x4E86;&#x9700;&#x8981;&#x91CD;&#x7B97;&#x7684;&#x6570;&#x636E;&#x91CF;&#x3002;</p>
<p>&#x200B;    &#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x51E0;&#x79CD;MapReduce&#x7684;&#x8FDE;&#x63A5;&#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x4E5F;&#x5728;MPP&#x6570;&#x636E;&#x5E93;&#x548C;&#x6570;&#x636E;&#x6D41;&#x5F15;&#x64CE;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x4EEC;&#x4E5F;&#x5F88;&#x597D;&#x5730;&#x6F14;&#x793A;&#x4E86;&#x5206;&#x533A;&#x7B97;&#x6CD5;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF1A;</p>
<p><strong><em>&#x6392;&#x5E8F;&#x5408;&#x5E76;&#x8FDE;&#x63A5;</em></strong></p>
<p>&#x200B;    &#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x8FDE;&#x63A5;&#x7684;&#x8F93;&#x5165;&#x90FD;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x63D0;&#x53D6;&#x8FDE;&#x63A5;&#x952E;&#x7684;Mapper&#x3002;&#x901A;&#x8FC7;&#x5206;&#x533A;&#xFF0C;&#x6392;&#x5E8F;&#x548C;&#x5408;&#x5E76;&#xFF0C;&#x5177;&#x6709;&#x76F8;&#x540C;&#x952E;&#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x6700;&#x7EC8;&#x90FD;&#x4F1A;&#x8FDB;&#x5165;&#x76F8;&#x540C;&#x7684;Reducer&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x80FD;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x597D;&#x7684;&#x8BB0;&#x5F55;&#x3002;</p>
<p><strong><em>&#x5E7F;&#x64AD;&#x6563;&#x5217;&#x8FDE;&#x63A5;</em></strong></p>
<p>&#x200B;    &#x4E24;&#x4E2A;&#x8FDE;&#x63A5;&#x8F93;&#x5165;&#x4E4B;&#x4E00;&#x5F88;&#x5C0F;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5E76;&#x6CA1;&#x6709;&#x5206;&#x533A;&#xFF0C;&#x800C;&#x4E14;&#x80FD;&#x88AB;&#x5B8C;&#x5168;&#x52A0;&#x8F7D;&#x8FDB;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x8868;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x8FDE;&#x63A5;&#x8F93;&#x5165;&#x5927;&#x7AEF;&#x7684;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x542F;&#x52A8;&#x4E00;&#x4E2A;Mapper&#xFF0C;&#x5C06;&#x8F93;&#x5165;&#x5C0F;&#x7AEF;&#x7684;&#x6563;&#x5217;&#x8868;&#x52A0;&#x8F7D;&#x5230;&#x6BCF;&#x4E2A;Mapper&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x626B;&#x63CF;&#x5927;&#x7AEF;&#xFF0C;&#x4E00;&#x6B21;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x4E3A;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x67E5;&#x8BE2;&#x6563;&#x5217;&#x8868;&#x3002;</p>
<p><strong><em>&#x5206;&#x533A;&#x6563;&#x5217;&#x8FDE;&#x63A5;</em></strong></p>
<p>&#x200B;    &#x5982;&#x679C;&#x4E24;&#x4E2A;&#x8FDE;&#x63A5;&#x8F93;&#x5165;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5206;&#x533A;&#xFF08;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x952E;&#xFF0C;&#x76F8;&#x540C;&#x7684;&#x6563;&#x5217;&#x51FD;&#x6570;&#x548C;&#x76F8;&#x540C;&#x6570;&#x91CF;&#x7684;&#x5206;&#x533A;&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x5BF9;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x5E94;&#x7528;&#x6563;&#x5217;&#x8868;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x200B;    &#x5206;&#x5E03;&#x5F0F;&#x6279;&#x5904;&#x7406;&#x5F15;&#x64CE;&#x6709;&#x4E00;&#x4E2A;&#x523B;&#x610F;&#x9650;&#x5236;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF1A;&#x56DE;&#x8C03;&#x51FD;&#x6570;&#xFF08;&#x6BD4;&#x5982;Mapper&#x548C;Reducer&#xFF09;&#x88AB;&#x5047;&#x5B9A;&#x662F;&#x65E0;&#x72B6;&#x6001;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x9664;&#x4E86;&#x6307;&#x5B9A;&#x7684;&#x8F93;&#x51FA;&#x5916;&#xFF0C;&#x5FC5;&#x987B;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5916;&#x90E8;&#x53EF;&#x89C1;&#x7684;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x4E00;&#x9650;&#x5236;&#x5141;&#x8BB8;&#x6846;&#x67B6;&#x5728;&#x5176;&#x62BD;&#x8C61;&#x4E0B;&#x9690;&#x85CF;&#x4E00;&#x4E9B;&#x56F0;&#x96BE;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x95EE;&#x9898;&#xFF1A;&#x5F53;&#x9047;&#x5230;&#x5D29;&#x6E83;&#x548C;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4EFB;&#x52A1;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x91CD;&#x8BD5;&#xFF0C;&#x4EFB;&#x4F55;&#x5931;&#x8D25;&#x4EFB;&#x52A1;&#x7684;&#x8F93;&#x51FA;&#x90FD;&#x88AB;&#x4E22;&#x5F03;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x6210;&#x529F;&#xFF0C;&#x5219;&#x5176;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x80FD;&#x4F7F;&#x5176;&#x8F93;&#x51FA;&#x5B9E;&#x9645;&#x53EF;&#x89C1;&#x3002;</p>
<p>&#x200B;    &#x5F97;&#x76CA;&#x4E8E;&#x8FD9;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x4F60;&#x5728;&#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x65E0;&#x9700;&#x64CD;&#x5FC3;&#x5B9E;&#x73B0;&#x5BB9;&#x9519;&#x673A;&#x5236;&#xFF1A;&#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4F5C;&#x4E1A;&#x7684;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x4E0E;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x7684;&#x60C5;&#x51B5;&#x76F8;&#x540C;&#xFF0C;&#x4E5F;&#x8BB8;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x8BD5;&#x5404;&#x79CD;&#x4EFB;&#x52A1;&#x3002;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#x5904;&#x7406;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x5C06;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x4F5C;&#x4E3A;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x6BD4;&#x8D77;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#xFF0C;&#x6279;&#x5904;&#x7406;&#x63D0;&#x4F9B;&#x7684;&#x8FD9;&#x79CD;&#x53EF;&#x9760;&#x6027;&#x8BED;&#x4E49;&#x8981;&#x5F3A;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x200B;    &#x6279;&#x5904;&#x7406;&#x4F5C;&#x4E1A;&#x7684;&#x663E;&#x8457;&#x7279;&#x70B9;&#x662F;&#xFF0C;&#x5B83;&#x8BFB;&#x53D6;&#x4E00;&#x4E9B;&#x8F93;&#x5165;&#x6570;&#x636E;&#x5E76;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x8F93;&#x51FA;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x4E0D;&#x4FEE;&#x6539;&#x8F93;&#x5165;&#x2014;&#x2014; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x8F93;&#x51FA;&#x662F;&#x4ECE;&#x8F93;&#x5165;&#x884D;&#x751F;&#x51FA;&#x7684;&#x3002;&#x6700;&#x5173;&#x952E;&#x7684;&#x662F;&#xFF0C;&#x8F93;&#x5165;&#x6570;&#x636E;&#x662F;<strong>&#x6709;&#x754C;&#x7684;&#xFF08;bounded&#xFF09;</strong>&#xFF1A;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x5DF2;&#x77E5;&#x7684;&#xFF0C;&#x56FA;&#x5B9A;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x6216;&#x6570;&#x636E;&#x5E93;&#x5185;&#x5BB9;&#x7684;&#x5FEB;&#x7167;&#xFF09;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x6709;&#x754C;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E1A;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5B8C;&#x6210;&#x4E86;&#x6574;&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x8BFB;&#x53D6;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x5728;&#x505A;&#x5B8C;&#x540E;&#xFF0C;&#x6700;&#x7EC8;&#x603B;&#x662F;&#x4F1A;&#x5B8C;&#x6210;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8F6C;&#x5411;&#x6D41;&#x5904;&#x7406;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x8F93;&#x5165;&#x662F;<strong>&#x65E0;&#x754C;&#x7684;&#xFF08;unbounded&#xFF09;</strong> &#x2014;&#x2014; &#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4F60;&#x8FD8;&#x6709;&#x6D3B;&#x513F;&#x8981;&#x5E72;&#xFF0C;&#x7136;&#x800C;&#x5B83;&#x7684;&#x8F93;&#x5165;&#x662F;&#x6C38;&#x65E0;&#x6B62;&#x5883;&#x7684;&#x6570;&#x636E;&#x6D41;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F5C;&#x4E1A;&#x6C38;&#x65E0;&#x5B8C;&#x6210;&#x4E4B;&#x65E5;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x80FD;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x6D8C;&#x5165;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x4E0A;&#xFF0C;&#x6D41;&#x5904;&#x7406;&#x548C;&#x6279;&#x5904;&#x7406;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5173;&#x4E8E;&#x65E0;&#x5C3D;&#x6570;&#x636E;&#x6D41;&#x7684;&#x5047;&#x8BBE;&#x4E5F;&#x5BF9;&#x6211;&#x4EEC;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x5F0F;&#x4EA7;&#x751F;&#x4E86;&#x5F88;&#x591A;&#x6539;&#x53D8;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;">&#x53C2;&#x8003;&#x6587;&#x732E;</h2>
<ol>
<li><p>Jeffrey Dean and Sanjay Ghemawat: &#x201C;<a href="http://research.google.com/archive/mapreduce.html" target="_blank">MapReduce: Simplified Data Processing on Large Clusters</a>,&#x201D; at <em>6th USENIX Symposium on Operating System Design and Implementation</em> (OSDI), December 2004.</p>
</li>
<li><p>Joel Spolsky: &#x201C;<a href="http://www.joelonsoftware.com/articles/ThePerilsofJavaSchools.html" target="_blank">The Perils of JavaSchools</a>,&#x201D; <em>joelonsoftware.com</em>, December 25, 2005.</p>
</li>
<li><p>Shivnath Babu and Herodotos Herodotou: &#x201C;<a href="http://research.microsoft.com/pubs/206464/db-mr-survey-final.pdf" target="_blank">Massively Parallel Databases and MapReduce Systems</a>,&#x201D; <em>Foundations and Trends in Databases</em>, volume 5, number 1, pages 1&#x2013;104, November 2013. <a href="http://dx.doi.org/10.1561/1900000036" target="_blank">doi:10.1561/1900000036</a></p>
</li>
<li><p>David J. DeWitt and Michael Stonebraker: &#x201C;<a href="https://homes.cs.washington.edu/~billhowe/mapreduce_a_major_step_backwards.html" target="_blank">MapReduce: A Major Step Backwards</a>,&#x201D; originally published at <em>databasecolumn.vertica.com</em>, January 17, 2008.</p>
</li>
<li><p>Henry Robinson: &#x201C;<a href="http://the-paper-trail.org/blog/the-elephant-was-a-trojan-horse-on-the-death-of-map-reduce-at-google/" target="_blank">The Elephant Was a Trojan Horse: On the Death of Map-Reduce at Google</a>,&#x201D;
<em>the-paper-trail.org</em>, June 25, 2014.</p>
</li>
<li><p>&#x201C;<a href="https://www.census.gov/history/www/innovations/technology/the_hollerith_tabulator.html" target="_blank">The Hollerith Machine</a>,&#x201D; United States Census Bureau, <em>census.gov</em>.</p>
</li>
<li><p>&#x201C;<a href="http://www.textfiles.com/bitsavers/pdf/ibm/punchedCard/Sorter/A24-1034-1_82-83-84_sorters.pdf" target="_blank">IBM 82, 83, and 84 Sorters Reference Manual</a>,&#x201D; Edition A24-1034-1, International Business
Machines Corporation, July 1962.</p>
</li>
<li><p>Adam Drake: &#x201C;<a href="http://aadrake.com/command-line-tools-can-be-235x-faster-than-your-hadoop-cluster.html" target="_blank">Command-Line Tools Can Be 235x Faster than Your Hadoop Cluster</a>,&#x201D; <em>aadrake.com</em>, January 25, 2014.</p>
</li>
<li><p>&#x201C;<a href="http://www.gnu.org/software/coreutils/manual/html_node/index.html" target="_blank">GNU Coreutils 8.23 Documentation</a>,&#x201D; Free Software Foundation, Inc., 2014.</p>
</li>
<li><p>Martin Kleppmann: &#x201C;<a href="http://martin.kleppmann.com/2015/08/05/kafka-samza-unix-philosophy-distributed-data.html" target="_blank">Kafka, Samza, and the Unix Philosophy of Distributed Data</a>,&#x201D; <em>martin.kleppmann.com</em>, August 5, 2015.</p>
</li>
<li><p>Doug McIlroy:<a href="http://cm.bell-labs.com/cm/cs/who/dmr/mdmpipe.pdf" target="_blank">Internal Bell Labs memo</a>, October 1964. Cited in: Dennis M. Richie: &#x201C;<a href="https://www.bell-labs.com/usr/dmr/www/mdmpipe.html" target="_blank">Advice from Doug McIlroy</a>,&#x201D; <em>cm.bell-labs.com</em>.</p>
</li>
<li><p>M. D. McIlroy, E. N. Pinson, and B. A. Tague: &#x201C;<a href="https://archive.org/details/bstj57-6-1899" target="_blank">UNIX Time-Sharing System: Foreword</a>,&#x201D; <em>The Bell System Technical Journal</em>, volume 57, number 6, pages 1899&#x2013;1904, July 1978.</p>
</li>
<li><p>Eric S. Raymond: <a href="http://www.catb.org/~esr/writings/taoup/html/" target="_blank"><em>The Art of UNIX Programming</em></a>. Addison-Wesley, 2003. ISBN: 978-0-13-142901-7</p>
</li>
<li><p>Ronald Duncan: &#x201C;<a href="https://ronaldduncan.wordpress.com/2009/10/31/text-file-formats-ascii-delimited-text-not-csv-or-tab-delimited-text/" target="_blank">Text File Formats &#x2013; ASCII Delimited Text &#x2013; Not CSV or TAB Delimited Text</a>,&#x201D;
<em>ronaldduncan.wordpress.com</em>, October 31, 2009.</p>
</li>
<li><p>Alan Kay: &#x201C;<a href="http://tinlizzie.org/~takashi/IsSoftwareEngineeringAnOxymoron.pdf" target="_blank">Is &apos;Software Engineering&apos; an Oxymoron?</a>,&#x201D; <em>tinlizzie.org</em>.</p>
</li>
<li><p>Martin Fowler: &#x201C;<a href="http://martinfowler.com/bliki/InversionOfControl.html" target="_blank">InversionOfControl</a>,&#x201D; <em>martinfowler.com</em>, June 26, 2005.</p>
</li>
<li><p>Daniel J. Bernstein: &#x201C;<a href="http://cr.yp.to/tcpip/twofd.html" target="_blank">Two File Descriptors for Sockets</a>,&#x201D; <em>cr.yp.to</em>.</p>
</li>
<li><p>Rob Pike and Dennis M. Ritchie: &#x201C;<a href="http://doc.cat-v.org/inferno/4th_edition/styx" target="_blank">The Styx Architecture for Distributed Systems</a>,&#x201D; <em>Bell Labs Technical Journal</em>, volume 4, number 2, pages 146&#x2013;152, April 1999.</p>
</li>
<li><p>Sanjay Ghemawat, Howard Gobioff, and Shun-Tak Leung: &#x201C;<a href="http://research.google.com/archive/gfs-sosp2003.pdf" target="_blank">The Google File System</a>,&#x201D; at <em>19th ACM Symposium on Operating Systems Principles</em> (SOSP), October 2003. <a href="http://dx.doi.org/10.1145/945445.945450" target="_blank">doi:10.1145/945445.945450</a></p>
</li>
<li><p>Michael Ovsiannikov, Silvius Rus, Damian Reeves, et al.: &#x201C;<a href="http://db.disi.unitn.eu/pages/VLDBProgram/pdf/industry/p808-ovsiannikov.pdf" target="_blank">The Quantcast File System</a>,&#x201D; <em>Proceedings of the VLDB Endowment</em>, volume 6, number 11, pages 1092&#x2013;1101, August 2013. <a href="http://dx.doi.org/10.14778/2536222.2536234" target="_blank">doi:10.14778/2536222.2536234</a></p>
</li>
<li><p>&#x201C;<a href="http://docs.openstack.org/developer/swift/" target="_blank">OpenStack Swift 2.6.1 Developer Documentation</a>,&#x201D; OpenStack Foundation, <em>docs.openstack.org</em>, March 2016.</p>
</li>
<li><p>Zhe Zhang, Andrew Wang, Kai Zheng, et al.: &#x201C;<a href="http://blog.cloudera.com/blog/2015/09/introduction-to-hdfs-erasure-coding-in-apache-hadoop/" target="_blank">Introduction to HDFS Erasure Coding in Apache Hadoop</a>,&#x201D; <em>blog.cloudera.com</em>, September 23, 2015.</p>
</li>
<li><p>Peter Cnudde: &#x201C;<a href="http://yahoohadoop.tumblr.com/post/138739227316/hadoop-turns-10" target="_blank">Hadoop Turns 10</a>,&#x201D; <em>yahoohadoop.tumblr.com</em>, February 5, 2016.</p>
</li>
<li><p>Eric Baldeschwieler: &#x201C;<a href="http://hortonworks.com/blog/thinking-about-the-hdfs-vs-other-storage-technologies/" target="_blank">Thinking About the HDFS vs. Other Storage Technologies</a>,&#x201D; <em>hortonworks.com</em>, July 25, 2012.</p>
</li>
<li><p>Brendan Gregg: &#x201C;<a href="http://dtrace.org/blogs/brendan/2013/06/25/manta-unix-meets-map-reduce/" target="_blank">Manta: Unix Meets Map Reduce</a>,&#x201D; <em>dtrace.org</em>, June 25, 2013.</p>
</li>
<li><p>Tom White: <em>Hadoop: The Definitive Guide</em>, 4th edition. O&apos;Reilly Media, 2015. ISBN: 978-1-491-90163-2</p>
</li>
<li><p>Jim N. Gray: &#x201C;<a href="http://arxiv.org/pdf/cs/0403019.pdf" target="_blank">Distributed Computing Economics</a>,&#x201D; Microsoft Research Tech Report MSR-TR-2003-24, March 2003.</p>
</li>
<li><p>M&#xE1;rton Trencs&#xE9;ni: &#x201C;<a href="http://bytepawn.com/luigi-airflow-pinball.html" target="_blank">Luigi vs Airflow vs Pinball</a>,&#x201D; <em>bytepawn.com</em>, February 6, 2016.</p>
</li>
<li><p>Roshan Sumbaly, Jay Kreps, and Sam Shah: &#x201C;<a href="http://www.slideshare.net/s_shah/the-big-data-ecosystem-at-linkedin-23512853" target="_blank">The &apos;Big Data&apos; Ecosystem at LinkedIn</a>,&#x201D; at <em>ACM International Conference on Management of Data (SIGMOD)</em>, July 2013. <a href="http://dx.doi.org/10.1145/2463676.2463707" target="_blank">doi:10.1145/2463676.2463707</a></p>
</li>
<li><p>Alan F. Gates, Olga Natkovich, Shubham Chopra, et al.: &#x201C;<a href="http://www.vldb.org/pvldb/2/vldb09-1074.pdf" target="_blank">Building a High-Level Dataflow System on Top of Map-Reduce: The Pig Experience</a>,&#x201D; at <em>35th International Conference on Very Large Data Bases</em> (VLDB), August 2009.</p>
</li>
<li><p>Ashish Thusoo, Joydeep Sen Sarma, Namit Jain, et al.: &#x201C;<a href="http://i.stanford.edu/~ragho/hive-icde2010.pdf" target="_blank">Hive &#x2013; A Petabyte Scale Data Warehouse Using Hadoop</a>,&#x201D; at <em>26th IEEE International Conference on Data Engineering</em> (ICDE), March 2010. <a href="http://dx.doi.org/10.1109/ICDE.2010.5447738" target="_blank">doi:10.1109/ICDE.2010.5447738</a></p>
</li>
<li><p>&#x201C;<a href="http://docs.cascading.org/cascading/3.0/userguide/" target="_blank">Cascading 3.0 User Guide</a>,&#x201D; Concurrent, Inc., <em>docs.cascading.org</em>, January 2016.</p>
</li>
<li><p>&#x201C;<a href="https://crunch.apache.org/user-guide.html" target="_blank">Apache Crunch User Guide</a>,&#x201D; Apache Software Foundation, <em>crunch.apache.org</em>.</p>
</li>
<li><p>Craig Chambers, Ashish Raniwala, Frances Perry, et al.: &#x201C;<a href="https://research.google.com/pubs/archive/35650.pdf" target="_blank">FlumeJava: Easy, Efficient Data-Parallel Pipelines</a>,&#x201D; at <em>31st ACM SIGPLAN Conference on Programming Language Design and Implementation</em> (PLDI), June 2010. <a href="http://dx.doi.org/10.1145/1806596.1806638" target="_blank">doi:10.1145/1806596.1806638</a></p>
</li>
<li><p>Jay Kreps: &#x201C;<a href="https://www.oreilly.com/ideas/why-local-state-is-a-fundamental-primitive-in-stream-processing" target="_blank">Why Local State is a Fundamental Primitive in Stream Processing</a>,&#x201D; <em>oreilly.com</em>, July 31, 2014.</p>
</li>
<li><p>Martin Kleppmann: &#x201C;<a href="http://martin.kleppmann.com/2012/10/01/rethinking-caching-in-web-apps.html" target="_blank">Rethinking Caching in Web Apps</a>,&#x201D; <em>martin.kleppmann.com</em>, October 1, 2012.</p>
</li>
<li><p>Mark Grover, Ted Malaska, Jonathan Seidman, and Gwen Shapira: <em><a href="http://shop.oreilly.com/product/0636920033196.do" target="_blank">Hadoop Application Architectures</a></em>. O&apos;Reilly Media, 2015. ISBN: 978-1-491-90004-8</p>
</li>
<li><p>Philippe Ajoux, Nathan Bronson, Sanjeev Kumar, et al.: &#x201C;<a href="https://www.usenix.org/system/files/conference/hotos15/hotos15-paper-ajoux.pdf" target="_blank">Challenges to Adopting Stronger Consistency at Scale</a>,&#x201D; at <em>15th USENIX Workshop on Hot Topics in Operating Systems</em> (HotOS), May 2015.</p>
</li>
<li><p>Sriranjan Manjunath: &#x201C;<a href="https://wiki.apache.org/pig/PigSkewedJoinSpec" target="_blank">Skewed Join</a>,&#x201D; <em>wiki.apache.org</em>, 2009.</p>
</li>
<li><p>David J. DeWitt, Jeffrey F. Naughton, Donovan A.Schneider, and S. Seshadri: &#x201C;<a href="http://www.vldb.org/conf/1992/P027.PDF" target="_blank">Practical Skew Handling in Parallel Joins</a>,&#x201D; at <em>18th International Conference on Very Large Data Bases</em> (VLDB), August 1992.</p>
</li>
<li><p>Marcel Kornacker, Alexander Behm, Victor Bittorf, et al.: &#x201C;<a href="http://pandis.net/resources/cidr15impala.pdf" target="_blank">Impala: A Modern, Open-Source SQL Engine for Hadoop</a>,&#x201D; at <em>7th Biennial Conference on Innovative Data Systems Research</em> (CIDR), January 2015.</p>
</li>
<li><p>Matthieu Monsch: &#x201C;<a href="https://engineering.linkedin.com/blog/2015/10/open-sourcing-paldb--a-lightweight-companion-for-storing-side-da" target="_blank">Open-Sourcing PalDB, a Lightweight Companion for Storing Side Data</a>,&#x201D; <em>engineering.linkedin.com</em>, October 26, 2015.</p>
</li>
<li><p>Daniel Peng and Frank Dabek: &#x201C;<a href="https://www.usenix.org/legacy/event/osdi10/tech/full_papers/Peng.pdf" target="_blank">Large-Scale Incremental Processing Using Distributed Transactions and Notifications</a>,&#x201D; at <em>9th USENIX conference on Operating Systems Design and Implementation</em> (OSDI), October 2010.</p>
</li>
<li><p>&#x201C;<a href="http://www.cloudera.com/documentation/cdh/5-1-x/Search/Cloudera-Search-User-Guide/Cloudera-Search-User-Guide.html" target="_blank">&quot;Cloudera Search User Guide,&quot;</a> Cloudera, Inc., September 2015.</p>
</li>
<li><p>Lili Wu, Sam Shah, Sean Choi, et al.:
&#x201C;<a href="http://ls13-www.cs.uni-dortmund.de/homepage/rsweb2014/papers/rsweb2014_submission_3.pdf" target="_blank">The Browsemaps: Collaborative Filtering at LinkedIn</a>,&#x201D; at <em>6th Workshop on Recommender Systems and the Social Web</em> (RSWeb), October 2014.</p>
</li>
<li><p>Roshan Sumbaly, Jay Kreps, Lei Gao, et al.: &#x201C;<a href="http://static.usenix.org/events/fast12/tech/full_papers/Sumbaly.pdf" target="_blank">Serving Large-Scale Batch Computed Data with Project Voldemort</a>,&#x201D; at <em>10th USENIX Conference on File and Storage Technologies</em> (FAST), February 2012.</p>
</li>
<li><p>Varun Sharma: &#x201C;<a href="https://engineering.pinterest.com/blog/open-sourcing-terrapin-serving-system-batch-generated-data-0" target="_blank">Open-Sourcing Terrapin: A Serving System for Batch Generated Data</a>,&#x201D;  <em>engineering.pinterest.com</em>, September 14, 2015.</p>
</li>
<li><p>Nathan Marz: &#x201C;<a href="http://www.slideshare.net/nathanmarz/elephantdb" target="_blank">ElephantDB</a>,&#x201D; <em>slideshare.net</em>, May 30, 2011.</p>
</li>
<li><p>Jean-Daniel (JD) Cryans: &#x201C;<a href="http://blog.cloudera.com/blog/2013/09/how-to-use-hbase-bulk-loading-and-why/" target="_blank">How-to: Use HBase Bulk Loading, and Why</a>,&#x201D; <em>blog.cloudera.com</em>, September 27, 2013.</p>
</li>
<li><p>Nathan Marz:  &#x201C;<a href="http://nathanmarz.com/blog/how-to-beat-the-cap-theorem.html" target="_blank">How to Beat the CAP   Theorem</a>,&#x201D; <em>nathanmarz.com</em>, October 13, 2011.</p>
</li>
<li><p>Molly Bartlett Dishman and Martin Fowler:  &#x201C;<a href="http://conferences.oreilly.com/software-architecture/sa2015/public/schedule/detail/40388" target="_blank">Agile   Architecture</a>,&#x201D; at <em>O&apos;Reilly Software Architecture Conference</em>, March 2015.</p>
</li>
<li><p>David J. DeWitt and Jim N. Gray: &#x201C;<a href="http://www.cs.cmu.edu/~pavlo/courses/fall2013/static/papers/dewittgray92.pdf" target="_blank">Parallel Database Systems: The Future of High Performance Database Systems</a>,&#x201D; <em>Communications of the ACM</em>, volume 35, number 6, pages 85&#x2013;98, June 1992. <a href="http://dx.doi.org/10.1145/129888.129894" target="_blank">doi:10.1145/129888.129894</a></p>
</li>
<li><p>Jay Kreps: &#x201C;<a href="https://twitter.com/jaykreps/status/528235702480142336" target="_blank">But the multi-tenancy thing is actually really really hard</a>,&#x201D; tweetstorm, <em>twitter.com</em>, October 31, 2014.</p>
</li>
<li><p>Jeffrey Cohen, Brian Dolan, Mark Dunlap, et al.: &#x201C;<a href="http://www.vldb.org/pvldb/2/vldb09-219.pdf" target="_blank">MAD Skills: New Analysis Practices for Big Data</a>,&#x201D; <em>Proceedings of the VLDB Endowment</em>, volume 2, number 2, pages 1481&#x2013;1492, August 2009. <a href="http://dx.doi.org/10.14778/1687553.1687576" target="_blank">doi:10.14778/1687553.1687576</a></p>
</li>
<li><p>Ignacio Terrizzano, Peter Schwarz, Mary Roth, and John E. Colino: &#x201C;<a href="http://cidrdb.org/cidr2015/Papers/CIDR15_Paper2.pdf" target="_blank">Data Wrangling: The Challenging Journey from the Wild to the Lake</a>,&#x201D; at <em>7th Biennial Conference on Innovative Data Systems Research</em> (CIDR), January 2015.</p>
</li>
<li><p>Paige Roberts: &#x201C;<a href="http://adaptivesystemsinc.com/blog/to-schema-on-read-or-to-schema-on-write-that-is-the-hadoop-data-lake-question/" target="_blank">To Schema on Read or to Schema on Write, That Is the Hadoop Data Lake Question</a>,&#x201D; <em>adaptivesystemsinc.com</em>, July 2, 2015.</p>
</li>
<li><p>Bobby Johnson and Joseph Adler: &#x201C;<a href="https://vimeo.com/123985284" target="_blank">The Sushi Principle: Raw Data Is Better</a>,&#x201D; at <em>Strata+Hadoop World</em>, February 2015.</p>
</li>
<li><p>Vinod Kumar Vavilapalli, Arun C. Murthy, Chris Douglas, et al.: &#x201C;<a href="http://www.socc2013.org/home/program/a5-vavilapalli.pdf" target="_blank">Apache Hadoop YARN: Yet Another Resource Negotiator</a>,&#x201D; at <em>4th ACM Symposium on Cloud Computing</em> (SoCC), October 2013. <a href="http://dx.doi.org/10.1145/2523616.2523633" target="_blank">doi:10.1145/2523616.2523633</a></p>
</li>
<li><p>Abhishek Verma, Luis Pedrosa, Madhukar Korupolu, et al.: &#x201C;<a href="http://research.google.com/pubs/pub43438.html" target="_blank">Large-Scale Cluster Management at Google with Borg</a>,&#x201D; at <em>10th European Conference on Computer Systems</em> (EuroSys), April 2015. <a href="http://dx.doi.org/10.1145/2741948.2741964" target="_blank">doi:10.1145/2741948.2741964</a></p>
</li>
<li><p>Malte Schwarzkopf: &#x201C;<a href="http://www.firmament.io/blog/scheduler-architectures.html" target="_blank">The Evolution of Cluster Scheduler Architectures</a>,&#x201D; <em>firmament.io</em>, March 9, 2016.</p>
</li>
<li><p>Matei Zaharia, Mosharaf Chowdhury, Tathagata Das, et al.: &#x201C;<a href="https://www.usenix.org/system/files/conference/nsdi12/nsdi12-final138.pdf" target="_blank">Resilient Distributed Datasets: A Fault-Tolerant Abstraction for In-Memory Cluster Computing</a>,&#x201D; at <em>9th USENIX Symposium on Networked Systems Design and Implementation</em> (NSDI), April 2012.</p>
</li>
<li><p>Holden Karau, Andy Konwinski, Patrick Wendell, and Matei Zaharia: <em>Learning Spark</em>. O&apos;Reilly Media, 2015. ISBN: 978-1-449-35904-1</p>
</li>
<li><p>Bikas Saha and Hitesh Shah: &#x201C;<a href="http://www.slideshare.net/Hadoop_Summit/w-1205phall1saha" target="_blank">Apache Tez: Accelerating Hadoop Query Processing</a>,&#x201D; at <em>Hadoop Summit</em>, June 2014.</p>
</li>
<li><p>Bikas Saha, Hitesh Shah, Siddharth Seth, et al.: &#x201C;<a href="http://home.cse.ust.hk/~weiwa/teaching/Fall15-COMP6611B/reading_list/Tez.pdf" target="_blank">Apache Tez: A Unifying Framework for Modeling and Building Data Processing Applications</a>,&#x201D; at <em>ACM International Conference on Management of Data</em> (SIGMOD), June 2015. <a href="http://dx.doi.org/10.1145/2723372.2742790" target="_blank">doi:10.1145/2723372.2742790</a></p>
</li>
<li><p>Kostas Tzoumas: &#x201C;<a href="http://www.slideshare.net/KostasTzoumas/apache-flink-api-runtime-and-project-roadmap" target="_blank">Apache Flink: API, Runtime, and Project Roadmap</a>,&#x201D; <em>slideshare.net</em>, January 14, 2015.</p>
</li>
<li><p>Alexander Alexandrov, Rico Bergmann, Stephan Ewen, et al.: &#x201C;<a href="https://ssc.io/pdf/2014-VLDBJ_Stratosphere_Overview.pdf" target="_blank">The Stratosphere Platform for Big Data Analytics</a>,&#x201D; <em>The VLDB Journal</em>, volume 23, number 6, pages 939&#x2013;964, May 2014. <a href="http://dx.doi.org/10.1007/s00778-014-0357-y" target="_blank">doi:10.1007/s00778-014-0357-y</a></p>
</li>
<li><p>Michael Isard, Mihai Budiu, Yuan Yu, et al.: &#x201C;<a href="http://research.microsoft.com/en-us/projects/dryad/eurosys07.pdf" target="_blank">Dryad: Distributed Data-Parallel Programs from Sequential Building Blocks</a>,&#x201D; at <em>European Conference on Computer Systems</em> (EuroSys), March 2007. <a href="http://dx.doi.org/10.1145/1272996.1273005" target="_blank">doi:10.1145/1272996.1273005</a></p>
</li>
<li><p>Daniel Warneke and Odej Kao: &#x201C;<a href="https://stratosphere2.dima.tu-berlin.de/assets/papers/Nephele_09.pdf" target="_blank">Nephele: Efficient Parallel Data Processing in the Cloud</a>,&#x201D; at <em>2nd Workshop on Many-Task Computing on Grids and Supercomputers</em> (MTAGS), November 2009. <a href="http://dx.doi.org/10.1145/1646468.1646476" target="_blank">doi:10.1145/1646468.1646476</a></p>
</li>
<li><p>Lawrence Page, Sergey Brin, Rajeev Motwani, and Terry Winograd: <a href="http://ilpubs.stanford.edu:8090/422/" target="_blank">&quot;The PageRank&quot;</a></p>
</li>
<li><p>Leslie G. Valiant: &#x201C;<a href="http://dl.acm.org/citation.cfm?id=79181" target="_blank">A Bridging Model for Parallel Computation</a>,&#x201D; <em>Communications of the ACM</em>, volume 33, number 8, pages 103&#x2013;111, August 1990. <a href="http://dx.doi.org/10.1145/79173.79181" target="_blank">doi:10.1145/79173.79181</a></p>
</li>
<li><p>Stephan Ewen, Kostas Tzoumas, Moritz Kaufmann, and Volker Markl: &#x201C;<a href="http://vldb.org/pvldb/vol5/p1268_stephanewen_vldb2012.pdf" target="_blank">Spinning Fast Iterative Data Flows</a>,&#x201D; <em>Proceedings of the VLDB Endowment</em>, volume 5, number 11, pages 1268-1279, July 2012. <a href="http://dx.doi.org/10.14778/2350229.2350245" target="_blank">doi:10.14778/2350229.2350245</a></p>
</li>
<li><p>Grzegorz Malewicz, Matthew H.Austern, Aart J. C. Bik, et al.: &#x201C;<a href="https://kowshik.github.io/JPregel/pregel_paper.pdf" target="_blank">Pregel: A System for Large-Scale Graph Processing</a>,&#x201D; at <em>ACM International Conference on Management of Data</em> (SIGMOD), June 2010. <a href="http://dx.doi.org/10.1145/1807167.1807184" target="_blank">doi:10.1145/1807167.1807184</a></p>
</li>
<li><p>Frank McSherry, Michael Isard, and Derek G. Murray: &#x201C;<a href="http://www.frankmcsherry.org/assets/COST.pdf" target="_blank">Scalability! But at What COST?</a>,&#x201D; at <em>15th USENIX Workshop on Hot Topics in Operating Systems</em> (HotOS), May 2015.</p>
</li>
<li><p>Ionel Gog, Malte Schwarzkopf, Natacha Crooks, et al.: &#x201C;<a href="http://www.cl.cam.ac.uk/research/srg/netos/camsas/pubs/eurosys15-musketeer.pdf" target="_blank">Musketeer: All for One, One for All in Data Processing Systems</a>,&#x201D; at <em>10th European Conference on Computer Systems</em> (EuroSys), April 2015. <a href="http://dx.doi.org/10.1145/2741948.2741968" target="_blank">doi:10.1145/2741948.2741968</a></p>
</li>
<li><p>Aapo Kyrola, Guy Blelloch, and Carlos Guestrin: &#x201C;<a href="https://www.usenix.org/system/files/conference/osdi12/osdi12-final-126.pdf" target="_blank">GraphChi: Large-Scale Graph Computation on Just a PC</a>,&#x201D; at <em>10th USENIX Symposium on Operating Systems Design and Implementation</em> (OSDI), October 2012.</p>
</li>
<li><p>Andrew Lenharth, Donald Nguyen, and Keshav Pingali: &#x201C;<a href="http://cacm.acm.org/magazines/2016/5/201591-parallel-graph-analytics/fulltext" target="_blank">Parallel Graph Analytics</a>,&#x201D; <em>Communications of the ACM</em>, volume 59, number 5, pages 78&#x2013;87, May <a href="http://dx.doi.org/10.1145/2901919" target="_blank">doi:10.1145/2901919</a></p>
</li>
<li><p>Fabian H&#xFC;ske: &#x201C;<a href="http://flink.apache.org/news/2015/03/13/peeking-into-Apache-Flinks-Engine-Room.html" target="_blank">Peeking into Apache Flink&apos;s Engine Room</a>,&#x201D; <em>flink.apache.org</em>, March 13, 2015.</p>
</li>
<li><p>Mostafa Mokhtar: &#x201C;<a href="http://hortonworks.com/blog/hive-0-14-cost-based-optimizer-cbo-technical-overview/" target="_blank">Hive 0.14 Cost Based Optimizer (CBO) Technical Overview</a>,&#x201D; <em>hortonworks.com</em>, March 2, 2015.</p>
</li>
<li><p>Michael Armbrust, Reynold S Xin, Cheng Lian, et al.: &#x201C;<a href="http://people.csail.mit.edu/matei/papers/2015/sigmod_spark_sql.pdf" target="_blank">Spark SQL: Relational Data Processing in Spark</a>,&#x201D; at <em>ACM International Conference on Management of Data</em> (SIGMOD), June 2015. <a href="http://dx.doi.org/10.1145/2723372.2742797" target="_blank">doi:10.1145/2723372.2742797</a></p>
</li>
<li><p>Daniel Blazevski: &#x201C;<a href="http://insightdataengineering.com/blog/flink-knn/" target="_blank">Planting Quadtrees for Apache Flink</a>,&#x201D; <em>insightdataengineering.com</em>, March 25, 2016.</p>
</li>
<li><p>Tom White: &#x201C;<a href="http://blog.cloudera.com/blog/2016/04/genome-analysis-toolkit-now-using-apache-spark-for-data-processing/" target="_blank">Genome Analysis Toolkit: Now Using Apache Spark for Data Processing</a>,&#x201D; <em>blog.cloudera.com</em>, April 6, 2016.</p>
</li>
</ol>
<hr>
<table>
<thead>
<tr>
<th>&#x4E0A;&#x4E00;&#x7AE0;</th>
<th>&#x76EE;&#x5F55;</th>
<th>&#x4E0B;&#x4E00;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><a href="part-iii.html">&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#xFF1A;&#x6D3E;&#x751F;&#x6570;&#x636E;</a></td>
<td><a href="./">&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;</a></td>
<td><a href="ch11.html">&#x7B2C;&#x5341;&#x4E00;&#x7AE0;&#xFF1A;&#x6D41;&#x5904;&#x7406;</a></td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="part-iii.html" class="navigation navigation-prev " aria-label="Previous page: 第三部分：衍生数据">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch11.html" class="navigation navigation-next " aria-label="Next page: 第十一章：流处理">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十章：批处理","level":"1.5.1","depth":2,"next":{"title":"第十一章：流处理","level":"1.5.2","depth":2,"path":"ch11.md","ref":"ch11.md","articles":[]},"previous":{"title":"第三部分：衍生数据","level":"1.5","depth":1,"path":"part-iii.md","ref":"part-iii.md","articles":[{"title":"第十章：批处理","level":"1.5.1","depth":2,"path":"ch10.md","ref":"ch10.md","articles":[]},{"title":"第十一章：流处理","level":"1.5.2","depth":2,"path":"ch11.md","ref":"ch11.md","articles":[]},{"title":"第十二章：数据系统的未来","level":"1.5.3","depth":2,"path":"ch12.md","ref":"ch12.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing","mathjax-pro","livereload"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/ddia"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"livereload":{},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch10.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-21T05:58:49.715Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

