
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第二章：数据模型与查询语言 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch3.html" />
    
    
    <link rel="prev" href="ch1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第二章：数据模型与查询语言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2-&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E0E;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;">2. &#x6570;&#x636E;&#x6A21;&#x578B;&#x4E0E;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;</h1>
<p><img src="img/ch2.png" alt=""></p>
<blockquote>
<p>&#x8BED;&#x8A00;&#x7684;&#x8FB9;&#x754C;&#x5C31;&#x662F;&#x601D;&#x60F3;&#x7684;&#x8FB9;&#x754C;&#x3002;</p>
<p>&#x2014;&#x2014; &#x8DEF;&#x5FB7;&#x7EF4;&#x5947;&#xB7;&#x7EF4;&#x7279;&#x6839;&#x65AF;&#x5766;&#xFF0C;&#x300A;&#x903B;&#x8F91;&#x54F2;&#x5B66;&#x300B;&#xFF08;1922&#xFF09;</p>
</blockquote>
<hr>
<p>[TOC]</p>
<p>&#x6570;&#x636E;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x5F71;&#x54CD;&#x5982;&#x6B64;&#x6DF1;&#x8FDC;&#xFF1A;&#x4E0D;&#x4EC5;&#x4EC5;&#x5F71;&#x54CD;&#x7740;&#x8F6F;&#x4EF6;&#x7684;&#x7F16;&#x5199;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x4E14;&#x5F71;&#x54CD;&#x7740;&#x6211;&#x4EEC;&#x7684;<strong>&#x89E3;&#x9898;&#x601D;&#x8DEF;</strong>&#x3002;</p>
<p>&#x591A;&#x6570;&#x5E94;&#x7528;&#x4F7F;&#x7528;&#x5C42;&#x5C42;&#x53E0;&#x52A0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x6784;&#x5EFA;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x5C42;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x5173;&#x952E;&#x95EE;&#x9898;&#x662F;&#xFF1A;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x7528;&#x4F4E;&#x4E00;&#x5C42;&#x6570;&#x636E;&#x6A21;&#x578B;&#x6765;<strong>&#x8868;&#x793A;</strong>&#x7684;&#xFF1F;&#x4F8B;&#x5982;&#xFF1A;</p>
<ol>
<li>&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x4F60;&#x89C2;&#x5BDF;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#xFF08;&#x91CC;&#x9762;&#x6709;&#x4EBA;&#x5458;&#xFF0C;&#x7EC4;&#x7EC7;&#xFF0C;&#x8D27;&#x7269;&#xFF0C;&#x884C;&#x4E3A;&#xFF0C;&#x8D44;&#x91D1;&#x6D41;&#x5411;&#xFF0C;&#x4F20;&#x611F;&#x5668;&#x7B49;&#xFF09;&#xFF0C;&#x5E76;&#x91C7;&#x7528;&#x5BF9;&#x8C61;&#x6216;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x53CA;&#x64CD;&#x63A7;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;API&#x6765;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002;&#x90A3;&#x4E9B;&#x7ED3;&#x6784;&#x901A;&#x5E38;&#x662F;&#x7279;&#x5B9A;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x3002;</li>
<li>&#x5F53;&#x8981;&#x5B58;&#x50A8;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x901A;&#x7528;&#x6570;&#x636E;&#x6A21;&#x578B;&#x6765;&#x8868;&#x793A;&#x5B83;&#x4EEC;&#xFF0C;&#x5982;JSON&#x6216;XML&#x6587;&#x6863;&#xFF0C;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x8868;&#x3001;&#x6216;&#x56FE;&#x6A21;&#x578B;&#x3002;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x9009;&#x5B9A;&#x5982;&#x4F55;&#x4EE5;&#x5185;&#x5B58;&#x3001;&#x78C1;&#x76D8;&#x6216;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x5B57;&#x8282;&#x6765;&#x8868;&#x793A;JSON/XML/&#x5173;&#x7CFB;/&#x56FE;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x7C7B;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x4F7F;&#x6570;&#x636E;&#x6709;&#x53EF;&#x80FD;&#x4EE5;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x67E5;&#x8BE2;&#xFF0C;&#x641C;&#x7D22;&#xFF0C;&#x64CD;&#x7EB5;&#x548C;&#x5904;&#x7406;&#x3002;</li>
<li>&#x5728;&#x66F4;&#x4F4E;&#x7684;&#x5C42;&#x6B21;&#x4E0A;&#xFF0C;&#x786C;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x5DF2;&#x7ECF;&#x60F3;&#x51FA;&#x4E86;&#x4F7F;&#x7528;&#x7535;&#x6D41;&#xFF0C;&#x5149;&#x8109;&#x51B2;&#xFF0C;&#x78C1;&#x573A;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x4E1C;&#x897F;&#x6765;&#x8868;&#x793A;&#x5B57;&#x8282;&#x7684;&#x65B9;&#x6CD5;&#x3002;</li>
</ol>
<p>&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4E2D;&#x95F4;&#x5C42;&#x6B21;&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x4E8E;API&#x7684;API&#xFF0C;&#x4E0D;&#x8FC7;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF1A;&#x6BCF;&#x4E2A;&#x5C42;&#x90FD;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x6765;&#x9690;&#x85CF;&#x66F4;&#x4F4E;&#x5C42;&#x6B21;&#x4E2D;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#x5141;&#x8BB8;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x7FA4;&#x6709;&#x6548;&#x5730;&#x534F;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x548C;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF09;&#x3002;</p>
<p>&#x6570;&#x636E;&#x6A21;&#x578B;&#x79CD;&#x7C7B;&#x7E41;&#x591A;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x90FD;&#x5E26;&#x6709;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x7684;&#x8BBE;&#x60F3;&#x3002;&#x6709;&#x4E9B;&#x7528;&#x6CD5;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x6709;&#x4E9B;&#x5219;&#x4E0D;&#x652F;&#x6301;&#x5982;&#x6B64;&#xFF1B;&#x6709;&#x4E9B;&#x64CD;&#x4F5C;&#x8FD0;&#x884C;&#x5F88;&#x5FEB;&#xFF0C;&#x6709;&#x4E9B;&#x5219;&#x8868;&#x73B0;&#x5F88;&#x5DEE;&#xFF1B;&#x6709;&#x4E9B;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x975E;&#x5E38;&#x81EA;&#x7136;&#xFF0C;&#x6709;&#x4E9B;&#x5219;&#x5F88;&#x9EBB;&#x70E6;&#x3002;</p>
<p>&#x638C;&#x63E1;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x591A;&#x7CBE;&#x529B;&#xFF08;&#x60F3;&#x60F3;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5EFA;&#x6A21;&#x6709;&#x591A;&#x5C11;&#x672C;&#x4E66;&#xFF09;&#x3002;&#x5373;&#x4FBF;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x4E0D;&#x7528;&#x64CD;&#x5FC3;&#x5176;&#x5185;&#x90E8;&#x5DE5;&#x4F5C;&#x673A;&#x5236;&#xFF0C;&#x6784;&#x5EFA;&#x8F6F;&#x4EF6;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5BF9;&#x4E0A;&#x5C42;&#x8F6F;&#x4EF6;&#x7684;&#x529F;&#x80FD;&#xFF08;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x4E0D;&#x80FD;&#x505A;&#x4EC0;&#x4E48;&#xFF09;&#x6709;&#x7740;&#x81F3;&#x6DF1;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x6240;&#x4EE5;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x4E00;&#x7CFB;&#x5217;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x548C;&#x67E5;&#x8BE2;&#x7684;&#x901A;&#x7528;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF08;&#x524D;&#x9762;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x7B2C;2&#x70B9;&#xFF09;&#x3002;&#x7279;&#x522B;&#x5730;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6BD4;&#x8F83;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#xFF0C;&#x6587;&#x6863;&#x6A21;&#x578B;&#x548C;&#x5C11;&#x91CF;&#x57FA;&#x4E8E;&#x56FE;&#x5F62;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5C06;&#x67E5;&#x770B;&#x5404;&#x79CD;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x5E76;&#x6BD4;&#x8F83;&#x5B83;&#x4EEC;&#x7684;&#x7528;&#x4F8B;&#x3002;&#x5728;&#x7B2C;3&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#xFF08;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x7B2C;3&#x70B9;&#xFF09;&#x3002;</p>
<h2 id="&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x4E0E;&#x6587;&#x6863;&#x6A21;&#x578B;">&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x4E0E;&#x6587;&#x6863;&#x6A21;&#x578B;</h2>
<p>&#x73B0;&#x5728;&#x6700;&#x8457;&#x540D;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x662F;SQL&#x3002;&#x5B83;&#x57FA;&#x4E8E;Edgar Codd&#x5728;1970&#x5E74;&#x63D0;&#x51FA;&#x7684;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x3010;1&#x3011;&#xFF1A;&#x6570;&#x636E;&#x88AB;&#x7EC4;&#x7EC7;&#x6210;<strong>&#x5173;&#x7CFB;</strong>&#xFF08;SQL&#x4E2D;&#x79F0;&#x4F5C;<strong>&#x8868;</strong>&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5173;&#x7CFB;&#x662F;<strong>&#x5143;&#x7EC4;</strong>&#xFF08;SQL&#x4E2D;&#x79F0;&#x4F5C;<strong>&#x884C;</strong>)&#x7684;&#x65E0;&#x5E8F;&#x96C6;&#x5408;&#x3002;</p>
<p>&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x66FE;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x8BBA;&#x6027;&#x7684;&#x63D0;&#x8BAE;&#xFF0C;&#x5F53;&#x65F6;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x6000;&#x7591;&#x662F;&#x5426;&#x80FD;&#x591F;&#x6709;&#x6548;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x7136;&#x800C;&#x5230;&#x4E86;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x4E2D;&#x671F;&#xFF0C;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF08;RDBMSes&#xFF09;&#x548C;SQL&#x5DF2;&#x6210;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4EEC;&#x5B58;&#x50A8;&#x548C;&#x67E5;&#x8BE2;&#x67D0;&#x4E9B;&#x5E38;&#x89C4;&#x7ED3;&#x6784;&#x7684;&#x6570;&#x636E;&#x7684;&#x9996;&#x9009;&#x5DE5;&#x5177;&#x3002;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x5DF2;&#x7ECF;&#x6301;&#x7EED;&#x79F0;&#x9738;&#x4E86;&#x5927;&#x7EA6;25~30&#x5E74;&#x2014;&#x2014;&#x8FD9;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x53F2;&#x6765;&#x8BF4;&#x662F;&#x6781;&#x5176;&#x6F2B;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x8D77;&#x6E90;&#x4E8E;&#x5546;&#x4E1A;&#x6570;&#x636E;&#x5904;&#x7406;&#xFF0C;&#x5728;20&#x4E16;&#x7EAA;60&#x5E74;&#x4EE3;&#x548C;70&#x5E74;&#x4EE3;&#x7528;&#x5927;&#x578B;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x6267;&#x884C;&#x3002;&#x4ECE;&#x4ECA;&#x5929;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x90A3;&#x4E9B;&#x7528;&#x4F8B;&#x663E;&#x5F97;&#x5F88;&#x5E73;&#x5E38;&#xFF1A;&#x5178;&#x578B;&#x7684;<strong>&#x4E8B;&#x52A1;&#x5904;&#x7406;</strong>&#xFF08;&#x5C06;&#x9500;&#x552E;&#x6216;&#x94F6;&#x884C;&#x4EA4;&#x6613;&#xFF0C;&#x822A;&#x7A7A;&#x516C;&#x53F8;&#x9884;&#x8BA2;&#xFF0C;&#x5E93;&#x5B58;&#x7BA1;&#x7406;&#x4FE1;&#x606F;&#x8BB0;&#x5F55;&#x5728;&#x5E93;&#xFF09;&#x548C;<strong>&#x6279;&#x5904;&#x7406;</strong>&#xFF08;&#x5BA2;&#x6237;&#x53D1;&#x7968;&#xFF0C;&#x5DE5;&#x8D44;&#x5355;&#xFF0C;&#x62A5;&#x544A;&#xFF09;&#x3002;</p>
<p>&#x5F53;&#x65F6;&#x7684;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5E93;&#x8FEB;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x6570;&#x636E;&#x5E93;&#x5185;&#x90E8;&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x3002;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x81F4;&#x529B;&#x4E8E;&#x5C06;&#x4E0A;&#x8FF0;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x9690;&#x85CF;&#x5728;&#x66F4;&#x7B80;&#x6D01;&#x7684;&#x63A5;&#x53E3;&#x4E4B;&#x540E;&#x3002;</p>
<p>&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x548C;&#x67E5;&#x8BE2;&#x65B9;&#x9762;&#x5B58;&#x5728;&#x7740;&#x8BB8;&#x591A;&#x76F8;&#x4E92;&#x7ADE;&#x4E89;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5728;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x548C;80&#x5E74;&#x4EE3;&#x521D;&#xFF0C;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x548C;&#x5206;&#x5C42;&#x6A21;&#x578B;&#x66FE;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x968F;&#x540E;&#x5360;&#x636E;&#x4E86;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#x3002;&#x5BF9;&#x8C61;&#x6570;&#x636E;&#x5E93;&#x5728;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x672B;&#x548C;90&#x5E74;&#x4EE3;&#x521D;&#x6765;&#x4E86;&#x53C8;&#x53BB;&#x3002;XML&#x6570;&#x636E;&#x5E93;&#x5728;&#x4E8C;&#x5341;&#x4E00;&#x4E16;&#x7EAA;&#x521D;&#x51FA;&#x73B0;&#xFF0C;&#x4F46;&#x53EA;&#x6709;&#x5C0F;&#x4F17;&#x91C7;&#x7528;&#x8FC7;&#x3002;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x7684;&#x6BCF;&#x4E2A;&#x7ADE;&#x4E89;&#x8005;&#x90FD;&#x5728;&#x5176;&#x65F6;&#x4EE3;&#x4EA7;&#x751F;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7092;&#x4F5C;&#xFF0C;&#x4F46;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x6301;&#x7EED;&#x3010;2&#x3011;&#x3002;</p>
<p>&#x968F;&#x7740;&#x7535;&#x8111;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x5927;&#x548C;&#x4E92;&#x8054;&#xFF0C;&#x5B83;&#x4EEC;&#x5F00;&#x59CB;&#x7528;&#x4E8E;&#x65E5;&#x76CA;&#x591A;&#x6837;&#x5316;&#x7684;&#x76EE;&#x7684;&#x3002;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x975E;&#x5E38;&#x6210;&#x529F;&#x5730;&#x88AB;&#x63A8;&#x5E7F;&#x5230;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x539F;&#x59CB;&#x8303;&#x56F4;&#x4E4B;&#x5916;&#x66F4;&#x4E3A;&#x5E7F;&#x6CDB;&#x7684;&#x7528;&#x4F8B;&#x4E0A;&#x3002;&#x4F60;&#x4ECA;&#x5929;&#x5728;&#x7F51;&#x4E0A;&#x770B;&#x5230;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4F9D;&#x65E7;&#x662F;&#x7531;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x6765;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x7EBF;&#x53D1;&#x5E03;&#xFF0C;&#x8BA8;&#x8BBA;&#xFF0C;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#xFF0C;&#x7535;&#x5B50;&#x5546;&#x52A1;&#xFF0C;&#x6E38;&#x620F;&#xFF0C;&#x8F6F;&#x4EF6;&#x5373;&#x670D;&#x52A1;&#x751F;&#x4EA7;&#x529B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7B49;&#x7B49;&#x5185;&#x5BB9;&#x3002;</p>
<h3 id="nosql&#x7684;&#x8BDE;&#x751F;">NoSQL&#x7684;&#x8BDE;&#x751F;</h3>
<p>&#x73B0;&#x5728; - 2010&#x5E74;&#x4EE3;&#xFF0C;NoSQL&#x5F00;&#x59CB;&#x4E86;&#x6700;&#x65B0;&#x4E00;&#x8F6E;&#x5C1D;&#x8BD5;&#xFF0C;&#x8BD5;&#x56FE;&#x63A8;&#x7FFB;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x7684;&#x7EDF;&#x6CBB;&#x5730;&#x4F4D;&#x3002;&#x201C;NoSQL&#x201D;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x8BA9;&#x4EBA;&#x9057;&#x61BE;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x5E76;&#x6CA1;&#x6709;&#x6D89;&#x53CA;&#x5230;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7684;&#x6280;&#x672F;&#x3002;&#x6700;&#x521D;&#x5B83;&#x53EA;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x9192;&#x76EE;&#x7684;Twitter&#x6807;&#x7B7E;&#xFF0C;&#x7528;&#x5728;2009&#x5E74;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x975E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x7684;&#x5F00;&#x6E90;&#x805A;&#x4F1A;&#x4E0A;&#x3002;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x89E6;&#x52A8;&#x4E86;&#x67D0;&#x4E9B;&#x795E;&#x7ECF;&#xFF0C;&#x5E76;&#x8FC5;&#x901F;&#x5728;&#x7F51;&#x7EDC;&#x521B;&#x4E1A;&#x793E;&#x533A;&#x5185;&#x5916;&#x4F20;&#x64AD;&#x5F00;&#x6765;&#x3002;&#x597D;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x73B0;&#x5728;&#x90FD;&#x4E0E;<em>#NoSQL#</em>&#x6807;&#x7B7E;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x5E76;&#x4E14;NoSQL&#x88AB;&#x8FFD;&#x6EAF;&#x6027;&#x5730;&#x91CD;&#x65B0;&#x89E3;&#x91CA;&#x4E3A;<strong>&#x4E0D;&#x4EC5;&#x662F;SQL&#xFF08;Not Only SQL&#xFF09;</strong> &#x3010;4&#x3011;&#x3002;</p>
<p>&#x91C7;&#x7528;NoSQL&#x6570;&#x636E;&#x5E93;&#x7684;&#x80CC;&#x540E;&#x6709;&#x51E0;&#x4E2A;&#x9A71;&#x52A8;&#x56E0;&#x7D20;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x9700;&#x8981;&#x6BD4;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#xFF0C;&#x5305;&#x62EC;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x6216;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x5199;&#x5165;&#x541E;&#x5410;&#x91CF;</li>
<li>&#x76F8;&#x6BD4;&#x5546;&#x4E1A;&#x6570;&#x636E;&#x5E93;&#x4EA7;&#x54C1;&#xFF0C;&#x514D;&#x8D39;&#x548C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x66F4;&#x53D7;&#x504F;&#x7231;&#x3002;</li>
<li>&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x652F;&#x6301;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;</li>
<li>&#x53D7;&#x632B;&#x4E8E;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x7684;&#x9650;&#x5236;&#x6027;&#xFF0C;&#x6E34;&#x671B;&#x4E00;&#x79CD;&#x66F4;&#x5177;&#x591A;&#x52A8;&#x6001;&#x6027;&#x4E0E;&#x8868;&#x73B0;&#x529B;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3010;5&#x3011;</li>
</ul>
<p>&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x4F8B;&#x7684;&#x6700;&#x4F73;&#x6280;&#x672F;&#x9009;&#x62E9;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4F8B;&#x7684;&#x6700;&#x4F73;&#x6280;&#x672F;&#x9009;&#x62E9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x53EF;&#x9884;&#x89C1;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4F3C;&#x4E4E;&#x53EF;&#x80FD;&#x4F1A;&#x7EE7;&#x7EED;&#x4E0E;&#x5404;&#x79CD;&#x975E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x8D77;&#x4F7F;&#x7528; - &#x8FD9;&#x79CD;&#x60F3;&#x6CD5;&#x6709;&#x65F6;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6DF7;&#x5408;&#x6301;&#x4E45;&#x5316;&#xFF08;polyglot persistence&#xFF09;</strong>&#x3002;</p>
<h3 id="&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#x4E0D;&#x5339;&#x914D;">&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#x4E0D;&#x5339;&#x914D;</h3>
<p>&#x76EE;&#x524D;&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x90FD;&#x4F7F;&#x7528;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x5F00;&#x53D1;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x5BF9;SQL&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x666E;&#x904D;&#x6279;&#x8BC4;&#xFF1A;&#x5982;&#x679C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x5173;&#x7CFB;&#x8868;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7B28;&#x62D9;&#x7684;&#x8F6C;&#x6362;&#x5C42;&#xFF0C;&#x5904;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x548C;&#x8868;&#xFF0C;&#x884C;&#xFF0C;&#x5217;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x3002;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x4E0D;&#x8FDE;&#x8D2F;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x963B;&#x6297;&#x4E0D;&#x5339;&#x914D;&#xFF08;impedance mismatch&#xFF09;</strong><sup><a href="#fn_i" id="reffn_i">i</a></sup>&#x3002;</p>
<blockquote id="fn_i">
<sup>i</sup>. &#x4E00;&#x4E2A;&#x4ECE;&#x7535;&#x5B50;&#x5B66;&#x501F;&#x7528;&#x7684;&#x672F;&#x8BED;&#x3002;&#x6BCF;&#x4E2A;&#x7535;&#x8DEF;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x90FD;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x963B;&#x6297;&#xFF08;&#x4EA4;&#x6D41;&#x7535;&#x963B;&#xFF09;&#x3002;&#x5F53;&#x4F60;&#x5C06;&#x4E00;&#x4E2A;&#x7535;&#x8DEF;&#x7684;&#x8F93;&#x51FA;&#x8FDE;&#x63A5;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7535;&#x8DEF;&#x7684;&#x8F93;&#x5165;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7535;&#x8DEF;&#x7684;&#x8F93;&#x51FA;&#x548C;&#x8F93;&#x5165;&#x963B;&#x6297;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x8FDE;&#x63A5;&#x4E0A;&#x7684;&#x529F;&#x7387;&#x4F20;&#x8F93;&#x5C06;&#x88AB;&#x6700;&#x5927;&#x5316;&#x3002;&#x963B;&#x6297;&#x4E0D;&#x5339;&#x914D;&#x4F1A;&#x5BFC;&#x81F4;&#x4FE1;&#x53F7;&#x53CD;&#x5C04;&#x53CA;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#x3002;<a href="#reffn_i" title="Jump back to footnote [i] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x50CF;ActiveRecord&#x548C;Hibernate&#x8FD9;&#x6837;&#x7684; <strong>&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#x6620;&#x5C04;&#xFF08;ORM object-relational mapping&#xFF09;</strong> &#x6846;&#x67B6;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x8FD9;&#x4E2A;&#x8F6C;&#x6362;&#x5C42;&#x6240;&#x9700;&#x7684;&#x6837;&#x677F;&#x4EE3;&#x7801;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x9690;&#x85CF;&#x8FD9;&#x4E24;&#x4E2A;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<p><img src="img/fig2-1.png" alt=""></p>
<p><strong>&#x56FE;2-1 &#x4F7F;&#x7528;&#x5173;&#x7CFB;&#x578B;&#x6A21;&#x5F0F;&#x6765;&#x8868;&#x793A;&#x9886;&#x82F1;&#x7B80;&#x4ECB;</strong></p>
<p>&#x4F8B;&#x5982;&#xFF0C;<a href="img/fig2-1.png">&#x56FE;2-1</a>&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5728;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#x4E2D;&#x8868;&#x793A;&#x7B80;&#x5386;&#xFF08;&#x4E00;&#x4E2A;LinkedIn&#x7B80;&#x4ECB;&#xFF09;&#x3002;&#x6574;&#x4E2A;&#x7B80;&#x4ECB;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x6807;&#x8BC6;&#x7B26;<code>user_id</code>&#x6765;&#x6807;&#x8BC6;&#x3002;&#x50CF;<code>first_name</code>&#x548C;<code>last_name</code>&#x8FD9;&#x6837;&#x7684;&#x5B57;&#x6BB5;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x53EA;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5728;User&#x8868;&#x4E0A;&#x5C06;&#x5176;&#x5EFA;&#x6A21;&#x4E3A;&#x5217;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x5728;&#x804C;&#x4E1A;&#x751F;&#x6DAF;&#x4E2D;&#x62E5;&#x6709;&#x591A;&#x4E8E;&#x4E00;&#x4EFD;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EBA;&#x4EEC;&#x53EF;&#x80FD;&#x6709;&#x4E0D;&#x540C;&#x6837;&#x7684;&#x6559;&#x80B2;&#x9636;&#x6BB5;&#x548C;&#x4EFB;&#x610F;&#x6570;&#x91CF;&#x7684;&#x8054;&#x7CFB;&#x4FE1;&#x606F;&#x3002;&#x4ECE;&#x7528;&#x6237;&#x5230;&#x8FD9;&#x4E9B;&#x9879;&#x76EE;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x8868;&#x793A;&#xFF1A;</p>
<ul>
<li>&#x4F20;&#x7EDF;SQL&#x6A21;&#x578B;&#xFF08;SQL&#xFF1A;1999&#x4E4B;&#x524D;&#xFF09;&#x4E2D;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x89C4;&#x8303;&#x5316;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x662F;&#x5C06;&#x804C;&#x4F4D;&#xFF0C;&#x6559;&#x80B2;&#x548C;&#x8054;&#x7CFB;&#x4FE1;&#x606F;&#x653E;&#x5728;&#x5355;&#x72EC;&#x7684;&#x8868;&#x4E2D;&#xFF0C;&#x5BF9;User&#x8868;&#x63D0;&#x4F9B;&#x5916;&#x952E;&#x5F15;&#x7528;&#xFF0C;&#x5982;<a href="img/fig2-1.png">&#x56FE;2-1</a>&#x6240;&#x793A;&#x3002;</li>
<li>&#x540E;&#x7EED;&#x7684;SQL&#x6807;&#x51C6;&#x589E;&#x52A0;&#x4E86;&#x5BF9;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;XML&#x6570;&#x636E;&#x7684;&#x652F;&#x6301;;&#x8FD9;&#x5141;&#x8BB8;&#x5C06;&#x591A;&#x503C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x5355;&#x884C;&#x5185;&#xFF0C;&#x5E76;&#x652F;&#x6301;&#x5728;&#x8FD9;&#x4E9B;&#x6587;&#x6863;&#x5185;&#x67E5;&#x8BE2;&#x548C;&#x7D22;&#x5F15;&#x3002;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x5728;Oracle&#xFF0C;IBM DB2&#xFF0C;MS SQL Server&#x548C;PostgreSQL&#x4E2D;&#x90FD;&#x6709;&#x4E0D;&#x540C;&#x7A0B;&#x5EA6;&#x7684;&#x652F;&#x6301;&#x3010;6,7&#x3011;&#x3002;JSON&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E5F;&#x5F97;&#x5230;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5305;&#x62EC;IBM DB2&#xFF0C;MySQL&#x548C;PostgreSQL &#x3010;8&#x3011;&#x3002;</li>
<li>&#x7B2C;&#x4E09;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x5C06;&#x804C;&#x4E1A;&#xFF0C;&#x6559;&#x80B2;&#x548C;&#x8054;&#x7CFB;&#x4FE1;&#x606F;&#x7F16;&#x7801;&#x4E3A;JSON&#x6216;XML&#x6587;&#x6863;&#xFF0C;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6587;&#x672C;&#x5217;&#x4E2D;&#xFF0C;&#x5E76;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x89E3;&#x6790;&#x5176;&#x7ED3;&#x6784;&#x548C;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x79CD;&#x914D;&#x7F6E;&#x4E0B;&#xFF0C;&#x901A;&#x5E38;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x6765;&#x67E5;&#x8BE2;&#x8BE5;&#x7F16;&#x7801;&#x5217;&#x4E2D;&#x7684;&#x503C;&#x3002;</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x50CF;&#x7B80;&#x5386;&#x8FD9;&#x6837;&#x81EA;&#x5305;&#x542B;&#x6587;&#x6863;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x800C;&#x8A00;&#xFF0C;JSON&#x8868;&#x793A;&#x662F;&#x975E;&#x5E38;&#x5408;&#x9002;&#x7684;&#xFF1A;&#x53C2;&#x89C1;<a href="">&#x4F8B;2-1</a>&#x3002;JSON&#x6BD4;XML&#x66F4;&#x7B80;&#x5355;&#x3002;&#x9762;&#x5411;&#x6587;&#x6863;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x5982;MongoDB &#x3010;9&#x3011;&#xFF0C;RethinkDB &#x3010;10&#x3011;&#xFF0C;CouchDB &#x3010;11&#x3011;&#x548C;Espresso&#x3010;12&#x3011;&#xFF09;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;</p>
<p><strong>&#x4F8B;2-1. &#x7528;JSON&#x6587;&#x6863;&#x8868;&#x793A;&#x4E00;&#x4E2A;LinkedIn&#x7B80;&#x4ECB;</strong></p>
<pre><code class="lang-json">{
  <span class="hljs-string">&quot;user_id&quot;</span>: <span class="hljs-number">251</span>,
  <span class="hljs-string">&quot;first_name&quot;</span>: <span class="hljs-string">&quot;Bill&quot;</span>,
  <span class="hljs-string">&quot;last_name&quot;</span>: <span class="hljs-string">&quot;Gates&quot;</span>,
  <span class="hljs-string">&quot;summary&quot;</span>: <span class="hljs-string">&quot;Co-chair of the Bill &amp; Melinda Gates... Active blogger.&quot;</span>,
  <span class="hljs-string">&quot;region_id&quot;</span>: <span class="hljs-string">&quot;us:91&quot;</span>,
  <span class="hljs-string">&quot;industry_id&quot;</span>: <span class="hljs-number">131</span>,
  <span class="hljs-string">&quot;photo_url&quot;</span>: <span class="hljs-string">&quot;/p/7/000/253/05b/308dd6e.jpg&quot;</span>,
  <span class="hljs-string">&quot;positions&quot;</span>: [
    {
      <span class="hljs-string">&quot;job_title&quot;</span>: <span class="hljs-string">&quot;Co-chair&quot;</span>,
      <span class="hljs-string">&quot;organization&quot;</span>: <span class="hljs-string">&quot;Bill &amp; Melinda Gates Foundation&quot;</span>
    },
    {
      <span class="hljs-string">&quot;job_title&quot;</span>: <span class="hljs-string">&quot;Co-founder, Chairman&quot;</span>,
      <span class="hljs-string">&quot;organization&quot;</span>: <span class="hljs-string">&quot;Microsoft&quot;</span>
    }
  ],
  <span class="hljs-string">&quot;education&quot;</span>: [
    {
      <span class="hljs-string">&quot;school_name&quot;</span>: <span class="hljs-string">&quot;Harvard University&quot;</span>,
      <span class="hljs-string">&quot;start&quot;</span>: <span class="hljs-number">1973</span>,
      <span class="hljs-string">&quot;end&quot;</span>: <span class="hljs-number">1975</span>
    },
    {
      <span class="hljs-string">&quot;school_name&quot;</span>: <span class="hljs-string">&quot;Lakeside School, Seattle&quot;</span>,
      <span class="hljs-string">&quot;start&quot;</span>: <span class="hljs-literal">null</span>,
      <span class="hljs-string">&quot;end&quot;</span>: <span class="hljs-literal">null</span>
    }
  ],
  <span class="hljs-string">&quot;contact_info&quot;</span>: {
    <span class="hljs-string">&quot;blog&quot;</span>: <span class="hljs-string">&quot;http://thegatesnotes.com&quot;</span>,
    <span class="hljs-string">&quot;twitter&quot;</span>: <span class="hljs-string">&quot;http://twitter.com/BillGates&quot;</span>
  }
}
</code></pre>
<p>&#x6709;&#x4E00;&#x4E9B;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BA4;&#x4E3A;JSON&#x6A21;&#x578B;&#x51CF;&#x5C11;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x548C;&#x5B58;&#x50A8;&#x5C42;&#x4E4B;&#x95F4;&#x7684;&#x963B;&#x6297;&#x4E0D;&#x5339;&#x914D;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch4.html">&#x7B2C;4&#x7AE0;</a>&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;JSON&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x4E5F;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;&#x7F3A;&#x4E4F;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x5F80;&#x5F80;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x4F18;&#x52BF;;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="#&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x7075;&#x6D3B;&#x6027;">&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x7075;&#x6D3B;&#x6027;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>JSON&#x8868;&#x793A;&#x6BD4;<a href="img/fig2-1.png">&#x56FE;2-1</a>&#x4E2D;&#x7684;&#x591A;&#x8868;&#x6A21;&#x5F0F;&#x5177;&#x6709;&#x66F4;&#x597D;&#x7684;<strong>&#x5C40;&#x90E8;&#x6027;&#xFF08;locality&#xFF09;</strong>&#x3002;&#x5982;&#x679C;&#x5728;&#x524D;&#x9762;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x793A;&#x4F8B;&#x4E2D;&#x83B7;&#x53D6;&#x7B80;&#x4ECB;&#xFF0C;&#x90A3;&#x9700;&#x8981;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x67E5;&#x8BE2;&#xFF08;&#x901A;&#x8FC7;<code>user_id</code>&#x67E5;&#x8BE2;&#x6BCF;&#x4E2A;&#x8868;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x5728;User&#x8868;&#x4E0E;&#x5176;&#x4E0B;&#x5C5E;&#x8868;&#x4E4B;&#x95F4;&#x6DF7;&#x4E71;&#x5730;&#x6267;&#x884C;&#x591A;&#x8DEF;&#x8FDE;&#x63A5;&#x3002;&#x800C;&#x5728;JSON&#x8868;&#x793A;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x90FD;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
<p>&#x4ECE;&#x7528;&#x6237;&#x7B80;&#x4ECB;&#x6587;&#x4EF6;&#x5230;&#x7528;&#x6237;&#x804C;&#x4F4D;&#xFF0C;&#x6559;&#x80B2;&#x5386;&#x53F2;&#x548C;&#x8054;&#x7CFB;&#x4FE1;&#x606F;&#xFF0C;&#x8FD9;&#x79CD;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x9690;&#x542B;&#x4E86;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x800C;JSON&#x8868;&#x793A;&#x4F7F;&#x5F97;&#x8FD9;&#x4E2A;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x53D8;&#x5F97;&#x660E;&#x786E;&#xFF08;&#x89C1;<a href="img/fig2-2.png">&#x56FE;2-2</a>&#xFF09;&#x3002;</p>
<p><img src="img/fig2-2.png" alt=""></p>
<p><strong>&#x56FE;2-2 &#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x6811;&#x7ED3;&#x6784;</strong></p>
<h3 id="&#x591A;&#x5BF9;&#x4E00;&#x548C;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;">&#x591A;&#x5BF9;&#x4E00;&#x548C;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;</h3>
<p>&#x5728;&#x4E0A;&#x4E00;&#x8282;&#x7684;<a href="">&#x4F8B;2-1</a>&#x4E2D;&#xFF0C;<code>region_id</code>&#x548C;<code>industry_id</code>&#x662F;&#x4EE5;ID&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7EAF;&#x5B57;&#x7B26;&#x4E32;&#x201C;Greater Seattle Area&#x201D;&#x548C;&#x201C;Philanthropy&#x201D;&#x7684;&#x5F62;&#x5F0F;&#x7ED9;&#x51FA;&#x7684;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x5982;&#x679C;&#x7528;&#x6237;&#x754C;&#x9762;&#x7528;&#x4E00;&#x4E2A;&#x81EA;&#x7531;&#x6587;&#x672C;&#x5B57;&#x6BB5;&#x6765;&#x8F93;&#x5165;&#x533A;&#x57DF;&#x548C;&#x884C;&#x4E1A;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x4ED6;&#x4EEC;&#x5B58;&#x50A8;&#x4E3A;&#x7EAF;&#x6587;&#x672C;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x5408;&#x7406;&#x7684;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x5F0F;&#x662F;&#x7ED9;&#x51FA;&#x5730;&#x7406;&#x533A;&#x57DF;&#x548C;&#x884C;&#x4E1A;&#x7684;&#x6807;&#x51C6;&#x5316;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x5E76;&#x8BA9;&#x7528;&#x6237;&#x4ECE;&#x4E0B;&#x62C9;&#x5217;&#x8868;&#x6216;&#x81EA;&#x52A8;&#x586B;&#x5145;&#x5668;&#x4E2D;&#x8FDB;&#x884C;&#x9009;&#x62E9;&#xFF0C;&#x5176;&#x4F18;&#x52BF;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5404;&#x4E2A;&#x7B80;&#x4ECB;&#x4E4B;&#x95F4;&#x6837;&#x5F0F;&#x548C;&#x62FC;&#x5199;&#x7EDF;&#x4E00;</li>
<li>&#x907F;&#x514D;&#x6B67;&#x4E49;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x51E0;&#x4E2A;&#x540C;&#x540D;&#x7684;&#x57CE;&#x5E02;&#xFF09;</li>
<li>&#x6613;&#x4E8E;&#x66F4;&#x65B0;&#x2014;&#x2014;&#x540D;&#x79F0;&#x53EA;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x66F4;&#x6539;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x4E8E;&#x653F;&#x6CBB;&#x4E8B;&#x4EF6;&#x800C;&#x6539;&#x53D8;&#x57CE;&#x5E02;&#x540D;&#x79F0;&#xFF09;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x8FDB;&#x884C;&#x5168;&#x9762;&#x66F4;&#x65B0;&#x3002;</li>
<li>&#x672C;&#x5730;&#x5316;&#x652F;&#x6301;&#x2014;&#x2014;&#x5F53;&#x7F51;&#x7AD9;&#x7FFB;&#x8BD1;&#x6210;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x6807;&#x51C6;&#x5316;&#x7684;&#x5217;&#x8868;&#x53EF;&#x4EE5;&#x88AB;&#x672C;&#x5730;&#x5316;&#xFF0C;&#x4F7F;&#x5F97;&#x5730;&#x533A;&#x548C;&#x884C;&#x4E1A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x663E;&#x793A;</li>
<li>&#x66F4;&#x597D;&#x7684;&#x641C;&#x7D22;&#x2014;&#x2014;&#x4F8B;&#x5982;&#xFF0C;&#x641C;&#x7D22;&#x534E;&#x76DB;&#x987F;&#x5DDE;&#x7684;&#x6148;&#x5584;&#x5BB6;&#x5C31;&#x4F1A;&#x5339;&#x914D;&#x8FD9;&#x4EFD;&#x7B80;&#x4ECB;&#xFF0C;&#x56E0;&#x4E3A;&#x5730;&#x533A;&#x5217;&#x8868;&#x53EF;&#x4EE5;&#x7F16;&#x7801;&#x8BB0;&#x5F55;&#x897F;&#x96C5;&#x56FE;&#x5728;&#x534E;&#x76DB;&#x987F;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#xFF08;&#x4ECE;&#x201C;Greater Seattle Area&#x201D;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#xFF09;</li>
</ul>
<p>&#x5B58;&#x50A8;ID&#x8FD8;&#x662F;&#x6587;&#x672C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x662F;&#x4E2A; <strong>&#x526F;&#x672C;&#xFF08;duplication&#xFF09;</strong> &#x95EE;&#x9898;&#x3002;&#x5F53;&#x4F7F;&#x7528;ID&#x65F6;&#xFF0C;&#x5BF9;&#x4EBA;&#x7C7B;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x6BD4;&#x5982;&#x5355;&#x8BCD;&#xFF1A;Philanthropy&#xFF09;&#x53EA;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x5904;&#xFF0C;&#x6240;&#x6709;&#x5F15;&#x7528;&#x5B83;&#x7684;&#x5730;&#x65B9;&#x4F7F;&#x7528;ID&#xFF08;ID&#x53EA;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6709;&#x610F;&#x4E49;&#xFF09;&#x3002;&#x5F53;&#x76F4;&#x63A5;&#x5B58;&#x50A8;&#x6587;&#x672C;&#x65F6;&#xFF0C;&#x5BF9;&#x4EBA;&#x7C7B;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4FE1;&#x606F;&#x4F1A;&#x590D;&#x5236;&#x5728;&#x6BCF;&#x5904;&#x4F7F;&#x7528;&#x8BB0;&#x5F55;&#x4E2D;&#x3002;</p>
<p>&#x4F7F;&#x7528;ID&#x7684;&#x597D;&#x5904;&#x662F;&#xFF0C;ID&#x5BF9;&#x4EBA;&#x7C7B;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x800C;&#x6C38;&#x8FDC;&#x4E0D;&#x9700;&#x8981;&#x6539;&#x53D8;&#xFF1A;ID&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x6807;&#x8BC6;&#x7684;&#x4FE1;&#x606F;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x4EFB;&#x4F55;&#x5BF9;&#x4EBA;&#x7C7B;&#x6709;&#x610F;&#x4E49;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x5C06;&#x6765;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#x6539;&#x53D8;&#x2014;&#x2014;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x88AB;&#x590D;&#x5236;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5197;&#x4F59;&#x526F;&#x672C;&#x90FD;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x3002;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x5199;&#x5165;&#x5F00;&#x9500;&#xFF0C;&#x4E5F;&#x5B58;&#x5728;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x98CE;&#x9669;&#xFF08;&#x4E00;&#x4E9B;&#x526F;&#x672C;&#x88AB;&#x66F4;&#x65B0;&#x4E86;&#xFF0C;&#x8FD8;&#x6709;&#x4E9B;&#x526F;&#x672C;&#x6CA1;&#x6709;&#x88AB;&#x66F4;&#x65B0;&#xFF09;&#x3002;&#x53BB;&#x9664;&#x6B64;&#x7C7B;&#x91CD;&#x590D;&#x662F;&#x6570;&#x636E;&#x5E93; <strong>&#x89C4;&#x8303;&#x5316;&#xFF08;normalization&#xFF09;</strong> &#x7684;&#x5173;&#x952E;&#x601D;&#x60F3;&#x3002;<sup><a href="#fn_ii" id="reffn_ii">ii</a></sup></p>
<blockquote id="fn_ii">
<sup>ii</sup>. &#x5173;&#x4E8E;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x7684;&#x6587;&#x732E;&#x533A;&#x5206;&#x4E86;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x89C4;&#x8303;&#x5F62;&#x5F0F;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x533A;&#x522B;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#x3002;&#x4E00;&#x4E2A;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x91CD;&#x590D;&#x5B58;&#x50A8;&#x4E86;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x7684;&#x503C;&#xFF0C;&#x5219;&#x6A21;&#x5F0F;&#x5C31;&#x4E0D;&#x662F;<strong>&#x89C4;&#x8303;&#x5316;&#xFF08;normalized&#xFF09;</strong>&#x7684;&#x3002;<a href="#reffn_ii" title="Jump back to footnote [ii] in the text."> &#x21A9;</a>
</blockquote>
<blockquote>
<p>&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x5458;&#x548C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x559C;&#x6B22;&#x4E89;&#x8BBA;&#x89C4;&#x8303;&#x5316;&#x548C;&#x975E;&#x89C4;&#x8303;&#x5316;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6682;&#x65F6;&#x4FDD;&#x7559;&#x5224;&#x65AD;&#x5427;&#x3002;&#x5728;&#x672C;&#x4E66;&#x7684;<a href="part-iii.html">&#x7B2C;&#x4E09;&#x90E8;&#x5206;</a>&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x8BDD;&#x9898;&#xFF0C;&#x63A2;&#x8BA8;&#x7CFB;&#x7EDF;&#x7684;&#x65B9;&#x6CD5;&#x7528;&#x4EE5;&#x5904;&#x7406;&#x7F13;&#x5B58;&#xFF0C;&#x975E;&#x89C4;&#x8303;&#x5316;&#x548C;&#x884D;&#x751F;&#x6570;&#x636E;&#x3002;</p>
</blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x89C4;&#x8303;&#x5316;&#x9700;&#x8981;&#x591A;&#x5BF9;&#x4E00;&#x7684;&#x5173;&#x7CFB;&#xFF08;&#x8BB8;&#x591A;&#x4EBA;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5730;&#x533A;&#xFF0C;&#x8BB8;&#x591A;&#x4EBA;&#x5728;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x884C;&#x4E1A;&#x5DE5;&#x4F5C;&#xFF09;&#xFF0C;&#x8FD9;&#x4E0E;&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E0D;&#x592A;&#x543B;&#x5408;&#x3002;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;ID&#x6765;&#x5F15;&#x7528;&#x5176;&#x4ED6;&#x8868;&#x4E2D;&#x7684;&#x884C;&#x662F;&#x6B63;&#x5E38;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FDE;&#x63A5;&#x5F88;&#x5BB9;&#x6613;&#x3002;&#x5728;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4E00;&#x5BF9;&#x591A;&#x6811;&#x7ED3;&#x6784;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7528;&#x8FDE;&#x63A5;&#xFF0C;&#x5BF9;&#x8FDE;&#x63A5;&#x7684;&#x652F;&#x6301;&#x901A;&#x5E38;&#x5F88;&#x5F31;<sup><a href="#fn_iii" id="reffn_iii">iii</a></sup>&#x3002;</p>
<blockquote id="fn_iii">
<sup>iii</sup>. &#x5728;&#x64B0;&#x5199;&#x672C;&#x6587;&#x65F6;&#xFF0C;RethinkDB&#x652F;&#x6301;&#x8FDE;&#x63A5;&#xFF0C;MongoDB&#x4E0D;&#x652F;&#x6301;&#x8FDE;&#x63A5;&#xFF0C;&#x800C;CouchDB&#x53EA;&#x652F;&#x6301;&#x9884;&#x5148;&#x58F0;&#x660E;&#x7684;&#x89C6;&#x56FE;&#x3002;<a href="#reffn_iii" title="Jump back to footnote [iii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x672C;&#x8EAB;&#x4E0D;&#x652F;&#x6301;&#x8FDE;&#x63A5;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x901A;&#x8FC7;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x591A;&#x4E2A;&#x67E5;&#x8BE2;&#x6765;&#x6A21;&#x62DF;&#x8FDE;&#x63A5;&#x3002;&#xFF08;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x5730;&#x533A;&#x548C;&#x884C;&#x4E1A;&#x7684;&#x5217;&#x8868;&#x53EF;&#x80FD;&#x5F88;&#x5C0F;&#xFF0C;&#x6539;&#x52A8;&#x5F88;&#x5C11;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5176;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x6267;&#x884C;&#x8FDE;&#x63A5;&#x7684;&#x5DE5;&#x4F5C;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x88AB;&#x8F6C;&#x79FB;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E0A;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5373;&#x4FBF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6700;&#x521D;&#x7248;&#x672C;&#x9002;&#x5408;&#x65E0;&#x8FDE;&#x63A5;&#x7684;&#x6587;&#x6863;&#x6A21;&#x578B;&#xFF0C;&#x968F;&#x7740;&#x529F;&#x80FD;&#x6DFB;&#x52A0;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4E92;&#x8054;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x5BF9;&#x7B80;&#x5386;&#x4F8B;&#x5B50;&#x8FDB;&#x884C;&#x7684;&#x4E00;&#x4E9B;&#x4FEE;&#x6539;&#xFF1A;</p>
<p><strong><em>&#x7EC4;&#x7EC7;&#x548C;&#x5B66;&#x6821;&#x4F5C;&#x4E3A;&#x5B9E;&#x4F53;</em></strong></p>
<p>&#x5728;&#x524D;&#x9762;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#xFF0C;<code>organization</code>&#xFF08;&#x7528;&#x6237;&#x5DE5;&#x4F5C;&#x7684;&#x516C;&#x53F8;&#xFF09;&#x548C;<code>school_name</code>&#xFF08;&#x4ED6;&#x4EEC;&#x5B66;&#x4E60;&#x7684;&#x5730;&#x65B9;&#xFF09;&#x53EA;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x4E5F;&#x8BB8;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x662F;&#x5BF9;&#x5B9E;&#x4F53;&#x7684;&#x5F15;&#x7528;&#x5462;&#xFF1F;&#x7136;&#x540E;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EC4;&#x7EC7;&#xFF0C;&#x5B66;&#x6821;&#x6216;&#x5927;&#x5B66;&#x90FD;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7F51;&#x9875;&#xFF08;&#x6807;&#x8BC6;&#xFF0C;&#x65B0;&#x95FB;&#x63D0;&#x8981;&#x7B49;&#xFF09;&#x3002;&#x6BCF;&#x4E2A;&#x7B80;&#x5386;&#x53EF;&#x4EE5;&#x94FE;&#x63A5;&#x5230;&#x5B83;&#x6240;&#x63D0;&#x5230;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x5B66;&#x6821;&#xFF0C;&#x5E76;&#x4E14;&#x5305;&#x62EC;&#x4ED6;&#x4EEC;&#x7684;&#x56FE;&#x6807;&#x548C;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#xFF08;&#x53C2;&#x89C1;<a href="img/fig2-3.png">&#x56FE;2-3</a>&#xFF0C;&#x6765;&#x81EA;LinkedIn&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF09;&#x3002;</p>
<p><strong><em>&#x63A8;&#x8350;</em></strong></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x529F;&#x80FD;&#xFF1A;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x5199;&#x4E00;&#x4E2A;&#x63A8;&#x8350;&#x3002;&#x5728;&#x7528;&#x6237;&#x7684;&#x7B80;&#x5386;&#x4E0A;&#x663E;&#x793A;&#x63A8;&#x8350;&#xFF0C;&#x5E76;&#x9644;&#x4E0A;&#x63A8;&#x8350;&#x7528;&#x6237;&#x7684;&#x59D3;&#x540D;&#x548C;&#x7167;&#x7247;&#x3002;&#x5982;&#x679C;&#x63A8;&#x8350;&#x4EBA;&#x66F4;&#x65B0;&#x4ED6;&#x4EEC;&#x7684;&#x7167;&#x7247;&#xFF0C;&#x90A3;&#x4ED6;&#x4EEC;&#x5199;&#x7684;&#x4EFB;&#x4F55;&#x5EFA;&#x8BAE;&#x90FD;&#x9700;&#x8981;&#x663E;&#x793A;&#x65B0;&#x7684;&#x7167;&#x7247;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x63A8;&#x8350;&#x5E94;&#x8BE5;&#x62E5;&#x6709;&#x4F5C;&#x8005;&#x4E2A;&#x4EBA;&#x7B80;&#x4ECB;&#x7684;&#x5F15;&#x7528;&#x3002;
<img src="img/fig2-3.png" alt=""></p>
<p><strong>&#x56FE;2-3 &#x516C;&#x53F8;&#x540D;&#x4E0D;&#x4EC5;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x516C;&#x53F8;&#x5B9E;&#x4F53;&#x7684;&#x94FE;&#x63A5;&#xFF08;LinkedIn&#x622A;&#x56FE;&#xFF09;</strong></p>
<p><a href="img/fig2-4.png">&#x56FE;2-4</a>&#x9610;&#x660E;&#x4E86;&#x8FD9;&#x4E9B;&#x65B0;&#x529F;&#x80FD;&#x9700;&#x8981;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x3002;&#x6BCF;&#x4E2A;&#x865A;&#x7EBF;&#x77E9;&#x5F62;&#x5185;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x5206;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x5355;&#x4F4D;&#xFF0C;&#x5B66;&#x6821;&#x548C;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x7684;&#x5F15;&#x7528;&#x9700;&#x8981;&#x8868;&#x793A;&#x6210;&#x5F15;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x67E5;&#x8BE2;&#x65F6;&#x9700;&#x8981;&#x8FDE;&#x63A5;&#x3002;</p>
<p><img src="img/fig2-4.png" alt=""></p>
<p><strong>&#x56FE;2-4 &#x4F7F;&#x7528;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x6269;&#x5C55;&#x7B80;&#x5386;</strong></p>
<h3 id="&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5426;&#x5728;&#x91CD;&#x8E48;&#x8986;&#x8F99;&#xFF1F;">&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5426;&#x5728;&#x91CD;&#x8E48;&#x8986;&#x8F99;&#xFF1F;</h3>
<p>&#x5728;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x8FDE;&#x63A5;&#x5DF2;&#x5E38;&#x89C4;&#x7528;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x548C;NoSQL&#x91CD;&#x542F;&#x4E86;&#x8FA9;&#x8BBA;&#xFF1A;&#x5982;&#x4F55;&#x6700;&#x597D;&#x5730;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8868;&#x793A;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x3002;&#x90A3;&#x573A;&#x8FA9;&#x8BBA;&#x53EF;&#x6BD4;NoSQL&#x53E4;&#x8001;&#x5F97;&#x591A;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6700;&#x65E9;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x5316;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5904;&#x7406;&#x6570;&#x636E;&#x5E93;&#x662F;IBM&#x7684;&#x4FE1;&#x606F;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF08;IMS&#xFF09;&#xFF0C;&#x6700;&#x521D;&#x662F;&#x4E3A;&#x4E86;&#x963F;&#x6CE2;&#x7F57;&#x592A;&#x7A7A;&#x8BA1;&#x5212;&#x7684;&#x5E93;&#x5B58;&#x7BA1;&#x7406;&#x800C;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x5E76;&#x4E8E;1968&#x5E74;&#x6709;&#x4E86;&#x9996;&#x6B21;&#x5546;&#x4E1A;&#x53D1;&#x5E03;&#x3010;13&#x3011;&#x3002;&#x76EE;&#x524D;&#x5B83;&#x4ECD;&#x5728;&#x4F7F;&#x7528;&#x548C;&#x7EF4;&#x62A4;&#xFF0C;&#x8FD0;&#x884C;&#x5728;IBM&#x5927;&#x578B;&#x673A;&#x7684;OS/390&#x4E0A;&#x3010;14&#x3011;&#x3002;</p>
<p>IMS&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x5C42;&#x6B21;&#x6A21;&#x578B;&#xFF08;hierarchical model&#xFF09;</strong>&#xFF0C;&#x5B83;&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x7684;JSON&#x6A21;&#x578B;&#x6709;&#x4E00;&#x4E9B;&#x60CA;&#x4EBA;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x3010;2&#x3011;&#x3002;&#x5B83;&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x8868;&#x793A;&#x4E3A;&#x5D4C;&#x5957;&#x5728;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#x6811;&#xFF0C;&#x8FD9;&#x5F88;&#x50CF;<a href="img/fig2-2.png">&#x56FE;2-2</a>&#x7684;JSON&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x540C;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x6837;&#xFF0C;IMS&#x80FD;&#x826F;&#x597D;&#x5904;&#x7406;&#x4E00;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x96BE;&#x5E94;&#x5BF9;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x652F;&#x6301;&#x8FDE;&#x63A5;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x590D;&#x5236;&#xFF08;&#x975E;&#x89C4;&#x8303;&#x5316;&#xFF09;&#x6570;&#x636E;&#x6216;&#x624B;&#x52A8;&#x89E3;&#x51B3;&#x4ECE;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x7684;&#x5F15;&#x7528;&#x3002;&#x8FD9;&#x4E9B;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x516D;&#x4E03;&#x5341;&#x5E74;&#x4EE3;&#x7684;&#x95EE;&#x9898;&#x4E0E;&#x73B0;&#x5728;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9047;&#x5230;&#x7684;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x95EE;&#x9898;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3010;15&#x3011;&#x3002;</p>
<p>&#x90A3;&#x65F6;&#x4EBA;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6765;&#x89E3;&#x51B3;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x5C40;&#x9650;&#x6027;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x7A81;&#x51FA;&#x7684;&#x4E24;&#x4E2A;&#x662F;<strong>&#x5173;&#x7CFB;&#x6A21;&#x578B;&#xFF08;relational model&#xFF09;</strong>&#xFF08;&#x5B83;&#x53D8;&#x6210;&#x4E86;SQL&#xFF0C;&#x7EDF;&#x6CBB;&#x4E86;&#x4E16;&#x754C;&#xFF09;&#x548C;<strong>&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#xFF08;network model&#xFF09;</strong>&#xFF08;&#x6700;&#x521D;&#x5F88;&#x53D7;&#x5173;&#x6CE8;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x53D8;&#x5F97;&#x51B7;&#x95E8;&#xFF09;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x9635;&#x8425;&#x4E4B;&#x95F4;&#x7684;&#x201C;&#x5927;&#x8FA9;&#x8BBA;&#x201D;&#x5728;70&#x5E74;&#x4EE3;&#x6301;&#x7EED;&#x4E86;&#x5F88;&#x4E45;&#x65F6;&#x95F4;&#x3010;2&#x3011;&#x3002;</p>
<p>&#x90A3;&#x4E24;&#x4E2A;&#x6A21;&#x5F0F;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x4E0E;&#x5F53;&#x524D;&#x7684;&#x95EE;&#x9898;&#x76F8;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#x503C;&#x5F97;&#x7B80;&#x8981;&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#x90A3;&#x573A;&#x8FA9;&#x8BBA;&#x3002;</p>
<h4 id="&#x7F51;&#x7EDC;&#x6A21;&#x578B;">&#x7F51;&#x7EDC;&#x6A21;&#x578B;</h4>
<p>&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x7531;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x8BED;&#x8A00;&#x4F1A;&#x8BAE;&#xFF08;CODASYL&#xFF09;&#x7684;&#x59D4;&#x5458;&#x4F1A;&#x8FDB;&#x884C;&#x4E86;&#x6807;&#x51C6;&#x5316;&#xFF0C;&#x5E76;&#x88AB;&#x6570;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5546;&#x5B9E;&#x73B0;;&#x5B83;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;CODASYL&#x6A21;&#x578B;&#x3010;16&#x3011;&#x3002;</p>
<p>CODASYL&#x6A21;&#x578B;&#x662F;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x63A8;&#x5E7F;&#x3002;&#x5728;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7236;&#x8282;&#x70B9;&#xFF1B;&#x5728;&#x7F51;&#x7EDC;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x6BCF;&#x6761;&#x8BB0;&#x5F55;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E2A;&#x7236;&#x8282;&#x70B9;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x201C;Greater Seattle Area&#x201D;&#x5730;&#x533A;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C45;&#x4F4F;&#x5728;&#x8BE5;&#x5730;&#x533A;&#x7684;&#x7528;&#x6237;&#x90FD;&#x53EF;&#x4EE5;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x8054;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x5BF9;&#x591A;&#x5BF9;&#x4E00;&#x548C;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#x3002;</p>
<p>&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x4E2D;&#x8BB0;&#x5F55;&#x4E4B;&#x95F4;&#x7684;&#x94FE;&#x63A5;&#x4E0D;&#x662F;&#x5916;&#x952E;&#xFF0C;&#x800C;&#x66F4;&#x50CF;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6307;&#x9488;&#xFF08;&#x540C;&#x65F6;&#x4ECD;&#x7136;&#x5B58;&#x50A8;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#xFF09;&#x3002;&#x8BBF;&#x95EE;&#x8BB0;&#x5F55;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x8DDF;&#x968F;&#x4ECE;&#x6839;&#x8BB0;&#x5F55;&#x8D77;&#x6CBF;&#x8FD9;&#x4E9B;&#x94FE;&#x8DEF;&#x6240;&#x5F62;&#x6210;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#xFF08;access path&#xFF09;</strong>&#x3002;</p>
<p>&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x7C7B;&#x4F3C;&#x904D;&#x5386;&#x94FE;&#x8868;&#xFF1A;&#x4ECE;&#x5217;&#x8868;&#x5934;&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x6B21;&#x67E5;&#x770B;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x6240;&#x9700;&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x4F46;&#x5728;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x7684;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x6570;&#x6761;&#x4E0D;&#x540C;&#x7684;&#x8DEF;&#x5F84;&#x53EF;&#x4EE5;&#x5230;&#x8FBE;&#x76F8;&#x540C;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5FC5;&#x987B;&#x8DDF;&#x8E2A;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x3002;</p>
<p>CODASYL&#x4E2D;&#x7684;&#x67E5;&#x8BE2;&#x662F;&#x901A;&#x8FC7;&#x5229;&#x7528;&#x904D;&#x5386;&#x8BB0;&#x5F55;&#x5217;&#x548C;&#x8DDF;&#x968F;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x8868;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x79FB;&#x52A8;&#x6E38;&#x6807;&#x6765;&#x6267;&#x884C;&#x7684;&#x3002;&#x5982;&#x679C;&#x8BB0;&#x5F55;&#x6709;&#x591A;&#x4E2A;&#x7236;&#x7ED3;&#x70B9;&#xFF08;&#x5373;&#x591A;&#x4E2A;&#x6765;&#x81EA;&#x5176;&#x4ED6;&#x8BB0;&#x5F55;&#x7684;&#x4F20;&#x5165;&#x6307;&#x9488;&#xFF09;&#xFF0C;&#x5219;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x5FC5;&#x987B;&#x8DDF;&#x8E2A;&#x6240;&#x6709;&#x7684;&#x5404;&#x79CD;&#x5173;&#x7CFB;&#x3002;&#x751A;&#x81F3;CODASYL&#x59D4;&#x5458;&#x4F1A;&#x6210;&#x5458;&#x4E5F;&#x627F;&#x8BA4;&#xFF0C;&#x8FD9;&#x5C31;&#x50CF;&#x5728;n&#x7EF4;&#x6570;&#x636E;&#x7A7A;&#x95F4;&#x4E2D;&#x8FDB;&#x884C;&#x5BFC;&#x822A;&#x3010;17&#x3011;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x624B;&#x52A8;&#x9009;&#x62E9;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x591F;&#x80FD;&#x6700;&#x6709;&#x6548;&#x5730;&#x5229;&#x7528;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x975E;&#x5E38;&#x6709;&#x9650;&#x7684;&#x786C;&#x4EF6;&#x529F;&#x80FD;&#xFF08;&#x5982;&#x78C1;&#x5E26;&#x9A71;&#x52A8;&#x5668;&#xFF0C;&#x5176;&#x641C;&#x7D22;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x6162;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x4F7F;&#x5F97;&#x67E5;&#x8BE2;&#x548C;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x4E0D;&#x7075;&#x6D3B;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5206;&#x5C42;&#x8FD8;&#x662F;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x6240;&#x9700;&#x6570;&#x636E;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x5C31;&#x4F1A;&#x9677;&#x5165;&#x56F0;&#x5883;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#xFF0C;&#x4F46;&#x662F;&#x5FC5;&#x987B;&#x6D4F;&#x89C8;&#x5927;&#x91CF;&#x624B;&#x5199;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x91CD;&#x5199;&#x6765;&#x5904;&#x7406;&#x65B0;&#x7684;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x3002;&#x66F4;&#x6539;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x5F88;&#x96BE;&#x7684;&#x3002;</p>
<h4 id="&#x5173;&#x7CFB;&#x6A21;&#x578B;">&#x5173;&#x7CFB;&#x6A21;&#x578B;</h4>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5C06;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x653E;&#x5728;&#x5149;&#x5929;&#x5316;&#x65E5;&#x4E4B;&#x4E0B;&#xFF1A;&#x4E00;&#x4E2A; <strong>&#x5173;&#x7CFB;&#xFF08;&#x8868;&#xFF09;</strong> &#x53EA;&#x662F;&#x4E00;&#x4E2A; <strong>&#x5143;&#x7EC4;&#xFF08;&#x884C;&#xFF09;</strong> &#x7684;&#x96C6;&#x5408;&#xFF0C;&#x4EC5;&#x6B64;&#x800C;&#x5DF2;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x8FF7;&#x5BAB;&#x4F3C;&#x7684;&#x5D4C;&#x5957;&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x590D;&#x6742;&#x7684;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x9009;&#x4E2D;&#x7B26;&#x5408;&#x4EFB;&#x610F;&#x6761;&#x4EF6;&#x7684;&#x884C;&#xFF0C;&#x8BFB;&#x53D6;&#x8868;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x6216;&#x6240;&#x6709;&#x884C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x67D0;&#x4E9B;&#x5217;&#x4F5C;&#x4E3A;&#x5339;&#x914D;&#x5173;&#x952E;&#x5B57;&#x6765;&#x8BFB;&#x53D6;&#x7279;&#x5B9A;&#x884C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x8868;&#x4E2D;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x4E0E;&#x5176;&#x4ED6;&#x8868;&#x7684;&#x5916;&#x952E;&#x5173;&#x7CFB;<sup><a href="#fn_iv" id="reffn_iv">iv</a></sup>&#x3002;</p>
<blockquote id="fn_iv">
<sup>iv</sup>. &#x5916;&#x952E;&#x7EA6;&#x675F;&#x5141;&#x8BB8;&#x5BF9;&#x4FEE;&#x6539;&#x7EA6;&#x675F;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x5FC5;&#x9009;&#x9879;&#x3002;&#x5373;&#x4F7F;&#x6709;&#x7EA6;&#x675F;&#xFF0C;&#x5916;&#x952E;&#x8FDE;&#x63A5;&#x5728;&#x67E5;&#x8BE2;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x5728;CODASYL&#x4E2D;&#xFF0C;&#x8FDE;&#x63A5;&#x5728;&#x63D2;&#x5165;&#x65F6;&#x9AD8;&#x6548;&#x5B8C;&#x6210;&#x3002;<a href="#reffn_iv" title="Jump back to footnote [iv] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x81EA;&#x52A8;&#x51B3;&#x5B9A;&#x67E5;&#x8BE2;&#x7684;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x4EE5;&#x54EA;&#x4E2A;&#x987A;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x54EA;&#x4E9B;&#x7D22;&#x5F15;&#x3002;&#x8FD9;&#x4E9B;&#x9009;&#x62E9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x201C;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x201D;&#xFF0C;&#x4F46;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x5B83;&#x4EEC;&#x662F;&#x7531;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7531;&#x7A0B;&#x5E8F;&#x5458;&#x751F;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5F88;&#x5C11;&#x9700;&#x8981;&#x8003;&#x8651;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60F3;&#x6309;&#x65B0;&#x7684;&#x65B9;&#x5F0F;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x67E5;&#x8BE2;&#x4F1A;&#x81EA;&#x52A8;&#x4F7F;&#x7528;&#x6700;&#x5408;&#x9002;&#x7684;&#x90A3;&#x4E9B;&#x7D22;&#x5F15;&#x3002;&#x65E0;&#x9700;&#x66F4;&#x6539;&#x67E5;&#x8BE2;&#x6765;&#x5229;&#x7528;&#x65B0;&#x7684;&#x7D22;&#x5F15;&#x3002;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="#&#x7528;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;">&#x7528;&#x4E8E;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;</a>&#x201D;&#x3002;&#xFF09;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x56E0;&#x6B64;&#x4F7F;&#x6DFB;&#x52A0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65B0;&#x529F;&#x80FD;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x662F;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x5DF2;&#x8017;&#x8D39;&#x4E86;&#x591A;&#x5E74;&#x7684;&#x7814;&#x7A76;&#x548C;&#x5F00;&#x53D1;&#x7CBE;&#x529B;&#x3010;18&#x3011;&#x3002;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x6D1E;&#x5BDF;&#x662F;&#xFF1A;&#x53EA;&#x9700;&#x6784;&#x5EFA;&#x4E00;&#x6B21;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#xFF0C;&#x968F;&#x540E;&#x4F7F;&#x7528;&#x8BE5;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6240;&#x6709;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x4E2D;&#x53D7;&#x76CA;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x4E3A;&#x7279;&#x5B9A;&#x67E5;&#x8BE2;&#x624B;&#x52A8;&#x7F16;&#x5199;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x6BD4;&#x7F16;&#x5199;&#x901A;&#x7528;&#x4F18;&#x5316;&#x5668;&#x66F4;&#x5BB9;&#x6613;&#x2014;&#x2014;&#x4E0D;&#x8FC7;&#x4ECE;&#x957F;&#x671F;&#x770B;&#x901A;&#x7528;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x66F4;&#x597D;&#x3002;</p>
<h4 id="&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x76F8;&#x6BD4;">&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x76F8;&#x6BD4;</h4>
<p>&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x8FD8;&#x539F;&#x4E3A;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#xFF1A;&#x5728;&#x5176;&#x7236;&#x8BB0;&#x5F55;&#x4E2D;&#x5B58;&#x50A8;&#x5D4C;&#x5957;&#x8BB0;&#x5F55;&#xFF08;<a href="">&#x56FE;2-1</a>&#x4E2D;&#x7684;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#xFF0C;&#x5982;<code>positions</code>&#xFF0C;<code>education</code>&#x548C;<code>contact_info</code>&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x5355;&#x72EC;&#x7684;&#x8868;&#x4E2D;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x8868;&#x793A;&#x591A;&#x5BF9;&#x4E00;&#x548C;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#x65F6;&#xFF0C;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x548C;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x5E76;&#x6CA1;&#x6709;&#x6839;&#x672C;&#x7684;&#x4E0D;&#x540C;&#xFF1A;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x76F8;&#x5173;&#x9879;&#x76EE;&#x90FD;&#x88AB;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x5728;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x4E2D;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5916;&#x952E;</strong>&#xFF0C;&#x5728;&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x79F0;&#x4E3A;<strong>&#x6587;&#x6863;&#x5F15;&#x7528;</strong>&#x3010;9&#x3011;&#x3002;&#x8BE5;&#x6807;&#x8BC6;&#x7B26;&#x5728;&#x8BFB;&#x53D6;&#x65F6;&#x901A;&#x8FC7;&#x8FDE;&#x63A5;&#x6216;&#x540E;&#x7EED;&#x67E5;&#x8BE2;&#x6765;&#x89E3;&#x6790;&#x3002;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#xFF0C;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x6CA1;&#x6709;&#x8D70;CODASYL&#x7684;&#x8001;&#x8DEF;&#x3002;</p>
<h3 id="&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x5728;&#x4ECA;&#x65E5;&#x7684;&#x5BF9;&#x6BD4;">&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x5728;&#x4ECA;&#x65E5;&#x7684;&#x5BF9;&#x6BD4;</h3>
<p>&#x5C06;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8BB8;&#x591A;&#x65B9;&#x9762;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5305;&#x62EC;&#x5B83;&#x4EEC;&#x7684;&#x5BB9;&#x9519;&#x5C5E;&#x6027;&#xFF08;&#x53C2;&#x9605;<a href="ch5.html">&#x7B2C;5&#x7AE0;</a>&#xFF09;&#x548C;&#x5904;&#x7406;&#x5E76;&#x53D1;&#x6027;&#xFF08;&#x53C2;&#x9605;<a href="ch7.html">&#x7B2C;7&#x7AE0;</a>&#xFF09;&#x3002;&#x672C;&#x7AE0;&#x5C06;&#x53EA;&#x5173;&#x6CE8;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x652F;&#x6301;&#x6587;&#x6863;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x4E3B;&#x8981;&#x8BBA;&#x636E;&#x662F;&#x67B6;&#x6784;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x56E0;&#x5C40;&#x90E8;&#x6027;&#x800C;&#x62E5;&#x6709;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x800C;&#x8A00;&#x66F4;&#x63A5;&#x8FD1;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x901A;&#x8FC7;&#x4E3A;&#x8FDE;&#x63A5;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x652F;&#x6301;&#x4EE5;&#x53CA;&#x652F;&#x6301;&#x591A;&#x5BF9;&#x4E00;&#x548C;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#x6765;&#x53CD;&#x51FB;&#x3002;</p>
<h4 id="&#x54EA;&#x79CD;&#x6570;&#x636E;&#x6A21;&#x578B;&#x66F4;&#x6709;&#x52A9;&#x4E8E;&#x7B80;&#x5316;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#xFF1F;">&#x54EA;&#x79CD;&#x6570;&#x636E;&#x6A21;&#x578B;&#x66F4;&#x6709;&#x52A9;&#x4E8E;&#x7B80;&#x5316;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#xFF1F;</h4>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5177;&#x6709;&#x7C7B;&#x4F3C;&#x6587;&#x6863;&#x7684;&#x7ED3;&#x6784;&#xFF08;&#x5373;&#xFF0C;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x6811;&#xFF0C;&#x901A;&#x5E38;&#x4E00;&#x6B21;&#x6027;&#x52A0;&#x8F7D;&#x6574;&#x4E2A;&#x6811;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528;&#x6587;&#x6863;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x3002;&#x5C06;&#x7C7B;&#x4F3C;&#x6587;&#x6863;&#x7684;&#x7ED3;&#x6784;&#x5206;&#x89E3;&#x6210;&#x591A;&#x4E2A;&#x8868;&#xFF08;&#x5982;<a href="img/fig2-1.png">&#x56FE;2-1</a>&#x4E2D;&#x7684;<code>positions</code>&#xFF0C;<code>education</code>&#x548C;<code>contact_info</code>&#xFF09;&#x7684;&#x5173;&#x7CFB;&#x6280;&#x672F;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7E41;&#x7410;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x6587;&#x6863;&#x6A21;&#x578B;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x5D4C;&#x5957;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x8BF4;&#x201C;&#x7528;&#x6237;251&#x7684;&#x4F4D;&#x7F6E;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x9879;&#x201D;&#xFF08;&#x5F88;&#x50CF;&#x5206;&#x5C42;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x6587;&#x4EF6;&#x5D4C;&#x5957;&#x4E0D;&#x592A;&#x6DF1;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x5BF9;&#x8FDE;&#x63A5;&#x7684;&#x7CDF;&#x7CD5;&#x652F;&#x6301;&#x53EF;&#x80FD;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x5206;&#x6790;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x6765;&#x8BB0;&#x5F55;&#x4F55;&#x65F6;&#x4F55;&#x5730;&#x53D1;&#x751F;&#x4E86;&#x4F55;&#x4E8B;&#xFF0C;&#x90A3;&#x4E48;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x4E5F;&#x7528;&#x4E0D;&#x4E0A;&#x3002;&#x3010;19&#x3011;&#x3002;</p>
<p>&#x4F46;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x786E;&#x5B9E;&#x4F1A;&#x7528;&#x5230;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4E48;&#x6587;&#x6863;&#x6A21;&#x578B;&#x5C31;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x8BF1;&#x4EBA;&#x4E86;&#x3002;&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53CD;&#x89C4;&#x8303;&#x5316;&#x6765;&#x6D88;&#x9664;&#x5BF9;&#x8FDE;&#x63A5;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x8FD9;&#x9700;&#x8981;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x6765;&#x505A;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x4EE5;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x5C3D;&#x7BA1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5411;&#x6570;&#x636E;&#x5E93;&#x53D1;&#x51FA;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x6A21;&#x62DF;&#x8FDE;&#x63A5;&#xFF0C;&#x4F46;&#x8FD9;&#x4E5F;&#x5C06;&#x590D;&#x6742;&#x6027;&#x8F6C;&#x79FB;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x6BD4;&#x7531;&#x6570;&#x636E;&#x5E93;&#x5185;&#x7684;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x66F4;&#x6162;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;&#x6587;&#x6863;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x4E0E;&#x66F4;&#x5DEE;&#x7684;&#x6027;&#x80FD;&#x3010;15&#x3011;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x8BF4;&#x54EA;&#x79CD;&#x6570;&#x636E;&#x6A21;&#x578B;&#x66F4;&#x6709;&#x52A9;&#x4E8E;&#x7B80;&#x5316;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53D6;&#x51B3;&#x4E8E;&#x6570;&#x636E;&#x9879;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x79CD;&#x7C7B;&#x3002;&#x5BF9;&#x9AD8;&#x5EA6;&#x5173;&#x8054;&#x7684;&#x6570;&#x636E;&#x800C;&#x8A00;&#xFF0C;&#x6587;&#x6863;&#x6A21;&#x578B;&#x662F;&#x6781;&#x5176;&#x7CDF;&#x7CD5;&#x7684;&#xFF0C;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x800C;&#x9009;&#x7528;&#x56FE;&#x5F62;&#x6A21;&#x578B;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x56FE;&#x6570;&#x636E;&#x6A21;&#x578B;">&#x56FE;&#x6570;&#x636E;&#x6A21;&#x578B;</a>&#x201D;&#xFF09;&#x662F;&#x6700;&#x81EA;&#x7136;&#x7684;&#x3002;</p>
<h4 id="&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x67B6;&#x6784;&#x7075;&#x6D3B;&#x6027;">&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x67B6;&#x6784;&#x7075;&#x6D3B;&#x6027;</h4>
<p>&#x5927;&#x591A;&#x6570;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4EE5;&#x53CA;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;JSON&#x652F;&#x6301;&#x90FD;&#x4E0D;&#x4F1A;&#x5F3A;&#x5236;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x91C7;&#x7528;&#x4F55;&#x79CD;&#x6A21;&#x5F0F;&#x3002;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684;XML&#x652F;&#x6301;&#x901A;&#x5E38;&#x5E26;&#x6709;&#x53EF;&#x9009;&#x7684;&#x6A21;&#x5F0F;&#x9A8C;&#x8BC1;&#x3002;&#x6CA1;&#x6709;&#x6A21;&#x5F0F;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x5C06;&#x4EFB;&#x610F;&#x7684;&#x952E;&#x548C;&#x503C;&#x6DFB;&#x52A0;&#x5230;&#x6587;&#x6863;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5BF9;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x6587;&#x6863;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x7684;&#x5B57;&#x6BB5;&#x3002;</p>
<p>&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x6709;&#x65F6;&#x79F0;&#x4E3A;<strong>&#x65E0;&#x6A21;&#x5F0F;&#xFF08;schemaless&#xFF09;</strong>&#xFF0C;&#x4F46;&#x8FD9;&#x5177;&#x6709;&#x8BEF;&#x5BFC;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x5047;&#x5B9A;&#x67D0;&#x79CD;&#x7ED3;&#x6784;&#x2014;&#x2014;&#x5373;&#x5B58;&#x5728;&#x9690;&#x5F0F;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x4E0D;&#x7531;&#x6570;&#x636E;&#x5E93;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x3010;20&#x3011;&#x3002;&#x4E00;&#x4E2A;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x672F;&#x8BED;&#x662F;<strong>&#x8BFB;&#x65F6;&#x6A21;&#x5F0F;&#xFF08;schema-on-read&#xFF09;</strong>&#xFF08;&#x6570;&#x636E;&#x7684;&#x7ED3;&#x6784;&#x662F;&#x9690;&#x542B;&#x7684;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x6570;&#x636E;&#x88AB;&#x8BFB;&#x53D6;&#x65F6;&#x624D;&#x88AB;&#x89E3;&#x91CA;&#xFF09;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x662F;<strong>&#x5199;&#x65F6;&#x6A21;&#x5F0F;&#xFF08;schema-on-write&#xFF09;</strong>&#xFF08;&#x4F20;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x6A21;&#x5F0F;&#x660E;&#x786E;&#xFF0C;&#x4E14;&#x6570;&#x636E;&#x5E93;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x7B26;&#x5408;&#x5176;&#x6A21;&#x5F0F;&#xFF09;&#x3010;21&#x3011;&#x3002;</p>
<p>&#x8BFB;&#x65F6;&#x6A21;&#x5F0F;&#x7C7B;&#x4F3C;&#x4E8E;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x52A8;&#x6001;&#xFF08;&#x8FD0;&#x884C;&#x65F6;&#xFF09;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#xFF0C;&#x800C;&#x5199;&#x65F6;&#x6A21;&#x5F0F;&#x7C7B;&#x4F3C;&#x4E8E;&#x9759;&#x6001;&#xFF08;&#x7F16;&#x8BD1;&#x65F6;&#xFF09;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;&#x5C31;&#x50CF;&#x9759;&#x6001;&#x548C;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x7684;&#x76F8;&#x5BF9;&#x4F18;&#x70B9;&#x5177;&#x6709;&#x5F88;&#x5927;&#x7684;&#x4E89;&#x8BAE;&#x6027;&#x4E00;&#x6837;&#x3010;22&#x3011;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6A21;&#x5F0F;&#x7684;&#x5F3A;&#x5236;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x6CA1;&#x6709;&#x6B63;&#x786E;&#x6216;&#x9519;&#x8BEF;&#x7684;&#x7B54;&#x6848;&#x3002;</p>
<p>&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x60F3;&#x8981;&#x6539;&#x53D8;&#x5176;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x5C24;&#x5176;&#x660E;&#x663E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x628A;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x5168;&#x540D;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x4E2D;&#xFF0C;&#x800C;&#x73B0;&#x5728;&#x60F3;&#x5206;&#x522B;&#x5B58;&#x50A8;&#x540D;&#x5B57;&#x548C;&#x59D3;&#x6C0F;&#x3010;23&#x3011;&#x3002;&#x5728;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x53EA;&#x9700;&#x5F00;&#x59CB;&#x5199;&#x5165;&#x5177;&#x6709;&#x65B0;&#x5B57;&#x6BB5;&#x7684;&#x65B0;&#x6587;&#x6863;&#xFF0C;&#x5E76;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x6765;&#x5904;&#x7406;&#x8BFB;&#x53D6;&#x65E7;&#x6587;&#x6863;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code class="lang-go"><span class="hljs-keyword">if</span> (user &amp;&amp; user.name &amp;&amp; !user.first_name) {
    <span class="hljs-comment">// Documents written before Dec 8, 2013 don&apos;t have first_name</span>
    user.first_name = user.name.split(<span class="hljs-string">&quot; &quot;</span>)[<span class="hljs-number">0</span>];
}
</code></pre>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5728;&#x201C;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x201D;&#x6570;&#x636E;&#x5E93;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x6267;&#x884C;&#x4EE5;&#x4E0B; <strong>&#x8FC1;&#x79FB;&#xFF08;migration&#xFF09;</strong> &#x64CD;&#x4F5C;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">ALTER</span> <span class="hljs-keyword">TABLE</span> <span class="hljs-keyword">users</span> <span class="hljs-keyword">ADD</span> <span class="hljs-keyword">COLUMN</span> first_name <span class="hljs-built_in">text</span>;
<span class="hljs-keyword">UPDATE</span> <span class="hljs-keyword">users</span> <span class="hljs-keyword">SET</span> first_name = split_part(<span class="hljs-keyword">name</span>, <span class="hljs-string">&apos; &apos;</span>, <span class="hljs-number">1</span>);         <span class="hljs-comment">-- PostgreSQL</span>
<span class="hljs-keyword">UPDATE</span> <span class="hljs-keyword">users</span> <span class="hljs-keyword">SET</span> first_name = substring_index(<span class="hljs-keyword">name</span>, <span class="hljs-string">&apos; &apos;</span>, <span class="hljs-number">1</span>);     <span class="hljs-comment">-- MySQL</span>
</code></pre>
<p>&#x6A21;&#x5F0F;&#x53D8;&#x66F4;&#x7684;&#x901F;&#x5EA6;&#x5F88;&#x6162;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x6C42;&#x505C;&#x8FD0;&#x3002;&#x5B83;&#x7684;&#x8FD9;&#x79CD;&#x574F;&#x540D;&#x8A89;&#x5E76;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x5E94;&#x5F97;&#x7684;&#xFF1A;&#x5927;&#x591A;&#x6570;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x53EF;&#x5728;&#x51E0;&#x6BEB;&#x79D2;&#x5185;&#x6267;&#x884C;<code>ALTER TABLE</code>&#x8BED;&#x53E5;&#x3002;MySQL&#x662F;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x4F8B;&#x5916;&#xFF0C;&#x5B83;&#x6267;&#x884C;<code>ALTER TABLE</code>&#x65F6;&#x4F1A;&#x590D;&#x5236;&#x6574;&#x4E2A;&#x8868;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x5728;&#x66F4;&#x6539;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x8868;&#x65F6;&#x4F1A;&#x82B1;&#x8D39;&#x51E0;&#x5206;&#x949F;&#x751A;&#x81F3;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x7684;&#x505C;&#x673A;&#x65F6;&#x95F4;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B58;&#x5728;&#x5404;&#x79CD;&#x5DE5;&#x5177;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#x3010;24,25,26&#x3011;&#x3002;</p>
<p>&#x5927;&#x578B;&#x8868;&#x4E0A;&#x8FD0;&#x884C;<code>UPDATE</code>&#x8BED;&#x53E5;&#x5728;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x5F88;&#x6162;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x884C;&#x90FD;&#x9700;&#x8981;&#x91CD;&#x5199;&#x3002;&#x8981;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x8BDD;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5C06;<code>first_name</code>&#x8BBE;&#x7F6E;&#x4E3A;&#x9ED8;&#x8BA4;&#x503C;<code>NULL</code>&#xFF0C;&#x5E76;&#x5728;&#x8BFB;&#x53D6;&#x65F6;&#x518D;&#x586B;&#x5145;&#xFF0C;&#x5C31;&#x50CF;&#x4F7F;&#x7528;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x5F53;&#x7531;&#x4E8E;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6570;&#x636E;&#x662F;&#x5F02;&#x6784;&#x7684;&#xFF09;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x9879;&#x76EE;&#x5E76;&#x4E0D;&#x90FD;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x6784;&#x65F6;,&#x8BFB;&#x65F6;&#x6A21;&#x5F0F;&#x66F4;&#x5177;&#x4F18;&#x52BF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#xFF1A;</p>
<ul>
<li>&#x5B58;&#x5728;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x653E;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x8868;&#x4E2D;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#x3002;</li>
<li>&#x6570;&#x636E;&#x7684;&#x7ED3;&#x6784;&#x7531;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#x51B3;&#x5B9A;&#x3002;&#x4F60;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#x4E14;&#x5B83;&#x968F;&#x65F6;&#x53EF;&#x80FD;&#x53D8;&#x5316;&#x3002;</li>
</ul>
<p>&#x5728;&#x4E0A;&#x8FF0;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6A21;&#x5F0F;&#x7684;&#x574F;&#x5904;&#x8FDC;&#x5927;&#x4E8E;&#x5B83;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x65E0;&#x6A21;&#x5F0F;&#x6587;&#x6863;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x81EA;&#x7136;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8981;&#x662F;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x90FD;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x6A21;&#x5F0F;&#x662F;&#x8BB0;&#x5F55;&#x5E76;&#x5F3A;&#x5236;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#x7684;&#x6709;&#x6548;&#x673A;&#x5236;&#x3002;&#x7B2C;&#x56DB;&#x7AE0;&#x5C06;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x6A21;&#x5F0F;&#x548C;&#x6A21;&#x5F0F;&#x6F14;&#x5316;&#x3002;</p>
<h4 id="&#x67E5;&#x8BE2;&#x7684;&#x6570;&#x636E;&#x5C40;&#x90E8;&#x6027;">&#x67E5;&#x8BE2;&#x7684;&#x6570;&#x636E;&#x5C40;&#x90E8;&#x6027;</h4>
<p>&#x6587;&#x6863;&#x901A;&#x5E38;&#x4EE5;&#x5355;&#x4E2A;&#x8FDE;&#x7EED;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#xFF0C;&#x7F16;&#x7801;&#x4E3A;JSON&#xFF0C;XML&#x6216;&#x5176;&#x4E8C;&#x8FDB;&#x5236;&#x53D8;&#x4F53;&#xFF08;&#x5982;MongoDB&#x7684;BSON&#xFF09;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x6574;&#x4E2A;&#x6587;&#x6863;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x5176;&#x6E32;&#x67D3;&#x81F3;&#x7F51;&#x9875;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5B58;&#x50A8;&#x5C40;&#x90E8;&#x6027;&#x4F1A;&#x5E26;&#x6765;&#x6027;&#x80FD;&#x4F18;&#x52BF;&#x3002;&#x5982;&#x679C;&#x5C06;&#x6570;&#x636E;&#x5206;&#x5272;&#x5230;&#x591A;&#x4E2A;&#x8868;&#x4E2D;&#xFF08;&#x5982;<a href="img/fig2-1.png">&#x56FE;2-1</a>&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x7D22;&#x5F15;&#x67E5;&#x627E;&#x624D;&#x80FD;&#x5C06;&#x5176;&#x5168;&#x90E8;&#x68C0;&#x7D22;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x78C1;&#x76D8;&#x67E5;&#x627E;&#x5E76;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5C40;&#x90E8;&#x6027;&#x4EC5;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x540C;&#x65F6;&#x9700;&#x8981;&#x6587;&#x6863;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x9700;&#x8981;&#x52A0;&#x8F7D;&#x6574;&#x4E2A;&#x6587;&#x6863;&#xFF0C;&#x5373;&#x4F7F;&#x53EA;&#x8BBF;&#x95EE;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5927;&#x578B;&#x6587;&#x6863;&#x6765;&#x8BF4;&#x662F;&#x5F88;&#x6D6A;&#x8D39;&#x7684;&#x3002;&#x66F4;&#x65B0;&#x6587;&#x6863;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x6574;&#x4E2A;&#x91CD;&#x5199;&#x3002;&#x53EA;&#x6709;&#x4E0D;&#x6539;&#x53D8;&#x6587;&#x6863;&#x5927;&#x5C0F;&#x7684;&#x4FEE;&#x6539;&#x624D;&#x53EF;&#x4EE5;&#x5BB9;&#x6613;&#x5730;&#x539F;&#x5730;&#x6267;&#x884C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x5E38;&#x5EFA;&#x8BAE;&#x4FDD;&#x6301;&#x76F8;&#x5BF9;&#x5C0F;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x5E76;&#x907F;&#x514D;&#x589E;&#x52A0;&#x6587;&#x6863;&#x5927;&#x5C0F;&#x7684;&#x5199;&#x5165;&#x3010;9&#x3011;&#x3002;&#x8FD9;&#x4E9B;&#x6027;&#x80FD;&#x9650;&#x5236;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x4E86;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B9E;&#x7528;&#x573A;&#x666F;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x6307;&#x51FA;&#x7684;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x5C40;&#x90E8;&#x6027;&#x800C;&#x5206;&#x7EC4;&#x96C6;&#x5408;&#x76F8;&#x5173;&#x6570;&#x636E;&#x7684;&#x60F3;&#x6CD5;&#x5E76;&#x4E0D;&#x5C40;&#x9650;&#x4E8E;&#x6587;&#x6863;&#x6A21;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Google&#x7684;Spanner&#x6570;&#x636E;&#x5E93;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x540C;&#x6837;&#x7684;&#x5C40;&#x90E8;&#x6027;&#x5C5E;&#x6027;&#xFF0C;&#x5141;&#x8BB8;&#x6A21;&#x5F0F;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x8868;&#x7684;&#x884C;&#x5E94;&#x8BE5;&#x4EA4;&#x9519;&#xFF08;&#x5D4C;&#x5957;&#xFF09;&#x5728;&#x7236;&#x8868;&#x5185;&#x3010;27&#x3011;&#x3002;Oracle&#x7C7B;&#x4F3C;&#x5730;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A; <strong>&#x591A;&#x8868;&#x7D22;&#x5F15;&#x96C6;&#x7FA4;&#x8868;&#xFF08;multi-table index cluster tables&#xFF09;</strong> &#x7684;&#x7C7B;&#x4F3C;&#x7279;&#x6027;&#x3010;28&#x3011;&#x3002;Bigtable&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF08;&#x7528;&#x4E8E;Cassandra&#x548C;HBase&#xFF09;&#x4E2D;&#x7684; <strong>&#x5217;&#x65CF;&#xFF08;column-family&#xFF09;</strong> &#x6982;&#x5FF5;&#x4E0E;&#x7BA1;&#x7406;&#x5C40;&#x90E8;&#x6027;&#x7684;&#x76EE;&#x7684;&#x7C7B;&#x4F3C;&#x3010;29&#x3011;&#x3002;</p>
<p>&#x5728;<a href="ch3.html">&#x7B2C;3&#x7AE0;</a>&#x5C06;&#x8FD8;&#x4F1A;&#x770B;&#x5230;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x5C40;&#x90E8;&#x6027;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<h4 id="&#x6587;&#x6863;&#x548C;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684;&#x878D;&#x5408;">&#x6587;&#x6863;&#x548C;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684;&#x878D;&#x5408;</h4>
<p>&#x81EA;2000&#x5E74;&#x4EE3;&#x4E2D;&#x671F;&#x4EE5;&#x6765;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF08;MySQL&#x9664;&#x5916;&#xFF09;&#x90FD;&#x5DF2;&#x652F;&#x6301;XML&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x5BF9;XML&#x6587;&#x6863;&#x8FDB;&#x884C;&#x672C;&#x5730;&#x4FEE;&#x6539;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;XML&#x6587;&#x6863;&#x4E2D;&#x8FDB;&#x884C;&#x7D22;&#x5F15;&#x548C;&#x67E5;&#x8BE2;&#x7684;&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x90A3;&#x79CD;&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x5E94;&#x5F53;&#x4F7F;&#x7528;&#x7684;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x4ECE;9.3&#x7248;&#x672C;&#x5F00;&#x59CB;&#x7684;PostgreSQL &#x3010;8&#x3011;&#xFF0C;&#x4ECE;5.7&#x7248;&#x672C;&#x5F00;&#x59CB;&#x7684;MySQL&#x4EE5;&#x53CA;&#x4ECE;&#x7248;&#x672C;10.5&#x5F00;&#x59CB;&#x7684;IBM DB2 [30]&#x4E5F;&#x5BF9;JSON&#x6587;&#x6863;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x652F;&#x6301;&#x7EA7;&#x522B;&#x3002;&#x9274;&#x4E8E;&#x7528;&#x5728;Web APIs&#x7684;JSON&#x6D41;&#x884C;&#x8D8B;&#x52BF;&#xFF0C;&#x5176;&#x4ED6;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x8DDF;&#x968F;&#x4ED6;&#x4EEC;&#x7684;&#x811A;&#x6B65;&#x5E76;&#x6DFB;&#x52A0;JSON&#x652F;&#x6301;&#x3002;</p>
<p>&#x5728;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;RethinkDB&#x5728;&#x5176;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x4E2D;&#x652F;&#x6301;&#x7C7B;&#x4F3C;&#x5173;&#x7CFB;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x4E00;&#x4E9B;MongoDB&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x89E3;&#x6790;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x7528;&#xFF08;&#x6709;&#x6548;&#x5730;&#x6267;&#x884C;&#x5BA2;&#x6237;&#x7AEF;&#x8FDE;&#x63A5;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x53EF;&#x80FD;&#x6BD4;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x8FDE;&#x63A5;&#x6162;&#xFF0C;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x7F51;&#x7EDC;&#x5F80;&#x8FD4;&#xFF0C;&#x5E76;&#x4E14;&#x4F18;&#x5316;&#x66F4;&#x5C11;&#xFF09;&#x3002;</p>
<p>&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x548C;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4F3C;&#x4E4E;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x76F8;&#x4F3C;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#xFF1A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x76F8;&#x4E92;&#x8865;&#x5145;<sup><a href="#fn_v" id="reffn_v">v</a></sup>&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x80FD;&#x591F;&#x5904;&#x7406;&#x7C7B;&#x4F3C;&#x6587;&#x6863;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x5BF9;&#x5176;&#x6267;&#x884C;&#x5173;&#x7CFB;&#x67E5;&#x8BE2;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6700;&#x7B26;&#x5408;&#x5176;&#x9700;&#x6C42;&#x7684;&#x529F;&#x80FD;&#x7EC4;&#x5408;&#x3002;</p>
<p>&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x548C;&#x6587;&#x6863;&#x6A21;&#x578B;&#x7684;&#x6DF7;&#x5408;&#x662F;&#x672A;&#x6765;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x6761;&#x5F88;&#x597D;&#x7684;&#x8DEF;&#x7EBF;&#x3002;</p>
<blockquote id="fn_v">
<sup>v</sup>. Codd&#x5BF9;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x3010;1&#x3011;&#x7684;&#x539F;&#x59CB;&#x63CF;&#x8FF0;&#x5B9E;&#x9645;&#x4E0A;&#x5141;&#x8BB8;&#x5728;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#x4E2D;&#x4E0E;JSON&#x6587;&#x6863;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;&#x4ED6;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x975E;&#x7B80;&#x5355;&#x57DF;&#xFF08;nonsimple domains&#xFF09;</strong>&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x662F;&#xFF0C;&#x4E00;&#x884C;&#x4E2D;&#x7684;&#x503C;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x50CF;&#x6570;&#x5B57;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x4E00;&#x6837;&#x7684;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x5D4C;&#x5957;&#x7684;&#x5173;&#x7CFB;&#xFF08;&#x8868;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x628A;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x5D4C;&#x5957;&#x7684;&#x6811;&#x7ED3;&#x6784;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x5F88;&#x50CF;30&#x5E74;&#x540E;&#x6DFB;&#x52A0;&#x5230;SQL&#x4E2D;&#x7684;JSON&#x6216;XML&#x652F;&#x6301;&#x3002;<a href="#reffn_v" title="Jump back to footnote [v] in the text."> &#x21A9;</a>
</blockquote>
<h2 id="&#x6570;&#x636E;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;">&#x6570;&#x636E;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;</h2>
<p>&#x5F53;&#x5F15;&#x5165;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x65F6;&#xFF0C;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x79CD;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#xFF1A;SQL&#x662F;&#x4E00;&#x79CD; <strong>&#x58F0;&#x660E;&#x5F0F;</strong> &#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x800C;IMS&#x548C;CODASYL&#x4F7F;&#x7528; <strong>&#x547D;&#x4EE4;&#x5F0F;</strong> &#x4EE3;&#x7801;&#x6765;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x5E93;&#x3002;&#x90A3;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;</p>
<p>&#x8BB8;&#x591A;&#x5E38;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x662F;&#x547D;&#x4EE4;&#x5F0F;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x52A8;&#x7269;&#x7269;&#x79CD;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x8FD4;&#x56DE;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x9CA8;&#x9C7C;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x5199;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">getSharks</span>(<span class="hljs-params"></span>) </span>{
    <span class="hljs-keyword">var</span> sharks = [];
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; animals.length; i++) {
        <span class="hljs-keyword">if</span> (animals[i].family === <span class="hljs-string">&quot;Sharks&quot;</span>) {
            sharks.push(animals[i]);
        }
    }
    <span class="hljs-keyword">return</span> sharks;
}
</code></pre>
<p>&#x5728;&#x5173;&#x7CFB;&#x4EE3;&#x6570;&#x4E2D;&#xFF1A;</p>
<p>$$
sharks = &#x3C3;_{family = &quot;sharks&quot;}(animals)</p>
<p>$$
&#x3C3;&#xFF08;&#x5E0C;&#x814A;&#x5B57;&#x6BCD;&#x897F;&#x683C;&#x739B;&#xFF09;&#x662F;&#x9009;&#x62E9;&#x64CD;&#x4F5C;&#x7B26;&#xFF0C;&#x53EA;&#x8FD4;&#x56DE;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x7684;&#x52A8;&#x7269;&#xFF0C;<code>family=&quot;shark&quot;</code>&#x3002;</p>
<p>&#x5B9A;&#x4E49;SQL&#x65F6;&#xFF0C;&#x5B83;&#x7D27;&#x5BC6;&#x5730;&#x9075;&#x5FAA;&#x5173;&#x7CFB;&#x4EE3;&#x6570;&#x7684;&#x7ED3;&#x6784;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">SELECT</span> * <span class="hljs-keyword">FROM</span> animals <span class="hljs-keyword">WHERE</span> family =<span class="hljs-string">&apos;Sharks&apos;</span>;
</code></pre>
<p>&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x544A;&#x8BC9;&#x8BA1;&#x7B97;&#x673A;&#x4EE5;&#x7279;&#x5B9A;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#x3002;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x9010;&#x884C;&#x5730;&#x904D;&#x5386;&#x4EE3;&#x7801;&#xFF0C;&#x8BC4;&#x4F30;&#x6761;&#x4EF6;&#xFF0C;&#x66F4;&#x65B0;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x518D;&#x5FAA;&#x73AF;&#x4E00;&#x904D;&#x3002;</p>
<p>&#x5728;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF08;&#x5982;SQL&#x6216;&#x5173;&#x7CFB;&#x4EE3;&#x6570;&#xFF09;&#x4E2D;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x6307;&#x5B9A;&#x6240;&#x9700;&#x6570;&#x636E;&#x7684;&#x6A21;&#x5F0F; - &#x7ED3;&#x679C;&#x5FC5;&#x987B;&#x7B26;&#x5408;&#x54EA;&#x4E9B;&#x6761;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5C06;&#x6570;&#x636E;&#x8F6C;&#x6362;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6392;&#x5E8F;&#xFF0C;&#x5206;&#x7EC4;&#x548C;&#x96C6;&#x5408;&#xFF09; - &#x4F46;&#x4E0D;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x76EE;&#x6807;&#x3002;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x54EA;&#x4E9B;&#x7D22;&#x5F15;&#x548C;&#x54EA;&#x4E9B;&#x8FDE;&#x63A5;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x4EE5;&#x4F55;&#x79CD;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x662F;&#x8FF7;&#x4EBA;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x901A;&#x5E38;&#x6BD4;&#x547D;&#x4EE4;&#x5F0F;API&#x66F4;&#x52A0;&#x7B80;&#x6D01;&#x548C;&#x5BB9;&#x6613;&#x3002;&#x4F46;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x8FD8;&#x9690;&#x85CF;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x5F15;&#x64CE;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5728;&#x65E0;&#x9700;&#x5BF9;&#x67E5;&#x8BE2;&#x505A;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x6027;&#x80FD;&#x63D0;&#x5347;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x672C;&#x8282;&#x5F00;&#x5934;&#x6240;&#x793A;&#x7684;&#x547D;&#x4EE4;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x52A8;&#x7269;&#x5217;&#x8868;&#x4EE5;&#x7279;&#x5B9A;&#x987A;&#x5E8F;&#x51FA;&#x73B0;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x60F3;&#x8981;&#x5728;&#x540E;&#x53F0;&#x56DE;&#x6536;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x79FB;&#x52A8;&#x8BB0;&#x5F55;&#xFF0C;&#x8FD9;&#x4F1A;&#x6539;&#x53D8;&#x52A8;&#x7269;&#x51FA;&#x73B0;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x6570;&#x636E;&#x5E93;&#x80FD;&#x5426;&#x5B89;&#x5168;&#x5730;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x4E2D;&#x65AD;&#x67E5;&#x8BE2;&#xFF1F;</p>
<p>SQL&#x793A;&#x4F8B;&#x4E0D;&#x786E;&#x4FDD;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x5728;&#x610F;&#x987A;&#x5E8F;&#x662F;&#x5426;&#x6539;&#x53D8;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x7528;&#x547D;&#x4EE4;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x5199;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x5E93;&#x5C31;&#x6C38;&#x8FDC;&#x4E0D;&#x53EF;&#x80FD;&#x786E;&#x5B9A;&#x4EE3;&#x7801;&#x662F;&#x5426;&#x4F9D;&#x8D56;&#x4E8E;&#x6392;&#x5E8F;&#x3002;SQL&#x76F8;&#x5F53;&#x6709;&#x9650;&#x7684;&#x529F;&#x80FD;&#x6027;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x81EA;&#x52A8;&#x4F18;&#x5316;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x58F0;&#x660E;&#x5F0F;&#x8BED;&#x8A00;&#x5F80;&#x5F80;&#x9002;&#x5408;&#x5E76;&#x884C;&#x6267;&#x884C;&#x3002;&#x73B0;&#x5728;&#xFF0C;CPU&#x7684;&#x901F;&#x5EA6;&#x901A;&#x8FC7;&#x6838;&#x5FC3;(core)&#x7684;&#x589E;&#x52A0;&#x53D8;&#x5F97;&#x66F4;&#x5FEB;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EE5;&#x6BD4;&#x4EE5;&#x524D;&#x66F4;&#x9AD8;&#x7684;&#x65F6;&#x949F;&#x901F;&#x5EA6;&#x8FD0;&#x884C;&#x3010;31&#x3011;&#x3002;&#x547D;&#x4EE4;&#x4EE3;&#x7801;&#x5F88;&#x96BE;&#x5728;&#x591A;&#x4E2A;&#x6838;&#x5FC3;&#x548C;&#x591A;&#x4E2A;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x5E76;&#x884C;&#x5316;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6307;&#x5B9A;&#x4E86;&#x6307;&#x4EE4;&#x5FC5;&#x987B;&#x4EE5;&#x7279;&#x5B9A;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x3002;&#x58F0;&#x660E;&#x5F0F;&#x8BED;&#x8A00;&#x66F4;&#x5177;&#x6709;&#x5E76;&#x884C;&#x6267;&#x884C;&#x7684;&#x6F5C;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4EC5;&#x6307;&#x5B9A;&#x7ED3;&#x679C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x800C;&#x4E0D;&#x6307;&#x5B9A;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x7ED3;&#x679C;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x5728;&#x9002;&#x5F53;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x4F7F;&#x7528;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x7684;&#x5E76;&#x884C;&#x5B9E;&#x73B0;&#x3010;32&#x3011;&#x3002;</p>
<h3 id="web&#x4E0A;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;">Web&#x4E0A;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;</h3>
<p>&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x52BF;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5728;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x6BD4;&#x8F83;&#x58F0;&#x660E;&#x5F0F;&#x548C;&#x547D;&#x4EE4;&#x5F0F;&#x65B9;&#x6CD5;&#xFF1A;&#x4E00;&#x4E2A;Web&#x6D4F;&#x89C8;&#x5668;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x6D77;&#x6D0B;&#x52A8;&#x7269;&#x7684;&#x7F51;&#x7AD9;&#x3002;&#x7528;&#x6237;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x67E5;&#x770B;&#x9CA8;&#x9C7C;&#x9875;&#x9762;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x5C06;&#x5F53;&#x524D;&#x6240;&#x9009;&#x7684;&#x5BFC;&#x822A;&#x9879;&#x76EE;&#x201C;&#x9CA8;&#x9C7C;&#x201D;&#x6807;&#x8BB0;&#x4E3A;&#x5F53;&#x524D;&#x9009;&#x4E2D;&#x9879;&#x76EE;&#x3002;</p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">ul</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span> <span class="hljs-attr">class</span>=<span class="hljs-string">&quot;selected&quot;</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>Sharks<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">ul</span>&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Great White Shark<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Tiger Shark<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Hammerhead Shark<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
        <span class="hljs-tag">&lt;/<span class="hljs-name">ul</span>&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span><span class="hljs-tag">&lt;<span class="hljs-name">p</span>&gt;</span>Whales<span class="hljs-tag">&lt;/<span class="hljs-name">p</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">ul</span>&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Blue Whale<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Humpback Whale<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">li</span>&gt;</span>Fin Whale<span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
        <span class="hljs-tag">&lt;/<span class="hljs-name">ul</span>&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">li</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">ul</span>&gt;</span>
</code></pre>
<p>&#x73B0;&#x5728;&#x60F3;&#x8BA9;&#x5F53;&#x524D;&#x6240;&#x9009;&#x9875;&#x9762;&#x7684;&#x6807;&#x9898;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x84DD;&#x8272;&#x7684;&#x80CC;&#x666F;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x89C6;&#x89C9;&#x4E0A;&#x7A81;&#x51FA;&#x663E;&#x793A;&#x3002;&#x4F7F;&#x7528;CSS&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF1A;</p>
<pre><code class="lang-css"><span class="hljs-selector-tag">li</span><span class="hljs-selector-class">.selected</span> &gt; <span class="hljs-selector-tag">p</span> {
    <span class="hljs-attribute">background-color</span>: blue;
}
</code></pre>
<p>&#x8FD9;&#x91CC;&#x7684;CSS&#x9009;&#x62E9;&#x5668;<code>li.selected&gt; p</code>&#x58F0;&#x660E;&#x4E86;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5E94;&#x7528;&#x84DD;&#x8272;&#x6837;&#x5F0F;&#x7684;&#x5143;&#x7D20;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;&#x5373;&#x5176;&#x76F4;&#x63A5;&#x7236;&#x5143;&#x7D20;&#x662F;&#x5177;&#x6709;<code>selected</code>CSS&#x7C7B;&#x7684;<code>&lt;li&gt;</code>&#x5143;&#x7D20;&#x7684;&#x6240;&#x6709;<code>&lt;p&gt;</code>&#x5143;&#x7D20;&#x3002;&#x793A;&#x4F8B;&#x4E2D;&#x7684;&#x5143;&#x7D20;<code>&lt;p&gt; Sharks &lt;/p&gt;</code>&#x5339;&#x914D;&#x6B64;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;<code>&lt;p&gt; Whales &lt;/p&gt;</code>&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;<code>&lt;li&gt;</code>&#x7236;&#x5143;&#x7D20;&#x7F3A;&#x5C11;<code>class =&#x201C;selected&#x201D;</code>&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F7F;&#x7528;XSL&#x800C;&#x4E0D;&#x662F;CSS&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x7C7B;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;</p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-name">xsl:template</span> <span class="hljs-attr">match</span>=<span class="hljs-string">&quot;li[@class=&apos;selected&apos;]/p&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">fo:block</span> <span class="hljs-attr">background-color</span>=<span class="hljs-string">&quot;blue&quot;</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">xsl:apply-templates</span>/&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">fo:block</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">xsl:template</span>&gt;</span>
</code></pre>
<p>&#x8FD9;&#x91CC;&#x7684;XPath&#x8868;&#x8FBE;&#x5F0F;<code>li[@class=&apos;selected&apos;]/p</code>&#x76F8;&#x5F53;&#x4E8E;&#x4E0A;&#x4F8B;&#x4E2D;&#x7684;CSS&#x9009;&#x62E9;&#x5668;<code>li.selected&gt; p</code>&#x3002;CSS&#x548C;XSL&#x7684;&#x5171;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x6587;&#x6863;&#x6837;&#x5F0F;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x5F0F;&#x65B9;&#x6CD5;&#x7684;&#x60C5;&#x51B5;&#x4F1A;&#x662F;&#x5982;&#x4F55;&#x3002;&#x5728;Javascript&#x4E2D;&#xFF0C;&#x4F7F;&#x7528; <strong>&#x6587;&#x6863;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#xFF08;DOM&#xFF09;</strong> API&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-js"><span class="hljs-keyword">var</span> liElements = <span class="hljs-built_in">document</span>.getElementsByTagName(<span class="hljs-string">&quot;li&quot;</span>);
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> i = <span class="hljs-number">0</span>; i &lt; liElements.length; i++) {
    <span class="hljs-keyword">if</span> (liElements[i].className === <span class="hljs-string">&quot;selected&quot;</span>) {
        <span class="hljs-keyword">var</span> children = liElements[i].childNodes;
        <span class="hljs-keyword">for</span> (<span class="hljs-keyword">var</span> j = <span class="hljs-number">0</span>; j &lt; children.length; j++) {
            <span class="hljs-keyword">var</span> child = children[j];
            <span class="hljs-keyword">if</span> (child.nodeType === Node.ELEMENT_NODE &amp;&amp; child.tagName === <span class="hljs-string">&quot;P&quot;</span>) {
                child.setAttribute(<span class="hljs-string">&quot;style&quot;</span>, <span class="hljs-string">&quot;background-color: blue&quot;</span>);
            }
        }
    }
}
</code></pre>
<p>&#x8FD9;&#x6BB5;JavaScript&#x4EE3;&#x7801;&#x547D;&#x4EE4;&#x5F0F;&#x5730;&#x5C06;&#x5143;&#x7D20;&#x8BBE;&#x7F6E;&#x4E3A;&#x84DD;&#x8272;&#x80CC;&#x666F;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x7801;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x7CDF;&#x7CD5;&#x3002;&#x4E0D;&#x4EC5;&#x6BD4;CSS&#x548C;XSL&#x7B49;&#x4EF7;&#x7269;&#x66F4;&#x957F;&#xFF0C;&#x66F4;&#x96BE;&#x7406;&#x89E3;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li><p>&#x5982;&#x679C;&#x9009;&#x5B9A;&#x7684;&#x7C7B;&#x88AB;&#x79FB;&#x9664;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x9875;&#x9762;&#xFF09;&#xFF0C;&#x5373;&#x4F7F;&#x4EE3;&#x7801;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#xFF0C;&#x84DD;&#x8272;&#x80CC;&#x666F;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x79FB;&#x9664; - &#x56E0;&#x6B64;&#x8BE5;&#x9879;&#x76EE;&#x5C06;&#x4FDD;&#x6301;&#x7A81;&#x51FA;&#x663E;&#x793A;&#xFF0C;&#x76F4;&#x5230;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x88AB;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x3002;&#x4F7F;&#x7528;CSS&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F1A;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;<code>li.selected&gt; p</code>&#x89C4;&#x5219;&#x4F55;&#x65F6;&#x4E0D;&#x518D;&#x9002;&#x7528;&#xFF0C;&#x5E76;&#x5728;&#x9009;&#x5B9A;&#x7684;&#x7C7B;&#x88AB;&#x79FB;&#x9664;&#x540E;&#x7ACB;&#x5373;&#x79FB;&#x9664;&#x84DD;&#x8272;&#x80CC;&#x666F;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x5229;&#x7528;&#x65B0;&#x7684;API&#xFF08;&#x4F8B;&#x5982;<code>document.getElementsBy ClassName&#xFF08;&#x201C;selected&#x201D;</code>&#xFF09;&#x751A;&#x81F3;<code>document.evaluate()</code>&#xFF09;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x91CD;&#x5199;&#x4EE3;&#x7801;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F9B;&#x5E94;&#x5546;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x7834;&#x574F;&#x517C;&#x5BB9;&#x6027;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x63D0;&#x9AD8;CSS&#x548C;XPath&#x7684;&#x6027;&#x80FD;&#x3002;</p>
</li>
</ul>
<p>&#x5728;Web&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x58F0;&#x660E;&#x5F0F;CSS&#x6837;&#x5F0F;&#x6BD4;&#x4F7F;&#x7528;JavaScript&#x547D;&#x4EE4;&#x5F0F;&#x5730;&#x64CD;&#x4F5C;&#x6837;&#x5F0F;&#x8981;&#x597D;&#x5F97;&#x591A;&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x50CF;SQL&#x8FD9;&#x6837;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x6BD4;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x5F0F;&#x67E5;&#x8BE2;API&#x8981;&#x597D;&#x5F97;&#x591A;<sup><a href="#fn_vi" id="reffn_vi">vi</a></sup>&#x3002;</p>
<blockquote id="fn_vi">
<sup>vi</sup>. vi IMS&#x548C;CODASYL&#x90FD;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x5F0F;API&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x4F7F;&#x7528;COBOL&#x4EE3;&#x7801;&#x904D;&#x5386;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x4E00;&#x6B21;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x3010;2,16&#x3011;&#x3002;<a href="#reffn_vi" title="Jump back to footnote [vi] in the text."> &#x21A9;</a>
</blockquote>
<h3 id="mapreduce&#x67E5;&#x8BE2;">MapReduce&#x67E5;&#x8BE2;</h3>
<p>MapReduce&#x662F;&#x4E00;&#x4E2A;&#x7531;Google&#x63A8;&#x5E7F;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x6279;&#x91CF;&#x5904;&#x7406;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x6570;&#x636E;&#x3010;33&#x3011;&#x3002;&#x4E00;&#x4E9B;NoSQL&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF08;&#x5305;&#x62EC;MongoDB&#x548C;CouchDB&#xFF09;&#x652F;&#x6301;&#x6709;&#x9650;&#x5F62;&#x5F0F;&#x7684;MapReduce&#xFF0C;&#x4F5C;&#x4E3A;&#x5728;&#x591A;&#x4E2A;&#x6587;&#x6863;&#x4E2D;&#x6267;&#x884C;&#x53EA;&#x8BFB;&#x67E5;&#x8BE2;&#x7684;&#x673A;&#x5236;&#x3002;</p>
<p>MapReduce&#x5C06;<a href="ch10.html">&#x7B2C;10&#x7AE0;</a>&#x4E2D;&#x6709;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5C06;&#x7B80;&#x8981;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;MongoDB&#x4F7F;&#x7528;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>MapReduce&#x65E2;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x58F0;&#x660E;&#x5F0F;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x547D;&#x4EE4;&#x5F0F;&#x7684;&#x67E5;&#x8BE2;API&#xFF0C;&#x800C;&#x662F;&#x5904;&#x4E8E;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#xFF1A;&#x67E5;&#x8BE2;&#x7684;&#x903B;&#x8F91;&#x7528;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x4F1A;&#x88AB;&#x5904;&#x7406;&#x6846;&#x67B6;&#x91CD;&#x590D;&#x6027;&#x8C03;&#x7528;&#x3002;&#x5B83;&#x57FA;&#x4E8E;<code>map</code>&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;<code>collect</code>&#xFF09;&#x548C;<code>reduce</code>&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;<code>fold</code>&#x6216;<code>inject</code>&#xFF09;&#x51FD;&#x6570;&#xFF0C;&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x5B58;&#x5728;&#x4E8E;&#x8BB8;&#x591A;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x3002;</p>
<p>&#x6700;&#x597D;&#x4E3E;&#x4F8B;&#x6765;&#x89E3;&#x91CA;MapReduce&#x6A21;&#x578B;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x662F;&#x4E00;&#x540D;&#x6D77;&#x6D0B;&#x751F;&#x7269;&#x5B66;&#x5BB6;&#xFF0C;&#x6BCF;&#x5F53;&#x4F60;&#x770B;&#x5230;&#x6D77;&#x6D0B;&#x4E2D;&#x7684;&#x52A8;&#x7269;&#x65F6;&#xFF0C;&#x4F60;&#x90FD;&#x4F1A;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x6761;&#x89C2;&#x5BDF;&#x8BB0;&#x5F55;&#x3002;&#x73B0;&#x5728;&#x4F60;&#x60F3;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x62A5;&#x544A;&#xFF0C;&#x8BF4;&#x660E;&#x4F60;&#x6BCF;&#x6708;&#x770B;&#x5230;&#x591A;&#x5C11;&#x9CA8;&#x9C7C;&#x3002;</p>
<p>&#x5728;PostgreSQL&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x8FD9;&#x6837;&#x8868;&#x8FF0;&#x8FD9;&#x4E2A;&#x67E5;&#x8BE2;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">SELECT</span>
    date_trunc(<span class="hljs-string">&apos;month&apos;</span>, observation_timestamp) <span class="hljs-keyword">AS</span> observation_month,
    <span class="hljs-keyword">sum</span>(num_animals)                           <span class="hljs-keyword">AS</span> total_animals
<span class="hljs-keyword">FROM</span> observations
<span class="hljs-keyword">WHERE</span> family = <span class="hljs-string">&apos;Sharks&apos;</span>
<span class="hljs-keyword">GROUP</span> <span class="hljs-keyword">BY</span> observation_month;
</code></pre>
<p><code>date_trunc(&apos;month&apos;&#xFF0C;timestamp)</code>&#x51FD;&#x6570;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x5305;&#x542B;<code>timestamp</code>&#x7684;&#x65E5;&#x5386;&#x6708;&#x4EFD;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4EE3;&#x8868;&#x8BE5;&#x6708;&#x4EFD;&#x5F00;&#x59CB;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5B83;&#x5C06;&#x65F6;&#x95F4;&#x6233;&#x820D;&#x5165;&#x6210;&#x6700;&#x8FD1;&#x7684;&#x6708;&#x4EFD;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x67E5;&#x8BE2;&#x9996;&#x5148;&#x8FC7;&#x6EE4;&#x89C2;&#x5BDF;&#x8BB0;&#x5F55;&#xFF0C;&#x4EE5;&#x53EA;&#x663E;&#x793A;&#x9CA8;&#x9C7C;&#x5BB6;&#x65CF;&#x7684;&#x7269;&#x79CD;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x5B83;&#x4EEC;&#x53D1;&#x751F;&#x7684;&#x65E5;&#x5386;&#x6708;&#x4EFD;&#x5BF9;&#x89C2;&#x5BDF;&#x8BB0;&#x5F55;&#x679C;&#x8FDB;&#x884C;&#x5206;&#x7EC4;&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x5728;&#x8BE5;&#x6708;&#x7684;&#x6240;&#x6709;&#x89C2;&#x5BDF;&#x8BB0;&#x5F55;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x52A8;&#x7269;&#x6570;&#x76EE;&#x52A0;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x540C;&#x6837;&#x7684;&#x67E5;&#x8BE2;&#x7528;MongoDB&#x7684;MapReduce&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x6309;&#x5982;&#x4E0B;&#x6765;&#x8868;&#x8FF0;&#xFF1A;</p>
<pre><code class="lang-js">db.observations.mapReduce(<span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">map</span>(<span class="hljs-params"></span>) </span>{
        <span class="hljs-keyword">var</span> year = <span class="hljs-keyword">this</span>.observationTimestamp.getFullYear();
        <span class="hljs-keyword">var</span> month = <span class="hljs-keyword">this</span>.observationTimestamp.getMonth() + <span class="hljs-number">1</span>;
        emit(year + <span class="hljs-string">&quot;-&quot;</span> + month, <span class="hljs-keyword">this</span>.numAnimals);
    },
    <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">reduce</span>(<span class="hljs-params">key, values</span>) </span>{
        <span class="hljs-keyword">return</span> <span class="hljs-built_in">Array</span>.sum(values);
    },
    {
        query: {
          family: <span class="hljs-string">&quot;Sharks&quot;</span>
        },
        out: <span class="hljs-string">&quot;monthlySharkReport&quot;</span>
    });
</code></pre>
<ul>
<li>&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x5F0F;&#x5730;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x53EA;&#x8003;&#x8651;&#x9CA8;&#x9C7C;&#x79CD;&#x7C7B;&#x7684;&#x8FC7;&#x6EE4;&#x5668;&#xFF08;&#x8FD9;&#x662F;MongoDB&#x7279;&#x5B9A;&#x7684;MapReduce&#x6269;&#x5C55;&#xFF09;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;&#x5339;&#x914D;&#x67E5;&#x8BE2;&#x7684;&#x6587;&#x6863;&#x90FD;&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x6B21;JavaScript&#x51FD;&#x6570;<code>map</code>&#xFF0C;&#x5C06;<code>this</code>&#x8BBE;&#x7F6E;&#x4E3A;&#x6587;&#x6863;&#x5BF9;&#x8C61;&#x3002;</li>
<li><code>map</code>&#x51FD;&#x6570;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x952E;&#xFF08;&#x5305;&#x62EC;&#x5E74;&#x4EFD;&#x548C;&#x6708;&#x4EFD;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5982;<code>&quot;2013-12&quot;</code>&#x6216;<code>&quot;2014-1&quot;</code>&#xFF09;&#x548C;&#x4E00;&#x4E2A;&#x503C;&#xFF08;&#x8BE5;&#x89C2;&#x5BDF;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x52A8;&#x7269;&#x6570;&#x91CF;&#xFF09;&#x3002;</li>
<li><code>map</code>&#x53D1;&#x51FA;&#x7684;&#x952E;&#x503C;&#x5BF9;&#x6309;&#x952E;&#x6765;&#x5206;&#x7EC4;&#x3002;&#x5BF9;&#x4E8E;&#x5177;&#x6709;&#x76F8;&#x540C;&#x952E;&#xFF08;&#x5373;&#xFF0C;&#x76F8;&#x540C;&#x7684;&#x6708;&#x4EFD;&#x548C;&#x5E74;&#x4EFD;&#xFF09;&#x7684;&#x6240;&#x6709;&#x952E;&#x503C;&#x5BF9;&#xFF0C;&#x8C03;&#x7528;&#x4E00;&#x6B21;<code>reduce</code>&#x51FD;&#x6570;&#x3002;</li>
<li><code>reduce</code>&#x51FD;&#x6570;&#x5C06;&#x7279;&#x5B9A;&#x6708;&#x4EFD;&#x5185;&#x6240;&#x6709;&#x89C2;&#x6D4B;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x52A8;&#x7269;&#x6570;&#x91CF;&#x76F8;&#x52A0;&#x3002;</li>
<li>&#x5C06;&#x6700;&#x7EC8;&#x7684;&#x8F93;&#x51FA;&#x5199;&#x5165;&#x5230;<code>monthlySharkReport</code>&#x96C6;&#x5408;&#x4E2D;&#x3002;</li>
</ul>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;<code>observations</code>&#x96C6;&#x5408;&#x5305;&#x542B;&#x8FD9;&#x4E24;&#x4E2A;&#x6587;&#x6863;&#xFF1A;</p>
<pre><code class="lang-json">{
  observationTimestamp: <span class="hljs-built_in">Date</span>.parse(  <span class="hljs-string">&quot;Mon, 25 Dec 1995 12:34:56 GMT&quot;</span>),
  family: <span class="hljs-string">&quot;Sharks&quot;</span>,
  species: <span class="hljs-string">&quot;Carcharodon carcharias&quot;</span>,
  numAnimals: <span class="hljs-number">3</span>
{
}
  observationTimestamp: <span class="hljs-built_in">Date</span>.parse(<span class="hljs-string">&quot;Tue, 12 Dec 1995 16:17:18 GMT&quot;</span>),
  family: <span class="hljs-string">&quot;Sharks&quot;</span>,
  species:    <span class="hljs-string">&quot;Carcharias taurus&quot;</span>,
  numAnimals: <span class="hljs-number">4</span>
}
</code></pre>
<p>&#x5BF9;&#x6BCF;&#x4E2A;&#x6587;&#x6863;&#x90FD;&#x4F1A;&#x8C03;&#x7528;&#x4E00;&#x6B21;<code>map</code>&#x51FD;&#x6570;&#xFF0C;&#x7ED3;&#x679C;&#x5C06;&#x662F;<code>emit(&quot;1995-12&quot;,3)</code>&#x548C;<code>emit(&quot;1995-12&quot;,4)</code>&#x3002;&#x968F;&#x540E;&#xFF0C;&#x4EE5;<code>reduce(&quot;1995-12&quot;,[3,4])</code>&#x8C03;&#x7528;<code>reduce</code>&#x51FD;&#x6570;&#xFF0C;&#x5C06;&#x8FD4;&#x56DE;<code>7</code>&#x3002;</p>
<p>map&#x548C;reduce&#x51FD;&#x6570;&#x5728;&#x529F;&#x80FD;&#x4E0A;&#x6709;&#x6240;&#x9650;&#x5236;&#xFF1A;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x662F;<strong>&#x7EAF;</strong>&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x53EA;&#x4F7F;&#x7528;&#x4F20;&#x9012;&#x7ED9;&#x5B83;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x6267;&#x884C;&#x989D;&#x5916;&#x7684;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x6709;&#x4EFB;&#x4F55;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x4E9B;&#x9650;&#x5236;&#x5141;&#x8BB8;&#x6570;&#x636E;&#x5E93;&#x4EE5;&#x4EFB;&#x4F55;&#x987A;&#x5E8F;&#x8FD0;&#x884C;&#x4EFB;&#x4F55;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x5728;&#x5931;&#x8D25;&#x65F6;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x5B83;&#x4EEC;&#x3002;&#x7136;&#x800C;&#xFF0C;map&#x548C;reduce&#x51FD;&#x6570;&#x4ECD;&#x7136;&#x662F;&#x5F3A;&#x5927;&#x7684;&#xFF1A;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x89E3;&#x6790;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8C03;&#x7528;&#x5E93;&#x51FD;&#x6570;&#xFF0C;&#x6267;&#x884C;&#x8BA1;&#x7B97;&#x7B49;&#x7B49;&#x3002;</p>
<p>MapReduce&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x5E95;&#x5C42;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#xFF0C;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x96C6;&#x7FA4;&#x4E0A;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6267;&#x884C;&#x3002;&#x50CF;SQL&#x8FD9;&#x6837;&#x7684;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x7CFB;&#x5217;&#x7684;MapReduce&#x64CD;&#x4F5C;&#x6765;&#x5B9E;&#x73B0;&#xFF08;&#x89C1;<a href="ch10.html">&#x7B2C;10&#x7AE0;</a>&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4E0D;&#x4F7F;&#x7528;MapReduce&#x7684;&#x5206;&#x5E03;&#x5F0F;SQL&#x5B9E;&#x73B0;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;SQL&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x9650;&#x5236;&#x5B83;&#x5728;&#x5355;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x800C;MapReduce&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x67E5;&#x8BE2;&#x6267;&#x884C;&#x4E0A;&#x6CA1;&#x6709;&#x5784;&#x65AD;&#x6743;&#x3002;</p>
<p>&#x80FD;&#x591F;&#x5728;&#x67E5;&#x8BE2;&#x4E2D;&#x4F7F;&#x7528;JavaScript&#x4EE3;&#x7801;&#x662F;&#x9AD8;&#x7EA7;&#x67E5;&#x8BE2;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x6027;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x9650;&#x4E8E;MapReduce&#xFF0C;&#x4E00;&#x4E9B;SQL&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;JavaScript&#x51FD;&#x6570;&#x8FDB;&#x884C;&#x6269;&#x5C55;&#x3010;34&#x3011;&#x3002;</p>
<p>MapReduce&#x7684;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x6027;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x4E24;&#x4E2A;&#x5BC6;&#x5207;&#x5408;&#x4F5C;&#x7684;JavaScript&#x51FD;&#x6570;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x6BD4;&#x7F16;&#x5199;&#x5355;&#x4E2A;&#x67E5;&#x8BE2;&#x66F4;&#x56F0;&#x96BE;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x4E3A;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x673A;&#x4F1A;&#x6765;&#x63D0;&#x9AD8;&#x67E5;&#x8BE2;&#x7684;&#x6027;&#x80FD;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;MongoDB 2.2&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x79CD;&#x53EB;&#x505A;<strong>&#x805A;&#x5408;&#x7BA1;&#x9053;</strong>&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x7684;&#x652F;&#x6301;&#x3010;9&#x3011;&#x3002;&#x7528;&#x8FD9;&#x79CD;&#x8BED;&#x8A00;&#x8868;&#x8FF0;&#x9CA8;&#x9C7C;&#x8BA1;&#x6570;&#x67E5;&#x8BE2;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-js">db.observations.aggregate([
  { $match: { family: <span class="hljs-string">&quot;Sharks&quot;</span> } },
  { $group: {
    _id: {
      year:  { $year:  <span class="hljs-string">&quot;$observationTimestamp&quot;</span> },
      month: { $month: <span class="hljs-string">&quot;$observationTimestamp&quot;</span> }
    },
    totalAnimals: { $sum: <span class="hljs-string">&quot;$numAnimals&quot;</span> } }}
]);
</code></pre>
<p>&#x805A;&#x5408;&#x7BA1;&#x9053;&#x8BED;&#x8A00;&#x4E0E;SQL&#x7684;&#x5B50;&#x96C6;&#x5177;&#x6709;&#x7C7B;&#x4F3C;&#x8868;&#x73B0;&#x529B;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;JSON&#x7684;&#x8BED;&#x6CD5;&#x800C;&#x4E0D;&#x662F;SQL&#x7684;&#x82F1;&#x8BED;&#x53E5;&#x5B50;&#x5F0F;&#x8BED;&#x6CD5;; &#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x4E5F;&#x8BB8;&#x662F;&#x53E3;&#x5473;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x7684;&#x5BD3;&#x610F;&#x662F;NoSQL&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x610F;&#x5916;&#x5730;&#x91CD;&#x65B0;&#x53D1;&#x660E;&#x4E86;SQL&#xFF0C;&#x5C3D;&#x7BA1;&#x5E26;&#x7740;&#x4F2A;&#x88C5;&#x3002;</p>
<h2 id="&#x56FE;&#x6570;&#x636E;&#x6A21;&#x578B;">&#x56FE;&#x6570;&#x636E;&#x6A21;&#x578B;</h2>
<p>&#x5982;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x6240;&#x89C1;&#xFF0C;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x662F;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E4B;&#x95F4;&#x5177;&#x6709;&#x533A;&#x522B;&#x6027;&#x7684;&#x91CD;&#x8981;&#x7279;&#x5F81;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5927;&#x591A;&#x6570;&#x7684;&#x5173;&#x7CFB;&#x662F;&#x4E00;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#xFF08;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x5927;&#x591A;&#x6570;&#x8BB0;&#x5F55;&#x4E4B;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x5173;&#x7CFB;&#xFF0C;&#x90A3;&#x4E48;&#x4F7F;&#x7528;&#x6587;&#x6863;&#x6A21;&#x578B;&#x662F;&#x5408;&#x9002;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8981;&#x662F;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x5728;&#x4F60;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5F88;&#x5E38;&#x89C1;&#x5462;&#xFF1F;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x7684;&#x7B80;&#x5355;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x662F;&#x968F;&#x7740;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5EFA;&#x6A21;&#x4E3A;&#x56FE;&#x5F62;&#x663E;&#x5F97;&#x66F4;&#x52A0;&#x81EA;&#x7136;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x56FE;&#x7531;&#x4E24;&#x79CD;&#x5BF9;&#x8C61;&#x7EC4;&#x6210;&#xFF1A;<strong>&#x9876;&#x70B9;&#xFF08;vertices&#xFF09;</strong>&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x8282;&#x70B9;&#xFF08;nodes&#xFF09;</strong> &#x6216;<strong>&#x5B9E;&#x4F53;&#xFF08;entities&#xFF09;</strong>&#xFF09;&#xFF0C;&#x548C;<strong>&#x8FB9;&#xFF08;edges&#xFF09;</strong>&#xFF08; &#x4E5F;&#x79F0;&#x4E3A;<strong>&#x5173;&#x7CFB;&#xFF08;relationships&#xFF09;</strong>&#x6216;<strong>&#x5F27; &#xFF08;arcs&#xFF09;</strong> &#xFF09;&#x3002;&#x591A;&#x79CD;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x88AB;&#x5EFA;&#x6A21;&#x4E3A;&#x4E00;&#x4E2A;&#x56FE;&#x5F62;&#x3002;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x5305;&#x62EC;&#xFF1A;</p>
<p><strong><em>&#x793E;&#x4EA4;&#x56FE;&#x8C31;</em></strong></p>
<p>&#x9876;&#x70B9;&#x662F;&#x4EBA;&#xFF0C;&#x8FB9;&#x6307;&#x793A;&#x54EA;&#x4E9B;&#x4EBA;&#x5F7C;&#x6B64;&#x8BA4;&#x8BC6;&#x3002;</p>
<p><strong><em>&#x7F51;&#x7EDC;&#x56FE;&#x8C31;</em></strong></p>
<p>&#x9876;&#x70B9;&#x662F;&#x7F51;&#x9875;&#xFF0C;&#x8FB9;&#x7F18;&#x8868;&#x793A;&#x6307;&#x5411;&#x5176;&#x4ED6;&#x9875;&#x9762;&#x7684;HTML&#x94FE;&#x63A5;&#x3002;</p>
<p><strong><em>&#x516C;&#x8DEF;&#x6216;&#x94C1;&#x8DEF;&#x7F51;&#x7EDC;</em></strong></p>
<p>&#x9876;&#x70B9;&#x662F;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#xFF0C;&#x8FB9;&#x7EBF;&#x4EE3;&#x8868;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x9053;&#x8DEF;&#x6216;&#x94C1;&#x8DEF;&#x7EBF;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x5C06;&#x90A3;&#x4E9B;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x7B97;&#x6CD5;&#x8FD0;&#x7528;&#x5230;&#x8FD9;&#x4E9B;&#x56FE;&#x4E0A;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x6C7D;&#x8F66;&#x5BFC;&#x822A;&#x7CFB;&#x7EDF;&#x641C;&#x7D22;&#x9053;&#x8DEF;&#x7F51;&#x7EDC;&#x4E2D;&#x4E24;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6700;&#x77ED;&#x8DEF;&#x5F84;&#xFF0C;PageRank&#x53EF;&#x4EE5;&#x7528;&#x5728;&#x7F51;&#x7EDC;&#x56FE;&#x4E0A;&#x6765;&#x786E;&#x5B9A;&#x7F51;&#x9875;&#x7684;&#x6D41;&#x884C;&#x7A0B;&#x5EA6;&#xFF0C;&#x4ECE;&#x800C;&#x786E;&#x5B9A;&#x8BE5;&#x7F51;&#x9875;&#x5728;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x4E2D;&#x7684;&#x6392;&#x540D;&#x3002;</p>
<p>&#x5728;&#x521A;&#x521A;&#x7ED9;&#x51FA;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x56FE;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x9876;&#x70B9;&#x4EE3;&#x8868;&#x4E86;&#x76F8;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4E8B;&#x7269;&#xFF08;&#x4EBA;&#xFF0C;&#x7F51;&#x9875;&#x6216;&#x4EA4;&#x53C9;&#x8DEF;&#x53E3;&#xFF09;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x56FE;&#x5E76;&#x4E0D;&#x5C40;&#x9650;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x540C;&#x7C7B;&#x6570;&#x636E;&#xFF1A;&#x540C;&#x6837;&#x5F3A;&#x5927;&#x5730;&#x662F;&#xFF0C;&#x56FE;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x4E00;&#x81F4;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x6765;&#x5728;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E2D;&#x5B58;&#x50A8;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Facebook&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x9876;&#x70B9;&#x548C;&#x8FB9;&#x7684;&#x5355;&#x4E2A;&#x56FE;&#xFF1A;&#x9876;&#x70B9;&#x8868;&#x793A;&#x4EBA;&#xFF0C;&#x5730;&#x70B9;&#xFF0C;&#x4E8B;&#x4EF6;&#xFF0C;&#x7B7E;&#x5230;&#x548C;&#x7528;&#x6237;&#x7684;&#x8BC4;&#x8BBA;&#xFF1B;&#x8FB9;&#x7F18;&#x8868;&#x793A;&#x54EA;&#x4E9B;&#x4EBA;&#x662F;&#x5F7C;&#x6B64;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x54EA;&#x4E2A;&#x7B7E;&#x5230;&#x53D1;&#x751F;&#x5728;&#x4F55;&#x5904;&#xFF0C;&#x8C01;&#x8BC4;&#x8BBA;&#x4E86;&#x54EA;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x8C01;&#x53C2;&#x4E0E;&#x4E86;&#x54EA;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x7B49;&#x7B49;&#x3010;35&#x3011;&#x3002;</p>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;<a href="img/fig2-5.png">&#x56FE;2-5</a>&#x6240;&#x793A;&#x7684;&#x793A;&#x4F8B;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x4ECE;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x6216;&#x7CFB;&#x8C31;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x83B7;&#x5F97;&#xFF1A;&#x5B83;&#x663E;&#x793A;&#x4E86;&#x4E24;&#x4E2A;&#x4EBA;&#xFF0C;&#x6765;&#x81EA;&#x7231;&#x8FBE;&#x8377;&#x5DDE;&#x7684;Lucy&#x548C;&#x6765;&#x81EA;&#x6CD5;&#x56FD;Beaune&#x7684;Alain&#x3002;&#x4ED6;&#x4EEC;&#x5DF2;&#x5A5A;&#xFF0C;&#x4F4F;&#x5728;&#x4F26;&#x6566;&#x3002;</p>
<p><img src="img/fig2-5.png" alt=""></p>
<p><strong>&#x56FE;2-5 &#x56FE;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x793A;&#x4F8B;&#xFF08;&#x6846;&#x4EE3;&#x8868;&#x9876;&#x70B9;&#xFF0C;&#x7BAD;&#x5934;&#x4EE3;&#x8868;&#x8FB9;&#xFF09;</strong></p>
<p>&#x6709;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x4F46;&#x76F8;&#x5173;&#x7684;&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x6784;&#x5EFA;&#x548C;&#x67E5;&#x8BE2;&#x56FE;&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x5C5E;&#x6027;&#x56FE;&#x6A21;&#x578B;&#xFF08;&#x7531;Neo4j&#xFF0C;Titan&#x548C;InfiniteGraph&#x5B9E;&#x73B0;&#xFF09;&#x548C;&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#xFF08;triple-store&#xFF09;&#x6A21;&#x578B;&#xFF08;&#x7531;Datomic&#xFF0C;AllegroGraph&#x7B49;&#x5B9E;&#x73B0;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x67E5;&#x770B;&#x56FE;&#x7684;&#x4E09;&#x79CD;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF1A;Cypher&#xFF0C;SPARQL&#x548C;Datalog&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x50CF;Gremlin &#x3010;36&#x3011;&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x5F62;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x548C;&#x50CF;Pregel&#x8FD9;&#x6837;&#x7684;&#x56FE;&#x5F62;&#x5904;&#x7406;&#x6846;&#x67B6;&#xFF08;&#x89C1;<a href="ch10.html">&#x7B2C;10&#x7AE0;</a>&#xFF09;&#x3002;</p>
<h3 id="&#x5C5E;&#x6027;&#x56FE;">&#x5C5E;&#x6027;&#x56FE;</h3>
<p>&#x5728;&#x5C5E;&#x6027;&#x56FE;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;<strong>&#x9876;&#x70B9;&#xFF08;vertex&#xFF09;</strong> &#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x552F;&#x4E00;&#x7684;&#x6807;&#x8BC6;&#x7B26;</li>
<li>&#x4E00;&#x7EC4; <strong>&#x51FA;&#x8FB9;&#xFF08;outgoing edges&#xFF09;</strong></li>
<li>&#x4E00;&#x7EC4; <strong>&#x5165;&#x8FB9;&#xFF08;ingoing edges&#xFF09;</strong></li>
<li>&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#xFF08;&#x952E;&#x503C;&#x5BF9;&#xFF09;</li>
</ul>
<p>&#x6BCF;&#x6761; <strong>&#x8FB9;&#xFF08;edge&#xFF09;</strong> &#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7B26;</li>
<li><strong>&#x8FB9;&#x7684;&#x8D77;&#x70B9;/&#x5C3E;&#x90E8;&#x9876;&#x70B9;&#xFF08;tail vertex&#xFF09;</strong></li>
<li><strong>&#x8FB9;&#x7684;&#x7EC8;&#x70B9;/&#x5934;&#x90E8;&#x9876;&#x70B9;&#xFF08;head vertex&#xFF09;</strong></li>
<li>&#x63CF;&#x8FF0;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7C7B;&#x578B;&#x7684;&#x6807;&#x7B7E;</li>
<li>&#x4E00;&#x7EC4;&#x5C5E;&#x6027;&#xFF08;&#x952E;&#x503C;&#x5BF9;&#xFF09;</li>
</ul>
<p>&#x53EF;&#x4EE5;&#x5C06;&#x56FE;&#x5B58;&#x50A8;&#x770B;&#x4F5C;&#x7531;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x8868;&#x7EC4;&#x6210;&#xFF1A;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x9876;&#x70B9;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x8FB9;&#xFF0C;&#x5982;<a href="">&#x4F8B;2-2</a>&#x6240;&#x793A;&#xFF08;&#x8BE5;&#x6A21;&#x5F0F;&#x4F7F;&#x7528;PostgreSQL JSON&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6765;&#x5B58;&#x50A8;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x6216;&#x6BCF;&#x6761;&#x8FB9;&#x7684;&#x5C5E;&#x6027;&#xFF09;&#x3002;&#x5934;&#x90E8;&#x548C;&#x5C3E;&#x90E8;&#x9876;&#x70B9;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x6BCF;&#x6761;&#x8FB9;&#xFF1B;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x4E00;&#x7EC4;&#x9876;&#x70B9;&#x7684;&#x8F93;&#x5165;&#x6216;&#x8F93;&#x51FA;&#x8FB9;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x901A;&#x8FC7;<code>head_vertex</code>&#x6216;<code>tail_vertex</code>&#x6765;&#x67E5;&#x8BE2;<code>edges</code>&#x8868;&#x3002;</p>
<p><strong>&#x4F8B;2-2 &#x4F7F;&#x7528;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#x6765;&#x8868;&#x793A;&#x5C5E;&#x6027;&#x56FE;</strong></p>
<pre><code class="lang-sql"><span class="hljs-keyword">CREATE</span> <span class="hljs-keyword">TABLE</span> vertices (
  vertex_id  <span class="hljs-built_in">INTEGER</span> PRIMARY <span class="hljs-keyword">KEY</span>,
  properties <span class="hljs-keyword">JSON</span>
);

<span class="hljs-keyword">CREATE</span> <span class="hljs-keyword">TABLE</span> edges (
  edge_id     <span class="hljs-built_in">INTEGER</span> PRIMARY <span class="hljs-keyword">KEY</span>,
  tail_vertex <span class="hljs-built_in">INTEGER</span> <span class="hljs-keyword">REFERENCES</span> vertices (vertex_id),
  head_vertex <span class="hljs-built_in">INTEGER</span> <span class="hljs-keyword">REFERENCES</span> vertices (vertex_id),
  label       <span class="hljs-built_in">TEXT</span>,
  properties  <span class="hljs-keyword">JSON</span>
);

<span class="hljs-keyword">CREATE</span> <span class="hljs-keyword">INDEX</span> edges_tails <span class="hljs-keyword">ON</span> edges (tail_vertex);
<span class="hljs-keyword">CREATE</span> <span class="hljs-keyword">INDEX</span> edges_heads <span class="hljs-keyword">ON</span> edges (head_vertex);
</code></pre>
<p>&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x65B9;&#x9762;&#x662F;&#xFF1A;</p>
<ol>
<li>&#x4EFB;&#x4F55;&#x9876;&#x70B9;&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x6761;&#x8FB9;&#x8FDE;&#x63A5;&#x5230;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x9876;&#x70B9;&#x3002;&#x6CA1;&#x6709;&#x6A21;&#x5F0F;&#x9650;&#x5236;&#x54EA;&#x79CD;&#x4E8B;&#x7269;&#x53EF;&#x4E0D;&#x53EF;&#x4EE5;&#x5173;&#x8054;&#x3002;</li>
<li>&#x7ED9;&#x5B9A;&#x4EFB;&#x4F55;&#x9876;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x5730;&#x627E;&#x5230;&#x5B83;&#x7684;&#x5165;&#x8FB9;&#x548C;&#x51FA;&#x8FB9;&#xFF0C;&#x4ECE;&#x800C;&#x904D;&#x5386;&#x56FE;&#xFF0C;&#x5373;&#x6CBF;&#x7740;&#x4E00;&#x7CFB;&#x5217;&#x9876;&#x70B9;&#x7684;&#x8DEF;&#x5F84;&#x524D;&#x540E;&#x79FB;&#x52A8;&#x3002;&#xFF08;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;<a href="">&#x4F8B;2-2</a>&#x5728;<code>tail_vertex</code>&#x548C;<code>head_vertex</code>&#x5217;&#x4E0A;&#x90FD;&#x6709;&#x7D22;&#x5F15;&#x7684;&#x539F;&#x56E0;&#x3002;&#xFF09;</li>
<li>&#x901A;&#x8FC7;&#x5BF9;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x5173;&#x7CFB;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x7B7E;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x56FE;&#x4E2D;&#x5B58;&#x50A8;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x540C;&#x65F6;&#x4ECD;&#x7136;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4E3A;&#x6570;&#x636E;&#x5EFA;&#x6A21;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5982;<a href="img/fig2-5.png">&#x56FE;2-5</a>&#x6240;&#x793A;&#x3002;&#x56FE;&#x4E2D;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E9B;&#x4F20;&#x7EDF;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#x96BE;&#x4EE5;&#x8868;&#x8FBE;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F8B;&#x5982;&#x4E0D;&#x540C;&#x56FD;&#x5BB6;&#x7684;&#x4E0D;&#x540C;&#x5730;&#x533A;&#x7ED3;&#x6784;&#xFF08;&#x6CD5;&#x56FD;&#x6709;&#x7701;&#x548C;&#x5DDE;&#xFF0C;&#x7F8E;&#x56FD;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5DDE;&#x548C;&#x5DDE;&#xFF09;&#xFF0C;&#x56FD;&#x4E2D;&#x56FD;&#x7684;&#x602A;&#x4E8B;&#xFF08;&#x5148;&#x5FFD;&#x7565;&#x4E3B;&#x6743;&#x56FD;&#x5BB6;&#x548C;&#x56FD;&#x5BB6;&#x9519;&#x7EFC;&#x590D;&#x6742;&#x7684;&#x70C2;&#x644A;&#x5B50;&#xFF09;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x7C92;&#x5EA6;&#xFF08;Lucy&#x73B0;&#x5728;&#x7684;&#x4F4F;&#x6240;&#x88AB;&#x6307;&#x5B9A;&#x4E3A;&#x4E00;&#x4E2A;&#x57CE;&#x5E02;&#xFF0C;&#x800C;&#x5979;&#x7684;&#x51FA;&#x751F;&#x5730;&#x70B9;&#x53EA;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5DDE;&#x7684;&#x7EA7;&#x522B;&#xFF09;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x5EF6;&#x4F38;&#x56FE;&#x8FD8;&#x80FD;&#x5305;&#x62EC;&#x8BB8;&#x591A;&#x5173;&#x4E8E;Lucy&#x548C;Alain&#xFF0C;&#x6216;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x5176;&#x4ED6;&#x66F4;&#x591A;&#x7684;&#x4E8B;&#x5B9E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x8868;&#x793A;&#x98DF;&#x7269;&#x8FC7;&#x654F;&#xFF08;&#x4E3A;&#x6BCF;&#x4E2A;&#x8FC7;&#x654F;&#x6E90;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x4EBA;&#x4E0E;&#x8FC7;&#x654F;&#x6E90;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x6761;&#x8FB9;&#x6765;&#x6307;&#x793A;&#x4E00;&#x79CD;&#x8FC7;&#x654F;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x5E76;&#x94FE;&#x63A5;&#x5230;&#x8FC7;&#x654F;&#x6E90;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FC7;&#x654F;&#x6E90;&#x5177;&#x6709;&#x4E00;&#x7EC4;&#x9876;&#x70B9;&#x7528;&#x6765;&#x663E;&#x793A;&#x54EA;&#x4E9B;&#x98DF;&#x7269;&#x542B;&#x6709;&#x54EA;&#x4E9B;&#x7269;&#x8D28;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#xFF0C;&#x627E;&#x51FA;&#x6BCF;&#x4E2A;&#x4EBA;&#x5403;&#x4EC0;&#x4E48;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x56FE;&#x8868;&#x5728;&#x53EF;&#x6F14;&#x5316;&#x6027;&#x662F;&#x5BCC;&#x6709;&#x4F18;&#x52BF;&#x7684;&#xFF1A;&#x5F53;&#x5411;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6DFB;&#x52A0;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x6269;&#x5C55;&#x56FE;&#x4EE5;&#x9002;&#x5E94;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
<h3 id="cypher&#x67E5;&#x8BE2;&#x8BED;&#x8A00;">Cypher&#x67E5;&#x8BE2;&#x8BED;&#x8A00;</h3>
<p>Cypher&#x662F;&#x5C5E;&#x6027;&#x56FE;&#x7684;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x4E3A;Neo4j&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x800C;&#x53D1;&#x660E;&#x3010;37&#x3011;&#x3002;&#xFF08;&#x5B83;&#x662F;&#x4EE5;&#x7535;&#x5F71;&#x201C;&#x9ED1;&#x5BA2;&#x5E1D;&#x56FD;&#x201D;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x89D2;&#x8272;&#x6765;&#x547D;&#x540D;&#x7684;&#xFF0C;&#x800C;&#x4E0E;&#x5BC6;&#x7801;&#x672F;&#x4E2D;&#x7684;&#x5BC6;&#x7801;&#x65E0;&#x5173;&#x3010;38&#x3011;&#x3002;&#xFF09;</p>
<p><a href="">&#x4F8B;2-3</a>&#x663E;&#x793A;&#x4E86;&#x5C06;<a href="img/fig2-5.png">&#x56FE;2-5</a>&#x7684;&#x5DE6;&#x8FB9;&#x90E8;&#x5206;&#x63D2;&#x5165;&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x7684;Cypher&#x67E5;&#x8BE2;&#x3002;&#x53EF;&#x4EE5;&#x7C7B;&#x4F3C;&#x5730;&#x6DFB;&#x52A0;&#x56FE;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#xFF0C;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x9605;&#x8BFB;&#x800C;&#x7701;&#x7565;&#x3002;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x50CF;<code>USA</code>&#x6216;<code>Idaho</code>&#x8FD9;&#x6837;&#x7684;&#x7B26;&#x53F7;&#x540D;&#x79F0;&#xFF0C;&#x67E5;&#x8BE2;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x540D;&#x79F0;&#x5728;&#x9876;&#x70B9;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x8FB9;&#xFF0C;&#x4F7F;&#x7528;&#x7BAD;&#x5934;&#x7B26;&#x53F7;&#xFF1A;<code>&#xFF08;Idaho&#xFF09; - [&#xFF1A;WITHIN] -&gt;&#xFF08;USA&#xFF09;</code>&#x521B;&#x5EFA;&#x4E00;&#x6761;&#x6807;&#x8BB0;&#x4E3A;<code>WITHIN</code>&#x7684;&#x8FB9;&#xFF0C;<code>Idaho</code>&#x4E3A;&#x5C3E;&#x8282;&#x70B9;&#xFF0C;<code>USA</code>&#x4E3A;&#x5934;&#x8282;&#x70B9;&#x3002;</p>
<p><strong>&#x4F8B;2-3 &#x5C06;&#x56FE;2-5&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5B50;&#x96C6;&#x8868;&#x793A;&#x4E3A;Cypher&#x67E5;&#x8BE2;</strong></p>
<pre><code class="lang-cypher">CREATE
    (NAmerica:Location {name:&apos;North America&apos;, type:&apos;continent&apos;}),
    (USA:Location      {name:&apos;United States&apos;, type:&apos;country&apos;  }),
    (Idaho:Location    {name:&apos;Idaho&apos;,         type:&apos;state&apos;    }),
    (Lucy:Person       {name:&apos;Lucy&apos; }),
    (Idaho) -[:WITHIN]-&gt;  (USA)  -[:WITHIN]-&gt; (NAmerica),
    (Lucy)  -[:BORN_IN]-&gt; (Idaho)
</code></pre>
<p>&#x5F53;<a href="img/fig2-5.png">&#x56FE;2-5</a>&#x7684;&#x6240;&#x6709;&#x9876;&#x70B9;&#x548C;&#x8FB9;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x636E;&#x5E93;&#x540E;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x63D0;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x627E;&#x5230;&#x6240;&#x6709;&#x4ECE;&#x7F8E;&#x56FD;&#x79FB;&#x6C11;&#x5230;&#x6B27;&#x6D32;&#x7684;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#x3002;&#x66F4;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x627E;&#x5230;&#x7B26;&#x5408;&#x4E0B;&#x9762;&#x6761;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x9876;&#x70B9;&#xFF0C;&#x5E76;&#x4E14;&#x8FD4;&#x56DE;&#x8FD9;&#x4E9B;&#x9876;&#x70B9;&#x7684;<code>name</code>&#x5C5E;&#x6027;&#xFF1A;&#x8BE5;&#x9876;&#x70B9;&#x62E5;&#x6709;&#x4E00;&#x6761;&#x8FDE;&#x5230;&#x7F8E;&#x56FD;&#x4EFB;&#x4E00;&#x4F4D;&#x7F6E;&#x7684;<code>BORN_IN</code>&#x8FB9;&#xFF0C;&#x548C;&#x4E00;&#x6761;&#x8FDE;&#x5230;&#x6B27;&#x6D32;&#x7684;&#x4EFB;&#x4E00;&#x4F4D;&#x7F6E;&#x7684;<code>LIVING_IN</code>&#x8FB9;&#x3002;</p>
<p><a href="">&#x4F8B;2-4</a>&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x5728;Cypher&#x4E2D;&#x8868;&#x8FBE;&#x8FD9;&#x4E2A;&#x67E5;&#x8BE2;&#x3002;&#x5728;MATCH&#x5B50;&#x53E5;&#x4E2D;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x7BAD;&#x5934;&#x7B26;&#x53F7;&#x6765;&#x67E5;&#x627E;&#x56FE;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;<code>(person) -[:BORN_IN]-&gt; ()</code> &#x53EF;&#x4EE5;&#x5339;&#x914D;<code>BORN_IN</code>&#x8FB9;&#x7684;&#x4EFB;&#x610F;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x3002;&#x8BE5;&#x8FB9;&#x7684;&#x5C3E;&#x8282;&#x70B9;&#x88AB;&#x7ED1;&#x5B9A;&#x4E86;&#x53D8;&#x91CF;<code>person</code>&#xFF0C;&#x5934;&#x8282;&#x70B9;&#x5219;&#x672A;&#x88AB;&#x7ED1;&#x5B9A;&#x3002;</p>
<p><strong>&#x4F8B;2-4 &#x67E5;&#x627E;&#x6240;&#x6709;&#x4ECE;&#x7F8E;&#x56FD;&#x79FB;&#x6C11;&#x5230;&#x6B27;&#x6D32;&#x7684;&#x4EBA;&#x7684;Cypher&#x67E5;&#x8BE2;&#xFF1A;</strong></p>
<pre><code class="lang-cypher">MATCH
    (person) -[:BORN_IN]-&gt;  () -[:WITHIN*0..]-&gt; (us:Location {name:&apos;United States&apos;}),
    (person) -[:LIVES_IN]-&gt; () -[:WITHIN*0..]-&gt; (eu:Location {name:&apos;Europe&apos;})
RETURN person.name
</code></pre>
<p>&#x67E5;&#x8BE2;&#x6309;&#x5982;&#x4E0B;&#x6765;&#x89E3;&#x8BFB;&#xFF1A;</p>
<blockquote>
<p>&#x627E;&#x5230;&#x6EE1;&#x8DB3;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x9876;&#x70B9;&#xFF08;&#x79F0;&#x4E4B;&#x4E3A;person&#x9876;&#x70B9;&#xFF09;&#xFF1A;</p>
<ol>
<li><p><code>person</code>&#x9876;&#x70B9;&#x62E5;&#x6709;&#x4E00;&#x6761;&#x5230;&#x67D0;&#x4E2A;&#x9876;&#x70B9;&#x7684;<code>BORN_IN</code>&#x51FA;&#x8FB9;&#x3002;&#x4ECE;&#x90A3;&#x4E2A;&#x9876;&#x70B9;&#x5F00;&#x59CB;&#xFF0C;&#x6CBF;&#x7740;&#x4E00;&#x7CFB;&#x5217;<code>WITHIN</code>&#x51FA;&#x8FB9;&#x6700;&#x7EC8;&#x5230;&#x8FBE;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x4E3A;<code>Location</code>&#xFF0C;<code>name</code>&#x5C5E;&#x6027;&#x4E3A;<code>United States</code>&#x7684;&#x9876;&#x70B9;&#x3002;</p>
</li>
<li><p><code>person</code>&#x9876;&#x70B9;&#x8FD8;&#x62E5;&#x6709;&#x4E00;&#x6761;<code>LIVES_IN</code>&#x51FA;&#x8FB9;&#x3002;&#x6CBF;&#x7740;&#x8FD9;&#x6761;&#x8FB9;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;<code>WITHIN</code>&#x51FA;&#x8FB9;&#x6700;&#x7EC8;&#x5230;&#x8FBE;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x4E3A;<code>Location</code>&#xFF0C;<code>name</code>&#x5C5E;&#x6027;&#x4E3A;<code>Europe</code>&#x7684;&#x9876;&#x70B9;&#x3002;</p>
</li>
</ol>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;<code>Person</code>&#x9876;&#x70B9;&#xFF0C;&#x8FD4;&#x56DE;&#x5176;<code>name</code>&#x5C5E;&#x6027;&#x3002;</p>
</blockquote>
<p>&#x6267;&#x884C;&#x8FD9;&#x6761;&#x67E5;&#x8BE2;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x51E0;&#x79CD;&#x53EF;&#x884C;&#x7684;&#x67E5;&#x8BE2;&#x8DEF;&#x5F84;&#x3002;&#x8FD9;&#x91CC;&#x7ED9;&#x51FA;&#x7684;&#x63CF;&#x8FF0;&#x5EFA;&#x8BAE;&#x9996;&#x5148;&#x626B;&#x63CF;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EBA;&#xFF0C;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x51FA;&#x751F;&#x5730;&#x548C;&#x5C45;&#x4F4F;&#x5730;&#xFF0C;&#x7136;&#x540E;&#x53EA;&#x8FD4;&#x56DE;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x7684;&#x90A3;&#x4E9B;&#x4EBA;&#x3002;</p>
<p>&#x7B49;&#x4EF7;&#x5730;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x4E24;&#x4E2A;<code>Location</code>&#x9876;&#x70B9;&#x5F00;&#x59CB;&#x53CD;&#x5411;&#x5730;&#x67E5;&#x627E;&#x3002;&#x5047;&#x5982;<code>name</code>&#x5C5E;&#x6027;&#x4E0A;&#x6709;&#x7D22;&#x5F15;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x5730;&#x627E;&#x5230;&#x4EE3;&#x8868;&#x7F8E;&#x56FD;&#x548C;&#x6B27;&#x6D32;&#x7684;&#x4E24;&#x4E2A;&#x9876;&#x70B9;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6CBF;&#x7740;&#x6240;&#x6709;<code>WITHIN</code>&#x5165;&#x8FB9;&#xFF0C;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x67E5;&#x627E;&#x51FA;&#x6240;&#x6709;&#x5728;&#x7F8E;&#x56FD;&#x548C;&#x6B27;&#x6D32;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x5DDE;&#xFF0C;&#x5730;&#x533A;&#xFF0C;&#x57CE;&#x5E02;&#x7B49;&#xFF09;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x67E5;&#x627E;&#x51FA;&#x90A3;&#x4E9B;&#x53EF;&#x4EE5;&#x7531;<code>BORN_IN</code>&#x6216;<code>LIVES_IN</code>&#x5165;&#x8FB9;&#x5230;&#x90A3;&#x4E9B;&#x4F4D;&#x7F6E;&#x9876;&#x70B9;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x5BF9;&#x4E8E;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x7F16;&#x5199;&#x67E5;&#x8BE2;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x6267;&#x884C;&#x7EC6;&#x8282;&#xFF1A;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x7A0B;&#x5E8F;&#x4F1A;&#x81EA;&#x52A8;&#x9009;&#x62E9;&#x9884;&#x6D4B;&#x6548;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x7B56;&#x7565;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x7F16;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x3002;</p>
<h3 id="sql&#x4E2D;&#x7684;&#x56FE;&#x67E5;&#x8BE2;">SQL&#x4E2D;&#x7684;&#x56FE;&#x67E5;&#x8BE2;</h3>
<p><a href="">&#x4F8B;2-2</a>&#x5EFA;&#x8BAE;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8868;&#x793A;&#x56FE;&#x6570;&#x636E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x628A;&#x56FE;&#x6570;&#x636E;&#x653E;&#x5165;&#x5173;&#x7CFB;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;SQL&#x67E5;&#x8BE2;&#x5B83;&#xFF1F;</p>
<p>&#x7B54;&#x6848;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x4E9B;&#x56F0;&#x96BE;&#x3002;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4F60;&#x901A;&#x5E38;&#x4F1A;&#x4E8B;&#x5148;&#x77E5;&#x9053;&#x5728;&#x67E5;&#x8BE2;&#x4E2D;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x8FDE;&#x63A5;&#x3002;&#x5728;&#x56FE;&#x67E5;&#x8BE2;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x627E;&#x5230;&#x5F85;&#x67E5;&#x627E;&#x7684;&#x9876;&#x70B9;&#x4E4B;&#x524D;&#xFF0C;&#x904D;&#x5386;&#x53EF;&#x53D8;&#x6570;&#x91CF;&#x7684;&#x8FB9;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x91CF;&#x4E8B;&#x5148;&#x5E76;&#x4E0D;&#x786E;&#x5B9A;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FD9;&#x53D1;&#x751F;&#x5728;Cypher&#x67E5;&#x8BE2;&#x4E2D;&#x7684;<code>() -[:WITHIN*0..]-&gt; ()</code>&#x89C4;&#x5219;&#x4E2D;&#x3002;&#x4E00;&#x4E2A;&#x4EBA;&#x7684;<code>LIVES_IN</code>&#x8FB9;&#x53EF;&#x4EE5;&#x6307;&#x5411;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x4F4D;&#x7F6E;&#xFF1A;&#x8857;&#x9053;&#xFF0C;&#x57CE;&#x5E02;&#xFF0C;&#x5730;&#x533A;&#xFF0C;&#x5730;&#x533A;&#xFF0C;&#x56FD;&#x5BB6;&#x7B49;&#x3002;&#x57CE;&#x5E02;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x533A;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x5DDE;&#x5185;&#x7684;&#x4E00;&#x4E2A;&#x5730;&#x533A;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x56FD;&#x5BB6;&#x5185;&#x7684;&#x4E00;&#x4E2A;&#x5DDE;&#x7B49;&#x7B49;&#x3002;<code>LIVES_IN</code>&#x8FB9;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x6307;&#x5411;&#x6B63;&#x5728;&#x67E5;&#x627E;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x5728;&#x4F4D;&#x7F6E;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x4E2D;&#x9694;&#x4E86;&#x6570;&#x5C42;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
<p>&#x5728;Cypher&#x4E2D;&#xFF0C;&#x7528;<code>WITHIN * 0</code>&#x975E;&#x5E38;&#x7B80;&#x6D01;&#x5730;&#x8868;&#x8FF0;&#x4E86;&#x4E0A;&#x8FF0;&#x4E8B;&#x5B9E;&#xFF1A;&#x201C;&#x6CBF;&#x7740;<code>WITHIN</code>&#x8FB9;&#xFF0C;&#x96F6;&#x6B21;&#x6216;&#x591A;&#x6B21;&#x201D;&#x3002;&#x5B83;&#x5F88;&#x50CF;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#x7684;<code>*</code>&#x8FD0;&#x7B97;&#x7B26;&#x3002;</p>
<p>&#x81EA;SQL:1999&#xFF0C;&#x67E5;&#x8BE2;&#x53EF;&#x53D8;&#x957F;&#x5EA6;&#x904D;&#x5386;&#x8DEF;&#x5F84;&#x7684;&#x601D;&#x60F3;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x79F0;&#x4E3A;<strong>&#x9012;&#x5F52;&#x516C;&#x7528;&#x8868;&#x8868;&#x8FBE;&#x5F0F;</strong>&#xFF08;<code>WITH RECURSIVE</code>&#x8BED;&#x6CD5;&#xFF09;&#x7684;&#x4E1C;&#x897F;&#x6765;&#x8868;&#x793A;&#x3002;<a href="">&#x4F8B;2-5</a>&#x663E;&#x793A;&#x4E86;&#x540C;&#x6837;&#x7684;&#x67E5;&#x8BE2; - &#x67E5;&#x627E;&#x4ECE;&#x7F8E;&#x56FD;&#x79FB;&#x6C11;&#x5230;&#x6B27;&#x6D32;&#x7684;&#x4EBA;&#x7684;&#x59D3;&#x540D; - &#x5728;SQL&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#xFF08;PostgreSQL&#xFF0C;IBM DB2&#xFF0C;Oracle&#x548C;SQL Server&#x5747;&#x652F;&#x6301;&#xFF09;&#x6765;&#x8868;&#x8FF0;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E0E;Cypher&#x76F8;&#x6BD4;&#xFF0C;&#x5176;&#x8BED;&#x6CD5;&#x975E;&#x5E38;&#x7B28;&#x62D9;&#x3002;</p>
<p><strong>&#x4F8B;2-5  &#x4E0E;&#x793A;&#x4F8B;2-4&#x540C;&#x6837;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x5728;SQL&#x4E2D;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x516C;&#x7528;&#x8868;&#x8868;&#x8FBE;&#x5F0F;&#x8868;&#x793A;</strong></p>
<pre><code class="lang-sql">WITH RECURSIVE
  <span class="hljs-comment">-- in_usa &#x5305;&#x542B;&#x6240;&#x6709;&#x7684;&#x7F8E;&#x56FD;&#x5883;&#x5185;&#x7684;&#x4F4D;&#x7F6E;ID</span>
    in_usa(vertex_id) AS (
    <span class="hljs-keyword">SELECT</span> vertex_id <span class="hljs-keyword">FROM</span> vertices <span class="hljs-keyword">WHERE</span> properties -&gt;&gt; <span class="hljs-string">&apos;name&apos;</span> = <span class="hljs-string">&apos;United States&apos;</span>
    <span class="hljs-keyword">UNION</span>
    <span class="hljs-keyword">SELECT</span> edges.tail_vertex <span class="hljs-keyword">FROM</span> edges
      <span class="hljs-keyword">JOIN</span> in_usa <span class="hljs-keyword">ON</span> edges.head_vertex = in_usa.vertex_id
      <span class="hljs-keyword">WHERE</span> edges.label = <span class="hljs-string">&apos;within&apos;</span>
  ),
  <span class="hljs-comment">-- in_europe &#x5305;&#x542B;&#x6240;&#x6709;&#x7684;&#x6B27;&#x6D32;&#x5883;&#x5185;&#x7684;&#x4F4D;&#x7F6E;ID</span>
    in_europe(vertex_id) <span class="hljs-keyword">AS</span> (
    <span class="hljs-keyword">SELECT</span> vertex_id <span class="hljs-keyword">FROM</span> vertices <span class="hljs-keyword">WHERE</span> properties -&gt;&gt; <span class="hljs-string">&apos;name&apos;</span> = <span class="hljs-string">&apos;Europe&apos;</span>
    <span class="hljs-keyword">UNION</span>
    <span class="hljs-keyword">SELECT</span> edges.tail_vertex <span class="hljs-keyword">FROM</span> edges
      <span class="hljs-keyword">JOIN</span> in_europe <span class="hljs-keyword">ON</span> edges.head_vertex = in_europe.vertex_id
      <span class="hljs-keyword">WHERE</span> edges.label = <span class="hljs-string">&apos;within&apos;</span> ),

  <span class="hljs-comment">-- born_in_usa &#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x7C7B;&#x578B;&#x4E3A;Person&#xFF0C;&#x4E14;&#x51FA;&#x751F;&#x5728;&#x7F8E;&#x56FD;&#x7684;&#x9876;&#x70B9;</span>
    born_in_usa(vertex_id) <span class="hljs-keyword">AS</span> (
      <span class="hljs-keyword">SELECT</span> edges.tail_vertex <span class="hljs-keyword">FROM</span> edges
        <span class="hljs-keyword">JOIN</span> in_usa <span class="hljs-keyword">ON</span> edges.head_vertex = in_usa.vertex_id
        <span class="hljs-keyword">WHERE</span> edges.label = <span class="hljs-string">&apos;born_in&apos;</span> ),

  <span class="hljs-comment">-- lives_in_europe &#x5305;&#x542B;&#x4E86;&#x6240;&#x6709;&#x7C7B;&#x578B;&#x4E3A;Person&#xFF0C;&#x4E14;&#x5C45;&#x4F4F;&#x5728;&#x6B27;&#x6D32;&#x7684;&#x9876;&#x70B9;&#x3002;</span>
    lives_in_europe(vertex_id) <span class="hljs-keyword">AS</span> (
      <span class="hljs-keyword">SELECT</span> edges.tail_vertex <span class="hljs-keyword">FROM</span> edges
        <span class="hljs-keyword">JOIN</span> in_europe <span class="hljs-keyword">ON</span> edges.head_vertex = in_europe.vertex_id
        <span class="hljs-keyword">WHERE</span> edges.label = <span class="hljs-string">&apos;lives_in&apos;</span>)

  <span class="hljs-keyword">SELECT</span> vertices.properties -&gt;&gt; <span class="hljs-string">&apos;name&apos;</span>
  <span class="hljs-keyword">FROM</span> vertices
    <span class="hljs-keyword">JOIN</span> born_in_usa <span class="hljs-keyword">ON</span> vertices.vertex_id = born_in_usa.vertex_id
    <span class="hljs-keyword">JOIN</span> lives_in_europe <span class="hljs-keyword">ON</span> vertices.vertex_id = lives_in_europe.vertex_id;
</code></pre>
<ul>
<li>&#x9996;&#x5148;&#xFF0C;&#x67E5;&#x627E;<code>name</code>&#x5C5E;&#x6027;&#x4E3A;<code>United States</code>&#x7684;&#x9876;&#x70B9;&#xFF0C;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;<code>in_usa</code>&#x9876;&#x70B9;&#x7684;&#x96C6;&#x5408;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;</li>
<li>&#x4ECE;<code>in_usa</code>&#x96C6;&#x5408;&#x7684;&#x9876;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x6CBF;&#x7740;&#x6240;&#x6709;&#x7684;<code>with_in</code>&#x5165;&#x8FB9;&#xFF0C;&#x5C06;&#x5176;&#x5C3E;&#x9876;&#x70B9;&#x52A0;&#x5165;&#x540C;&#x4E00;&#x96C6;&#x5408;&#xFF0C;&#x4E0D;&#x65AD;&#x9012;&#x5F52;&#x76F4;&#x5230;&#x6240;&#x6709;<code>with_in</code>&#x5165;&#x8FB9;&#x90FD;&#x88AB;&#x8BBF;&#x95EE;&#x5B8C;&#x6BD5;&#x3002;</li>
<li>&#x540C;&#x7406;&#xFF0C;&#x4ECE;<code>name</code>&#x5C5E;&#x6027;&#x4E3A;<code>Europe</code>&#x7684;&#x9876;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x5EFA;&#x7ACB;<code>in_europe</code>&#x9876;&#x70B9;&#x7684;&#x96C6;&#x5408;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;<code>in_usa</code>&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x6839;&#x636E;<code>born_in</code>&#x5165;&#x8FB9;&#x6765;&#x67E5;&#x627E;&#x51FA;&#x751F;&#x5728;&#x7F8E;&#x56FD;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x7684;&#x4EBA;&#x3002;</li>
<li>&#x540C;&#x6837;&#xFF0C;&#x5BF9;&#x4E8E;<code>in_europe</code>&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x6839;&#x636E;<code>lives_in</code>&#x5165;&#x8FB9;&#x6765;&#x67E5;&#x627E;&#x5C45;&#x4F4F;&#x5728;&#x6B27;&#x6D32;&#x7684;&#x4EBA;&#x3002;</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x628A;&#x5728;&#x7F8E;&#x56FD;&#x51FA;&#x751F;&#x7684;&#x4EBA;&#x7684;&#x96C6;&#x5408;&#x4E0E;&#x5728;&#x6B27;&#x6D32;&#x5C45;&#x4F4F;&#x7684;&#x4EBA;&#x7684;&#x96C6;&#x5408;&#x76F8;&#x4EA4;&#x3002;</li>
</ul>
<p>&#x540C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#xFF0C;&#x7528;&#x67D0;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x5199;&#x6210;4&#x884C;&#xFF0C;&#x800C;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x9700;&#x8981;29&#x884C;&#xFF0C;&#x8FD9;&#x6070;&#x6070;&#x8BF4;&#x660E;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x9009;&#x62E9;&#x9002;&#x5408;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<h3 id="&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#x548C;sparql">&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#x548C;SPARQL</h3>
<p>&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#x6A21;&#x5F0F;&#x5927;&#x4F53;&#x4E0A;&#x4E0E;&#x5C5E;&#x6027;&#x56FE;&#x6A21;&#x578B;&#x76F8;&#x540C;&#xFF0C;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x8BCD;&#x6765;&#x63CF;&#x8FF0;&#x76F8;&#x540C;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x4E0D;&#x8FC7;&#x4ECD;&#x7136;&#x503C;&#x5F97;&#x8BA8;&#x8BBA;&#xFF0C;&#x56E0;&#x4E3A;&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#x6709;&#x5F88;&#x591A;&#x73B0;&#x6210;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x548C;&#x8BED;&#x8A00;&#x5BF9;&#x4E8E;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5DE5;&#x5177;&#x7BB1;&#x53EF;&#x80FD;&#x662F;&#x5B9D;&#x8D35;&#x7684;&#x8865;&#x5145;&#x3002;</p>
<p>&#x5728;&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x90FD;&#x4EE5;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4E09;&#x90E8;&#x5206;&#x8868;&#x793A;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#xFF08;<strong>&#x4E3B;&#x8BED;</strong>&#xFF0C;<strong>&#x8C13;&#x8BED;</strong>&#xFF0C;<strong>&#x5BBE;&#x8BED;</strong>&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E09;&#x5143;&#x7EC4; <strong>(&#x5409;&#x59C6;, &#x559C;&#x6B22; ,&#x9999;&#x8549;)</strong> &#x4E2D;&#xFF0C;<strong>&#x5409;&#x59C6;</strong> &#x662F;&#x4E3B;&#x8BED;&#xFF0C;<strong>&#x559C;&#x6B22;</strong> &#x662F;&#x8C13;&#x8BED;&#xFF08;&#x52A8;&#x8BCD;&#xFF09;&#xFF0C;<strong>&#x9999;&#x8549;</strong> &#x662F;&#x5BF9;&#x8C61;&#x3002;</p>
<p>&#x4E09;&#x5143;&#x7EC4;&#x7684;&#x4E3B;&#x8BED;&#x76F8;&#x5F53;&#x4E8E;&#x56FE;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x3002;&#x800C;&#x5BBE;&#x8BED;&#x662F;&#x4E0B;&#x9762;&#x4E24;&#x8005;&#x4E4B;&#x4E00;&#xFF1A;</p>
<ol>
<li>&#x539F;&#x59CB;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4E2D;&#x7684;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#x5B57;&#x7B26;&#x4E32;&#x6216;&#x6570;&#x5B57;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E09;&#x5143;&#x7EC4;&#x7684;&#x8C13;&#x8BED;&#x548C;&#x5BBE;&#x8BED;&#x76F8;&#x5F53;&#x4E8E;&#x4E3B;&#x8BED;&#x9876;&#x70B9;&#x4E0A;&#x7684;&#x5C5E;&#x6027;&#x7684;&#x952E;&#x548C;&#x503C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>(lucy, age, 33)</code>&#x5C31;&#x50CF;&#x5C5E;&#x6027;<code>{&#x201C;age&#x201D;&#xFF1A;33}</code>&#x7684;&#x9876;&#x70B9;lucy&#x3002;</li>
<li>&#x56FE;&#x4E2D;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8C13;&#x8BED;&#x662F;&#x56FE;&#x4E2D;&#x7684;&#x4E00;&#x6761;&#x8FB9;&#xFF0C;&#x4E3B;&#x8BED;&#x662F;&#x5176;&#x5C3E;&#x90E8;&#x9876;&#x70B9;&#xFF0C;&#x800C;&#x5BBE;&#x8BED;&#x662F;&#x5176;&#x5934;&#x90E8;&#x9876;&#x70B9;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;<code>(lucy, marriedTo, alain)</code>&#x4E2D;&#x4E3B;&#x8BED;&#x548C;&#x5BBE;&#x8BED;<code>lucy</code>&#x548C;<code>alain</code>&#x90FD;&#x662F;&#x9876;&#x70B9;&#xFF0C;&#x5E76;&#x4E14;&#x8C13;&#x8BED;<code>marriedTo</code>&#x662F;&#x8FDE;&#x63A5;&#x4ED6;&#x4EEC;&#x7684;&#x8FB9;&#x7684;&#x6807;&#x7B7E;&#x3002;</li>
</ol>
<p><a href="">&#x4F8B;2-6</a>&#x663E;&#x793A;&#x4E86;&#x4E0E;<a href="">&#x4F8B;2-3</a>&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x79F0;&#x4E3A;Turtle&#x7684;&#x683C;&#x5F0F;&#xFF08;Notation3&#xFF08;N3&#xFF09;&#x3010;39&#x3011;&#xFF09;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#x5F62;&#x5F0F;&#x5199;&#x6210;&#x4E09;&#x5143;&#x7EC4;&#x3002;</p>
<p><strong>&#x4F8B;2-6 &#x56FE;2-5&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5B50;&#x96C6;&#xFF0C;&#x8868;&#x793A;&#x4E3A;Turtle&#x4E09;&#x5143;&#x7EC4;</strong></p>
<pre><code class="lang-reStructuredText">@prefix : &lt;urn:example:&gt;.
_:lucy     a       :Person.
_:lucy     :name   &quot;Lucy&quot;.
_:lucy     :bornIn _:idaho.
_:idaho    a       :Location.
_:idaho    :name   &quot;Idaho&quot;.
_:idaho    :type   &quot;state&quot;.
_:idaho    :within _:usa.
_:usa      a       :Location
_:usa      :name   &quot;United States&quot;
_:usa      :type   &quot;country&quot;.
_:usa      :within _:namerica.
_:namerica a       :Location
_:namerica :name   &quot;North America&quot;
_:namerica :type   :&quot;continent&quot;
</code></pre>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x56FE;&#x7684;&#x9876;&#x70B9;&#x88AB;&#x5199;&#x4E3A;&#xFF1A;<code>_&#xFF1A;someName</code>&#x3002;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x4EE5;&#x5916;&#x7684;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;&#x5B83;&#x7684;&#x5B58;&#x5728;&#x53EA;&#x662F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x660E;&#x786E;&#x54EA;&#x4E9B;&#x4E09;&#x5143;&#x7EC4;&#x5F15;&#x7528;&#x4E86;&#x540C;&#x4E00;&#x9876;&#x70B9;&#x3002;&#x5F53;&#x8C13;&#x8BED;&#x8868;&#x793A;&#x8FB9;&#x65F6;&#xFF0C;&#x8BE5;&#x5BBE;&#x8BED;&#x662F;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#xFF0C;&#x5982;<code>_:idaho :within _:usa.</code>&#x3002;&#x5F53;&#x8C13;&#x8BED;&#x662F;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x65F6;&#xFF0C;&#x8BE5;&#x5BBE;&#x8BED;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5982;<code>_:usa :name &quot;United States&quot;</code></p>
<p>&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x5730;&#x91CD;&#x590D;&#x76F8;&#x540C;&#x7684;&#x4E3B;&#x8BED;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x5F53;&#x91CD;&#x590D;&#xFF0C;&#x4F46;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5206;&#x53F7;&#x6765;&#x8BF4;&#x660E;&#x5173;&#x4E8E;&#x540C;&#x4E00;&#x4E3B;&#x8BED;&#x7684;&#x591A;&#x4E2A;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;Turtle&#x683C;&#x5F0F;&#x76F8;&#x5F53;&#x4E0D;&#x9519;&#xFF0C;&#x53EF;&#x8BFB;&#x6027;&#x5F3A;&#xFF1A;&#x53C2;&#x89C1;<a href="">&#x4F8B;2-7</a>&#x3002;</p>
<p><strong>&#x4F8B;2-7 &#x4E00;&#x79CD;&#x76F8;&#x5BF9;&#x4F8B;2-6&#x5199;&#x5165;&#x6570;&#x636E;&#x7684;&#x66F4;&#x4E3A;&#x7B80;&#x6D01;&#x7684;&#x65B9;&#x6CD5;&#x3002;</strong></p>
<pre><code>@prefix : &lt;urn:example:&gt;.
_:lucy      a :Person;   :name &quot;Lucy&quot;;          :bornIn _:idaho.
_:idaho     a :Location; :name &quot;Idaho&quot;;         :type &quot;state&quot;;   :within _:usa
_:usa       a :Loaction; :name &quot;United States&quot;; :type &quot;country&quot;; :within _:namerica.
_:namerica  a :Location; :name &quot;North America&quot;; :type &quot;continent&quot;.
</code></pre><h4 id="&#x8BED;&#x4E49;&#x7F51;&#x7EDC;">&#x8BED;&#x4E49;&#x7F51;&#x7EDC;</h4>
<p>&#x5982;&#x679C;&#x4F60;&#x9605;&#x8BFB;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5377;&#x5165;&#x5173;&#x4E8E;&#x8BED;&#x4E49;&#x7F51;&#x7EDC;&#x7684;&#x6587;&#x7AE0;&#x6F29;&#x6DA1;&#x4E2D;&#x3002;&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x4E8E;&#x8BED;&#x4E49;&#x7F51;&#x7EDC;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;Datomic&#x3010;40&#x3011;&#x662F;&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;<sup><a href="#fn_vii" id="reffn_vii">vii</a></sup>&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x58F0;&#x79F0;&#x4E0E;&#x5B83;&#x6709;&#x4EFB;&#x4F55;&#x5173;&#x7CFB;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x773C;&#x4E2D;&#x8FD9;&#x4E24;&#x8005;&#x7D27;&#x5BC6;&#x76F8;&#x8FDE;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x7B80;&#x8981;&#x5730;&#x8BA8;&#x8BBA;&#x4E00;&#x4E0B;&#x3002;</p>
<blockquote id="fn_vii">
<sup>vii</sup>. &#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BB2;&#xFF0C;Datomic&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E94;&#x5143;&#x7EC4;&#x800C;&#x4E0D;&#x662F;&#x4E09;&#x5143;&#x7EC4;&#xFF0C;&#x4E24;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x5B57;&#x6BB5;&#x662F;&#x7528;&#x4E8E;&#x7248;&#x672C;&#x63A7;&#x5236;&#x7684;&#x5143;&#x6570;&#x636E;<a href="#reffn_vii" title="Jump back to footnote [vii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x8BB2;&#x8BED;&#x4E49;&#x7F51;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x4E14;&#x5408;&#x7406;&#x7684;&#x60F3;&#x6CD5;&#xFF1A;&#x7F51;&#x7AD9;&#x5DF2;&#x7ECF;&#x5C06;&#x4FE1;&#x606F;&#x53D1;&#x5E03;&#x4E3A;&#x6587;&#x5B57;&#x548C;&#x56FE;&#x7247;&#x4F9B;&#x4EBA;&#x7C7B;&#x9605;&#x8BFB;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5C06;&#x4FE1;&#x606F;&#x4F5C;&#x4E3A;&#x673A;&#x5668;&#x53EF;&#x8BFB;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x53D1;&#x5E03;&#x7ED9;&#x8BA1;&#x7B97;&#x673A;&#x5462;&#xFF1F;<strong>&#x8D44;&#x6E90;&#x63CF;&#x8FF0;&#x6846;&#x67B6;</strong>&#xFF08;RDF&#xFF09;&#x3010;41&#x3011;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4F5C;&#x4E3A;&#x4E0D;&#x540C;&#x7F51;&#x7AD9;&#x4EE5;&#x4E00;&#x81F4;&#x7684;&#x683C;&#x5F0F;&#x53D1;&#x5E03;&#x6570;&#x636E;&#x7684;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x5141;&#x8BB8;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x7F51;&#x7AD9;&#x7684;&#x6570;&#x636E;&#x81EA;&#x52A8;&#x5408;&#x5E76;&#x6210;<strong>&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x7F51;&#x7EDC;</strong> - &#x4E00;&#x79CD;&#x4E92;&#x8054;&#x7F51;&#x8303;&#x56F4;&#x5185;&#x7684;&#x201C;&#x5173;&#x4E8E;&#x4E00;&#x5207;&#x7684;&#x6570;&#x636E;&#x5E93;&#x201C;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BED;&#x4E49;&#x7F51;&#x5728;&#x4E8C;&#x5341;&#x4E00;&#x4E16;&#x7EAA;&#x521D;&#x88AB;&#x8FC7;&#x5EA6;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FF9;&#x8C61;&#x8868;&#x660E;&#x5DF2;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8BB8;&#x591A;&#x4EBA;&#x5472;&#x4E4B;&#x4EE5;&#x9F3B;&#x3002;&#x5B83;&#x8FD8;&#x906D;&#x53D7;&#x4E86;&#x8FC7;&#x591A;&#x7684;&#x4EE4;&#x4EBA;&#x773C;&#x82B1;&#x7F2D;&#x4E71;&#x7684;&#x7F29;&#x7565;&#x8BCD;&#xFF0C;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x6807;&#x51C6;&#x63D0;&#x8BAE;&#x548C;&#x72C2;&#x5984;&#x81EA;&#x5927;&#x7684;&#x82E6;&#x679C;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x4ED4;&#x7EC6;&#x89C2;&#x5BDF;&#x8FD9;&#x4E9B;&#x5931;&#x8D25;&#xFF0C;&#x8BED;&#x4E49;Web&#x9879;&#x76EE;&#x8FD8;&#x662F;&#x62E5;&#x6709;&#x5F88;&#x591A;&#x4F18;&#x79C0;&#x7684;&#x5DE5;&#x4F5C;&#x6210;&#x679C;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x6CA1;&#x6709;&#x5174;&#x8DA3;&#x5728;&#x8BED;&#x4E49;&#x7F51;&#x4E0A;&#x53D1;&#x5E03;RDF&#x6570;&#x636E;&#xFF0C;&#x4E09;&#x5143;&#x7EC4;&#x4E5F;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x826F;&#x597D;&#x5185;&#x90E8;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;</p>
<h4 id="rdf&#x6570;&#x636E;&#x6A21;&#x578B;">RDF&#x6570;&#x636E;&#x6A21;&#x578B;</h4>
<p><a href="">&#x4F8B;2-7</a>&#x4E2D;&#x4F7F;&#x7528;&#x7684;Turtle&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x4E8E;RDF&#x6570;&#x636E;&#x7684;&#x4EBA;&#x53EF;&#x8BFB;&#x683C;&#x5F0F;&#x3002;&#x6709;&#x65F6;&#x5019;&#xFF0C;RDF&#x4E5F;&#x53EF;&#x4EE5;&#x4EE5;XML&#x683C;&#x5F0F;&#x7F16;&#x5199;&#xFF0C;&#x4E0D;&#x8FC7;&#x5B8C;&#x6210;&#x540C;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x4F1A;&#x76F8;&#x5BF9;&#x5570;&#x55E6;&#xFF0C;&#x53C2;&#x89C1;<a href="">&#x4F8B;2-8</a>&#x3002;Turtle/N3&#x662F;&#x66F4;&#x53EF;&#x53D6;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x66F4;&#x5BB9;&#x6613;&#x9605;&#x8BFB;&#xFF0C;&#x50CF;Apache Jena &#x3010;42&#x3011;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x5728;&#x4E0D;&#x540C;&#x7684;RDF&#x683C;&#x5F0F;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x3002;</p>
<p><strong>&#x4F8B;2-8 &#x7528;RDF/XML&#x8BED;&#x6CD5;&#x8868;&#x793A;&#x4F8B;2-7&#x7684;&#x6570;&#x636E;</strong></p>
<pre><code class="lang-xml"><span class="hljs-tag">&lt;<span class="hljs-name">rdf:RDF</span> <span class="hljs-attr">xmlns</span>=<span class="hljs-string">&quot;urn:example:&quot;</span>
         <span class="hljs-attr">xmlns:rdf</span>=<span class="hljs-string">&quot;http://www.w3.org/1999/02/22-rdf-syntax-ns#&quot;</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">Location</span> <span class="hljs-attr">rdf:nodeID</span>=<span class="hljs-string">&quot;idaho&quot;</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">name</span>&gt;</span>Idaho<span class="hljs-tag">&lt;/<span class="hljs-name">name</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">type</span>&gt;</span>state<span class="hljs-tag">&lt;/<span class="hljs-name">type</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">within</span>&gt;</span>
            <span class="hljs-tag">&lt;<span class="hljs-name">Location</span> <span class="hljs-attr">rdf:nodeID</span>=<span class="hljs-string">&quot;usa&quot;</span>&gt;</span>
                <span class="hljs-tag">&lt;<span class="hljs-name">name</span>&gt;</span>United States<span class="hljs-tag">&lt;/<span class="hljs-name">name</span>&gt;</span>
                <span class="hljs-tag">&lt;<span class="hljs-name">type</span>&gt;</span>country<span class="hljs-tag">&lt;/<span class="hljs-name">type</span>&gt;</span>
                <span class="hljs-tag">&lt;<span class="hljs-name">within</span>&gt;</span>
                    <span class="hljs-tag">&lt;<span class="hljs-name">Location</span> <span class="hljs-attr">rdf:nodeID</span>=<span class="hljs-string">&quot;namerica&quot;</span>&gt;</span>
                        <span class="hljs-tag">&lt;<span class="hljs-name">name</span>&gt;</span>North America<span class="hljs-tag">&lt;/<span class="hljs-name">name</span>&gt;</span>
                        <span class="hljs-tag">&lt;<span class="hljs-name">type</span>&gt;</span>continent<span class="hljs-tag">&lt;/<span class="hljs-name">type</span>&gt;</span>
                    <span class="hljs-tag">&lt;/<span class="hljs-name">Location</span>&gt;</span>
                <span class="hljs-tag">&lt;/<span class="hljs-name">within</span>&gt;</span>
            <span class="hljs-tag">&lt;/<span class="hljs-name">Location</span>&gt;</span>
        <span class="hljs-tag">&lt;/<span class="hljs-name">within</span>&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">Location</span>&gt;</span>
    <span class="hljs-tag">&lt;<span class="hljs-name">Person</span> <span class="hljs-attr">rdf:nodeID</span>=<span class="hljs-string">&quot;lucy&quot;</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">name</span>&gt;</span>Lucy<span class="hljs-tag">&lt;/<span class="hljs-name">name</span>&gt;</span>
        <span class="hljs-tag">&lt;<span class="hljs-name">bornIn</span> <span class="hljs-attr">rdf:nodeID</span>=<span class="hljs-string">&quot;idaho&quot;</span>/&gt;</span>
    <span class="hljs-tag">&lt;/<span class="hljs-name">Person</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">rdf:RDF</span>&gt;</span>
</code></pre>
<p>RDF&#x6709;&#x4E00;&#x4E9B;&#x5947;&#x602A;&#x4E4B;&#x5904;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x4E3A;&#x4E86;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4EA4;&#x6362;&#x6570;&#x636E;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x4E09;&#x5143;&#x7EC4;&#x7684;&#x4E3B;&#x8BED;&#xFF0C;&#x8C13;&#x8BED;&#x548C;&#x5BBE;&#x8BED;&#x901A;&#x5E38;&#x662F;URI&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8C13;&#x8BED;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;URI&#xFF0C;&#x5982; <code>&lt;http://my-company.com/namespace#within&gt;</code>&#x6216;<code>&lt;http://my-company.com/namespace#lives_in&gt;</code>&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;<code>WITHIN</code>&#x6216;<code>LIVES_IN</code>&#x3002;&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x80CC;&#x540E;&#x7684;&#x539F;&#x56E0;&#x4E3A;&#x4E86;&#x8BA9;&#x4F60;&#x80FD;&#x591F;&#x628A;&#x4F60;&#x7684;&#x6570;&#x636E;&#x548C;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x8D4B;&#x4E88;&#x5355;&#x8BCD;<code>within</code>&#x6216;&#x8005;<code>lives_in</code>&#x4E0D;&#x540C;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x4E24;&#x8005;&#x4E5F;&#x4E0D;&#x4F1A;&#x51B2;&#x7A81;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x8C13;&#x8BED;&#x5B9E;&#x9645;&#x4E0A;&#x662F;<code>&lt;http://other.org/foo#within&gt;</code>&#x548C;<code>&lt;http://other.org/foo#lives_in&gt;</code>&#x3002;</p>
<p>&#x4ECE;RDF&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;URL <code>&lt;http://my-company.com/namespace&gt;</code> &#x4E0D;&#x4E00;&#x5B9A;&#x9700;&#x8981;&#x80FD;&#x89E3;&#x6790;&#x6210;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF0C;&#x5B83;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x3002;&#x4E3A;&#x907F;&#x514D;&#x4E0E;<code>http://URL</code>&#x6DF7;&#x6DC6;&#xFF0C;&#x672C;&#x8282;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x4F7F;&#x7528;&#x4E0D;&#x53EF;&#x89E3;&#x6790;&#x7684;URI&#xFF0C;&#x5982;<code>urn&#xFF1A;example&#xFF1A;within</code>&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x5728;&#x6587;&#x4EF6;&#x9876;&#x90E8;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x524D;&#x7F00;&#xFF0C;&#x7136;&#x540E;&#x5C31;&#x4E0D;&#x7528;&#x518D;&#x7BA1;&#x4E86;&#x3002;</p>
<h3 id="sparql&#x67E5;&#x8BE2;&#x8BED;&#x8A00;">SPARQL&#x67E5;&#x8BE2;&#x8BED;&#x8A00;</h3>
<p><strong>SPARQL</strong>&#x662F;&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x4E09;&#x5143;&#x7EC4;&#x5B58;&#x50A8;&#x7684;&#x9762;&#x5411;RDF&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x3010;43&#x3011;&#x3002;&#xFF08;&#x5B83;&#x662F;SPARQL&#x534F;&#x8BAE;&#x548C;RDF&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x53D1;&#x97F3;&#x4E3A;&#x201C;sparkle&#x201D;&#x3002;&#xFF09;SPARQL&#x65E9;&#x4E8E;Cypher&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;Cypher&#x7684;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x501F;&#x9274;&#x4E8E;SPARQL&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3010;37&#x3011;&#x3002;</p>
<p>&#x4E0E;&#x4E4B;&#x524D;&#x76F8;&#x540C;&#x7684;&#x67E5;&#x8BE2; - &#x67E5;&#x627E;&#x4ECE;&#x7F8E;&#x56FD;&#x8F6C;&#x79FB;&#x5230;&#x6B27;&#x6D32;&#x7684;&#x4EBA; - &#x4F7F;&#x7528;SPARQL&#x6BD4;&#x4F7F;&#x7528;Cypher&#x751A;&#x81F3;&#x66F4;&#x4E3A;&#x7B80;&#x6D01;&#xFF08;&#x53C2;&#x89C1;<a href="">&#x4F8B;2-9</a>&#xFF09;&#x3002;</p>
<p><strong>&#x4F8B;2-9 &#x4E0E;&#x793A;&#x4F8B;2-4&#x76F8;&#x540C;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x7528;SPARQL&#x8868;&#x793A;</strong></p>
<pre><code class="lang-sparql">PREFIX : &lt;urn:example:&gt;
SELECT ?personName WHERE {
  ?person :name ?personName.
  ?person :bornIn  / :within* / :name &quot;United States&quot;.
  ?person :livesIn / :within* / :name &quot;Europe&quot;.
}
</code></pre>
<p>&#x7ED3;&#x6784;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x8868;&#x8FBE;&#x5F0F;&#x662F;&#x7B49;&#x4EF7;&#x7684;&#xFF08;SPARQL&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x4EE5;&#x95EE;&#x53F7;&#x5F00;&#x5934;&#xFF09;&#xFF1A;</p>
<pre><code>(person) -[:BORN_IN]-&gt; () -[:WITHIN*0..]-&gt; (location)   # Cypher
?person :bornIn / :within* ?location.                   # SPARQL
</code></pre><p>&#x56E0;&#x4E3A;RDF&#x4E0D;&#x533A;&#x5206;&#x5C5E;&#x6027;&#x548C;&#x8FB9;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x5C06;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;&#x8C13;&#x8BED;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x8BED;&#x6CD5;&#x6765;&#x5339;&#x914D;&#x5C5E;&#x6027;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x8868;&#x8FBE;&#x5F0F;&#x4E2D;&#xFF0C;&#x53D8;&#x91CF;<code>usa</code>&#x88AB;&#x7ED1;&#x5B9A;&#x5230;&#x4EFB;&#x610F;&#x5177;&#x6709;&#x503C;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;<code>&quot;United States&quot;</code>&#x7684;<code>name</code>&#x5C5E;&#x6027;&#x7684;&#x9876;&#x70B9;&#xFF1A;</p>
<pre><code>(usa {name:&apos;United States&apos;})   # Cypher
?usa :name &quot;United States&quot;.    # SPARQL
</code></pre><p>SPARQL&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x597D;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x2014;&#x2014;&#x54EA;&#x6015;&#x8BED;&#x4E49;&#x7F51;&#x4ECE;&#x672A;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;&#x5F3A;&#x5927;&#x5DE5;&#x5177;&#x3002;</p>
<blockquote>
<h4 id="&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x76F8;&#x6BD4;&#x8F83;">&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x76F8;&#x6BD4;&#x8F83;</h4>
<p>&#x5728;&#x201C;<a href="#&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5426;&#x5728;&#x91CD;&#x8E48;&#x8986;&#x8F99;&#xFF1F;">&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5426;&#x5728;&#x91CD;&#x8E48;&#x8986;&#x8F99;&#xFF1F;</a>&#x201D;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;CODASYL&#x548C;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x5982;&#x4F55;&#x7ADE;&#x76F8;&#x89E3;&#x51B3;IMS&#x4E2D;&#x7684;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x95EE;&#x9898;&#x3002;&#x4E4D;&#x4E00;&#x770B;&#xFF0C;CODASYL&#x7684;&#x7F51;&#x7EDC;&#x6A21;&#x578B;&#x770B;&#x8D77;&#x6765;&#x4E0E;&#x56FE;&#x6A21;&#x578B;&#x76F8;&#x4F3C;&#x3002;CODASYL&#x662F;&#x5426;&#x662F;&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53D8;&#x79CD;&#xFF1F;</p>
<p>&#x4E0D;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x51E0;&#x4E2A;&#x91CD;&#x8981;&#x65B9;&#x9762;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF1A;</p>
<ul>
<li>&#x5728;CODASYL&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x6709;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x54EA;&#x79CD;&#x8BB0;&#x5F55;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#x5728;&#x5176;&#x4ED6;&#x8BB0;&#x5F55;&#x7C7B;&#x578B;&#x4E2D;&#x3002;&#x5728;&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x9650;&#x5236;&#xFF1A;&#x4EFB;&#x4F55;&#x9876;&#x70B9;&#x90FD;&#x53EF;&#x4EE5;&#x5177;&#x6709;&#x5230;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x9876;&#x70B9;&#x7684;&#x8FB9;&#x3002;&#x8FD9;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9002;&#x5E94;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;</li>
<li>&#x5728;CODASYL&#x4E2D;&#xFF0C;&#x8FBE;&#x5230;&#x7279;&#x5B9A;&#x8BB0;&#x5F55;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x904D;&#x5386;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x3002;&#x5728;&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5176;&#x552F;&#x4E00;ID&#x76F4;&#x63A5;&#x5F15;&#x7528;&#x4EFB;&#x4F55;&#x9876;&#x70B9;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x6765;&#x67E5;&#x627E;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x503C;&#x7684;&#x9876;&#x70B9;&#x3002;</li>
<li>&#x5728;CODASYL&#xFF0C;&#x8BB0;&#x5F55;&#x7684;&#x540E;&#x7EED;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF0C;&#x6240;&#x4EE5;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4EBA;&#x4E0D;&#x5F97;&#x4E0D;&#x7EF4;&#x6301;&#x6392;&#x5E8F;&#xFF08;&#x8FD9;&#x4F1A;&#x5F71;&#x54CD;&#x5B58;&#x50A8;&#x5E03;&#x5C40;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x63D2;&#x5165;&#x65B0;&#x8BB0;&#x5F55;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x5F97;&#x4E0D;&#x62C5;&#x5FC3;&#x7684;&#x65B0;&#x8BB0;&#x5F55;&#x5728;&#x8FD9;&#x4E9B;&#x96C6;&#x5408;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5728;&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x9876;&#x70B9;&#x548C;&#x8FB9;&#x4E0D;&#x662F;&#x6709;&#x5E8F;&#x7684;&#xFF08;&#x53EA;&#x80FD;&#x5728;&#x67E5;&#x8BE2;&#x65F6;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF09;&#x3002;</li>
<li>&#x5728;CODASYL&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x67E5;&#x8BE2;&#x90FD;&#x662F;&#x547D;&#x4EE4;&#x5F0F;&#x7684;&#xFF0C;&#x96BE;&#x4EE5;&#x7F16;&#x5199;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x5BB9;&#x6613;&#x56E0;&#x67B6;&#x6784;&#x4E2D;&#x7684;&#x53D8;&#x5316;&#x800C;&#x53D7;&#x5230;&#x7834;&#x574F;&#x3002;&#x5728;&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x547D;&#x4EE4;&#x5F0F;&#x4EE3;&#x7801;&#x4E2D;&#x7F16;&#x5199;&#x904D;&#x5386;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x652F;&#x6301;&#x9AD8;&#x7EA7;&#x58F0;&#x660E;&#x5F0F;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x5982;Cypher&#x6216;SPARQL&#x3002;</li>
</ul>
</blockquote>
<h3 id="&#x57FA;&#x7840;&#xFF1A;datalog">&#x57FA;&#x7840;&#xFF1A;Datalog</h3>
<p><strong>Datalog</strong>&#x662F;&#x6BD4;SPARQL&#x6216;Cypher&#x66F4;&#x53E4;&#x8001;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5728;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x88AB;&#x5B66;&#x8005;&#x5E7F;&#x6CDB;&#x7814;&#x7A76;&#x3010;44,45,46&#x3011;&#x3002;&#x5B83;&#x5728;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x4E2D;&#x4E0D;&#x592A;&#x77E5;&#x540D;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x662F;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E3A;&#x4EE5;&#x540E;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;Datalog&#x88AB;&#x7528;&#x4E8E;&#x5C11;&#x6570;&#x7684;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x662F;Datomic &#x3010;40&#x3011;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;Cascalog &#x3010;47&#x3011;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x67E5;&#x8BE2;Hadoop&#x5927;&#x6570;&#x636E;&#x96C6;&#x7684;Datalog&#x5B9E;&#x73B0;<sup><a href="#fn_viii" id="reffn_viii">viii</a></sup>&#x3002;</p>
<blockquote id="fn_viii">
<sup>viii</sup>. Datomic&#x548C;Cascalog&#x4F7F;&#x7528;Datalog&#x7684;Clojure S&#x8868;&#x8FBE;&#x5F0F;&#x8BED;&#x6CD5;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x5BB9;&#x6613;&#x9605;&#x8BFB;&#x7684;Prolog&#x8BED;&#x6CD5;&#xFF0C;&#x4F46;&#x4E24;&#x8005;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x529F;&#x80FD;&#x5DEE;&#x5F02;&#x3002;<a href="#reffn_viii" title="Jump back to footnote [viii] in the text."> &#x21A9;</a>
</blockquote>
<p>Datalog&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E09;&#x5143;&#x7EC4;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x70B9;&#x6CDB;&#x5316;&#x3002;&#x628A;&#x4E09;&#x5143;&#x7EC4;&#x5199;&#x6210;<strong>&#x8C13;&#x8BED;</strong>&#xFF08;<strong>&#x4E3B;&#x8BED;&#xFF0C;&#x5BBE;&#x8BED;</strong>&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5199;&#x4E09;&#x5143;&#x8BED;&#xFF08;<strong>&#x4E3B;&#x8BED;&#xFF0C;&#x8C13;&#x8BED;&#xFF0C;&#x5BBE;&#x8BED;</strong>&#xFF09;&#x3002;<a href="">&#x4F8B;2-10</a>&#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x7528;Datalog&#x5199;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p><strong>&#x4F8B;2-10 &#x7528;Datalog&#x6765;&#x8868;&#x793A;&#x56FE;2-5&#x4E2D;&#x7684;&#x6570;&#x636E;&#x5B50;&#x96C6;</strong></p>
<pre><code class="lang-prolog">name(namerica, <span class="hljs-string">&apos;North America&apos;</span>).
type(namerica, continent).

name(usa, <span class="hljs-string">&apos;United States&apos;</span>).
type(usa, country).
within(usa, namerica).

name(idaho, <span class="hljs-string">&apos;Idaho&apos;</span>).
type(idaho, state).
within(idaho, usa).

name(lucy, <span class="hljs-string">&apos;Lucy&apos;</span>).
born_in(lucy, idaho).
</code></pre>
<p>&#x65E2;&#x7136;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x4E86;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x50CF;&#x4E4B;&#x524D;&#x4E00;&#x6837;&#x7F16;&#x5199;&#x76F8;&#x540C;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x5982;<a href="">&#x4F8B;2-11</a>&#x6240;&#x793A;&#x3002;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x6709;&#x70B9;&#x4E0D;&#x540C;&#x4E8E;Cypher&#x6216;SPARQL&#x7684;&#x7B49;&#x4EF7;&#x7269;&#xFF0C;&#x4F46;&#x662F;&#x8BF7;&#x4E0D;&#x8981;&#x653E;&#x5F03;&#x5B83;&#x3002;Datalog&#x662F;Prolog&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5B66;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x89C1;&#x8FC7;&#x3002;</p>
<p><strong>&#x4F8B;2-11 &#x4E0E;&#x793A;&#x4F8B;2-4&#x76F8;&#x540C;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x7528;Datalog&#x8868;&#x793A;</strong></p>
<pre><code>within_recursive(Location, Name) :- name(Location, Name). /* Rule 1 */

within_recursive(Location, Name) :- within(Location, Via), /* Rule 2 */
                                    within_recursive(Via, Name).

migrated(Name, BornIn, LivingIn) :- name(Person, Name), /* Rule 3 */
                                    born_in(Person, BornLoc),
                                    within_recursive(BornLoc, BornIn),
                                    lives_in(Person, LivingLoc),
                                    within_recursive(LivingLoc, LivingIn).

?- migrated(Who, &apos;United States&apos;, &apos;Europe&apos;). /* Who = &apos;Lucy&apos;. */
</code></pre><p>Cypher&#x548C;SPARQL&#x4F7F;&#x7528;SELECT&#x7ACB;&#x5373;&#x8DF3;&#x8F6C;&#xFF0C;&#x4F46;&#x662F;Datalog&#x4E00;&#x6B21;&#x53EA;&#x8FDB;&#x884C;&#x4E00;&#x5C0F;&#x6B65;&#x3002;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;<strong>&#x89C4;&#x5219;</strong>&#xFF0C;&#x4EE5;&#x5C06;&#x65B0;&#x8C13;&#x8BED;&#x544A;&#x8BC9;&#x6570;&#x636E;&#x5E93;&#xFF1A;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x4E24;&#x4E2A;&#x65B0;&#x7684;&#x8C13;&#x8BED;&#xFF0C;<code>within_recursive</code>&#x548C;<code>migrated</code>&#x3002;&#x8FD9;&#x4E9B;&#x8C13;&#x8BED;&#x4E0D;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E09;&#x5143;&#x7EC4;&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x5B83;&#x4EEC;&#x662F;&#x4ECE;&#x6570;&#x636E;&#x6216;&#x5176;&#x4ED6;&#x89C4;&#x5219;&#x6D3E;&#x751F;&#x800C;&#x6765;&#x7684;&#x3002;&#x89C4;&#x5219;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x5176;&#x4ED6;&#x89C4;&#x5219;&#xFF0C;&#x5C31;&#x50CF;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x5176;&#x4ED6;&#x51FD;&#x6570;&#x6216;&#x8005;&#x9012;&#x5F52;&#x5730;&#x8C03;&#x7528;&#x81EA;&#x5DF1;&#x4E00;&#x6837;&#x3002;&#x50CF;&#x8FD9;&#x6837;&#xFF0C;&#x590D;&#x6742;&#x7684;&#x67E5;&#x8BE2;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x6784;&#x5EFA;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x5757;&#x3002;</p>
<p>&#x5728;&#x89C4;&#x5219;&#x4E2D;&#xFF0C;&#x4EE5;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x5F00;&#x5934;&#x7684;&#x5355;&#x8BCD;&#x662F;&#x53D8;&#x91CF;&#xFF0C;&#x8C13;&#x8BED;&#x5219;&#x7528;Cypher&#x548C;SPARQL&#x7684;&#x65B9;&#x5F0F;&#x4E00;&#x6837;&#x6765;&#x5339;&#x914D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>name(Location, Name)</code>&#x901A;&#x8FC7;&#x53D8;&#x91CF;&#x7ED1;&#x5B9A;<code>Location = namerica</code>&#x548C;<code>Name =&apos;North America&apos;</code>&#x53EF;&#x4EE5;&#x5339;&#x914D;&#x4E09;&#x5143;&#x7EC4;<code>name(namerica, &apos;North America&apos;)</code>&#x3002;</p>
<p>&#x8981;&#x662F;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5728;<code>:-</code> &#x64CD;&#x4F5C;&#x7B26;&#x7684;&#x53F3;&#x4FA7;&#x627E;&#x5230;&#x4E0E;&#x6240;&#x6709;&#x8C13;&#x8BED;&#x7684;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#xFF0C;&#x5C31;&#x8FD0;&#x7528;&#x8BE5;&#x89C4;&#x5219;&#x3002;&#x5F53;&#x89C4;&#x5219;&#x8FD0;&#x7528;&#x65F6;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x901A;&#x8FC7;<code>:-</code>&#x7684;&#x5DE6;&#x4FA7;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x5C06;&#x53D8;&#x91CF;&#x66FF;&#x6362;&#x6210;&#x5B83;&#x4EEC;&#x5339;&#x914D;&#x7684;&#x503C;&#xFF09;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x5E94;&#x7528;&#x89C4;&#x5219;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;</p>
<ol>
<li>&#x6570;&#x636E;&#x5E93;&#x5B58;&#x5728;<code>name(namerica, &apos;North America&apos;)</code>&#xFF0C;&#x6545;&#x8FD0;&#x7528;&#x89C4;&#x5219;1&#x3002;&#x5B83;&#x751F;&#x6210;<code>within_recursive(namerica, &apos;North America&apos;)</code>&#x3002;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x5B58;&#x5728;<code>within(usa, namerica)</code>&#xFF0C;&#x5728;&#x4E0A;&#x4E00;&#x6B65;&#x9AA4;&#x4E2D;&#x751F;&#x6210;<code>within_recursive(namerica, &apos;North America&apos;)</code>&#xFF0C;&#x6545;&#x8FD0;&#x7528;&#x89C4;&#x5219;2&#x3002;&#x5B83;&#x4F1A;&#x4EA7;&#x751F;<code>within_recursive(usa, &apos;North America&apos;)</code>&#x3002;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x5B58;&#x5728;<code>within(idaho, usa)</code>&#xFF0C;&#x5728;&#x4E0A;&#x4E00;&#x6B65;&#x751F;&#x6210;<code>within_recursive(usa, &apos;North America&apos;)</code>&#xFF0C;&#x6545;&#x8FD0;&#x7528;&#x89C4;&#x5219;2&#x3002;&#x5B83;&#x4EA7;&#x751F;<code>within_recursive(idaho, &apos;North America&apos;)</code>&#x3002;</li>
</ol>
<p>&#x901A;&#x8FC7;&#x91CD;&#x590D;&#x5E94;&#x7528;&#x89C4;&#x5219;1&#x548C;2&#xFF0C;<code>within_recursive</code>&#x8C13;&#x8BED;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5305;&#x542B;&#x5317;&#x7F8E;&#xFF08;&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#x540D;&#x79F0;&#xFF09;&#x7684;&#x6240;&#x6709;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5982;<a href="img/fig2-6.png">&#x56FE;2-6</a>&#x6240;&#x793A;&#x3002;</p>
<p><img src="img/fig2-6.png" alt=""></p>
<p><strong>&#x56FE;2-6 &#x4F7F;&#x7528;&#x793A;&#x4F8B;2-11&#x4E2D;&#x7684;Datalog&#x89C4;&#x5219;&#x6765;&#x786E;&#x5B9A;&#x7231;&#x8FBE;&#x8377;&#x5DDE;&#x5728;&#x5317;&#x7F8E;&#x3002;</strong></p>
<p>&#x73B0;&#x5728;&#x89C4;&#x5219;3&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x51FA;&#x751F;&#x5728;&#x67D0;&#x4E2A;&#x5730;&#x65B9;<code>BornIn</code>&#x7684;&#x4EBA;&#xFF0C;&#x5E76;&#x4F4F;&#x5728;&#x67D0;&#x4E2A;&#x5730;&#x65B9;<code>LivingIn</code>&#x3002;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;<code>BornIn =&apos;United States&apos;</code>&#x548C;<code>LivingIn =&apos;Europe&apos;</code>&#xFF0C;&#x5E76;&#x5C06;&#x6B64;&#x4EBA;&#x4F5C;&#x4E3A;&#x53D8;&#x91CF;<code>Who</code>&#xFF0C;&#x8BA9;Datalog&#x7CFB;&#x7EDF;&#x627E;&#x51FA;&#x53D8;&#x91CF;<code>Who</code>&#x4F1A;&#x51FA;&#x73B0;&#x54EA;&#x4E9B;&#x503C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x540E;&#x5F97;&#x5230;&#x4E86;&#x4E0E;&#x65E9;&#x5148;&#x7684;Cypher&#x548C;SPARQL&#x67E5;&#x8BE2;&#x76F8;&#x540C;&#x7684;&#x7B54;&#x6848;&#x3002;</p>
<p>&#x76F8;&#x5BF9;&#x4E8E;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x5176;&#x4ED6;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x4E0D;&#x540C;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x6765;&#x601D;&#x8003;Datalog&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x89C4;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x67E5;&#x8BE2;&#x4E2D;&#x8FDB;&#x884C;&#x7EC4;&#x5408;&#x548C;&#x91CD;&#x7528;&#x3002;&#x867D;&#x7136;&#x5BF9;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x6B21;&#x6027;&#x67E5;&#x8BE2;&#xFF0C;&#x663E;&#x5F97;&#x4E0D;&#x592A;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x5904;&#x7406;&#x6570;&#x636E;&#x5F88;&#x590D;&#x6742;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x8BFE;&#x9898;&#xFF0C;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5FEB;&#x901F;&#x6D4F;&#x89C8;&#x4E86;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x6765;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x6BCF;&#x4E2A;&#x6A21;&#x578B;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x5E0C;&#x671B;&#x8FD9;&#x4E2A;&#x6982;&#x8FF0;&#x8DB3;&#x4EE5;&#x6FC0;&#x8D77;&#x4F60;&#x7684;&#x5174;&#x8DA3;&#xFF0C;&#x4EE5;&#x66F4;&#x591A;&#x5730;&#x4E86;&#x89E3;&#x6700;&#x9002;&#x5408;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x9700;&#x6C42;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x5728;&#x5386;&#x53F2;&#x4E0A;&#xFF0C;&#x6570;&#x636E;&#x6700;&#x5F00;&#x59CB;&#x88AB;&#x8868;&#x793A;&#x4E3A;&#x4E00;&#x68F5;&#x5927;&#x6811;&#xFF08;&#x5C42;&#x6B21;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E0D;&#x5229;&#x4E8E;&#x8868;&#x793A;&#x591A;&#x5BF9;&#x591A;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x6240;&#x4EE5;&#x53D1;&#x660E;&#x4E86;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6700;&#x8FD1;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53D1;&#x73B0;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E5F;&#x4E0D;&#x9002;&#x5408;&#x91C7;&#x7528;&#x5173;&#x7CFB;&#x6A21;&#x578B;&#x3002;&#x65B0;&#x7684;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x201C;NoSQL&#x201D;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x65B9;&#x5411;&#x4E0A;&#x5B58;&#x5728;&#x5206;&#x6B67;&#xFF1A;</p>
<ol>
<li><strong>&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;</strong>&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x662F;&#xFF1A;&#x6570;&#x636E;&#x901A;&#x5E38;&#x662F;&#x81EA;&#x6211;&#x5305;&#x542B;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6587;&#x6863;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x975E;&#x5E38;&#x7A00;&#x5C11;&#x3002;</li>
<li><strong>&#x56FE;&#x5F62;&#x6570;&#x636E;&#x5E93;</strong>&#x7528;&#x4E8E;&#x76F8;&#x53CD;&#x7684;&#x573A;&#x666F;&#xFF1A;&#x4EFB;&#x610F;&#x4E8B;&#x7269;&#x90FD;&#x53EF;&#x80FD;&#x4E0E;&#x4EFB;&#x4F55;&#x4E8B;&#x7269;&#x76F8;&#x5173;&#x8054;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x4E09;&#x79CD;&#x6A21;&#x578B;&#xFF08;&#x6587;&#x6863;&#xFF0C;&#x5173;&#x7CFB;&#x548C;&#x56FE;&#x5F62;&#xFF09;&#x5728;&#x4ECA;&#x5929;&#x90FD;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5404;&#x81EA;&#x7684;&#x9886;&#x57DF;&#x90FD;&#x53D1;&#x6325;&#x5F88;&#x597D;&#x3002;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x6765;&#x6A21;&#x62DF; &#x2014; &#x4F8B;&#x5982;&#xFF0C;&#x56FE;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8868;&#x793A; &#x2014; &#x4F46;&#x7ED3;&#x679C;&#x5F80;&#x5F80;&#x662F;&#x7CDF;&#x7CD5;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x6709;&#x7740;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x76EE;&#x7684;&#x7684;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x4E07;&#x80FD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x548C;&#x56FE;&#x6570;&#x636E;&#x5E93;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x70B9;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x4E3A;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x5F3A;&#x5236;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x66F4;&#x5BB9;&#x6613;&#x9002;&#x5E94;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x3002;&#x4F46;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F88;&#x53EF;&#x80FD;&#x4ECD;&#x4F1A;&#x5047;&#x5B9A;&#x6570;&#x636E;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x7ED3;&#x6784;&#xFF1B;&#x8FD9;&#x53EA;&#x662F;&#x6A21;&#x5F0F;&#x662F;&#x660E;&#x786E;&#x7684;&#xFF08;&#x5199;&#x5165;&#x65F6;&#x5F3A;&#x5236;&#xFF09;&#x8FD8;&#x662F;&#x9690;&#x542B;&#x7684;&#xFF08;&#x8BFB;&#x53D6;&#x65F6;&#x5904;&#x7406;&#xFF09;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x90FD;&#x5177;&#x6709;&#x5404;&#x81EA;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x6216;&#x6846;&#x67B6;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;SQL&#xFF0C;MapReduce&#xFF0C;MongoDB&#x7684;&#x805A;&#x5408;&#x7BA1;&#x9053;&#xFF0C;Cypher&#xFF0C;SPARQL&#x548C;Datalog&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x8C08;&#x5230;&#x4E86;CSS&#x548C;XSL/XPath&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x800C;&#x5305;&#x542B;&#x6709;&#x8DA3;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8986;&#x76D6;&#x4E86;&#x5F88;&#x591A;&#x5C42;&#x9762;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x6709;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x3002;&#x4E3E;&#x51E0;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<ul>
<li>&#x4F7F;&#x7528;&#x57FA;&#x56E0;&#x7EC4;&#x6570;&#x636E;&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x901A;&#x5E38;&#x9700;&#x8981;&#x6267;&#x884C;<strong>&#x5E8F;&#x5217;&#x76F8;&#x4F3C;&#x6027;&#x641C;&#x7D22;</strong>&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5F88;&#x957F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;DNA&#x5206;&#x5B50;&#xFF09;&#xFF0C;&#x5E76;&#x5728;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x7C7B;&#x4F3C;&#x4F46;&#x4E0D;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5BFB;&#x627E;&#x5339;&#x914D;&#x3002;&#x8FD9;&#x91CC;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x4E0D;&#x80FD;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x7528;&#x6CD5;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x7F16;&#x5199;&#x4E86;&#x50CF;GenBank&#x8FD9;&#x6837;&#x7684;&#x4E13;&#x95E8;&#x7684;&#x57FA;&#x56E0;&#x7EC4;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x7684;&#x539F;&#x56E0;&#x3010;48&#x3011;&#x3002;</li>
<li>&#x7C92;&#x5B50;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x6570;&#x5341;&#x5E74;&#x6765;&#x4E00;&#x76F4;&#x5728;&#x8FDB;&#x884C;&#x5927;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x50CF;&#x5927;&#x578B;&#x5F3A;&#x5B50;&#x5BF9;&#x649E;&#x673A;&#xFF08;LHC&#xFF09;&#x8FD9;&#x6837;&#x7684;&#x9879;&#x76EE;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5DE5;&#x4F5C;&#x5728;&#x6570;&#x767E;&#x4EBF;&#x5146;&#x5B57;&#x8282;&#x7684;&#x8303;&#x56F4;&#x5185;&#xFF01;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x89C4;&#x6A21;&#x4E0B;&#xFF0C;&#x9700;&#x8981;&#x5B9A;&#x5236;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x6765;&#x963B;&#x6B62;&#x786C;&#x4EF6;&#x6210;&#x672C;&#x7684;&#x5931;&#x63A7;&#x3010;49&#x3011;&#x3002;</li>
<li><strong>&#x5168;&#x6587;&#x641C;&#x7D22;</strong>&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E00;&#x79CD;&#x7ECF;&#x5E38;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x4FE1;&#x606F;&#x68C0;&#x7D22;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x4E13;&#x4E1A;&#x8BFE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C;&#x4E09;&#x7AE0;&#x548C;&#x7B2C;&#x4E09;&#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#x3002;</li>
</ul>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6682;&#x65F6;&#x5C06;&#x5176;&#x653E;&#x5728;&#x4E00;&#x8FB9;&#x3002;&#x5728;<a href="ch3.html">&#x4E0B;&#x4E00;&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x5728;<strong>&#x5B9E;&#x73B0;</strong>&#x672C;&#x7AE0;&#x63CF;&#x8FF0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x65F6;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x6743;&#x8861;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;">&#x53C2;&#x8003;&#x6587;&#x732E;</h2>
<ol>
<li><p>Edgar F. Codd: &#x201C;<a href="https://www.seas.upenn.edu/~zives/03f/cis550/codd.pdf" target="_blank">A Relational Model of Data for Large Shared Data Banks</a>,&#x201D; <em>Communications of the ACM</em>, volume 13, number 6, pages 377&#x2013;387, June 1970. <a href="http://dx.doi.org/10.1145/362384.362685" target="_blank">doi:10.1145/362384.362685</a></p>
</li>
<li><p>Michael Stonebraker and Joseph M. Hellerstein: &#x201C;<a href="http://mitpress2.mit.edu/books/chapters/0262693143chapm1.pdf" target="_blank">What Goes Around Comes Around</a>,&#x201D;
in <em>Readings in Database Systems</em>, 4th edition, MIT Press, pages 2&#x2013;41, 2005. ISBN: 978-0-262-69314-1</p>
</li>
<li><p>Pramod J. Sadalage and Martin Fowler: <em>NoSQL Distilled</em>. Addison-Wesley, August 2012. ISBN:
978-0-321-82662-6</p>
</li>
<li><p>Eric Evans: &#x201C;<a href="http://blog.sym-link.com/2009/10/30/nosql_whats_in_a_name.html" target="_blank">NoSQL: What&apos;s in a Name?</a>,&#x201D; <em>blog.sym-link.com</em>, October 30, 2009.</p>
</li>
<li><p>James Phillips:  &#x201C;<a href="http://blog.couchbase.com/nosql-adoption-survey-surprises" target="_blank">Surprises in Our NoSQL   Adoption Survey</a>,&#x201D; <em>blog.couchbase.com</em>, February 8, 2012.</p>
</li>
<li><p>Michael Wagner:  <em>SQL/XML:2006 &#x2013; Evaluierung der Standardkonformit&#xE4;t ausgew&#xE4;hlter Datenbanksysteme</em>.  Diplomica Verlag, Hamburg, 2010. ISBN: 978-3-836-64609-3</p>
</li>
<li><p>&#x201C;<a href="http://technet.microsoft.com/en-us/library/bb522446.aspx" target="_blank">XML   Data in SQL Server</a>,&#x201D; SQL Server 2012 documentation, <em>technet.microsoft.com</em>, 2013.</p>
</li>
<li><p>&#x201C;<a href="http://www.postgresql.org/docs/9.3/static/index.html" target="_blank">PostgreSQL   9.3.1 Documentation</a>,&#x201D; The PostgreSQL Global Development Group, 2013.</p>
</li>
<li><p>&#x201C;<a href="http://docs.mongodb.org/manual/" target="_blank">The MongoDB 2.4 Manual</a>,&#x201D; MongoDB, Inc., 2013.</p>
</li>
<li><p>&#x201C;<a href="http://www.rethinkdb.com/docs/" target="_blank">RethinkDB 1.11 Documentation</a>,&#x201D; <em>rethinkdb.com</em>, 2013.</p>
</li>
<li><p>&#x201C;<a href="http://docs.couchdb.org/en/latest/" target="_blank">Apache CouchDB 1.6 Documentation</a>,&#x201D; <em>docs.couchdb.org</em>, 2014.</p>
</li>
<li><p>Lin Qiao, Kapil Surlaker, Shirshanka Das, et al.: &#x201C;<a href="http://www.slideshare.net/amywtang/espresso-20952131" target="_blank">On Brewing Fresh Espresso: LinkedIn&#x2019;s Distributed Data Serving Platform</a>,&#x201D; at <em>ACM International Conference on Management of Data</em> (SIGMOD), June 2013.</p>
</li>
<li><p>Rick Long, Mark Harrington, Robert Hain, and Geoff Nicholls: <a href="http://www.redbooks.ibm.com/redbooks/pdfs/sg245352.pdf" target="_blank"><em>IMS Primer</em></a>. IBM Redbook SG24-5352-00, IBM International Technical Support Organization, January 2000.</p>
</li>
<li><p>Stephen D. Bartlett: &#x201C;<a href="ftp://public.dhe.ibm.com/software/data/ims/pdf/TCG2013015LI.pdf" target="_blank">IBM&#x2019;s IMS&#x2014;Myths, Realities, and Opportunities</a>,&#x201D; The Clipper Group Navigator, TCG2013015LI, July 2013.</p>
</li>
<li><p>Sarah Mei: &#x201C;<a href="http://www.sarahmei.com/blog/2013/11/11/why-you-should-never-use-mongodb/" target="_blank">Why You Should Never Use MongoDB</a>,&#x201D; <em>sarahmei.com</em>, November 11, 2013.</p>
</li>
<li><p>J. S. Knowles and D. M. R. Bell: &#x201C;The CODASYL Model,&#x201D; in <em>Databases&#x2014;Role and Structure: An Advanced Course</em>, edited by P. M. Stocker, P. M. D. Gray, and M. P. Atkinson, pages 19&#x2013;56, Cambridge University Press, 1984. ISBN: 978-0-521-25430-4</p>
</li>
<li><p>Charles W. Bachman: &#x201C;<a href="http://dl.acm.org/citation.cfm?id=362534" target="_blank">The Programmer as Navigator</a>,&#x201D; <em>Communications of the ACM</em>, volume 16, number 11, pages 653&#x2013;658, November 1973. <a href="http://dx.doi.org/10.1145/355611.362534" target="_blank">doi:10.1145/355611.362534</a></p>
</li>
<li><p>Joseph M. Hellerstein, Michael Stonebraker, and James Hamilton: &#x201C;<a href="http://db.cs.berkeley.edu/papers/fntdb07-architecture.pdf" target="_blank">Architecture of a Database System</a>,&#x201D;
<em>Foundations and Trends in Databases</em>, volume 1, number 2, pages 141&#x2013;259, November 2007. <a href="http://dx.doi.org/10.1561/1900000002" target="_blank">doi:10.1561/1900000002</a></p>
</li>
<li><p>Sandeep Parikh and Kelly Stirman: &#x201C;<a href="http://blog.mongodb.org/post/65517193370/schema-design-for-time-series-data-in-mongodb" target="_blank">Schema Design for Time Series Data in MongoDB</a>,&#x201D; <em>blog.mongodb.org</em>, October 30, 2013.</p>
</li>
<li><p>Martin Fowler: &#x201C;<a href="http://martinfowler.com/articles/schemaless/" target="_blank">Schemaless Data Structures</a>,&#x201D; <em>martinfowler.com</em>, January 7, 2013.</p>
</li>
<li><p>Amr Awadallah: &#x201C;<a href="http://www.slideshare.net/awadallah/schemaonread-vs-schemaonwrite" target="_blank">Schema-on-Read vs. Schema-on-Write</a>,&#x201D; at <em>Berkeley EECS RAD Lab Retreat</em>, Santa Cruz, CA, May 2009.</p>
</li>
<li><p>Martin Odersky: &#x201C;<a href="http://www.infoq.com/presentations/data-types-issues" target="_blank">The Trouble with Types</a>,&#x201D; at <em>Strange Loop</em>, September 2013.</p>
</li>
<li><p>Conrad Irwin: &#x201C;<a href="https://speakerdeck.com/conradirwin/mongodb-confessions-of-a-postgresql-lover" target="_blank">MongoDB&#x2014;Confessions of a PostgreSQL Lover</a>,&#x201D; at <em>HTML5DevConf</em>, October 2013.</p>
</li>
<li><p>&#x201C;<a href="http://www.percona.com/doc/percona-toolkit/2.2/pt-online-schema-change.html" target="_blank">Percona Toolkit Documentation: pt-online-schema-change</a>,&#x201D; Percona Ireland Ltd., 2013.</p>
</li>
<li><p>Rany Keddo, Tobias Bielohlawek, and Tobias Schmidt: &#x201C;<a href="https://github.com/soundcloud/lhm" target="_blank">Large Hadron Migrator</a>,&#x201D; SoundCloud, 2013. Shlomi Noach:</p>
<p>&#x201C;<a href="http://githubengineering.com/gh-ost-github-s-online-migration-tool-for-mysql/" target="_blank">gh-ost: GitHub&apos;s Online Schema Migration Tool for MySQL</a>,&#x201D; <em>githubengineering.com</em>, August 1, 2016.</p>
</li>
<li><p>James C. Corbett, Jeffrey Dean, Michael Epstein, et al.: &#x201C;<a href="http://research.google.com/archive/spanner.html" target="_blank">Spanner: Google&#x2019;s Globally-Distributed Database</a>,&#x201D; at <em>10th USENIX Symposium on Operating System Design and Implementation</em> (OSDI),
October 2012.</p>
</li>
<li><p>Donald K. Burleson: &#x201C;<a href="http://www.dba-oracle.com/oracle_tip_hash_index_cluster_table.htm" target="_blank">Reduce I/O with Oracle Cluster Tables</a>,&#x201D; <em>dba-oracle.com</em>.</p>
</li>
<li><p>Fay Chang, Jeffrey Dean, Sanjay Ghemawat, et al.: &#x201C;<a href="http://research.google.com/archive/bigtable.html" target="_blank">Bigtable: A Distributed Storage System for Structured Data</a>,&#x201D; at <em>7th USENIX Symposium on Operating System Design and Implementation</em> (OSDI), November 2006.</p>
</li>
<li><p>Bobbie J. Cochrane and Kathy A. McKnight: &#x201C;<a href="http://www.ibm.com/developerworks/data/library/techarticle/dm-1306nosqlforjson1/" target="_blank">DB2 JSON Capabilities, Part 1: Introduction to DB2 JSON</a>,&#x201D; IBM developerWorks, June 20, 2013.</p>
</li>
<li><p>Herb Sutter: &#x201C;<a href="http://www.gotw.ca/publications/concurrency-ddj.htm" target="_blank">The Free Lunch Is Over: A Fundamental Turn Toward Concurrency in Software</a>,&#x201D; <em>Dr. Dobb&apos;s Journal</em>, volume 30, number 3, pages 202-210, March 2005.</p>
</li>
<li><p>Joseph M. Hellerstein: &#x201C;<a href="http://www.eecs.berkeley.edu/Pubs/TechRpts/2010/EECS-2010-90.pdf" target="_blank">The Declarative Imperative: Experiences and Conjectures in Distributed Logic</a>,&#x201D; Electrical Engineering and Computer Sciences, University of California at Berkeley, Tech report UCB/EECS-2010-90, June 2010.</p>
</li>
<li><p>Jeffrey Dean and Sanjay Ghemawat: &#x201C;<a href="http://research.google.com/archive/mapreduce.html" target="_blank">MapReduce: Simplified Data Processing on Large Clusters</a>,&#x201D; at <em>6th USENIX Symposium on Operating System Design and Implementation</em> (OSDI), December 2004.</p>
</li>
<li><p>Craig Kerstiens: &#x201C;<a href="https://blog.heroku.com/javascript_in_your_postgres" target="_blank">JavaScript in Your Postgres</a>,&#x201D; <em>blog.heroku.com</em>, June 5, 2013.</p>
</li>
<li><p>Nathan Bronson, Zach Amsden, George Cabrera, et al.: &#x201C;<a href="https://www.usenix.org/conference/atc13/technical-sessions/presentation/bronson" target="_blank">TAO: Facebook&#x2019;s Distributed Data Store for the Social Graph</a>,&#x201D; at <em>USENIX Annual Technical Conference</em> (USENIX ATC), June 2013.</p>
</li>
<li><p>&#x201C;<a href="http://tinkerpop.apache.org/docs/3.2.3/reference/" target="_blank">Apache TinkerPop3.2.3 Documentation</a>,&#x201D; <em>tinkerpop.apache.org</em>, October 2016.</p>
</li>
<li><p>&#x201C;<a href="http://docs.neo4j.org/chunked/2.0.0/index.html" target="_blank">The Neo4j Manual v2.0.0</a>,&#x201D; Neo Technology, 2013. Emil Eifrem: <a href="https://twitter.com/emileifrem/status/419107961512804352" target="_blank">Twitter correspondence</a>, January 3, 2014.</p>
</li>
<li><p>David Beckett and Tim Berners-Lee: &#x201C;<a href="http://www.w3.org/TeamSubmission/turtle/" target="_blank">Turtle &#x2013; Terse RDF Triple Language</a>,&#x201D; W3C Team Submission, March 28, 2011.</p>
</li>
<li><p>&#x201C;<a href="http://docs.datomic.com/" target="_blank">Datomic Development Resources</a>,&#x201D; Metadata Partners, LLC, 2013. W3C RDF Working Group: &#x201C;<a href="http://www.w3.org/RDF/" target="_blank">Resource Description Framework (RDF)</a>,&#x201D; <em>w3.org</em>, 10 February 2004.</p>
</li>
<li><p>&#x201C;<a href="http://jena.apache.org/" target="_blank">Apache Jena</a>,&#x201D; Apache Software Foundation.</p>
</li>
<li><p>Steve Harris, Andy Seaborne, and Eric Prud&apos;hommeaux: &#x201C;<a href="http://www.w3.org/TR/sparql11-query/" target="_blank">SPARQL 1.1 Query Language</a>,&#x201D;
W3C Recommendation, March 2013.</p>
</li>
<li><p>Todd J. Green, Shan Shan Huang, Boon Thau Loo, and Wenchao Zhou: &#x201C;<a href="http://blogs.evergreen.edu/sosw/files/2014/04/Green-Vol5-DBS-017.pdf" target="_blank">Datalog and Recursive Query Processing</a>,&#x201D; <em>Foundations and Trends in Databases</em>, volume 5, number 2, pages 105&#x2013;195, November 2013. <a href="http://dx.doi.org/10.1561/1900000017" target="_blank">doi:10.1561/1900000017</a></p>
</li>
<li><p>Stefano Ceri, Georg Gottlob, and Letizia Tanca: &#x201C;<a href="https://www.researchgate.net/profile/Letizia_Tanca/publication/3296132_What_you_always_wanted_to_know_about_Datalog_and_never_dared_to_ask/links/0fcfd50ca2d20473ca000000.pdf" target="_blank">What You Always Wanted to Know About Datalog (And Never Dared to Ask)</a>,&#x201D; <em>IEEE Transactions on Knowledge and Data Engineering</em>, volume 1, number 1, pages 146&#x2013;166, March 1989. <a href="http://dx.doi.org/10.1109/69.43410" target="_blank">doi:10.1109/69.43410</a></p>
</li>
<li><p>Serge Abiteboul, Richard Hull, and Victor Vianu: <a href="http://webdam.inria.fr/Alice/" target="_blank"><em>Foundations of Databases</em></a>. Addison-Wesley, 1995. ISBN: 978-0-201-53771-0, available online at <em>webdam.inria.fr/Alice</em></p>
</li>
<li><p>Nathan Marz: &#x201C;<a href="http://cascalog.org/" target="_blank">Cascalog</a>,&quot; <em>cascalog.org</em>. Dennis A. Benson,  Ilene Karsch-Mizrachi, David J. Lipman, et al.:</p>
<p>  &#x201C;<a href="http://nar.oxfordjournals.org/content/36/suppl_1/D25.full-text-lowres.pdf" target="_blank">GenBank</a>,&#x201D;   <em>Nucleic Acids Research</em>, volume 36, Database issue, pages D25&#x2013;D30, December 2007.   <a href="http://dx.doi.org/10.1093/nar/gkm929" target="_blank">doi:10.1093/nar/gkm929</a></p>
</li>
<li><p>Fons Rademakers:   &#x201C;<a href="http://indico.cern.ch/getFile.py/access?contribId=13&amp;resId=0&amp;materialId=slides&amp;confId=246453" target="_blank">ROOT   for Big Data Analysis</a>,&#x201D; at <em>Workshop on the Future of Big Data Management</em>,
  London, UK, June 2013.</p>
</li>
</ol>
<hr>
<table>
<thead>
<tr>
<th>&#x4E0A;&#x4E00;&#x7AE0;</th>
<th>&#x76EE;&#x5F55;</th>
<th>&#x4E0B;&#x4E00;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><a href="ch1.html">&#x7B2C;&#x4E00;&#x7AE0;&#xFF1A;&#x53EF;&#x9760;&#x6027;&#x3001;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x6027;</a></td>
<td><a href="./">&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;</a></td>
<td><a href="ch3.html">&#x7B2C;&#x4E09;&#x7AE0;&#xFF1A;&#x5B58;&#x50A8;&#x4E0E;&#x68C0;&#x7D22;</a></td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch1.html" class="navigation navigation-prev " aria-label="Previous page: 第一章：可靠性、可伸缩性、可维护性">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch3.html" class="navigation navigation-next " aria-label="Next page: 第三章：存储与检索">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第二章：数据模型与查询语言","level":"1.3.2","depth":2,"next":{"title":"第三章：存储与检索","level":"1.3.3","depth":2,"path":"ch3.md","ref":"ch3.md","articles":[]},"previous":{"title":"第一章：可靠性、可伸缩性、可维护性","level":"1.3.1","depth":2,"path":"ch1.md","ref":"ch1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/KnowledgeHive"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch2.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-12T15:31:17.016Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

