
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四章：编码与演化 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="part-ii.html" />
    
    
    <link rel="prev" href="ch3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第四章：编码与演化</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="4-&#x7F16;&#x7801;&#x4E0E;&#x6F14;&#x5316;">4. &#x7F16;&#x7801;&#x4E0E;&#x6F14;&#x5316;</h1>
<p><img src="img/ch4.png" alt=""></p>
<blockquote>
<p>&#x552F;&#x53D8;&#x6240;&#x9002;</p>
<p> &#x2014;&#x2014;&#x4EE5;&#x5F17;&#x6240;&#x7684;&#x8D6B;&#x62C9;&#x514B;&#x5229;&#x7279;&#xFF0C;&#x4E3A;&#x67CF;&#x62C9;&#x56FE;&#x6240;&#x5F15;&#xFF08;&#x516C;&#x5143;&#x524D;360&#x5E74;&#xFF09;    </p>
</blockquote>
<hr>
<p>[TOC]</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x968F;&#x65F6;&#x95F4;&#x800C;&#x53D8;&#x5316;&#x3002;&#x65B0;&#x4EA7;&#x54C1;&#x7684;&#x63A8;&#x51FA;&#xFF0C;&#x5BF9;&#x9700;&#x6C42;&#x7684;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#xFF0C;&#x6216;&#x8005;&#x5546;&#x4E1A;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x603B;&#x4F1A;&#x4F34;&#x968F;&#x7740;<strong>&#x529F;&#x80FD;&#xFF08;feature&#xFF09;</strong> &#x7684;&#x589E;&#x589E;&#x6539;&#x6539;&#x3002;<a href="ch1.html">&#x7B2C;&#x4E00;&#x7AE0;</a>&#x4ECB;&#x7ECD;&#x4E86;<a href="ch1.html#&#x53EF;&#x6F14;&#x5316;&#x6027;&#xFF1A;&#x62E5;&#x62B1;&#x53D8;&#x5316;"><strong>&#x53EF;&#x6F14;&#x5316;&#x6027;(evolvability)</strong></a>&#x7684;&#x6982;&#x5FF5;&#xFF1A;&#x5E94;&#x8BE5;&#x5C3D;&#x529B;&#x6784;&#x5EFA;&#x80FD;&#x7075;&#x6D3B;&#x9002;&#x5E94;&#x53D8;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="">&#x53EF;&#x6F14;&#x5316;&#x6027;&#xFF1A;&#x62E5;&#x62B1;&#x53D8;&#x5316;</a>&#x201D;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4FEE;&#x6539;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x9700;&#x8981;&#x66F4;&#x6539;&#x5176;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#xFF1A;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x5B57;&#x6BB5;&#x6216;&#x8BB0;&#x5F55;&#x7C7B;&#x578B;&#xFF0C;&#x6216;&#x8005;&#x4EE5;&#x65B0;&#x65B9;&#x5F0F;&#x5C55;&#x793A;&#x73B0;&#x6709;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;<a href="ch2.html">&#x7B2C;&#x4E8C;&#x7AE0;</a>&#x8BA8;&#x8BBA;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5E94;&#x5BF9;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x3002;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x5047;&#x5B9A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x9075;&#x5FAA;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#xFF1A;&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x8BE5;&#x6A21;&#x5F0F;&#xFF08;&#x901A;&#x8FC7;&#x6A21;&#x5F0F;&#x8FC1;&#x79FB;&#xFF0C;&#x5373;<code>ALTER</code>&#x8BED;&#x53E5;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x70B9;&#x90FD;&#x6709;&#x4E14;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;<strong>&#x8BFB;&#x65F6;&#x6A21;&#x5F0F;&#xFF08;schema-on-read&#xFF09;</strong>&#xFF08;&#x6216; <strong>&#x65E0;&#x6A21;&#x5F0F;&#xFF08;schemaless&#xFF09;</strong>&#xFF09;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x4F1A;&#x5F3A;&#x5236;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x5199;&#x5165;&#x7684;&#x65B0;&#x8001;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x7684;&#x6DF7;&#x5408;&#xFF08;&#x53C2;&#x9605; &#x201C;&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x7075;&#x6D3B;&#x6027;&#x201D; &#xFF09;&#x3002;</p>
<p>&#x5F53;&#x6570;&#x636E;<strong>&#x683C;&#x5F0F;&#xFF08;format&#xFF09;</strong> &#x6216;<strong>&#x6A21;&#x5F0F;&#xFF08;schema&#xFF09;</strong> &#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x66F4;&#x6539;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x8BB0;&#x5F55;&#x6DFB;&#x52A0;&#x65B0;&#x5B57;&#x6BB5;&#xFF0C;&#x7136;&#x540E;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x8BFB;&#x5199;&#x8BE5;&#x5B57;&#x6BB5;&#xFF09;&#x3002;&#x4F46;&#x5728;&#x5927;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x4EE3;&#x7801;&#x53D8;&#x66F4;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x5B8C;&#x6210;&#xFF1A;</p>
<ul>
<li>&#x5BF9;&#x4E8E; <strong>&#x670D;&#x52A1;&#x7AEF;&#xFF08;server-side&#xFF09;</strong> &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6267;&#x884C; <strong>&#x6EDA;&#x52A8;&#x5347;&#x7EA7; &#xFF08;rolling upgrade&#xFF09;</strong> &#xFF08;&#x4E5F;&#x79F0;&#x4E3A; <strong>&#x9636;&#x6BB5;&#x53D1;&#x5E03;&#xFF08;staged rollout&#xFF09;</strong> &#xFF09;&#xFF0C;&#x4E00;&#x6B21;&#x5C06;&#x65B0;&#x7248;&#x672C;&#x90E8;&#x7F72;&#x5230;&#x5C11;&#x6570;&#x51E0;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x68C0;&#x67E5;&#x65B0;&#x7248;&#x672C;&#x662F;&#x5426;&#x8FD0;&#x884C;&#x6B63;&#x5E38;&#xFF0C;&#x7136;&#x540E;&#x9010;&#x6E10;&#x90E8;&#x5B8C;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x6837;&#x65E0;&#x9700;&#x4E2D;&#x65AD;&#x670D;&#x52A1;&#x5373;&#x53EF;&#x90E8;&#x7F72;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x4E3A;&#x9891;&#x7E41;&#x53D1;&#x5E03;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x884C;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x5E26;&#x6765;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x6F14;&#x5316;&#x6027;&#x3002;</li>
<li>&#x5BF9;&#x4E8E; <strong>&#x5BA2;&#x6237;&#x7AEF;&#xFF08;client-side&#xFF09;</strong> &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5347;&#x4E0D;&#x5347;&#x7EA7;&#x5C31;&#x8981;&#x770B;&#x7528;&#x6237;&#x7684;&#x5FC3;&#x60C5;&#x4E86;&#x3002;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x76F8;&#x5F53;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#x90FD;&#x4E0D;&#x4F1A;&#x53BB;&#x5347;&#x7EA7;&#x8F6F;&#x4EF6;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x65B0;&#x65E7;&#x7248;&#x672C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x53CA;&#x65B0;&#x65E7;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x540C;&#x65F6;&#x5171;&#x5904;&#x3002;&#x7CFB;&#x7EDF;&#x60F3;&#x8981;&#x7EE7;&#x7EED;&#x987A;&#x5229;&#x8FD0;&#x884C;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4FDD;&#x6301;<strong>&#x53CC;&#x5411;&#x517C;&#x5BB9;&#x6027;</strong>&#xFF1A;</p>
<p><strong><em>&#x5411;&#x540E;&#x517C;&#x5BB9; (backward compatibility)</em></strong></p>
<p>&#x200B;    &#x65B0;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8BFB;&#x65E7;&#x6570;&#x636E;&#x3002;</p>
<p><strong><em>&#x5411;&#x524D;&#x517C;&#x5BB9; (forward compatibility)</em></strong></p>
<p>&#x200B;    &#x65E7;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8BFB;&#x65B0;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#x901A;&#x5E38;&#x5E76;&#x4E0D;&#x96BE;&#x5B9E;&#x73B0;&#xFF1A;&#x65B0;&#x4EE3;&#x7801;&#x7684;&#x4F5C;&#x8005;&#x5F53;&#x7136;&#x77E5;&#x9053;&#x7531;&#x65E7;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x663E;&#x793A;&#x5730;&#x5904;&#x7406;&#x5B83;&#xFF08;&#x6700;&#x7B80;&#x5355;&#x7684;&#x529E;&#x6CD5;&#x662F;&#xFF0C;&#x4FDD;&#x7559;&#x65E7;&#x4EE3;&#x7801;&#x5373;&#x53EF;&#x8BFB;&#x53D6;&#x65E7;&#x6570;&#x636E;&#xFF09;&#x3002;</p>
<p>&#x5411;&#x524D;&#x517C;&#x5BB9;&#x6027;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x68D8;&#x624B;&#xFF0C;&#x56E0;&#x4E3A;&#x65E7;&#x7248;&#x7684;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x5FFD;&#x7565;&#x65B0;&#x7248;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x4E2D;&#x65B0;&#x589E;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x4E2D;&#x5C06;&#x4ECB;&#x7ECD;&#x51E0;&#x79CD;&#x7F16;&#x7801;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5305;&#x62EC; JSON&#xFF0C;XML&#xFF0C;Protocol Buffers&#xFF0C;Thrift&#x548C;Avro&#x3002;&#x5C24;&#x5176;&#x5C06;&#x5173;&#x6CE8;&#x8FD9;&#x4E9B;&#x683C;&#x5F0F;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x6A21;&#x5F0F;&#x53D8;&#x5316;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x5BF9;&#x65B0;&#x65E7;&#x4EE3;&#x7801;&#x6570;&#x636E;&#x9700;&#x8981;&#x5171;&#x5B58;&#x7684;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#x3002;&#x7136;&#x540E;&#x5C06;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x683C;&#x5F0F;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x548C;&#x901A;&#x4FE1;&#xFF1A;&#x5728;Web&#x670D;&#x52A1;&#x4E2D;&#xFF0C;<strong>&#x5177;&#x8C61;&#x72B6;&#x6001;&#x4F20;&#x8F93;&#xFF08;REST&#xFF09;</strong>&#x548C;<strong>&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF08;RPC&#xFF09;</strong>&#xFF0C;&#x4EE5;&#x53CA;<strong>&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7CFB;&#x7EDF;</strong>&#xFF08;&#x5982;Actor&#x548C;&#x6D88;&#x606F;&#x961F;&#x5217;&#xFF09;&#x3002;</p>
<h2 id="&#x7F16;&#x7801;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;">&#x7F16;&#x7801;&#x6570;&#x636E;&#x7684;&#x683C;&#x5F0F;</h2>
<p>&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#xFF08;&#x81F3;&#x5C11;&#xFF09;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x6570;&#x636E;&#xFF1A;</p>
<ol>
<li>&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5728;&#x5BF9;&#x8C61;&#xFF0C;&#x7ED3;&#x6784;&#x4F53;&#xFF0C;&#x5217;&#x8868;&#xFF0C;&#x6570;&#x7EC4;&#xFF0C;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x6811;&#x7B49;&#x4E2D;&#x3002; &#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x9488;&#x5BF9;CPU&#x7684;&#x9AD8;&#x6548;&#x8BBF;&#x95EE;&#x548C;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x4E86;&#x4F18;&#x5316;&#xFF08;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x6307;&#x9488;&#xFF09;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8981;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x6216;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5C06;&#x5176; <strong>&#x7F16;&#x7801;&#xFF08;encode&#xFF09;</strong> &#x4E3A;&#x67D0;&#x79CD;&#x81EA;&#x5305;&#x542B;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;JSON&#x6587;&#x6863;&#xFF09;&#x3002; &#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x8FDB;&#x7A0B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x7684;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#xFF0C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x6307;&#x9488;&#x5BF9;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x90FD;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x8868;&#x793A;&#x4F1A;&#x4E0E;&#x901A;&#x5E38;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5B8C;&#x5168;&#x4E0D;&#x540C;<sup><a href="#fn_i" id="reffn_i">i</a></sup>&#x3002;</li>
</ol>
<blockquote id="fn_i">
<sup>i</sup>. &#x9664;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x5916;&#xFF0C;&#x4F8B;&#x5982;&#x67D0;&#x4E9B;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x6587;&#x4EF6;&#x6216;&#x76F4;&#x63A5;&#x5728;&#x538B;&#x7F29;&#x6570;&#x636E;&#x4E0A;&#x64CD;&#x4F5C;&#xFF08;&#x5982;&#x201C;<a href="ch4.html#&#x5217;&#x538B;&#x7F29;">&#x5217;&#x538B;&#x7F29;</a>&#x201D;&#x4E2D;&#x6240;&#x8FF0;&#xFF09;&#x3002;<a href="#reffn_i" title="Jump back to footnote [i] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x4E24;&#x79CD;&#x8868;&#x793A;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x67D0;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x7FFB;&#x8BD1;&#x3002; &#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x8868;&#x793A;&#x5230;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x7684;&#x8F6C;&#x6362;&#x79F0;&#x4E3A; <strong>&#x7F16;&#x7801;&#xFF08;Encoding&#xFF09;</strong> &#xFF08;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x5E8F;&#x5217;&#x5316;&#xFF08;serialization&#xFF09;</strong>&#x6216;<strong>&#x7F16;&#x7EC4;&#xFF08;marshalling&#xFF09;</strong>&#xFF09;&#xFF0C;&#x53CD;&#x8FC7;&#x6765;&#x79F0;&#x4E3A;<strong>&#x89E3;&#x7801;&#xFF08;Decoding&#xFF09;</strong><sup><a href="#fn_ii" id="reffn_ii">ii</a></sup>&#xFF08;<strong>&#x89E3;&#x6790;&#xFF08;Parsing&#xFF09;</strong>&#xFF0C;<strong>&#x53CD;&#x5E8F;&#x5217;&#x5316;&#xFF08;deserialization&#xFF09;</strong>&#xFF0C;<strong>&#x53CD;&#x7F16;&#x7EC4;( unmarshalling&#xFF09;</strong>&#xFF09;<sup><a href="#fn_&#x8BD1;i" id="reffn_&#x8BD1;i">&#x8BD1;i</a></sup>&#x3002;</p>
<blockquote id="fn_ii">
<sup>ii</sup>. &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;<strong>&#x7F16;&#x7801;&#xFF08;encode&#xFF09;</strong>  &#x4E0E; <strong>&#x52A0;&#x5BC6;&#xFF08;encryption&#xFF09;</strong> &#x65E0;&#x5173;&#x3002; &#x672C;&#x4E66;&#x4E0D;&#x8BA8;&#x8BBA;&#x52A0;&#x5BC6;&#x3002;<a href="#reffn_ii" title="Jump back to footnote [ii] in the text."> &#x21A9;</a>
</blockquote>
<blockquote id="fn_&#x8BD1;i">
<sup>&#x8BD1;i</sup>. Marshal&#x4E0E;Serialization&#x7684;&#x533A;&#x522B;&#xFF1A;Marshal&#x4E0D;&#x4EC5;&#x4F20;&#x8F93;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x4E00;&#x8D77;&#x4F20;&#x8F93;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#xFF09;&#x3002;<a href="#reffn_&#x8BD1;i" title="Jump back to footnote [&#x8BD1;i] in the text."> &#x21A9;</a>
</blockquote>
<blockquote>
<h4 id="&#x672F;&#x8BED;&#x51B2;&#x7A81;">&#x672F;&#x8BED;&#x51B2;&#x7A81;</h4>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5728;<a href="ch7.html">&#x7B2C;&#x4E03;&#x7AE0;</a>&#xFF1A; <strong>&#x4E8B;&#x52A1;&#xFF08;Transaction&#xFF09;</strong> &#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x91CC;&#xFF0C;<strong>&#x5E8F;&#x5217;&#x5316;&#xFF08;Serialization&#xFF09;</strong> &#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x4E5F;&#x51FA;&#x73B0;&#x4E86;&#xFF0C;&#x800C;&#x4E14;&#x5177;&#x6709;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x542B;&#x4E49;&#x3002;&#x5C3D;&#x7BA1;&#x5E8F;&#x5217;&#x5316;&#x53EF;&#x80FD;&#x662F;&#x66F4;&#x5E38;&#x89C1;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x672F;&#x8BED;&#x91CD;&#x8F7D;&#xFF0C;&#x672C;&#x4E66;&#x4E2D;&#x575A;&#x6301;&#x4F7F;&#x7528; <strong>&#x7F16;&#x7801;&#xFF08;Encoding&#xFF09;</strong> &#x8868;&#x8FBE;&#x6B64;&#x542B;&#x4E49;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x800C;&#x6709;&#x8BB8;&#x591A;&#x5E93;&#x548C;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x3002; &#x9996;&#x5148;&#x8BA9;&#x6211;&#x4EEC;&#x6982;&#x89C8;&#x4E00;&#x4E0B;&#x3002;</p>
<h3 id="&#x8BED;&#x8A00;&#x7279;&#x5B9A;&#x7684;&#x683C;&#x5F0F;">&#x8BED;&#x8A00;&#x7279;&#x5B9A;&#x7684;&#x683C;&#x5F0F;</h3>
<p>&#x8BB8;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x5185;&#x5EFA;&#x4E86;&#x5C06;&#x5185;&#x5B58;&#x5BF9;&#x8C61;&#x7F16;&#x7801;&#x4E3A;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x7684;&#x652F;&#x6301;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Java&#x6709;<code>java.io.Serializable</code> &#x3010;1&#x3011;&#xFF0C;Ruby&#x6709;<code>Marshal</code>&#x3010;2&#x3011;&#xFF0C;Python&#x6709;<code>pickle</code>&#x3010;3&#x3011;&#x7B49;&#x7B49;&#x3002;&#x8BB8;&#x591A;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x4E5F;&#x5B58;&#x5728;&#xFF0C;&#x4F8B;&#x5982;<code>Kryo for Java</code> &#x3010;4&#x3011;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x7F16;&#x7801;&#x5E93;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5F88;&#x5C11;&#x7684;&#x989D;&#x5916;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#x5185;&#x5B58;&#x5BF9;&#x8C61;&#x7684;&#x4FDD;&#x5B58;&#x4E0E;&#x6062;&#x590D;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x6DF1;&#x5C42;&#x6B21;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x8FD9;&#x7C7B;&#x7F16;&#x7801;&#x901A;&#x5E38;&#x4E0E;&#x7279;&#x5B9A;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6DF1;&#x5EA6;&#x7ED1;&#x5B9A;&#xFF0C;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x5F88;&#x96BE;&#x8BFB;&#x53D6;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x4EE5;&#x8FD9;&#x7C7B;&#x7F16;&#x7801;&#x5B58;&#x50A8;&#x6216;&#x4F20;&#x8F93;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4F60;&#x5C31;&#x548C;&#x8FD9;&#x95E8;&#x8BED;&#x8A00;&#x7ED1;&#x6B7B;&#x5728;&#x4E00;&#x8D77;&#x4E86;&#x3002;&#x5E76;&#x4E14;&#x5F88;&#x96BE;&#x5C06;&#x7CFB;&#x7EDF;&#x4E0E;&#x5176;&#x4ED6;&#x7EC4;&#x7EC7;&#x7684;&#x7CFB;&#x7EDF;&#xFF08;&#x53EF;&#x80FD;&#x7528;&#x7684;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x8A00;&#xFF09;&#x8FDB;&#x884C;&#x96C6;&#x6210;&#x3002;</li>
<li>&#x4E3A;&#x4E86;&#x6062;&#x590D;&#x76F8;&#x540C;&#x5BF9;&#x8C61;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x89E3;&#x7801;&#x8FC7;&#x7A0B;&#x9700;&#x8981;<strong>&#x5B9E;&#x4F8B;&#x5316;&#x4EFB;&#x610F;&#x7C7B;</strong>&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x6765;&#x6E90;&#x3010;5&#x3011;&#xFF1A;&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x89E3;&#x7801;&#x4EFB;&#x610F;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x80FD;&#x5B9E;&#x4F8B;&#x5316;&#x4EFB;&#x610F;&#x7684;&#x7C7B;&#xFF0C;&#x8FD9;&#x4F1A;&#x5141;&#x8BB8;&#x4ED6;&#x4EEC;&#x505A;&#x53EF;&#x6015;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5982;&#x8FDC;&#x7A0B;&#x6267;&#x884C;&#x4EFB;&#x610F;&#x4EE3;&#x7801;&#x3010;6,7&#x3011;&#x3002;</li>
<li>&#x5728;&#x8FD9;&#x4E9B;&#x5E93;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x7248;&#x672C;&#x63A7;&#x5236;&#x901A;&#x5E38;&#x662F;&#x4E8B;&#x540E;&#x624D;&#x8003;&#x8651;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x65E8;&#x5728;&#x5FEB;&#x901F;&#x7B80;&#x4FBF;&#x5730;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x6240;&#x4EE5;&#x5F80;&#x5F80;&#x5FFD;&#x7565;&#x4E86;&#x524D;&#x5411;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x6027;&#x5E26;&#x6765;&#x7684;&#x9EBB;&#x70E6;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x6548;&#x7387;&#xFF08;&#x7F16;&#x7801;&#x6216;&#x89E3;&#x7801;&#x6240;&#x82B1;&#x8D39;&#x7684;CPU&#x65F6;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA;&#x7F16;&#x7801;&#x7ED3;&#x6784;&#x7684;&#x5927;&#x5C0F;&#xFF09;&#x5F80;&#x5F80;&#x4E5F;&#x662F;&#x4E8B;&#x540E;&#x624D;&#x8003;&#x8651;&#x7684;&#x3002; &#x4F8B;&#x5982;&#xFF0C;Java&#x7684;&#x5185;&#x7F6E;&#x5E8F;&#x5217;&#x5316;&#x7531;&#x4E8E;&#x5176;&#x7CDF;&#x7CD5;&#x7684;&#x6027;&#x80FD;&#x548C;&#x81C3;&#x80BF;&#x7684;&#x7F16;&#x7801;&#x800C;&#x81ED;&#x540D;&#x662D;&#x7740;&#x3010;8&#x3011;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x9664;&#x975E;&#x4E34;&#x65F6;&#x4F7F;&#x7528;&#xFF0C;&#x91C7;&#x7528;&#x8BED;&#x8A00;&#x5185;&#x7F6E;&#x7F16;&#x7801;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x574F;&#x4E3B;&#x610F;&#x3002;</p>
<h3 id="json&#xFF0C;xml&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x53D8;&#x4F53;">JSON&#xFF0C;XML&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x53D8;&#x4F53;</h3>
<p>&#x5F53;&#x6211;&#x4EEC;&#x8C08;&#x5230;&#x53EF;&#x4EE5;&#x88AB;&#x591A;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x8BFB;&#x5199;&#x7684;&#x6807;&#x51C6;&#x7F16;&#x7801;&#x65F6;&#xFF0C;JSON&#x548C;XML&#x662F;&#x6700;&#x663E;&#x773C;&#x7684;&#x89D2;&#x9010;&#x8005;&#x3002;&#x5B83;&#x4EEC;&#x5E7F;&#x4E3A;&#x4EBA;&#x77E5;&#xFF0C;&#x5E7F;&#x53D7;&#x652F;&#x6301;&#xFF0C;&#x4E5F;&#x201C;&#x5E7F;&#x53D7;&#x618E;&#x6076;&#x201D;&#x3002; XML&#x7ECF;&#x5E38;&#x6536;&#x5230;&#x6279;&#x8BC4;&#xFF1A;&#x8FC7;&#x4E8E;&#x5197;&#x957F;&#x4E0E;&#x4E14;&#x8FC7;&#x4EFD;&#x590D;&#x6742;&#x3010;9&#x3011;&#x3002; JSON&#x7684;&#x6D41;&#x884C;&#x5219;&#x4E3B;&#x8981;&#x6E90;&#x4E8E;&#xFF08;&#x901A;&#x8FC7;&#x6210;&#x4E3A;JavaScript&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF09;Web&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x5185;&#x7F6E;&#x652F;&#x6301;&#xFF0C;&#x4EE5;&#x53CA;&#x76F8;&#x5BF9;&#x4E8E;XML&#x7684;&#x7B80;&#x5355;&#x6027;&#x3002; CSV&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x4E0E;&#x8BED;&#x8A00;&#x65E0;&#x5173;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5C3D;&#x7BA1;&#x5176;&#x529F;&#x80FD;&#x76F8;&#x5BF9;&#x8F83;&#x5F31;&#x3002;</p>
<p>JSON&#xFF0C;XML&#x548C;CSV&#x5C5E;&#x4E8E;&#x6587;&#x672C;&#x683C;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x5177;&#x6709;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x6027;&#xFF08;&#x5C3D;&#x7BA1;&#x5B83;&#x4EEC;&#x7684;&#x8BED;&#x6CD5;&#x662F;&#x4E00;&#x4E2A;&#x70ED;&#x95E8;&#x4E89;&#x8BAE;&#x8BDD;&#x9898;&#xFF09;&#x3002;&#x9664;&#x4E86;&#x8868;&#x9762;&#x7684;&#x8BED;&#x6CD5;&#x95EE;&#x9898;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x5FAE;&#x5999;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li><strong>&#x6570;&#x503C;&#xFF08;numbers&#xFF09;</strong> &#x7684;&#x7F16;&#x7801;&#x591A;&#x6709;&#x6B67;&#x4E49;&#x4E4B;&#x5904;&#x3002;XML&#x548C;CSV&#x4E0D;&#x80FD;&#x533A;&#x5206;&#x6570;&#x5B57;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x9664;&#x975E;&#x5F15;&#x7528;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x6A21;&#x5F0F;&#xFF09;&#x3002; JSON&#x867D;&#x7136;&#x533A;&#x5206;&#x5B57;&#x7B26;&#x4E32;&#x4E0E;&#x6570;&#x503C;&#xFF0C;&#x4F46;&#x4E0D;&#x533A;&#x5206;&#x6574;&#x6570;&#x548C;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x80FD;&#x6307;&#x5B9A;&#x7CBE;&#x5EA6;&#x3002;</li>
<li>&#x5F53;&#x5904;&#x7406;&#x66F4;&#x5927;&#x7684;&#x6570;&#x503C;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x663E;&#x5F97;&#x5C24;&#x4E3A;&#x4E25;&#x91CD;&#x3002;&#x4F8B;&#x5982;&#x5927;&#x4E8E;$2^{53}$&#x7684;&#x6574;&#x6570;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;IEEE 754&#x53CC;&#x7CBE;&#x5EA6;&#x6D6E;&#x70B9;&#x6570;&#x7CBE;&#x786E;&#x8868;&#x793A;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x4F7F;&#x7528;&#x6D6E;&#x70B9;&#x6570;&#xFF08;&#x4F8B;&#x5982;JavaScript&#xFF09;&#x7684;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x4F1A;&#x53D8;&#x5F97;&#x4E0D;&#x51C6;&#x786E;&#x3002; Twitter&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x5927;&#x4E8E;$2^{53}$&#x7684;&#x6570;&#x5B57;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;64&#x4F4D;&#x6574;&#x6570;&#x6765;&#x6807;&#x8BC6;&#x6BCF;&#x6761;&#x63A8;&#x6587;&#x3002; Twitter API&#x8FD4;&#x56DE;&#x7684;JSON&#x5305;&#x542B;&#x4E86;&#x4E24;&#x79CD;&#x63A8;&#x7279;ID&#xFF0C;&#x4E00;&#x79CD;&#x662F;JSON&#x6570;&#x503C;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x5341;&#x8FDB;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4EE5;&#x907F;&#x514D;JavaScript&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x89E3;&#x6790;&#x6570;&#x5B57;&#x7684;&#x95EE;&#x9898;&#x3010;10&#x3011;&#x3002;</li>
<li>JSON&#x548C;XML&#x5BF9;Unicode&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x5373;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x6587;&#x672C;&#xFF09;&#x6709;&#x5F88;&#x597D;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x4E0D;&#x652F;&#x6301;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#xFF08;&#x5373;&#x4E0D;&#x5E26; <strong>&#x5B57;&#x7B26;&#x7F16;&#x7801;(character encoding)</strong> &#x7684;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF09;&#x3002;&#x4E8C;&#x8FDB;&#x5236;&#x4E32;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4EBA;&#x4EEC;&#x901A;&#x8FC7;&#x4F7F;&#x7528;Base64&#x5C06;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x7F16;&#x7801;&#x4E3A;&#x6587;&#x672C;&#x6765;&#x7ED5;&#x8FC7;&#x6B64;&#x9650;&#x5236;&#x3002;&#x5176;&#x7279;&#x6709;&#x7684;&#x6A21;&#x5F0F;&#x901A;&#x5E38;&#x6807;&#x8BC6;&#x7740;&#x8FD9;&#x4E2A;&#x503C;&#x5E94;&#x5F53;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;Base64&#x7F16;&#x7801;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x867D;&#x7136;&#x7BA1;&#x7528;&#xFF0C;&#x4F46;&#x6BD4;&#x8F83;Hacky&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x589E;&#x52A0;&#x4E09;&#x5206;&#x4E4B;&#x4E00;&#x7684;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x3002;</li>
<li>XML &#x3010;11&#x3011;&#x548C; JSON &#x3010;12&#x3011;&#x90FD;&#x6709;&#x53EF;&#x9009;&#x7684;&#x6A21;&#x5F0F;&#x652F;&#x6301;&#x3002;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x8BED;&#x8A00;&#x76F8;&#x5F53;&#x5F3A;&#x5927;&#xFF0C;&#x6240;&#x4EE5;&#x5B66;&#x4E60;&#x548C;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x90FD;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x3002; XML&#x6A21;&#x5F0F;&#x7684;&#x4F7F;&#x7528;&#x76F8;&#x5F53;&#x666E;&#x904D;&#xFF0C;&#x4F46;&#x8BB8;&#x591A;&#x57FA;&#x4E8E;JSON&#x7684;&#x5DE5;&#x5177;&#x624D;&#x4E0D;&#x4F1A;&#x53BB;&#x6298;&#x817E;&#x6A21;&#x5F0F;&#x3002;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x6B63;&#x786E;&#x89E3;&#x8BFB;&#xFF08;&#x4F8B;&#x5982;&#x533A;&#x5206;&#x6570;&#x503C;&#x4E0E;&#x4E8C;&#x8FDB;&#x5236;&#x4E32;&#xFF09;&#x53D6;&#x51B3;&#x4E8E;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F7F;&#x7528;XML/JSON&#x6A21;&#x5F0F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5BF9;&#x76F8;&#x5E94;&#x7684;&#x7F16;&#x7801;/&#x89E3;&#x7801;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x786C;&#x7F16;&#x7801;&#x3002;</li>
<li>CSV&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6A21;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x6BCF;&#x884C;&#x548C;&#x6BCF;&#x5217;&#x7684;&#x542B;&#x4E49;&#x5B8C;&#x5168;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x81EA;&#x884C;&#x5B9A;&#x4E49;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D8;&#x66F4;&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x7684;&#x884C;&#x6216;&#x5217;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x79CD;&#x53D8;&#x66F4;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x624B;&#x5DE5;&#x5904;&#x7406;&#x3002; CSV&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x6A21;&#x7CCA;&#x7684;&#x683C;&#x5F0F;&#xFF08;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x503C;&#x5305;&#x542B;&#x9017;&#x53F7;&#x6216;&#x6362;&#x884C;&#x7B26;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;&#xFF09;&#x3002;&#x5C3D;&#x7BA1;&#x5176;&#x8F6C;&#x4E49;&#x89C4;&#x5219;&#x5DF2;&#x7ECF;&#x88AB;&#x6B63;&#x5F0F;&#x6307;&#x5B9A;&#x3010;13&#x3011;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x89E3;&#x6790;&#x5668;&#x90FD;&#x6B63;&#x786E;&#x7684;&#x5B9E;&#x73B0;&#x4E86;&#x6807;&#x51C6;&#x3002;</li>
</ul>
<p>&#x5C3D;&#x7BA1;&#x5B58;&#x5728;&#x8FD9;&#x4E9B;&#x7F3A;&#x9677;&#xFF0C;&#x4F46;JSON&#xFF0C;XML&#x548C;CSV&#x5BF9;&#x5F88;&#x591A;&#x9700;&#x6C42;&#x6765;&#x8BF4;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x597D;&#x4E86;&#x3002;&#x5B83;&#x4EEC;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x7EE7;&#x7EED;&#x6D41;&#x884C;&#x4E0B;&#x53BB;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x683C;&#x5F0F;&#x6765;&#x8BF4;&#xFF08;&#x5373;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#x53D1;&#x9001;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7EC4;&#x7EC7;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x8981;&#x4EBA;&#x4EEC;&#x5BF9;&#x683C;&#x5F0F;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x89C1;&#x4E00;&#x81F4;&#xFF0C;&#x683C;&#x5F0F;&#x6709;&#x591A;&#x7F8E;&#x89C2;&#x6216;&#x8005;&#x6548;&#x7387;&#x6709;&#x591A;&#x9AD8;&#x6548;&#x5C31;&#x65E0;&#x6240;&#x8C13;&#x4E86;&#x3002;&#x8BA9;&#x4E0D;&#x540C;&#x7684;&#x7EC4;&#x7EC7;&#x5C31;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x96BE;&#x5EA6;&#x8D85;&#x8FC7;&#x4E86;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;">&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;</h4>
<p>&#x5BF9;&#x4E8E;&#x4EC5;&#x5728;&#x7EC4;&#x7EC7;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F7F;&#x7528;&#x6700;&#x5C0F;&#x516C;&#x7EA6;&#x6570;&#x5F0F;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x538B;&#x529B;&#x8F83;&#x5C0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x66F4;&#x7D27;&#x51D1;&#x6216;&#x66F4;&#x5FEB;&#x7684;&#x89E3;&#x6790;&#x683C;&#x5F0F;&#x3002;&#x867D;&#x7136;&#x5BF9;&#x5C0F;&#x6570;&#x636E;&#x96C6;&#x6765;&#x8BF4;&#xFF0C;&#x6536;&#x76CA;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#xFF1B;&#x4F46;&#x4E00;&#x65E6;&#x8FBE;&#x5230;TB&#x7EA7;&#x522B;&#xFF0C;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x7684;&#x9009;&#x578B;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x5DE8;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>JSON&#x6BD4;XML&#x7B80;&#x6D01;&#xFF0C;&#x4F46;&#x4E0E;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x76F8;&#x6BD4;&#x8FD8;&#x662F;&#x592A;&#x5360;&#x7A7A;&#x95F4;&#x3002;&#x8FD9;&#x4E00;&#x4E8B;&#x5B9E;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x7248;&#x672C;JSON &amp; XML&#x7684;&#x51FA;&#x73B0;&#xFF0C;JSON&#xFF08;MessagePack&#xFF0C;BSON&#xFF0C;BJSON&#xFF0C;UBJSON&#xFF0C;BISON&#x548C;Smile&#x7B49;&#xFF09;&#xFF08;&#x4F8B;&#x5982;WBXML&#x548C;Fast Infoset&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x683C;&#x5F0F;&#x5DF2;&#x7ECF;&#x5728;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x9886;&#x57DF;&#x4E2D;&#x91C7;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x80FD;&#x50CF;&#x6587;&#x672C;&#x7248;JSON&#x548C;XML&#x90A3;&#x6837;&#x88AB;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x683C;&#x5F0F;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x6269;&#x5C55;&#x4E86;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x533A;&#x5206;&#x6574;&#x6570;&#x548C;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;&#x6216;&#x8005;&#x589E;&#x52A0;&#x5BF9;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x652F;&#x6301;&#xFF09;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5B83;&#x4EEC;&#x6CA1;&#x6709;&#x76D6;&#x9762;JSON / XML&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x7279;&#x522B;&#x662F;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x6CA1;&#x6709;&#x89C4;&#x5B9A;&#x6A21;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x5728;&#x7F16;&#x7801;&#x6570;&#x636E;&#x4E2D;&#x5305;&#x542B;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5728;<a href="">&#x4F8B;4-1</a>&#x4E2D;&#x7684;JSON&#x6587;&#x6863;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x67D0;&#x5904;&#x5305;&#x542B;&#x5B57;&#x7B26;&#x4E32;<code>userName</code>&#xFF0C;<code>favoriteNumber</code>&#x548C;<code>interest</code>&#x3002;</p>
<p><strong>&#x4F8B;4-1 &#x672C;&#x7AE0;&#x4E2D;&#x7528;&#x4E8E;&#x5C55;&#x793A;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x7684;&#x793A;&#x4F8B;&#x8BB0;&#x5F55;</strong></p>
<pre><code class="lang-json">{
    <span class="hljs-string">&quot;userName&quot;</span>: <span class="hljs-string">&quot;Martin&quot;</span>,
    <span class="hljs-string">&quot;favoriteNumber&quot;</span>: <span class="hljs-number">1337</span>,
    <span class="hljs-string">&quot;interests&quot;</span>: [<span class="hljs-string">&quot;daydreaming&quot;</span>, <span class="hljs-string">&quot;hacking&quot;</span>]
}
</code></pre>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;MessagePack&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;JSON&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x3002;&#x56FE;4-1&#x663E;&#x793A;&#x4E86;&#x5982;&#x679C;&#x4F7F;&#x7528;MessagePack &#x3010;14&#x3011;&#x5BF9;<a href="">&#x4F8B;4-1</a>&#x4E2D;&#x7684;JSON&#x6587;&#x6863;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x5219;&#x5F97;&#x5230;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x3002;&#x524D;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;<code>0x83</code>&#x8868;&#x793A;&#x63A5;&#x4E0B;&#x6765;&#x662F;<strong>3</strong>&#x4E2A;&#x5B57;&#x6BB5;&#xFF08;&#x4F4E;&#x56DB;&#x4F4D;= <code>0x03</code>&#xFF09;&#x7684;<strong>&#x5BF9;&#x8C61; object</strong>&#xFF08;&#x9AD8;&#x56DB;&#x4F4D;= <code>0x80</code>&#xFF09;&#x3002; &#xFF08;&#x5982;&#x679C;&#x60F3;&#x77E5;&#x9053;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6709;15&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x5B57;&#x6BB5;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF0C;&#x5B57;&#x6BB5;&#x7684;&#x6570;&#x91CF;&#x585E;&#x4E0D;&#x8FDB;4&#x4E2A;bit&#x91CC;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4F1A;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x578B;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5B57;&#x6BB5;&#x7684;&#x6570;&#x91CF;&#x88AB;&#x7F16;&#x7801;&#x4E24;&#x4E2A;&#x6216;&#x56DB;&#x4E2A;&#x5B57;&#x8282;&#xFF09;&#x3002;</li>
<li>&#x7B2C;&#x4E8C;&#x4E2A;&#x5B57;&#x8282;<code>0xa8</code>&#x8868;&#x793A;&#x63A5;&#x4E0B;&#x6765;&#x662F;<strong>8</strong>&#x5B57;&#x8282;&#x957F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x6700;&#x9AD8;&#x56DB;&#x4F4D;= 0x08&#xFF09;&#x3002;</li>
<li>&#x63A5;&#x4E0B;&#x6765;&#x516B;&#x4E2A;&#x5B57;&#x8282;&#x662F;ASCII&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x7684;&#x5B57;&#x6BB5;&#x540D;&#x79F0;<code>userName</code>&#x3002;&#x7531;&#x4E8E;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x6307;&#x660E;&#x957F;&#x5EA6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x6807;&#x8BB0;&#x6765;&#x6807;&#x8BC6;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#xFF08;&#x6216;&#x8005;&#x4EFB;&#x4F55;&#x8F6C;&#x4E49;&#xFF09;&#x3002;</li>
<li>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E03;&#x4E2A;&#x5B57;&#x8282;&#x5BF9;&#x524D;&#x7F00;&#x4E3A;<code>0xa6</code>&#x7684;&#x516D;&#x4E2A;&#x5B57;&#x6BCD;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;<code>Martin</code>&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</li>
</ol>
<p>&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x957F;&#x5EA6;&#x4E3A;66&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x4EC5;&#x7565;&#x5C0F;&#x4E8E;&#x6587;&#x672C;JSON&#x7F16;&#x7801;&#x6240;&#x53D6;&#x7684;81&#x4E2A;&#x5B57;&#x8282;&#xFF08;&#x5220;&#x9664;&#x4E86;&#x7A7A;&#x767D;&#xFF09;&#x3002;&#x6240;&#x6709;&#x7684;JSON&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x662F;&#x76F8;&#x4F3C;&#x7684;&#x3002;&#x7A7A;&#x95F4;&#x8282;&#x7701;&#x4E86;&#x4E00;&#x4E01;&#x70B9;&#xFF08;&#x4EE5;&#x53CA;&#x89E3;&#x6790;&#x52A0;&#x901F;&#xFF09;&#x662F;&#x5426;&#x80FD;&#x5F25;&#x8865;&#x53EF;&#x8BFB;&#x6027;&#x7684;&#x635F;&#x5931;&#xFF0C;&#x8C01;&#x4E5F;&#x8BF4;&#x4E0D;&#x51C6;&#x3002;</p>
<p>&#x5728;&#x4E0B;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x80FD;&#x8FBE;&#x5230;&#x6BD4;&#x8FD9;&#x597D;&#x5F97;&#x591A;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53EA;&#x7528;32&#x4E2A;&#x5B57;&#x8282;&#x5BF9;&#x76F8;&#x540C;&#x7684;&#x8BB0;&#x5F55;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;</p>
<p><img src="img/fig4-1.png" alt=""></p>
<p><strong>&#x56FE;4-1 &#x4F7F;&#x7528;MessagePack&#x7F16;&#x7801;&#x7684;&#x8BB0;&#x5F55;&#xFF08;&#x4F8B;4-1&#xFF09;</strong></p>
<h3 id="thrift&#x4E0E;protocol-buffers">Thrift&#x4E0E;Protocol Buffers</h3>
<p>Apache Thrift &#x3010;15&#x3011;&#x548C;Protocol Buffers&#xFF08;protobuf&#xFF09;&#x3010;16&#x3011;&#x662F;&#x57FA;&#x4E8E;&#x76F8;&#x540C;&#x539F;&#x7406;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x5E93;&#x3002; Protocol Buffers&#x6700;&#x521D;&#x662F;&#x5728;Google&#x5F00;&#x53D1;&#x7684;&#xFF0C;Thrift&#x6700;&#x521D;&#x662F;&#x5728;Facebook&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5728;2007~2008&#x5E74;&#x90FD;&#x662F;&#x5F00;&#x6E90;&#x7684;&#x3010;17&#x3011;&#x3002;
Thrift&#x548C;Protocol Buffers&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x6765;&#x7F16;&#x7801;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x3002;&#x8981;&#x5728;Thrift&#x7684;<a href="">&#x4F8B;4-1</a>&#x4E2D;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Thrift <strong>&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x8BED;&#x8A00;&#xFF08;IDL&#xFF09;</strong> &#x6765;&#x63CF;&#x8FF0;&#x6A21;&#x5F0F;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-c"><span class="hljs-keyword">struct</span> Person {
    <span class="hljs-number">1</span>: required <span class="hljs-built_in">string</span>       userName,
    <span class="hljs-number">2</span>: optional i64          favoriteNumber,
    <span class="hljs-number">3</span>: optional <span class="hljs-built_in">list</span>&lt;<span class="hljs-built_in">string</span>&gt; interests
}
</code></pre>
<p>Protocol Buffers&#x7684;&#x7B49;&#x6548;&#x6A21;&#x5F0F;&#x5B9A;&#x4E49;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF1A;</p>
<pre><code class="lang-protobuf"><span class="hljs-class"><span class="hljs-keyword">message</span> <span class="hljs-title">Person</span> </span>{
    <span class="hljs-keyword">required</span> <span class="hljs-built_in">string</span> user_name       = <span class="hljs-number">1</span>;
    <span class="hljs-keyword">optional</span> <span class="hljs-built_in">int64</span>  favorite_number = <span class="hljs-number">2</span>;
    <span class="hljs-keyword">repeated</span> <span class="hljs-built_in">string</span> interests       = <span class="hljs-number">3</span>;
}
</code></pre>
<p>Thrift&#x548C;Protocol Buffers&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x5E26;&#x6709;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5DE5;&#x5177;&#xFF0C;&#x5B83;&#x91C7;&#x7528;&#x4E86;&#x7C7B;&#x4F3C;&#x4E8E;&#x8FD9;&#x91CC;&#x6240;&#x793A;&#x7684;&#x6A21;&#x5F0F;&#x5B9A;&#x4E49;&#xFF0C;&#x5E76;&#x4E14;&#x751F;&#x6210;&#x4E86;&#x4EE5;&#x5404;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x6A21;&#x5F0F;&#x7684;&#x7C7B;&#x3010;18&#x3011;&#x3002;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x6B64;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x5BF9;&#x6A21;&#x5F0F;&#x7684;&#x8BB0;&#x5F55;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x6216;&#x89E3;&#x7801;&#x3002;
&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#xFF1F;&#x4EE4;&#x4EBA;&#x56F0;&#x60D1;&#x7684;&#x662F;&#xFF0C;Thrift&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x683C;&#x5F0F;<sup><a href="#fn_iii" id="reffn_iii">iii</a></sup>&#xFF0C;&#x5206;&#x522B;&#x79F0;&#x4E3A;BinaryProtocol&#x548C;CompactProtocol&#x3002;&#x5148;&#x6765;&#x770B;&#x770B;BinaryProtocol&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#x7684;&#x7F16;&#x7801;&#x6765;&#x7F16;&#x7801;<a href="">&#x4F8B;4-1</a>&#x4E2D;&#x7684;&#x6D88;&#x606F;&#x53EA;&#x9700;&#x8981;59&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x5982;<a href="img/fig4-2.png">&#x56FE;4-2</a>&#x6240;&#x793A;&#x3010;19&#x3011;&#x3002;</p>
<p><img src="img/fig4-2.png" alt=""></p>
<p><strong>&#x56FE;4-2 &#x4F7F;&#x7528;Thrift&#x4E8C;&#x8FDB;&#x5236;&#x534F;&#x8BAE;&#x7F16;&#x7801;&#x7684;&#x8BB0;&#x5F55;</strong></p>
<blockquote id="fn_iii">
<sup>iii</sup>. &#x5B9E;&#x9645;&#x4E0A;&#xFF0C;Thrift&#x6709;&#x4E09;&#x79CD;&#x4E8C;&#x8FDB;&#x5236;&#x534F;&#x8BAE;&#xFF1A;CompactProtocol&#x548C;DenseProtocol&#xFF0C;&#x5C3D;&#x7BA1;DenseProtocol&#x53EA;&#x652F;&#x6301;C ++&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7B97;&#x4F5C;&#x8DE8;&#x8BED;&#x8A00;[18]&#x3002; &#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x5B83;&#x8FD8;&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x57FA;&#x4E8E;JSON&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3010;19&#x3011;&#x3002; &#x771F;&#x9017;&#xFF01;<a href="#reffn_iii" title="Jump back to footnote [iii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x4E0E;<a href="Img/fig4-1.png">&#x56FE;4-1</a>&#x7C7B;&#x4F3C;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x6CE8;&#x91CA;&#xFF08;&#x7528;&#x4E8E;&#x6307;&#x793A;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x6574;&#x6570;&#xFF0C;&#x5217;&#x8868;&#x7B49;&#xFF09;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x957F;&#x5EA6;&#xFF08;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x9879;&#x76EE;&#x6570;&#xFF09; &#x3002;&#x51FA;&#x73B0;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;<code>(&#x201C;Martin&#x201D;, &#x201C;daydreaming&#x201D;, &#x201C;hacking&#x201D;)</code>&#x4E5F;&#x88AB;&#x7F16;&#x7801;&#x4E3A;ASCII&#xFF08;&#x6216;&#x8005;&#x8BF4;&#xFF0C;UTF-8&#xFF09;&#xFF0C;&#x4E0E;&#x4E4B;&#x524D;&#x7C7B;&#x4F3C;&#x3002;</p>
<p>&#x4E0E;<a href="img/fig4-1.png">&#x56FE;4-1</a>&#x76F8;&#x6BD4;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x662F;&#x6CA1;&#x6709;&#x5B57;&#x6BB5;&#x540D;<code>(userName, favoriteNumber, interest)</code>&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7F16;&#x7801;&#x6570;&#x636E;&#x5305;&#x542B;&#x5B57;&#x6BB5;&#x6807;&#x7B7E;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x6570;&#x5B57;<code>(1, 2&#x548C;3)</code>&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x6A21;&#x5F0F;&#x5B9A;&#x4E49;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x6570;&#x5B57;&#x3002;&#x5B57;&#x6BB5;&#x6807;&#x8BB0;&#x5C31;&#x50CF;&#x5B57;&#x6BB5;&#x7684;&#x522B;&#x540D; - &#x5B83;&#x4EEC;&#x662F;&#x8BF4;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x8C08;&#x8BBA;&#x7684;&#x5B57;&#x6BB5;&#x7684;&#x4E00;&#x79CD;&#x7D27;&#x51D1;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x62FC;&#x51FA;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x3002;</p>
<p>Thrift CompactProtocol&#x7F16;&#x7801;&#x5728;&#x8BED;&#x4E49;&#x4E0A;&#x7B49;&#x540C;&#x4E8E;BinaryProtocol&#xFF0C;&#x4F46;&#x662F;&#x5982;<a href="img/fig4-3.png">&#x56FE;4-3</a>&#x6240;&#x793A;&#xFF0C;&#x5B83;&#x53EA;&#x5C06;&#x76F8;&#x540C;&#x7684;&#x4FE1;&#x606F;&#x6253;&#x5305;&#x6210;&#x53EA;&#x6709;34&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x5B83;&#x901A;&#x8FC7;&#x5C06;&#x5B57;&#x6BB5;&#x7C7B;&#x578B;&#x548C;&#x6807;&#x7B7E;&#x53F7;&#x6253;&#x5305;&#x5230;&#x5355;&#x4E2A;&#x5B57;&#x8282;&#x4E2D;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x53EF;&#x53D8;&#x957F;&#x5EA6;&#x6574;&#x6570;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x6570;&#x5B57;1337&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x5168;&#x90E8;&#x516B;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#x7F16;&#x7801;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x6700;&#x9AD8;&#x4F4D;&#x7528;&#x6765;&#x6307;&#x793A;&#x662F;&#x5426;&#x8FD8;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5B57;&#x8282;&#x6765;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;-64&#x5230;63&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x5B57;&#x88AB;&#x7F16;&#x7801;&#x4E3A;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;-8192&#x548C;8191&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x5B57;&#x4EE5;&#x4E24;&#x4E2A;&#x5B57;&#x8282;&#x7F16;&#x7801;&#xFF0C;&#x7B49;&#x7B49;&#x3002;&#x8F83;&#x5927;&#x7684;&#x6570;&#x5B57;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x5B57;&#x8282;&#x3002;</p>
<p><img src="img/fig4-3.png" alt=""></p>
<p><strong>&#x56FE;4-3 &#x4F7F;&#x7528;Thrift&#x538B;&#x7F29;&#x534F;&#x8BAE;&#x7F16;&#x7801;&#x7684;&#x8BB0;&#x5F55;</strong></p>
<p>&#x6700;&#x540E;&#xFF0C;Protocol Buffers&#xFF08;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF09;&#x5BF9;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x5982;<a href="img/fig4-4.png">&#x56FE;4-4</a>&#x6240;&#x793A;&#x3002; &#x5B83;&#x7684;&#x6253;&#x5305;&#x65B9;&#x5F0F;&#x7A0D;&#x6709;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x4E0E;Thrift&#x7684;CompactProtocol&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002; Protobuf&#x5C06;&#x540C;&#x6837;&#x7684;&#x8BB0;&#x5F55;&#x585E;&#x8FDB;&#x4E86;33&#x4E2A;&#x5B57;&#x8282;&#x4E2D;&#x3002;</p>
<p><img src="img/fig4-4.png" alt=""></p>
<p><strong>&#x56FE;4-4 &#x4F7F;&#x7528;Protobuf&#x7F16;&#x7801;&#x7684;&#x8BB0;&#x5F55;</strong></p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x4E2A;&#x7EC6;&#x8282;&#xFF1A;&#x5728;&#x524D;&#x9762;&#x6240;&#x793A;&#x7684;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x5FC5;&#x9700;&#x6216;&#x53EF;&#x9009;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x5BF9;&#x5B57;&#x6BB5;&#x5982;&#x4F55;&#x7F16;&#x7801;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#xFF08;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5B57;&#x6BB5;&#x6307;&#x793A;&#x662F;&#x5426;&#x9700;&#x8981;&#x5B57;&#x6BB5;&#xFF09;&#x3002;&#x6240;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x672A;&#x8BBE;&#x7F6E;&#x8BE5;&#x5B57;&#x6BB5;&#xFF0C;&#x5219;&#x6240;&#x9700;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x68C0;&#x67E5;&#x5C06;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x6355;&#x83B7;&#x9519;&#x8BEF;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<h4 id="&#x5B57;&#x6BB5;&#x6807;&#x7B7E;&#x548C;&#x6A21;&#x5F0F;&#x6F14;&#x53D8;">&#x5B57;&#x6BB5;&#x6807;&#x7B7E;&#x548C;&#x6A21;&#x5F0F;&#x6F14;&#x53D8;</h4>
<p>&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BF4;&#x8FC7;&#xFF0C;&#x6A21;&#x5F0F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x9700;&#x8981;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x800C;&#x6539;&#x53D8;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x6A21;&#x5F0F;&#x6F14;&#x53D8;&#x3002; Thrift&#x548C;Protocol Buffers&#x5982;&#x4F55;&#x5904;&#x7406;&#x6A21;&#x5F0F;&#x66F4;&#x6539;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x6301;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#xFF1F;</p>
<p>&#x4ECE;&#x793A;&#x4F8B;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x7F16;&#x7801;&#x7684;&#x8BB0;&#x5F55;&#x5C31;&#x662F;&#x5176;&#x7F16;&#x7801;&#x5B57;&#x6BB5;&#x7684;&#x62FC;&#x63A5;&#x3002;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x7531;&#x5176;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#xFF08;&#x6837;&#x672C;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x6570;&#x5B57;1,2,3&#xFF09;&#x6807;&#x8BC6;&#xFF0C;&#x5E76;&#x7528;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;&#x4F8B;&#x5982;&#x5B57;&#x7B26;&#x4E32;&#x6216;&#x6574;&#x6570;&#xFF09;&#x6CE8;&#x91CA;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x8BBE;&#x7F6E;&#x5B57;&#x6BB5;&#x503C;&#xFF0C;&#x5219;&#x7B80;&#x5355;&#x5730;&#x4ECE;&#x7F16;&#x7801;&#x8BB0;&#x5F55;&#x4E2D;&#x7701;&#x7565;&#x3002;&#x4ECE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5B57;&#x6BB5;&#x6807;&#x8BB0;&#x5BF9;&#x7F16;&#x7801;&#x6570;&#x636E;&#x7684;&#x542B;&#x4E49;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x66F4;&#x6539;&#x67B6;&#x6784;&#x4E2D;&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x56E0;&#x4E3A;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5F15;&#x7528;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x66F4;&#x6539;&#x5B57;&#x6BB5;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4F1A;&#x4F7F;&#x6240;&#x6709;&#x73B0;&#x6709;&#x7684;&#x7F16;&#x7801;&#x6570;&#x636E;&#x65E0;&#x6548;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x5B57;&#x6BB5;&#x5230;&#x67B6;&#x6784;&#xFF0C;&#x53EA;&#x8981;&#x60A8;&#x7ED9;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#x3002;&#x5982;&#x679C;&#x65E7;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x6DFB;&#x52A0;&#x7684;&#x65B0;&#x7684;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#xFF09;&#x8BD5;&#x56FE;&#x8BFB;&#x53D6;&#x65B0;&#x4EE3;&#x7801;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x5176;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#x4E0D;&#x80FD;&#x8BC6;&#x522B;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5FFD;&#x7565;&#x8BE5;&#x5B57;&#x6BB5;&#x3002;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6CE8;&#x91CA;&#x5141;&#x8BB8;&#x89E3;&#x6790;&#x5668;&#x786E;&#x5B9A;&#x9700;&#x8981;&#x8DF3;&#x8FC7;&#x7684;&#x5B57;&#x8282;&#x6570;&#x3002;&#x8FD9;&#x4FDD;&#x6301;&#x4E86;&#x524D;&#x5411;&#x517C;&#x5BB9;&#x6027;&#xFF1A;&#x65E7;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x7531;&#x65B0;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x7684;&#x8BB0;&#x5F55;&#x3002;</p>
<p>&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#x5462;&#xFF1F;&#x53EA;&#x8981;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#xFF0C;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x65E7;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#x4ECD;&#x7136;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x542B;&#x4E49;&#x3002;&#x552F;&#x4E00;&#x7684;&#x7EC6;&#x8282;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x8981;&#x6C42;&#x3002;&#x5982;&#x679C;&#x60A8;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x5E76;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x5FC5;&#x9700;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x65B0;&#x4EE3;&#x7801;&#x8BFB;&#x53D6;&#x65E7;&#x4EE3;&#x7801;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x8BE5;&#x68C0;&#x67E5;&#x5C06;&#x5931;&#x8D25;&#xFF0C;&#x56E0;&#x4E3A;&#x65E7;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x5199;&#x5165;&#x60A8;&#x6DFB;&#x52A0;&#x7684;&#x65B0;&#x5B57;&#x6BB5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x5728;&#x6A21;&#x5F0F;&#x7684;&#x521D;&#x59CB;&#x90E8;&#x7F72;&#x4E4B;&#x540E; <strong>&#x6DFB;&#x52A0;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x662F;&#x53EF;&#x9009;&#x7684;&#x6216;&#x5177;&#x6709;&#x9ED8;&#x8BA4;&#x503C;</strong>&#x3002;</p>
<p>&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x5C31;&#x50CF;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x5012;&#x9000;&#x548C;&#x5411;&#x524D;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#x76F8;&#x53CD;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x60A8;&#x53EA;&#x80FD;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x7684;&#x5B57;&#x6BB5;&#xFF08;&#x5FC5;&#x586B;&#x5B57;&#x6BB5;&#x6C38;&#x8FDC;&#x4E0D;&#x80FD;&#x5220;&#x9664;&#xFF09;&#xFF0C;&#x800C;&#x4E14;&#x60A8;&#x4E0D;&#x80FD;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#xFF08;&#x56E0;&#x4E3A;&#x60A8;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x6709;&#x6570;&#x636E;&#x5199;&#x5728;&#x5305;&#x542B;&#x65E7;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x800C;&#x8BE5;&#x5B57;&#x6BB5;&#x5FC5;&#x987B;&#x88AB;&#x65B0;&#x4EE3;&#x7801;&#x5FFD;&#x7565;&#xFF09;&#x3002;</p>
<h4 id="&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x6A21;&#x5F0F;&#x6F14;&#x53D8;">&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x6A21;&#x5F0F;&#x6F14;&#x53D8;</h4>
<p>&#x5982;&#x4F55;&#x6539;&#x53D8;&#x5B57;&#x6BB5;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF1F;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x2014;&#x2014;&#x68C0;&#x67E5;&#x6587;&#x4EF6;&#x7684;&#x7EC6;&#x8282;&#x2014;&#x2014;&#x4F46;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x98CE;&#x9669;&#xFF0C;&#x503C;&#x5C06;&#x5931;&#x53BB;&#x7CBE;&#x5EA6;&#x6216;&#x88AB;&#x627C;&#x6740;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x5C06;&#x4E00;&#x4E2A;32&#x4F4D;&#x7684;&#x6574;&#x6570;&#x53D8;&#x6210;&#x4E00;&#x4E2A;64&#x4F4D;&#x7684;&#x6574;&#x6570;&#x3002;&#x65B0;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x8BFB;&#x53D6;&#x65E7;&#x4EE3;&#x7801;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x89E3;&#x6790;&#x5668;&#x53EF;&#x4EE5;&#x7528;&#x96F6;&#x586B;&#x5145;&#x4EFB;&#x4F55;&#x7F3A;&#x5931;&#x7684;&#x4F4D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x65E7;&#x4EE3;&#x7801;&#x8BFB;&#x53D6;&#x7531;&#x65B0;&#x4EE3;&#x7801;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x65E7;&#x4EE3;&#x7801;&#x4ECD;&#x4F7F;&#x7528;32&#x4F4D;&#x53D8;&#x91CF;&#x6765;&#x4FDD;&#x5B58;&#x8BE5;&#x503C;&#x3002;&#x5982;&#x679C;&#x89E3;&#x7801;&#x7684;64&#x4F4D;&#x503C;&#x4E0D;&#x9002;&#x5408;32&#x4F4D;&#xFF0C;&#x5219;&#x5B83;&#x5C06;&#x88AB;&#x622A;&#x65AD;&#x3002;</p>
<p>Protobuf&#x7684;&#x4E00;&#x4E2A;&#x5947;&#x602A;&#x7684;&#x7EC6;&#x8282;&#x662F;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x5217;&#x8868;&#x6216;&#x6570;&#x7EC4;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x91CD;&#x590D;&#x6807;&#x8BB0;&#xFF08;&#x8FD9;&#x662F;&#x7B2C;&#x4E09;&#x4E2A;&#x9009;&#x9879;&#x65C1;&#x8FB9;&#x5FC5;&#x8981;&#x548C;&#x53EF;&#x9009;&#xFF09;&#x3002;&#x5982;<a href="img/fig4-4.png">&#x56FE;4-4</a>&#x6240;&#x793A;&#xFF0C;&#x91CD;&#x590D;&#x5B57;&#x6BB5;&#x7684;&#x7F16;&#x7801;&#x6B63;&#x5982;&#x5B83;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF1A;&#x540C;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x6807;&#x8BB0;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x51FA;&#x73B0;&#x5728;&#x8BB0;&#x5F55;&#x4E2D;&#x3002;&#x8FD9;&#x5177;&#x6709;&#x5F88;&#x597D;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x53EF;&#x9009;&#xFF08;&#x5355;&#x503C;&#xFF09;&#x5B57;&#x6BB5;&#x66F4;&#x6539;&#x4E3A;&#x91CD;&#x590D;&#xFF08;&#x591A;&#x503C;&#xFF09;&#x5B57;&#x6BB5;&#x3002;&#x8BFB;&#x53D6;&#x65E7;&#x6570;&#x636E;&#x7684;&#x65B0;&#x4EE3;&#x7801;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x96F6;&#x4E2A;&#x6216;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x7684;&#x5217;&#x8868;&#xFF08;&#x53D6;&#x51B3;&#x4E8E;&#x8BE5;&#x5B57;&#x6BB5;&#x662F;&#x5426;&#x5B58;&#x5728;&#xFF09;&#x3002;&#x8BFB;&#x53D6;&#x65B0;&#x6570;&#x636E;&#x7684;&#x65E7;&#x4EE3;&#x7801;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x5217;&#x8868;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;</p>
<p>Thrift&#x6709;&#x4E00;&#x4E2A;&#x4E13;&#x7528;&#x7684;&#x5217;&#x8868;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x5217;&#x8868;&#x5143;&#x7D20;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x53C2;&#x6570;&#x5316;&#x3002;&#x8FD9;&#x4E0D;&#x5141;&#x8BB8;Protocol Buffers&#x6240;&#x505A;&#x7684;&#x4ECE;&#x5355;&#x503C;&#x5230;&#x591A;&#x503C;&#x7684;&#x76F8;&#x540C;&#x6F14;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5177;&#x6709;&#x652F;&#x6301;&#x5D4C;&#x5957;&#x5217;&#x8868;&#x7684;&#x4F18;&#x70B9;&#x3002;</p>
<h3 id="avro">Avro</h3>
<p>Apache Avro &#x3010;20&#x3011;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF0C;&#x4E0E;Protocol Buffers&#x548C;Thrift&#x6709;&#x8DA3;&#x7684;&#x4E0D;&#x540C;&#x3002; &#x5B83;&#x662F;&#x4F5C;&#x4E3A;Hadoop&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x9879;&#x76EE;&#x5728;2009&#x5E74;&#x5F00;&#x59CB;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;Thrift&#x4E0D;&#x9002;&#x5408;Hadoop&#x7684;&#x7528;&#x4F8B;&#x3010;21&#x3011;&#x3002;</p>
<p>Avro&#x4E5F;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x6765;&#x6307;&#x5B9A;&#x6B63;&#x5728;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x7684;&#x7ED3;&#x6784;&#x3002; &#x5B83;&#x6709;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#x8BED;&#x8A00;&#xFF1A;&#x4E00;&#x79CD;&#xFF08;Avro IDL&#xFF09;&#x7528;&#x4E8E;&#x4EBA;&#x5DE5;&#x7F16;&#x8F91;&#xFF0C;&#x4E00;&#x79CD;&#xFF08;&#x57FA;&#x4E8E;JSON&#xFF09;&#x66F4;&#x6613;&#x4E8E;&#x673A;&#x5668;&#x8BFB;&#x53D6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x7528;Avro IDL&#x7F16;&#x5199;&#x7684;&#x793A;&#x4F8B;&#x6A21;&#x5F0F;&#x53EF;&#x80FD;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-c">record Person {
    <span class="hljs-built_in">string</span>                userName;
    <span class="hljs-keyword">union</span> { null, <span class="hljs-keyword">long</span> }  favoriteNumber = null;
    <span class="hljs-built_in">array</span>&lt;<span class="hljs-built_in">string</span>&gt;         interests;
}
</code></pre>
<p>&#x7B49;&#x4EF7;&#x7684;JSON&#x8868;&#x793A;&#xFF1A;</p>
<pre><code class="lang-json">{
    <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;record&quot;</span>,
    <span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;Person&quot;</span>,
    <span class="hljs-string">&quot;fields&quot;</span>: [
        {<span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;userName&quot;</span>, <span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;string&quot;</span>},
        {<span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;favoriteNumber&quot;</span>, <span class="hljs-string">&quot;type&quot;</span>: [<span class="hljs-string">&quot;null&quot;</span>, <span class="hljs-string">&quot;long&quot;</span>], <span class="hljs-string">&quot;default&quot;</span>: <span class="hljs-literal">null</span>},
        {<span class="hljs-string">&quot;name&quot;</span>: <span class="hljs-string">&quot;interests&quot;</span>, <span class="hljs-string">&quot;type&quot;</span>: {<span class="hljs-string">&quot;type&quot;</span>: <span class="hljs-string">&quot;array&quot;</span>, <span class="hljs-string">&quot;items&quot;</span>: <span class="hljs-string">&quot;string&quot;</span>}
    ] 
}
</code></pre>
<p>&#x9996;&#x5148;&#xFF0C;&#x8BF7;&#x6CE8;&#x610F;&#x67B6;&#x6784;&#x4E2D;&#x6CA1;&#x6709;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#x3002; &#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x7F16;&#x7801;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x8BB0;&#x5F55;&#xFF08;<a href="">&#x4F8B;4-1</a>&#xFF09;&#xFF0C;Avro&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x53EA;&#x6709;32&#x4E2A;&#x5B57;&#x8282;&#x957F;&#xFF0C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x89C1;&#x8FC7;&#x7684;&#x6240;&#x6709;&#x7F16;&#x7801;&#x4E2D;&#x6700;&#x7D27;&#x51D1;&#x7684;&#x3002; &#x7F16;&#x7801;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x7684;&#x5206;&#x89E3;&#x5982;<a href="img/fig4-5.png">&#x56FE;4-5</a>&#x6240;&#x793A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x68C0;&#x67E5;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x5B57;&#x6BB5;&#x6216;&#x5176;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002; &#x7F16;&#x7801;&#x53EA;&#x662F;&#x7531;&#x8FDE;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x503C;&#x7EC4;&#x6210;&#x3002; &#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x524D;&#x7F00;&#xFF0C;&#x540E;&#x8DDF;UTF-8&#x5B57;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x88AB;&#x5305;&#x542B;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x544A;&#x8BC9;&#x4F60;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5176;&#x4ED6;&#x7684;&#x6574;&#x6570;&#x3002; &#x6574;&#x6570;&#x4F7F;&#x7528;&#x53EF;&#x53D8;&#x957F;&#x5EA6;&#x7F16;&#x7801;&#xFF08;&#x4E0E;Thrift&#x7684;CompactProtocol&#x76F8;&#x540C;&#xFF09;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;</p>
<p><img src="img/fig4-5.png" alt=""></p>
<p><strong>&#x56FE;4-5 &#x4F7F;&#x7528;Avro&#x7F16;&#x7801;&#x7684;&#x8BB0;&#x5F55;</strong></p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x6790;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x60A8;&#x6309;&#x7167;&#x5B83;&#x4EEC;&#x51FA;&#x73B0;&#x5728;&#x67B6;&#x6784;&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x904D;&#x5386;&#x8FD9;&#x4E9B;&#x5B57;&#x6BB5;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x67B6;&#x6784;&#x6765;&#x544A;&#x8BC9;&#x60A8;&#x6BCF;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x4E0E;&#x5199;&#x5165;&#x6570;&#x636E;&#x7684;&#x4EE3;&#x7801;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5219;&#x53EA;&#x80FD;&#x6B63;&#x786E;&#x89E3;&#x7801;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x3002;&#x8BFB;&#x8005;&#x548C;&#x4F5C;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x6A21;&#x5F0F;&#x4E0D;&#x5339;&#x914D;&#x610F;&#x5473;&#x7740;&#x9519;&#x8BEF;&#x5730;&#x89E3;&#x7801;&#x6570;&#x636E;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;Avro&#x5982;&#x4F55;&#x652F;&#x6301;&#x6A21;&#x5F0F;&#x6F14;&#x53D8;&#x5462;&#xFF1F;</p>
<h4 id="&#x4F5C;&#x8005;&#x6A21;&#x5F0F;&#x4E0E;&#x8BFB;&#x8005;&#x6A21;&#x5F0F;">&#x4F5C;&#x8005;&#x6A21;&#x5F0F;&#x4E0E;&#x8BFB;&#x8005;&#x6A21;&#x5F0F;</h4>
<p>&#x6709;&#x4E86;Avro&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x60F3;&#x8981;&#x7F16;&#x7801;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#xFF08;&#x5C06;&#x5176;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x6216;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x7B49;&#xFF09;&#x65F6;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x5B83;&#x77E5;&#x9053;&#x7684;&#x4EFB;&#x4F55;&#x7248;&#x672C;&#x7684;&#x6A21;&#x5F0F;&#x7F16;&#x7801;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x67B6;&#x6784;&#x53EF;&#x80FD;&#x88AB;&#x7F16;&#x8BD1;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x60F3;&#x8981;&#x89E3;&#x7801;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#xFF08;&#x4ECE;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x6216;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x4ECE;&#x7F51;&#x7EDC;&#x63A5;&#x6536;&#x6570;&#x636E;&#x7B49;&#xFF09;&#x65F6;&#xFF0C;&#x5B83;&#x5E0C;&#x671B;&#x6570;&#x636E;&#x5728;&#x67D0;&#x4E2A;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x8BFB;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6784;&#x5EFA;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x662F;&#x4ECE;&#x8BE5;&#x6A21;&#x5F0F;&#x751F;&#x6210;&#x7684;&#x3002;</p>
<p>Avro&#x7684;&#x5173;&#x952E;&#x601D;&#x60F3;&#x662F;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x8BFB;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x4E0D;&#x5FC5;&#x662F;&#x76F8;&#x540C;&#x7684; - &#x4ED6;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x517C;&#x5BB9;&#x3002;&#x5F53;&#x6570;&#x636E;&#x89E3;&#x7801;&#xFF08;&#x8BFB;&#x53D6;&#xFF09;&#x65F6;&#xFF0C;Avro&#x5E93;&#x901A;&#x8FC7;&#x5E76;&#x6392;&#x67E5;&#x770B;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x8BFB;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x5E76;&#x5C06;&#x6570;&#x636E;&#x4ECE;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x8F6C;&#x6362;&#x5230;&#x8BFB;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x5DEE;&#x5F02;&#x3002; Avro&#x89C4;&#x8303;&#x3010;20&#x3011;&#x786E;&#x5207;&#x5730;&#x5B9A;&#x4E49;&#x4E86;&#x8FD9;&#x79CD;&#x89E3;&#x6790;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#xFF0C;&#x5982;<a href="img/fig4-6.png">&#x56FE;4-6</a>&#x6240;&#x793A;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x8BFB;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x7684;&#x5B57;&#x6BB5;&#x987A;&#x5E8F;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6A21;&#x5F0F;&#x89E3;&#x6790;&#x901A;&#x8FC7;&#x5B57;&#x6BB5;&#x540D;&#x5339;&#x914D;&#x5B57;&#x6BB5;&#x3002;&#x5982;&#x679C;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x4EE3;&#x7801;&#x9047;&#x5230;&#x51FA;&#x73B0;&#x5728;&#x4F5C;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#x4F46;&#x4E0D;&#x5728;&#x8BFB;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x5219;&#x5FFD;&#x7565;&#x5B83;&#x3002;&#x5982;&#x679C;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x67D0;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x4F46;&#x662F;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x4E0D;&#x5305;&#x542B;&#x8BE5;&#x540D;&#x79F0;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x5728;&#x8BFB;&#x8005;&#x6A21;&#x5F0F;&#x4E2D;&#x58F0;&#x660E;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x586B;&#x5145;&#x3002;</p>
<p><img src="img/fig4-6.png" alt=""></p>
<p><strong>&#x56FE;4-6 &#x4E00;&#x4E2A;Avro Reader&#x89E3;&#x51B3;&#x8BFB;&#x5199;&#x6A21;&#x5F0F;&#x7684;&#x5DEE;&#x5F02;</strong></p>
<h4 id="&#x6A21;&#x5F0F;&#x6F14;&#x53D8;&#x89C4;&#x5219;">&#x6A21;&#x5F0F;&#x6F14;&#x53D8;&#x89C4;&#x5219;</h4>
<p>&#x4F7F;&#x7528;Avro&#xFF0C;&#x5411;&#x524D;&#x517C;&#x5BB9;&#x6027;&#x610F;&#x5473;&#x7740;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x65B0;&#x7248;&#x672C;&#x7684;&#x67B6;&#x6784;&#x4F5C;&#x4E3A;&#x7F16;&#x5199;&#x5668;&#xFF0C;&#x5E76;&#x5C06;&#x65E7;&#x7248;&#x672C;&#x7684;&#x67B6;&#x6784;&#x4F5C;&#x4E3A;&#x8BFB;&#x8005;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x8BFB;&#x8005;&#x7684;&#x65B0;&#x7248;&#x672C;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x4F5C;&#x4E3A;&#x4F5C;&#x8005;&#x7684;&#x65E7;&#x7248;&#x672C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x60A8;&#x53EA;&#x80FD;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x5177;&#x6709;&#x9ED8;&#x8BA4;&#x503C;&#x7684;&#x5B57;&#x6BB5;&#x3002; &#xFF08;&#x6211;&#x4EEC;&#x7684;Avro&#x6A21;&#x5F0F;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;<code>favourNumber</code>&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A;<code>null</code>&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x503C;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x5B57;&#x6BB5;&#x5B58;&#x5728;&#x4E8E;&#x65B0;&#x7684;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x65E7;&#x7684;&#x3002;&#x5F53;&#x4F7F;&#x7528;&#x65B0;&#x6A21;&#x5F0F;&#x7684;&#x9605;&#x8BFB;&#x5668;&#x8BFB;&#x53D6;&#x4F7F;&#x7528;&#x65E7;&#x6A21;&#x5F0F;&#x5199;&#x5165;&#x7684;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x5C06;&#x4E3A;&#x7F3A;&#x5C11;&#x7684;&#x5B57;&#x6BB5;&#x586B;&#x5145;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x9ED8;&#x8BA4;&#x503C;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x65B0;&#x7684;&#x9605;&#x8BFB;&#x5668;&#x5C06;&#x65E0;&#x6CD5;&#x8BFB;&#x53D6;&#x65E7;&#x4F5C;&#x8005;&#x5199;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4F1A;&#x7834;&#x574F;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#x3002;&#x5982;&#x679C;&#x60A8;&#x8981;&#x5220;&#x9664;&#x6CA1;&#x6709;&#x9ED8;&#x8BA4;&#x503C;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x65E7;&#x7684;&#x9605;&#x8BFB;&#x5668;&#x5C06;&#x65E0;&#x6CD5;&#x8BFB;&#x53D6;&#x65B0;&#x4F5C;&#x8005;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x4F1A;&#x6253;&#x7834;&#x517C;&#x5BB9;&#x6027;&#x3002;&#x5728;&#x4E00;&#x4E9B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;null&#x662F;&#x4EFB;&#x4F55;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x4F46;&#x5728;Avro&#x4E2D;&#x5E76;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#xFF1A;&#x5982;&#x679C;&#x8981;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x4E3A;<code>null</code>&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<code>union {null&#xFF0C;long&#xFF0C;string}</code>&#x5B57;&#x6BB5;;&#x8868;&#x793A;&#x8BE5;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x662F;&#x6570;&#x5B57;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;<code>null</code>&#x3002;&#x5982;&#x679C;&#x5B83;&#x662F;union&#x7684;&#x5206;&#x652F;&#x4E4B;&#x4E00;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x80FD;&#x4F7F;&#x7528;null&#x4F5C;&#x4E3A;&#x9ED8;&#x8BA4;&#x503C;<sup><a href="#fn_iv" id="reffn_iv">iv</a></sup>&#x3002;&#x8FD9;&#x6BD4;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x4E3A;<code>null</code>&#x662F;&#x66F4;&#x52A0;&#x5197;&#x957F;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x901A;&#x8FC7;&#x660E;&#x786E;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x548C;&#x4E0D;&#x53EF;&#x4EE5;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x9632;&#x6B62;&#x9519;&#x8BEF;&#x7684;<code>null</code> &#x3010;22&#x3011;&#x3002;</p>
<blockquote id="fn_iv">
<sup>iv</sup>. &#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x9ED8;&#x8BA4;&#x503C;&#x5FC5;&#x987B;&#x662F;&#x8054;&#x5408;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x662F;Avro&#x7684;&#x7279;&#x5B9A;&#x9650;&#x5236;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x7684;&#x4E00;&#x822C;&#x7279;&#x5F81;&#x3002;<a href="#reffn_iv" title="Jump back to footnote [iv] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x56E0;&#x6B64;&#xFF0C;Avro&#x6CA1;&#x6709;&#x50CF;Protocol Buffers&#x548C;Thrift&#x90A3;&#x6837;&#x7684;<code>optional</code>&#x548C;<code>required</code>&#x6807;&#x8BB0;&#xFF08;&#x5B83;&#x6709;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x548C;&#x9ED8;&#x8BA4;&#x503C;&#xFF09;&#x3002;</p>
<p>&#x53EA;&#x8981;Avro&#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x7C7B;&#x578B;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x5B57;&#x6BB5;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;&#x66F4;&#x6539;&#x5B57;&#x6BB5;&#x7684;&#x540D;&#x79F0;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x70B9;&#x68D8;&#x624B;&#xFF1A;&#x8BFB;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x7684;&#x522B;&#x540D;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x5339;&#x914D;&#x65E7;&#x4F5C;&#x5BB6;&#x7684;&#x6A21;&#x5F0F;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x4E0E;&#x522B;&#x540D;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x66F4;&#x6539;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x662F;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x5411;&#x524D;&#x517C;&#x5BB9;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5411;&#x8054;&#x5408;&#x7C7B;&#x578B;&#x6DFB;&#x52A0;&#x5206;&#x652F;&#x4E5F;&#x662F;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x5411;&#x524D;&#x517C;&#x5BB9;&#x3002;</p>
<h5 id="&#x4F46;&#x4F5C;&#x8005;&#x6A21;&#x5F0F;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;">&#x4F46;&#x4F5C;&#x8005;&#x6A21;&#x5F0F;&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h5>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x8BFB;&#x8005;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x662F;&#x54EA;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x636E;&#x88AB;&#x7F16;&#x7801;&#x7684;&#xFF1F;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x53EA;&#x5C06;&#x6574;&#x4E2A;&#x6A21;&#x5F0F;&#x5305;&#x62EC;&#x5728;&#x6BCF;&#x4E2A;&#x8BB0;&#x5F55;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x6A21;&#x5F0F;&#x53EF;&#x80FD;&#x6BD4;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x5927;&#x5F97;&#x591A;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x8282;&#x7701;&#x7684;&#x6240;&#x6709;&#x7A7A;&#x95F4;&#x90FD;&#x662F;&#x5F92;&#x52B3;&#x7684;&#x3002;
&#x7B54;&#x6848;&#x53D6;&#x51B3;&#x4E8E;Avro&#x4F7F;&#x7528;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x3002;&#x4E3E;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<ul>
<li><p>&#x6709;&#x5F88;&#x591A;&#x8BB0;&#x5F55;&#x7684;&#x5927;&#x6587;&#x4EF6;</p>
<p>Avro&#x7684;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7528;&#x9014; - &#x5C24;&#x5176;&#x662F;&#x5728;Hadoop&#x73AF;&#x5883;&#x4E2D; - &#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5305;&#x542B;&#x6570;&#x767E;&#x4E07;&#x6761;&#x8BB0;&#x5F55;&#x7684;&#x5927;&#x6587;&#x4EF6;&#xFF0C;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x90FD;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002; &#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch10.html">&#x7B2C;10&#x7AE0;</a>&#x8BA8;&#x8BBA;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#xFF09;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x4F5C;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x6587;&#x4EF6;&#x7684;&#x5F00;&#x5934;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x6B21;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x3002; Avro&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#xFF08;&#x5BF9;&#x8C61;&#x5BB9;&#x5668;&#x6587;&#x4EF6;&#xFF09;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x652F;&#x6301;&#x72EC;&#x7ACB;&#x5199;&#x5165;&#x7684;&#x8BB0;&#x5F55;&#x7684;&#x6570;&#x636E;&#x5E93;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8BB0;&#x5F55;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x7F16;&#x5199; - &#x4F60;&#x4E0D;&#x80FD;&#x5047;&#x5B9A;&#x6240;&#x6709;&#x7684;&#x8BB0;&#x5F55;&#x90FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x7F16;&#x7801;&#x8BB0;&#x5F55;&#x7684;&#x5F00;&#x59CB;&#x5904;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x5E76;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x6A21;&#x5F0F;&#x7248;&#x672C;&#x5217;&#x8868;&#x3002;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x8BB0;&#x5F55;&#xFF0C;&#x63D0;&#x53D6;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x83B7;&#x53D6;&#x8BE5;&#x7248;&#x672C;&#x53F7;&#x7684;&#x4F5C;&#x8005;&#x6A21;&#x5F0F;&#x3002;&#x4F7F;&#x7528;&#x8BE5;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x89E3;&#x7801;&#x8BB0;&#x5F55;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x3002; &#xFF08;&#x4F8B;&#x5982;Espresso &#x3010;23&#x3011;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#xFF09;</p>
</li>
<li><p>&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x53D1;&#x9001;&#x8BB0;&#x5F55;</p>
<p>&#x5F53;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x901A;&#x8FC7;&#x53CC;&#x5411;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x8FDE;&#x63A5;&#x8BBE;&#x7F6E;&#x4E0A;&#x534F;&#x5546;&#x6A21;&#x5F0F;&#x7248;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8FDE;&#x63A5;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x4F7F;&#x7528;&#x8BE5;&#x6A21;&#x5F0F;&#x3002; Avro RPC&#x534F;&#x8BAE;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF1A;REST&#x548C;RPC">&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF1A;REST&#x548C;RPC</a>&#x201D;&#xFF09;&#x5982;&#x6B64;&#x5DE5;&#x4F5C;&#x3002;</p>
</li>
</ul>
<p>&#x5177;&#x6709;&#x6A21;&#x5F0F;&#x7248;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5145;&#x5F53;&#x6587;&#x6863;&#x5E76;&#x4E3A;&#x60A8;&#x63D0;&#x4F9B;&#x4E86;&#x68C0;&#x67E5;&#x6A21;&#x5F0F;&#x517C;&#x5BB9;&#x6027;&#x7684;&#x673A;&#x4F1A;&#x3010;24&#x3011;&#x3002;&#x4F5C;&#x4E3A;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x9012;&#x589E;&#x6574;&#x6570;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x7684;&#x6563;&#x5217;&#x3002;</p>
<h4 id="&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#x6A21;&#x5F0F;">&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#x6A21;&#x5F0F;</h4>
<p>&#x4E0E;Protocol Buffers&#x548C;Thrift&#x76F8;&#x6BD4;&#xFF0C;Avro&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#x67B6;&#x6784;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#x3002;&#x4F46;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x5F88;&#x91CD;&#x8981;&#xFF1F;&#x5728;&#x6A21;&#x5F0F;&#x4E2D;&#x4FDD;&#x7559;&#x4E00;&#x4E9B;&#x6570;&#x5B57;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;</p>
<p>&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;Avro&#x5BF9;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#x6A21;&#x5F0F;&#x66F4;&#x53CB;&#x5584;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x5982;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F60;&#x60F3;&#x8981;&#x628A;&#x5B83;&#x7684;&#x5185;&#x5BB9;&#x8F6C;&#x50A8;&#x5230;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x60F3;&#x4F7F;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x6765;&#x907F;&#x514D;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x6587;&#x672C;&#x683C;&#x5F0F;&#xFF08;JSON&#xFF0C;CSV&#xFF0C;SQL&#xFF09;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;Avro&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x4ECE;&#x5173;&#x7CFB;&#x6A21;&#x5F0F;&#x751F;&#x6210;&#x4E00;&#x4E2A;Avro&#x6A21;&#x5F0F;&#xFF08;&#x5728;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;JSON&#x8868;&#x793A;&#x4E2D;&#xFF09;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8BE5;&#x6A21;&#x5F0F;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5168;&#x90E8;&#x8F6C;&#x50A8;&#x5230;Avro&#x5BF9;&#x8C61;&#x5BB9;&#x5668;&#x6587;&#x4EF6;&#x3010;25&#x3011;&#x4E2D;&#x3002;&#x60A8;&#x4E3A;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8868;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x6A21;&#x5F0F;&#xFF0C;&#x6BCF;&#x4E2A;&#x5217;&#x6210;&#x4E3A;&#x8BE5;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x3002;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5217;&#x540D;&#x79F0;&#x6620;&#x5C04;&#x5230;Avro&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x6A21;&#x5F0F;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x5217;&#xFF0C;&#x5220;&#x9664;&#x4E86;&#x4E00;&#x5217;&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4ECE;&#x66F4;&#x65B0;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6A21;&#x5F0F;&#x751F;&#x6210;&#x65B0;&#x7684;Avro&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x5728;&#x65B0;&#x7684;Avro&#x6A21;&#x5F0F;&#x4E2D;&#x5BFC;&#x51FA;&#x6570;&#x636E;&#x3002;&#x6570;&#x636E;&#x5BFC;&#x51FA;&#x8FC7;&#x7A0B;&#x4E0D;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x6A21;&#x5F0F;&#x7684;&#x6539;&#x53D8; - &#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#x90FD;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x8FDB;&#x884C;&#x6A21;&#x5F0F;&#x8F6C;&#x6362;&#x3002;&#x4EFB;&#x4F55;&#x8BFB;&#x53D6;&#x65B0;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x7684;&#x4EBA;&#x90FD;&#x4F1A;&#x770B;&#x5230;&#x8BB0;&#x5F55;&#x7684;&#x5B57;&#x6BB5;&#x5DF2;&#x7ECF;&#x6539;&#x53D8;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5B57;&#x6BB5;&#x662F;&#x901A;&#x8FC7;&#x540D;&#x5B57;&#x6765;&#x6807;&#x8BC6;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x66F4;&#x65B0;&#x7684;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x4E0E;&#x65E7;&#x7684;&#x8BFB;&#x8005;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x4E3A;&#x6B64;&#x4F7F;&#x7528;Thrift&#x6216;Protocol Buffers&#xFF0C;&#x5219;&#x5B57;&#x6BB5;&#x6807;&#x8BB0;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x624B;&#x52A8;&#x5206;&#x914D;&#xFF1A;&#x6BCF;&#x6B21;&#x6570;&#x636E;&#x5E93;&#x6A21;&#x5F0F;&#x66F4;&#x6539;&#x65F6;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x90FD;&#x5FC5;&#x987B;&#x624B;&#x52A8;&#x66F4;&#x65B0;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x5217;&#x540D;&#x5230;&#x5B57;&#x6BB5;&#x6807;&#x7B7E;&#x3002; &#xFF08;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x4F46;&#x6A21;&#x5F0F;&#x751F;&#x6210;&#x5668;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#xFF0C;&#x4E0D;&#x8981;&#x5206;&#x914D;&#x4EE5;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x5B57;&#x6BB5;&#x6807;&#x8BB0;&#x3002;&#xFF09;&#x8FD9;&#x79CD;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#x6A21;&#x5F0F;&#x6839;&#x672C;&#x4E0D;&#x662F;Thrift&#x6216;Protocol Buffers&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#xFF0C;&#x800C;&#x662F;&#x4E3A;Avro&#x3002;</p>
<h4 id="&#x4EE3;&#x7801;&#x751F;&#x6210;&#x548C;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;">&#x4EE3;&#x7801;&#x751F;&#x6210;&#x548C;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x8BED;&#x8A00;</h4>
<p>Thrift&#x548C;Protobuf&#x4F9D;&#x8D56;&#x4E8E;&#x4EE3;&#x7801;&#x751F;&#x6210;&#xFF1A;&#x5728;&#x5B9A;&#x4E49;&#x4E86;&#x6A21;&#x5F0F;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x60A8;&#x9009;&#x62E9;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x751F;&#x6210;&#x5B9E;&#x73B0;&#x6B64;&#x6A21;&#x5F0F;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x5728;Java&#xFF0C;C ++&#x6216;C&#xFF03;&#x7B49;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x4E2D;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x5C06;&#x9AD8;&#x6548;&#x7684;&#x5185;&#x5B58;&#x4E2D;&#x7ED3;&#x6784;&#x7528;&#x4E8E;&#x89E3;&#x7801;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x7F16;&#x5199;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x7A0B;&#x5E8F;&#x65F6;&#x5141;&#x8BB8;&#x5728;IDE&#x4E2D;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x548C;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x5728;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;&#x5982;JavaScript&#xFF0C;Ruby&#x6216;Python&#xFF09;&#x4E2D;&#xFF0C;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x7F16;&#x8BD1;&#x65F6;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x5668;&#x6765;&#x6EE1;&#x8DB3;&#x3002;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5728;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x4E2D;&#x7ECF;&#x5E38;&#x88AB;&#x5FFD;&#x89C6;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x907F;&#x514D;&#x4E86;&#x660E;&#x786E;&#x7684;&#x7F16;&#x8BD1;&#x6B65;&#x9AA4;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5BF9;&#x4E8E;&#x52A8;&#x6001;&#x751F;&#x6210;&#x7684;&#x6A21;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8868;&#x751F;&#x6210;&#x7684;Avro&#x6A21;&#x5F0F;&#xFF09;&#xFF0C;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x5BF9;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x969C;&#x788D;&#x3002;</p>
<p>Avro&#x4E3A;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x9009;&#x7684;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x751F;&#x6210;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5BB9;&#x5668;&#x6587;&#x4EF6;&#xFF08;&#x5B83;&#x5D4C;&#x5165;&#x4E86;&#x4F5C;&#x8005;&#x7684;&#x6A21;&#x5F0F;&#xFF09;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7528;Avro&#x5E93;&#x6253;&#x5F00;&#x5B83;&#xFF0C;&#x5E76;&#x4EE5;&#x4E0E;&#x67E5;&#x770B;JSON&#x6587;&#x4EF6;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x67E5;&#x770B;&#x6570;&#x636E;&#x3002;&#x8BE5;&#x6587;&#x4EF6;&#x662F;&#x81EA;&#x63CF;&#x8FF0;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5305;&#x542B;&#x6240;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x5143;&#x6570;&#x636E;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x7279;&#x522B;&#x9002;&#x7528;&#x4E8E;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x8BED;&#x8A00;&#x5982;Apache Pig &#x3010;26&#x3011;&#x3002;&#x5728;Pig&#x4E2D;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x6253;&#x5F00;&#x4E00;&#x4E9B;Avro&#x6587;&#x4EF6;&#xFF0C;&#x5F00;&#x59CB;&#x5206;&#x6790;&#x5B83;&#x4EEC;&#xFF0C;&#x5E76;&#x7F16;&#x5199;&#x6D3E;&#x751F;&#x6570;&#x636E;&#x96C6;&#x4EE5;Avro&#x683C;&#x5F0F;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x8003;&#x8651;&#x6A21;&#x5F0F;&#x3002;</p>
<h3 id="&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;">&#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;</h3>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;Protocol Buffers&#xFF0C;Thrift&#x548C;Avro&#x90FD;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x6765;&#x63CF;&#x8FF0;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x6A21;&#x5F0F;&#x8BED;&#x8A00;&#x6BD4;XML&#x6A21;&#x5F0F;&#x6216;&#x8005;JSON&#x6A21;&#x5F0F;&#x7B80;&#x5355;&#x5F97;&#x591A;&#xFF0C;&#x5B83;&#x652F;&#x6301;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x9A8C;&#x8BC1;&#x89C4;&#x5219;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x201C;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x503C;&#x5FC5;&#x987B;&#x4E0E;&#x8BE5;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x5339;&#x914D;&#x201D;&#x6216;&#x201C;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x6574;&#x6570;&#x503C;&#x5FC5;&#x987B;&#x5728;0&#x548C;100&#x4E4B;&#x95F4;&#x201C;&#xFF09;&#x3002;&#x7531;&#x4E8E;Protocol Buffers&#xFF0C;Thrift&#x548C;Avro&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x4E5F;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x5DF2;&#x7ECF;&#x53D1;&#x5C55;&#x5230;&#x652F;&#x6301;&#x76F8;&#x5F53;&#x5E7F;&#x6CDB;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x7F16;&#x7801;&#x6240;&#x57FA;&#x4E8E;&#x7684;&#x60F3;&#x6CD5;&#x7EDD;&#x4E0D;&#x662F;&#x65B0;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;ASN.1&#x6709;&#x5F88;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x5B83;&#x662F;1984&#x5E74;&#x9996;&#x6B21;&#x88AB;&#x6807;&#x51C6;&#x5316;&#x7684;&#x6A21;&#x5F0F;&#x5B9A;&#x4E49;&#x8BED;&#x8A00;&#x3010;27&#x3011;&#x3002;&#x5B83;&#x88AB;&#x7528;&#x6765;&#x5B9A;&#x4E49;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF0C;&#x5176;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#xFF08;DER&#xFF09;&#x4ECD;&#x7136;&#x88AB;&#x7528;&#x4E8E;&#x7F16;&#x7801;SSL&#x8BC1;&#x4E66;&#xFF08;X.509&#xFF09;&#xFF0C;&#x4F8B;&#x5982;&#x3010;28&#x3011;&#x3002; ASN.1&#x652F;&#x6301;&#x4F7F;&#x7528;&#x6807;&#x7B7E;&#x53F7;&#x7801;&#x7684;&#x6A21;&#x5F0F;&#x6F14;&#x8FDB;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;Protocol Buffers&#x548C;Thrift &#x3010;29&#x3011;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x590D;&#x6742;&#x548C;&#x4E25;&#x91CD;&#x7684;&#x6587;&#x4EF6;&#x8BB0;&#x5F55;&#xFF0C;&#x6240;&#x4EE5;ASN.1&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x65B0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x597D;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E5F;&#x4E3A;&#x5176;&#x6570;&#x636E;&#x5B9E;&#x73B0;&#x67D0;&#x79CD;&#x4E13;&#x6709;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BE5;&#x534F;&#x8BAE;&#x5411;&#x6570;&#x636E;&#x5E93;&#x53D1;&#x9001;&#x67E5;&#x8BE2;&#x5E76;&#x83B7;&#x53D6;&#x54CD;&#x5E94;&#x3002;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x901A;&#x5E38;&#x7279;&#x5B9A;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x4E14;&#x6570;&#x636E;&#x5E93;&#x4F9B;&#x5E94;&#x5546;&#x63D0;&#x4F9B;&#x5C06;&#x6765;&#x81EA;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x54CD;&#x5E94;&#x89E3;&#x7801;&#x4E3A;&#x5185;&#x5B58;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF08;&#x4F8B;&#x5982;&#x4F7F;&#x7528;ODBC&#x6216;JDBC API&#xFF09;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5C3D;&#x7BA1;JSON&#xFF0C;XML&#x548C;CSV&#x7B49;&#x6587;&#x672C;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x975E;&#x5E38;&#x666E;&#x904D;&#xFF0C;&#x4F46;&#x57FA;&#x4E8E;&#x6A21;&#x5F0F;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x7684;&#x9009;&#x62E9;&#x3002;&#x4ED6;&#x4EEC;&#x6709;&#x4E00;&#x4E9B;&#x5F88;&#x597D;&#x7684;&#x5C5E;&#x6027;&#xFF1A;</p>
<ul>
<li>&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x6BD4;&#x5404;&#x79CD;&#x201C;&#x4E8C;&#x8FDB;&#x5236;JSON&#x201D;&#x53D8;&#x4F53;&#x66F4;&#x7D27;&#x51D1;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#x7F16;&#x7801;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#x540D;&#x79F0;&#x3002;</li>
<li>&#x6A21;&#x5F0F;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x6587;&#x6863;&#x5F62;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x6A21;&#x5F0F;&#x662F;&#x89E3;&#x7801;&#x6240;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5B83;&#x662F;&#x6700;&#x65B0;&#x7684;&#xFF08;&#x800C;&#x624B;&#x52A8;&#x7EF4;&#x62A4;&#x7684;&#x6587;&#x6863;&#x53EF;&#x80FD;&#x5F88;&#x5BB9;&#x6613;&#x504F;&#x79BB;&#x73B0;&#x5B9E;&#xFF09;&#x3002;</li>
<li>&#x4FDD;&#x7559;&#x6A21;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x5141;&#x8BB8;&#x60A8;&#x5728;&#x90E8;&#x7F72;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x4E4B;&#x524D;&#x68C0;&#x67E5;&#x6A21;&#x5F0F;&#x66F4;&#x6539;&#x7684;&#x5411;&#x524D;&#x548C;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4ECE;&#x6A21;&#x5F0F;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x80FD;&#x529B;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x8FDB;&#x884C;&#x7C7B;&#x578B;&#x68C0;&#x67E5;&#x3002;</li>
</ul>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x6A21;&#x5F0F;&#x8FDB;&#x5316;&#x5141;&#x8BB8;&#x4E0E;JSON&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x7684;&#x65E0;&#x6A21;&#x5F0F;/&#x6A21;&#x5F0F;&#x8BFB;&#x53D6;&#x76F8;&#x540C;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;39&#x9875;&#x7684;&#x201C;&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x7075;&#x6D3B;&#x6027;&#x201D;&#xFF09;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x548C;&#x66F4;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<h2 id="&#x6570;&#x636E;&#x6D41;&#x7684;&#x7C7B;&#x578B;">&#x6570;&#x636E;&#x6D41;&#x7684;&#x7C7B;&#x578B;</h2>
<p>&#x5728;&#x672C;&#x7AE0;&#x7684;&#x5F00;&#x59CB;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#xFF0C;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x60A8;&#x60F3;&#x8981;&#x5C06;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x4E0D;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x53EA;&#x8981;&#x60A8;&#x60F3;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x6570;&#x636E;&#x6216;&#x5C06;&#x5176;&#x5199;&#x5165;&#x6587;&#x4EF6;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x7F16;&#x7801;&#x4E3A;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x505A;&#x8FD9;&#x4E2A;&#x7684;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x7801;&#x3002;
&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x5411;&#x524D;&#x548C;&#x5411;&#x540E;&#x7684;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x53EF;&#x6F14;&#x5316;&#x6027;&#x6765;&#x8BF4;&#x975E;&#x5E38;&#x91CD;&#x8981;&#xFF08;&#x901A;&#x8FC7;&#x5141;&#x8BB8;&#x60A8;&#x72EC;&#x7ACB;&#x5347;&#x7EA7;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x4E00;&#x6B21;&#x6539;&#x53D8;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF09;&#x3002;&#x517C;&#x5BB9;&#x6027;&#x662F;&#x7F16;&#x7801;&#x6570;&#x636E;&#x7684;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x548C;&#x89E3;&#x7801;&#x5B83;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x79CD;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x62BD;&#x8C61;&#x7684;&#x6982;&#x5FF5; - &#x6570;&#x636E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x4ECE;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x6D41;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x6D41;&#x7A0B;&#x3002;&#x8C01;&#x7F16;&#x7801;&#x6570;&#x636E;&#xFF0C;&#x8C01;&#x89E3;&#x7801;&#xFF1F;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x8BA8;&#x6570;&#x636E;&#x5982;&#x4F55;&#x5728;&#x6D41;&#x7A0B;&#x4E4B;&#x95F4;&#x6D41;&#x52A8;&#x7684;&#x4E00;&#x4E9B;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x901A;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x901A;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6570;&#x636E;&#x6D41;">&#x901A;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6570;&#x636E;&#x6D41;</a>&#x201D;&#xFF09;</li>
<li>&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x8C03;&#x7528;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x6D41;&#xFF1A;REST&#x548C;RPC">&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x4F20;&#x8F93;&#x6570;&#x636E;&#x6D41;&#xFF1A;REST&#x548C;RPC</a>&#x201D;&#xFF09;</li>
<li>&#x901A;&#x8FC7;&#x5F02;&#x6B65;&#x6D88;&#x606F;&#x4F20;&#x9012;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x6D88;&#x606F;&#x4F20;&#x9012;&#x6570;&#x636E;&#x6D41;">&#x6D88;&#x606F;&#x4F20;&#x9012;&#x6570;&#x636E;&#x6D41;</a>&#x201D;&#xFF09;</li>
</ul>
<h3 id="&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;">&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;</h3>
<p>&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8FC7;&#x7A0B;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x53D6;&#x7684;&#x8FC7;&#x7A0B;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#x3002;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BFB;&#x8005;&#x53EA;&#x662F;&#x76F8;&#x540C;&#x8FDB;&#x7A0B;&#x7684;&#x540E;&#x7EED;&#x7248;&#x672C; - &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x5B58;&#x50A8;&#x4E3A;&#x5411;&#x672A;&#x6765;&#x7684;&#x81EA;&#x6211;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#x663E;&#x7136;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x5426;&#x5219;&#x4F60;&#x672A;&#x6765;&#x7684;&#x81EA;&#x5DF1;&#x5C06;&#x65E0;&#x6CD5;&#x89E3;&#x7801;&#x4F60;&#x4EE5;&#x524D;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8FDB;&#x7A0B;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x662F;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x670D;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x51E0;&#x4E2A;&#x76F8;&#x540C;&#x670D;&#x52A1;&#x7684;&#x5B9E;&#x4F8B;&#xFF08;&#x4E3A;&#x4E86;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x6216;&#x5BB9;&#x9519;&#x6027;&#x800C;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#xFF09;&#x3002;&#x65E0;&#x8BBA;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x67D0;&#x4E9B;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x8FD0;&#x884C;&#x8F83;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x6709;&#x4E9B;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x8FD0;&#x884C;&#x8F83;&#x65E7;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x7248;&#x672C;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x90E8;&#x7F72;&#x5728;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E9B;&#x5B9E;&#x4F8B;&#x5DF2;&#x7ECF;&#x66F4;&#x65B0;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x5B9E;&#x4F8B;&#x5C1A;&#x672A;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x503C;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x66F4;&#x65B0;&#x7248;&#x672C;&#x7684;&#x4EE3;&#x7801;&#x5199;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x88AB;&#x4ECD;&#x65E7;&#x8FD0;&#x884C;&#x7684;&#x65E7;&#x7248;&#x672C;&#x7684;&#x4EE3;&#x7801;&#x8BFB;&#x53D6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x5411;&#x524D;&#x517C;&#x5BB9;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x969C;&#x788D;&#x3002;&#x5047;&#x8BBE;&#x60A8;&#x5C06;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x6DFB;&#x52A0;&#x5230;&#x8BB0;&#x5F55;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x8F83;&#x65B0;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x8BE5;&#x65B0;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x3002;&#x968F;&#x540E;&#xFF0C;&#x65E7;&#x7248;&#x672C;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x5C1A;&#x4E0D;&#x77E5;&#x9053;&#x65B0;&#x5B57;&#x6BB5;&#xFF09;&#x5C06;&#x8BFB;&#x53D6;&#x8BB0;&#x5F55;&#xFF0C;&#x66F4;&#x65B0;&#x8BB0;&#x5F55;&#x5E76;&#x5C06;&#x5176;&#x5199;&#x56DE;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7406;&#x60F3;&#x7684;&#x884C;&#x4E3A;&#x901A;&#x5E38;&#x662F;&#x65E7;&#x4EE3;&#x7801;&#x4FDD;&#x6301;&#x65B0;&#x7684;&#x9886;&#x57DF;&#x5B8C;&#x6574;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4E0D;&#x80FD;&#x88AB;&#x89E3;&#x91CA;&#x3002;</p>
<p>&#x524D;&#x9762;&#x8BA8;&#x8BBA;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x652F;&#x6301;&#x672A;&#x77E5;&#x57DF;&#x7684;&#x4FDD;&#x5B58;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C42;&#x9762;&#x4FDD;&#x6301;&#x8C28;&#x614E;&#xFF0C;&#x5982;&#x56FE;4-7&#x6240;&#x793A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x503C;&#x89E3;&#x7801;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6A21;&#x578B;&#x5BF9;&#x8C61;&#xFF0C;&#x7A0D;&#x540E;&#x91CD;&#x65B0;&#x7F16;&#x7801;&#x8FD9;&#x4E9B;&#x6A21;&#x578B;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x672A;&#x77E5;&#x5B57;&#x6BB5;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x8BE5;&#x7FFB;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E22;&#x5931;&#x3002;</p>
<p>&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x610F;&#x8BC6;&#x5230;&#x5B83;&#x3002;</p>
<p><img src="img/fig4-7.png" alt=""></p>
<p><strong>&#x56FE;4-7 &#x5F53;&#x8F83;&#x65E7;&#x7248;&#x672C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x66F4;&#x65B0;&#x4EE5;&#x524D;&#x7531;&#x8F83;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5C0F;&#x5FC3;&#xFF0C;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x3002;</strong></p>
<h4 id="&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x5199;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x503C;">&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x5199;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x503C;</h4>
<p>&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x5141;&#x8BB8;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x66F4;&#x65B0;&#x4EFB;&#x4F55;&#x503C;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E9B;&#x503C;&#x662F;&#x4E94;&#x6BEB;&#x79D2;&#x524D;&#x5199;&#x7684;&#xFF0C;&#x800C;&#x4E00;&#x4E9B;&#x503C;&#x662F;&#x4E94;&#x5E74;&#x524D;&#x5199;&#x7684;&#x3002;</p>
<p>&#x5728;&#x90E8;&#x7F72;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B0;&#x7248;&#x672C;&#x65F6;&#xFF0C;&#x4E5F;&#x8BB8;&#x7528;&#x4E0D;&#x4E86;&#x51E0;&#x5206;&#x949F;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x7684;&#x65E7;&#x7248;&#x672C;&#x66FF;&#x6362;&#x4E3A;&#x65B0;&#x7248;&#x672C;&#xFF08;&#x81F3;&#x5C11;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF09;&#x3002;&#x4F46;&#x6570;&#x636E;&#x5E93;&#x5185;&#x5BB9;&#x5E76;&#x975E;&#x5982;&#x6B64;&#xFF1A;&#x5BF9;&#x4E8E;&#x4E94;&#x5E74;&#x524D;&#x7684;&#x6570;&#x636E;&#x6765;&#x8BF4;&#xFF0C;&#x9664;&#x975E;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x663E;&#x5F0F;&#x91CD;&#x5199;&#xFF0C;&#x5426;&#x5219;&#x5B83;&#x4ECD;&#x7136;&#x4F1A;&#x4EE5;&#x539F;&#x59CB;&#x7F16;&#x7801;&#x5F62;&#x5F0F;&#x5B58;&#x5728;&#x3002;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x6709;&#x65F6;&#x88AB;&#x6982;&#x62EC;&#x4E3A;&#xFF1A;&#x6570;&#x636E;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x8D85;&#x51FA;&#x4EE3;&#x7801;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</p>
<p>&#x5C06;&#x6570;&#x636E;&#x91CD;&#x5199;&#xFF08;&#x8FC1;&#x79FB;&#xFF09;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6A21;&#x5F0F;&#x5F53;&#x7136;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x6570;&#x636E;&#x96C6;&#x4E0A;&#x6267;&#x884C;&#x662F;&#x4E00;&#x4E2A;&#x6602;&#x8D35;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x5982;&#x679C;&#x53EF;&#x80FD;&#x7684;&#x8BDD;&#x5C31;&#x907F;&#x514D;&#x5B83;&#x3002;&#x5927;&#x591A;&#x6570;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x5141;&#x8BB8;&#x7B80;&#x5355;&#x7684;&#x6A21;&#x5F0F;&#x66F4;&#x6539;&#xFF0C;&#x4F8B;&#x5982;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x503C;&#x4E3A;&#x7A7A;&#x7684;&#x65B0;&#x5217;&#xFF0C;&#x800C;&#x4E0D;&#x91CD;&#x5199;&#x73B0;&#x6709;&#x6570;&#x636E;<sup><a href="#fn_v" id="reffn_v">v</a></sup>&#x8BFB;&#x53D6;&#x65E7;&#x884C;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x586B;&#x5145;&#x7F16;&#x7801;&#x6570;&#x636E;&#x4E2D;&#x7F3A;&#x5C11;&#x7684;&#x4EFB;&#x4F55;&#x5217;&#x7684;&#x7A7A;&#x503C;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x3002; LinkedIn&#x7684;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;Espresso&#x4F7F;&#x7528;Avro&#x5B58;&#x50A8;&#xFF0C;&#x5141;&#x8BB8;&#x5B83;&#x4F7F;&#x7528;Avro&#x7684;&#x6A21;&#x5F0F;&#x6F14;&#x53D8;&#x89C4;&#x5219;&#x3010;23&#x3011;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x67B6;&#x6784;&#x6F14;&#x53D8;&#x5141;&#x8BB8;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x662F;&#x7528;&#x5355;&#x4E2A;&#x6A21;&#x5F0F;&#x7F16;&#x7801;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x5E95;&#x5C42;&#x5B58;&#x50A8;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x7528;&#x6A21;&#x5F0F;&#x7684;&#x5404;&#x79CD;&#x5386;&#x53F2;&#x7248;&#x672C;&#x7F16;&#x7801;&#x7684;&#x8BB0;&#x5F55;&#x3002;</p>
<blockquote id="fn_v">
<sup>v</sup>. &#x9664;&#x4E86;MySQL&#xFF0C;&#x5373;&#x4F7F;&#x5E76;&#x975E;&#x771F;&#x7684;&#x5FC5;&#x8981;&#xFF0C;&#x5B83;&#x4E5F;&#x7ECF;&#x5E38;&#x4F1A;&#x91CD;&#x5199;&#x6574;&#x4E2A;&#x8868;&#xFF0C;&#x6B63;&#x5982;&#x201C;<a href="ch3.html#&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x7075;&#x6D3B;&#x6027;">&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x67B6;&#x6784;&#x7075;&#x6D3B;&#x6027;</a>&#x201D;&#x4E2D;&#x6240;&#x63D0;&#x5230;&#x7684;&#x3002;<a href="#reffn_v" title="Jump back to footnote [v] in the text."> &#x21A9;</a>
</blockquote>
<h4 id="&#x5F52;&#x6863;&#x5B58;&#x50A8;">&#x5F52;&#x6863;&#x5B58;&#x50A8;</h4>
<p>&#x4E5F;&#x8BB8;&#x60A8;&#x4E0D;&#x65F6;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5FEB;&#x7167;&#xFF0C;&#x4F8B;&#x5982;&#x5907;&#x4EFD;&#x6216;&#x52A0;&#x8F7D;&#x5230;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x6570;&#x636E;&#x4ED3;&#x5E93;">&#x6570;&#x636E;&#x4ED3;&#x5E93;</a>&#x201D;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5373;&#x4F7F;&#x6E90;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x539F;&#x59CB;&#x7F16;&#x7801;&#x5305;&#x542B;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x65F6;&#x4EE3;&#x7684;&#x6A21;&#x5F0F;&#x7248;&#x672C;&#x7684;&#x6DF7;&#x5408;&#xFF0C;&#x6570;&#x636E;&#x8F6C;&#x50A8;&#x901A;&#x5E38;&#x4E5F;&#x5C06;&#x4F7F;&#x7528;&#x6700;&#x65B0;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;&#x65E2;&#x7136;&#x4F60;&#x6B63;&#x5728;&#x590D;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x4E00;&#x76F4;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x526F;&#x672C;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x6570;&#x636E;&#x8F6C;&#x50A8;&#x662F;&#x4E00;&#x6B21;&#x5199;&#x5165;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4EE5;&#x540E;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#xFF0C;&#x6240;&#x4EE5;Avro&#x5BF9;&#x8C61;&#x5BB9;&#x5668;&#x6587;&#x4EF6;&#x7B49;&#x683C;&#x5F0F;&#x975E;&#x5E38;&#x9002;&#x5408;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x6570;&#x636E;&#x7F16;&#x7801;&#x4E3A;&#x9762;&#x5411;&#x5206;&#x6790;&#x7684;&#x5217;&#x5F0F;&#x683C;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;Parquet&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;97&#x9875;&#x7684;&#x201C;<a href="ch3.html#&#x5217;&#x538B;&#x7F29;">&#x5217;&#x538B;&#x7F29;</a>&#x201D;&#xFF09;&#x3002;</p>
<p>&#x5728;<a href="ch10.html">&#x7B2C;10&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x5728;&#x6863;&#x6848;&#x5B58;&#x50A8;&#x4E2D;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x3002;</p>
<h3 id="&#x670D;&#x52A1;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF1A;rest&#x4E0E;rpc">&#x670D;&#x52A1;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF1A;REST&#x4E0E;RPC</h3>
<p>&#x5F53;&#x60A8;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x7684;&#x8FDB;&#x7A0B;&#x65F6;&#xFF0C;&#x5B89;&#x6392;&#x8BE5;&#x901A;&#x4FE1;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x51E0;&#x79CD;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5B89;&#x6392;&#x662F;&#x6709;&#x4E24;&#x4E2A;&#x89D2;&#x8272;&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x3002;&#x670D;&#x52A1;&#x5668;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x516C;&#x5F00;API&#xFF0C;&#x5E76;&#x4E14;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x4EE5;&#x5411;&#x8BE5;API&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x3002;&#x670D;&#x52A1;&#x5668;&#x516C;&#x5F00;&#x7684;API&#x88AB;&#x79F0;&#x4E3A;&#x670D;&#x52A1;&#x3002;</p>
<p>Web&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#xFF1A;&#x5BA2;&#x6237;&#xFF08;Web&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#x5411;Web&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#xFF0C;&#x4F7F;GET&#x8BF7;&#x6C42;&#x4E0B;&#x8F7D;HTML&#xFF0C;CSS&#xFF0C;JavaScript&#xFF0C;&#x56FE;&#x50CF;&#x7B49;&#xFF0C;&#x5E76;&#x5411;POST&#x8BF7;&#x6C42;&#x63D0;&#x4EA4;&#x6570;&#x636E;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002; API&#x5305;&#x542B;&#x4E00;&#x7EC4;&#x6807;&#x51C6;&#x7684;&#x534F;&#x8BAE;&#x548C;&#x6570;&#x636E;&#x683C;&#x5F0F;&#xFF08;HTTP&#xFF0C;URL&#xFF0C;SSL/TLS&#xFF0C;HTML&#x7B49;&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#x548C;&#x7F51;&#x7AD9;&#x4F5C;&#x8005;&#x5927;&#x591A;&#x540C;&#x610F;&#x8FD9;&#x4E9B;&#x6807;&#x51C6;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE;&#x4EFB;&#x4F55;&#x7F51;&#x7AD9;&#xFF08;&#x81F3;&#x5C11;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#xFF01;&#xFF09;&#x3002;</p>
<p>Web&#x6D4F;&#x89C8;&#x5668;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7C7B;&#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x6216;&#x684C;&#x9762;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x672C;&#x5730;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E5F;&#x53EF;&#x4EE5;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x5728;Web&#x6D4F;&#x89C8;&#x5668;&#x5185;&#x8FD0;&#x884C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;JavaScript&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;XMLHttpRequest&#x6210;&#x4E3A;HTTP&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x8BE5;&#x6280;&#x672F;&#x88AB;&#x79F0;&#x4E3A;Ajax &#x3010;30&#x3011;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x7684;&#x54CD;&#x5E94;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x7528;&#x4E8E;&#x663E;&#x793A;&#x7ED9;&#x4EBA;&#x7684;HTML&#xFF0C;&#x800C;&#x662F;&#x7528;&#x4E8E;&#x4FBF;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#xFF08;&#x5982;JSON&#xFF09;&#x8FDB;&#x4E00;&#x6B65;&#x5904;&#x7406;&#x7684;&#x7F16;&#x7801;&#x6570;&#x636E;&#x3002;&#x5C3D;&#x7BA1;HTTP&#x53EF;&#x80FD;&#x88AB;&#x7528;&#x4F5C;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF0C;&#x4F46;&#x9876;&#x5C42;&#x5B9E;&#x73B0;&#x7684;API&#x662F;&#x7279;&#x5B9A;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x5C31;&#x8BE5;API&#x7684;&#x7EC6;&#x8282;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x672C;&#x8EAB;&#x53EF;&#x4EE5;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5178;&#x578B;&#x7684;Web&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x5145;&#x5F53;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x5C06;&#x5927;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6309;&#x7167;&#x529F;&#x80FD;&#x533A;&#x57DF;&#x5206;&#x89E3;&#x4E3A;&#x8F83;&#x5C0F;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x8FD9;&#x6837;&#x5F53;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x9700;&#x8981;&#x6765;&#x81EA;&#x53E6;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#x6216;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x79CD;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B9;&#x5F0F;&#x4F20;&#x7EDF;&#x4E0A;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF08;service-oriented architecture&#xFF0C;SOA&#xFF09;</strong>&#xFF0C;&#x6700;&#x8FD1;&#x88AB;&#x6539;&#x8FDB;&#x548C;&#x66F4;&#x540D;&#x4E3A;<strong>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;</strong>&#x3010;31,32&#x3011;&#x3002;</p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#xFF0C;&#x670D;&#x52A1;&#x7C7B;&#x4F3C;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#xFF1A;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x5141;&#x8BB8;&#x5BA2;&#x6237;&#x7AEF;&#x63D0;&#x4EA4;&#x548C;&#x67E5;&#x8BE2;&#x6570;&#x636E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x867D;&#x7136;&#x6570;&#x636E;&#x5E93;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x5728;<a href="ch2.html">&#x7B2C;2&#x7AE0;</a>&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x4EFB;&#x610F;&#x67E5;&#x8BE2;&#xFF0C;&#x4F46;&#x662F;&#x670D;&#x52A1;&#x516C;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;API&#xFF0C;&#x5B83;&#x53EA;&#x5141;&#x8BB8;&#x7531;&#x670D;&#x52A1;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF08;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#xFF09;&#x9884;&#x5B9A;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3010;33&#x3011;&#x3002;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x5C01;&#x88C5;&#xFF1A;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x5BF9;&#x5BA2;&#x6237;&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;&#x548C;&#x4E0D;&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;&#x65BD;&#x52A0;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x9650;&#x5236;&#x3002;</p>
<p>&#x9762;&#x5411;&#x670D;&#x52A1;/&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x662F;&#x901A;&#x8FC7;&#x4F7F;&#x670D;&#x52A1;&#x72EC;&#x7ACB;&#x90E8;&#x7F72;&#x548C;&#x6F14;&#x5316;&#x6765;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x66F4;&#x6613;&#x4E8E;&#x66F4;&#x6539;&#x548C;&#x7EF4;&#x62A4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5E94;&#x8BE5;&#x7531;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x62E5;&#x6709;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x56E2;&#x961F;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x7ECF;&#x5E38;&#x53D1;&#x5E03;&#x65B0;&#x7248;&#x672C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x4E0E;&#x5176;&#x4ED6;&#x56E2;&#x961F;&#x534F;&#x8C03;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x671F;&#x671B;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x65E7;&#x7248;&#x672C;&#x548C;&#x65B0;&#x7248;&#x672C;&#x540C;&#x65F6;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7F16;&#x7801;&#x5FC5;&#x987B;&#x5728;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x670D;&#x52A1;API&#x4E4B;&#x95F4;&#x517C;&#x5BB9;&#x2014;&#x2014;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x672C;&#x7AE0;&#x4E00;&#x76F4;&#x5728;&#x8C08;&#x8BBA;&#x3002;</p>
<h4 id="web&#x670D;&#x52A1;">Web&#x670D;&#x52A1;</h4>
<p><strong>&#x5F53;&#x670D;&#x52A1;&#x4F7F;&#x7528;HTTP&#x4F5C;&#x4E3A;&#x5E95;&#x5C42;&#x901A;&#x4FE1;&#x534F;&#x8BAE;&#x65F6;&#xFF0C;&#x53EF;&#x79F0;&#x4E4B;&#x4E3A;Web&#x670D;&#x52A1;</strong>&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x5C0F;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;Web&#x670D;&#x52A1;&#x4E0D;&#x4EC5;&#x5728;Web&#x4E0A;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x4F7F;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ol>
<li>&#x8FD0;&#x884C;&#x5728;&#x7528;&#x6237;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x672C;&#x5730;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6216;&#x4F7F;&#x7528;Ajax&#x7684;JavaScript web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF09;&#x901A;&#x8FC7;HTTP&#x5411;&#x670D;&#x52A1;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x516C;&#x5171;&#x4E92;&#x8054;&#x7F51;&#x8FDB;&#x884C;&#x3002;</li>
<li>&#x4E00;&#x79CD;&#x670D;&#x52A1;&#x5411;&#x540C;&#x4E00;&#x7EC4;&#x7EC7;&#x62E5;&#x6709;&#x7684;&#x53E6;&#x4E00;&#x9879;&#x670D;&#x52A1;&#x63D0;&#x51FA;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x901A;&#x5E38;&#x4F4D;&#x4E8E;&#x540C;&#x4E00;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#xFF0C;&#x4F5C;&#x4E3A;&#x9762;&#x5411;&#x670D;&#x52A1;/&#x5FAE;&#x578B;&#x67B6;&#x6784;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; &#xFF08;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x7528;&#x4F8B;&#x7684;&#x8F6F;&#x4EF6;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A; <strong>&#x4E2D;&#x95F4;&#x4EF6;&#xFF08;middleware&#xFF09;</strong> &#xFF09;</li>
<li>&#x4E00;&#x79CD;&#x670D;&#x52A1;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x5411;&#x4E0D;&#x540C;&#x7EC4;&#x7EC7;&#x6240;&#x62E5;&#x6709;&#x7684;&#x670D;&#x52A1;&#x63D0;&#x51FA;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7EC4;&#x7EC7;&#x540E;&#x7AEF;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x3002;&#x6B64;&#x7C7B;&#x522B;&#x5305;&#x62EC;&#x7531;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#xFF08;&#x5982;&#x4FE1;&#x7528;&#x5361;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#xFF09;&#x63D0;&#x4F9B;&#x7684;&#x516C;&#x5171;API&#xFF0C;&#x6216;&#x7528;&#x4E8E;&#x5171;&#x4EAB;&#x8BBF;&#x95EE;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;OAuth&#x3002;</li>
</ol>
<p>&#x6709;&#x4E24;&#x79CD;&#x6D41;&#x884C;&#x7684;Web&#x670D;&#x52A1;&#x65B9;&#x6CD5;&#xFF1A;REST&#x548C;SOAP&#x3002;&#x4ED6;&#x4EEC;&#x5728;&#x54F2;&#x5B66;&#x65B9;&#x9762;&#x51E0;&#x4E4E;&#x662F;&#x622A;&#x7136;&#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x5F80;&#x5F80;&#x662F;&#x5404;&#x81EA;&#x652F;&#x6301;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x6FC0;&#x70C8;&#x8FA9;&#x8BBA;&#xFF08;&#x5373;&#x4F7F;&#x5728;&#x6BCF;&#x4E2A;&#x9635;&#x8425;&#x5185;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x4E89;&#x8BBA;&#x3002; &#x4F8B;&#x5982;&#xFF0C;<strong>HATEOAS&#xFF08;&#x8D85;&#x5A92;&#x4F53;&#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x72B6;&#x6001;&#x7684;&#x5F15;&#x64CE;&#xFF09;</strong> &#x7ECF;&#x5E38;&#x5F15;&#x53D1;&#x8BA8;&#x8BBA;&#x3010;35&#x3011;&#x3002;&#xFF09;</p>
<p>REST&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x534F;&#x8BAE;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;HTTP&#x539F;&#x5219;&#x7684;&#x8BBE;&#x8BA1;&#x54F2;&#x5B66;&#x3010;34,35&#x3011;&#x3002;&#x5B83;&#x5F3A;&#x8C03;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#xFF0C;&#x4F7F;&#x7528;URL&#x6765;&#x6807;&#x8BC6;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;HTTP&#x529F;&#x80FD;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#x63A7;&#x5236;&#xFF0C;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x548C;&#x5185;&#x5BB9;&#x7C7B;&#x578B;&#x534F;&#x5546;&#x3002;&#x4E0E;SOAP&#x76F8;&#x6BD4;&#xFF0C;REST&#x5DF2;&#x7ECF;&#x8D8A;&#x6765;&#x8D8A;&#x53D7;&#x6B22;&#x8FCE;&#xFF0C;&#x81F3;&#x5C11;&#x5728;&#x8DE8;&#x7EC4;&#x7EC7;&#x670D;&#x52A1;&#x96C6;&#x6210;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#x3010;36&#x3011;&#xFF0C;&#x5E76;&#x7ECF;&#x5E38;&#x4E0E;&#x5FAE;&#x670D;&#x52A1;&#x76F8;&#x5173;[31]&#x3002;&#x6839;&#x636E;REST&#x539F;&#x5219;&#x8BBE;&#x8BA1;&#x7684;API&#x79F0;&#x4E3A;RESTful&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;SOAP&#x662F;&#x7528;&#x4E8E;&#x5236;&#x4F5C;&#x7F51;&#x7EDC;API&#x8BF7;&#x6C42;&#x7684;&#x57FA;&#x4E8E;XML&#x7684;&#x534F;&#x8BAE;&#xFF08; &#x5C3D;&#x7BA1;&#x9996;&#x5B57;&#x6BCD;&#x7F29;&#x5199;&#x8BCD;&#x76F8;&#x4F3C;&#xFF0C;SOAP&#x5E76;&#x4E0D;&#x662F;SOA&#x7684;&#x8981;&#x6C42;&#x3002; SOAP&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x800C;SOA&#x662F;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x822C;&#x65B9;&#x6CD5;&#x3002;&#xFF09;&#x3002;&#x867D;&#x7136;&#x5B83;&#x6700;&#x5E38;&#x7528;&#x4E8E;HTTP&#xFF0C;&#x4F46;&#x5176;&#x76EE;&#x7684;&#x662F;&#x72EC;&#x7ACB;&#x4E8E;HTTP&#xFF0C;&#x5E76;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x5927;&#x591A;&#x6570;HTTP&#x529F;&#x80FD;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x5E26;&#x6709;&#x5E9E;&#x5927;&#x800C;&#x590D;&#x6742;&#x7684;&#x591A;&#x79CD;&#x76F8;&#x5173;&#x6807;&#x51C6;&#xFF08;Web&#x670D;&#x52A1;&#x6846;&#x67B6;&#xFF0C;&#x79F0;&#x4E3A;<code>WS-*</code>&#xFF09;&#xFF0C;&#x5B83;&#x4EEC;&#x589E;&#x52A0;&#x4E86;&#x5404;&#x79CD;&#x529F;&#x80FD;&#x3010;37&#x3011;&#x3002;</p>
<p>SOAP Web&#x670D;&#x52A1;&#x7684;API&#x4F7F;&#x7528;&#x79F0;&#x4E3A;Web&#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x8BED;&#x8A00;&#xFF08;WSDL&#xFF09;&#x7684;&#x57FA;&#x4E8E;XML&#x7684;&#x8BED;&#x8A00;&#x6765;&#x63CF;&#x8FF0;&#x3002; WSDL&#x652F;&#x6301;&#x4EE3;&#x7801;&#x751F;&#x6210;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x7C7B;&#x548C;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF08;&#x7F16;&#x7801;&#x4E3A;XML&#x6D88;&#x606F;&#x5E76;&#x7531;&#x6846;&#x67B6;&#x518D;&#x6B21;&#x89E3;&#x7801;&#xFF09;&#x8BBF;&#x95EE;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x5728;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x5728;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x5F88;&#x5C11;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x4EE3;&#x7801;&#x751F;&#x6210;&#x548C;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x5316;&#x8BED;&#x8A00;">&#x4EE3;&#x7801;&#x751F;&#x6210;&#x548C;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x5316;&#x8BED;&#x8A00;</a>&#x201D;&#xFF09;&#x3002;</p>
<p>&#x7531;&#x4E8E;WSDL&#x7684;&#x8BBE;&#x8BA1;&#x4E0D;&#x662F;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x7531;&#x4E8E;SOAP&#x6D88;&#x606F;&#x901A;&#x5E38;&#x662F;&#x624B;&#x52A8;&#x6784;&#x5EFA;&#x7684;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF0C;&#x6240;&#x4EE5;SOAP&#x7684;&#x7528;&#x6237;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x4F9D;&#x8D56;&#x4E8E;&#x5DE5;&#x5177;&#x652F;&#x6301;&#xFF0C;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x548C;IDE&#x3010;38&#x3011;&#x3002;&#x5BF9;&#x4E8E;SOAP&#x4F9B;&#x5E94;&#x5546;&#x4E0D;&#x652F;&#x6301;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x4E0E;SOAP&#x670D;&#x52A1;&#x7684;&#x96C6;&#x6210;&#x662F;&#x56F0;&#x96BE;&#x7684;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;SOAP&#x53CA;&#x5176;&#x5404;&#x79CD;&#x6269;&#x5C55;&#x8868;&#x9762;&#x4E0A;&#x662F;&#x6807;&#x51C6;&#x5316;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x5382;&#x5546;&#x7684;&#x5B9E;&#x73B0;&#x4E4B;&#x95F4;&#x7684;&#x4E92;&#x64CD;&#x4F5C;&#x6027;&#x5F80;&#x5F80;&#x4F1A;&#x9020;&#x6210;&#x95EE;&#x9898;&#x3010;39&#x3011;&#x3002;&#x7531;&#x4E8E;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x5C3D;&#x7BA1;&#x8BB8;&#x591A;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x4ECD;&#x7136;&#x4F7F;&#x7528;SOAP&#xFF0C;&#x4F46;&#x5728;&#x5927;&#x591A;&#x6570;&#x5C0F;&#x516C;&#x53F8;&#x4E2D;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x53D7;&#x5230;&#x9752;&#x7750;&#x3002;</p>
<p>REST&#x98CE;&#x683C;&#x7684;API&#x503E;&#x5411;&#x4E8E;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x5E38;&#x6D89;&#x53CA;&#x8F83;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x548C;&#x81EA;&#x52A8;&#x5316;&#x5DE5;&#x5177;&#x3002;&#x5B9A;&#x4E49;&#x683C;&#x5F0F;&#xFF08;&#x5982;OpenAPI&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;Swagger &#x3010;40&#x3011;&#xFF09;&#x53EF;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;RESTful API&#x5E76;&#x751F;&#x6210;&#x6587;&#x6863;&#x3002;</p>
<h4 id="&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF08;rpc&#xFF09;&#x7684;&#x95EE;&#x9898;">&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF08;RPC&#xFF09;&#x7684;&#x95EE;&#x9898;</h4>
<p>Web&#x670D;&#x52A1;&#x4EC5;&#x4EC5;&#x662F;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;API&#x8BF7;&#x6C42;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x6280;&#x672F;&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x5176;&#x4E2D;&#x8BB8;&#x591A;&#x6280;&#x672F;&#x53D7;&#x5230;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7092;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x5B58;&#x5728;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#x3002; Enterprise JavaBeans&#xFF08;EJB&#xFF09;&#x548C;Java&#x7684;<strong>&#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF08;RMI&#xFF09;</strong> &#x4EC5;&#x9650;&#x4E8E;Java&#x3002;<strong>&#x5206;&#x5E03;&#x5F0F;&#x7EC4;&#x4EF6;&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#xFF08;DCOM&#xFF09;</strong> &#x4EC5;&#x9650;&#x4E8E;Microsoft&#x5E73;&#x53F0;&#x3002;<strong>&#x516C;&#x5171;&#x5BF9;&#x8C61;&#x8BF7;&#x6C42;&#x4EE3;&#x7406;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF08;CORBA&#xFF09;</strong> &#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF0C;&#x4E0D;&#x63D0;&#x4F9B;&#x524D;&#x5411;&#x6216;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x6027;&#x3010;41&#x3011;&#x3002;</p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x57FA;&#x4E8E; <strong>&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF08;RPC&#xFF09;</strong> &#x7684;&#x601D;&#x60F3;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x81EA;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#x4E00;&#x76F4;&#x5B58;&#x5728;&#x3010;42&#x3011;&#x3002; RPC&#x6A21;&#x578B;&#x8BD5;&#x56FE;&#x5411;&#x8FDC;&#x7A0B;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x4E0E;&#x5728;&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x6216;&#x65B9;&#x6CD5;&#x76F8;&#x540C;&#xFF08;&#x8FD9;&#x79CD;&#x62BD;&#x8C61;&#x79F0;&#x4E3A;&#x4F4D;&#x7F6E;&#x900F;&#x660E;&#xFF09;&#x3002;&#x5C3D;&#x7BA1;RPC&#x8D77;&#x521D;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6839;&#x672C;&#x4E0A;&#x662F;&#x6709;&#x7F3A;&#x9677;&#x7684;&#x3010;43,44&#x3011;&#x3002;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x4E0E;&#x672C;&#x5730;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#xFF1A;</p>
<ul>
<li>&#x672C;&#x5730;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x662F;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6210;&#x529F;&#x6216;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x4EC5;&#x53D6;&#x51B3;&#x4E8E;&#x53D7;&#x60A8;&#x63A7;&#x5236;&#x7684;&#x53C2;&#x6570;&#x3002;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x662F;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#xFF1A;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x6216;&#x8005;&#x8FDC;&#x7A0B;&#x8BA1;&#x7B97;&#x673A;&#x53EF;&#x80FD;&#x5F88;&#x6162;&#x6216;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5B8C;&#x5168;&#x4E0D;&#x5728;&#x60A8;&#x7684;&#x63A7;&#x5236;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#x3002;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x662F;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5FC5;&#x987B;&#x9884;&#x6D4B;&#x4ED6;&#x4EEC;&#xFF0C;&#x4F8B;&#x5982;&#x901A;&#x8FC7;&#x91CD;&#x8BD5;&#x5931;&#x8D25;&#x7684;&#x8BF7;&#x6C42;&#x3002;</li>
<li>&#x672C;&#x5730;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8981;&#x4E48;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#xFF0C;&#x8981;&#x4E48;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x6216;&#x8005;&#x6C38;&#x8FDC;&#x4E0D;&#x8FD4;&#x56DE;&#xFF08;&#x56E0;&#x4E3A;&#x8FDB;&#x5165;&#x65E0;&#x9650;&#x5FAA;&#x73AF;&#x6216;&#x8FDB;&#x7A0B;&#x5D29;&#x6E83;&#xFF09;&#x3002;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x7ED3;&#x679C;&#xFF1A;&#x7531;&#x4E8E;&#x8D85;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x8FD4;&#x56DE;&#x6CA1;&#x6709;&#x7ED3;&#x679C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x6765;&#x81EA;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x4F60;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x8BF7;&#x6C42;&#x662F;&#x5426;&#x901A;&#x8FC7;&#x3002; &#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch8.html">&#x7B2C;8&#x7AE0;</a>&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x60A8;&#x91CD;&#x8BD5;&#x5931;&#x8D25;&#x7684;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x8BF7;&#x6C42;&#x5B9E;&#x9645;&#x4E0A;&#x6B63;&#x5728;&#x901A;&#x8FC7;&#xFF0C;&#x53EA;&#x6709;&#x54CD;&#x5E94;&#x4E22;&#x5931;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x91CD;&#x8BD5;&#x5C06;&#x5BFC;&#x81F4;&#x8BE5;&#x64CD;&#x4F5C;&#x88AB;&#x6267;&#x884C;&#x591A;&#x6B21;&#xFF0C;&#x9664;&#x975E;&#x60A8;&#x5728;&#x534F;&#x8BAE;&#x4E2D;&#x5F15;&#x5165;&#x9664;&#x91CD;&#xFF08; <strong>&#x5E42;&#x7B49;&#xFF08;idempotence&#xFF09;</strong>&#xFF09;&#x673A;&#x5236;&#x3002;&#x672C;&#x5730;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002; &#xFF08;&#x5728;<a href="ch11.html">&#x7B2C;&#x5341;&#x4E00;&#x7AE0;</a>&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x5E42;&#x7B49;&#x6027;&#xFF09;</li>
<li>&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x672C;&#x5730;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5927;&#x81F4;&#x76F8;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x6267;&#x884C;&#x3002;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x6BD4;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8981;&#x6162;&#x5F97;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x5176;&#x5EF6;&#x8FDF;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x53EF;&#x53D8;&#x7684;&#xFF1A;&#x5728;&#x4E0D;&#x5230;&#x4E00;&#x6BEB;&#x79D2;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x6216;&#x8005;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x8D85;&#x8F7D;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x51E0;&#x79D2;&#x949F;&#x7684;&#x65F6;&#x95F4;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x7684;&#x4E1C;&#x897F;&#x3002;</li>
<li>&#x8C03;&#x7528;&#x672C;&#x5730;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x5730;&#x5C06;&#x5F15;&#x7528;&#xFF08;&#x6307;&#x9488;&#xFF09;&#x4F20;&#x9012;&#x7ED9;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5F53;&#x4F60;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x90FD;&#x9700;&#x8981;&#x88AB;&#x7F16;&#x7801;&#x6210;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x5B57;&#x8282;&#x3002;&#x6CA1;&#x5173;&#x7CFB;&#xFF0C;&#x5982;&#x679C;&#x53C2;&#x6570;&#x662F;&#x50CF;&#x6570;&#x5B57;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x8FD9;&#x6837;&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x8F83;&#x5927;&#x7684;&#x5BF9;&#x8C61;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<p>&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#xFF0C;&#x6240;&#x4EE5;RPC&#x6846;&#x67B6;&#x5FC5;&#x987B;&#x5C06;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4ECE;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x7FFB;&#x8BD1;&#x6210;&#x53E6;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x6345;&#x51FA;&#x5927;&#x7BD3;&#x5B50;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x8BED;&#x8A00;&#x90FD;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7C7B;&#x578B; &#x2014;&#x2014; &#x4F8B;&#x5982;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;JavaScript&#x7684;&#x6570;&#x5B57;&#x5927;&#x4E8E;$2^{53}$&#x7684;&#x95EE;&#x9898;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#JSON&#xFF0C;XML&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x53D8;&#x4F53;">JSON&#xFF0C;XML&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x53D8;&#x4F53;</a>&#x201D;&#xFF09;&#x3002;&#x7528;&#x5355;&#x4E00;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x5355;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x6B64;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x610F;&#x5473;&#x7740;&#x5C1D;&#x8BD5;&#x4F7F;&#x8FDC;&#x7A0B;&#x670D;&#x52A1;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x672C;&#x5730;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6839;&#x672C;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#x3002; REST&#x7684;&#x90E8;&#x5206;&#x5438;&#x5F15;&#x529B;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x8BD5;&#x56FE;&#x9690;&#x85CF;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x4E8B;&#x5B9E;&#xFF08;&#x5C3D;&#x7BA1;&#x8FD9;&#x4F3C;&#x4E4E;&#x5E76;&#x6CA1;&#x6709;&#x963B;&#x6B62;&#x4EBA;&#x4EEC;&#x5728;REST&#x4E4B;&#x4E0A;&#x6784;&#x5EFA;RPC&#x5E93;&#xFF09;&#x3002;</p>
<h4 id="rpc&#x7684;&#x5F53;&#x524D;&#x65B9;&#x5411;">RPC&#x7684;&#x5F53;&#x524D;&#x65B9;&#x5411;</h4>
<p>&#x5C3D;&#x7BA1;&#x6709;&#x8FD9;&#x6837;&#x90A3;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;RPC&#x4E0D;&#x4F1A;&#x6D88;&#x5931;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x63D0;&#x5230;&#x7684;&#x6240;&#x6709;&#x7F16;&#x7801;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6784;&#x5EFA;&#x4E86;&#x5404;&#x79CD;RPC&#x6846;&#x67B6;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;Thrift&#x548C;Avro&#x5E26;&#x6709;RPC&#x652F;&#x6301;&#xFF0C;gRPC&#x662F;&#x4F7F;&#x7528;Protocol Buffers&#x7684;RPC&#x5B9E;&#x73B0;&#xFF0C;Finagle&#x4E5F;&#x4F7F;&#x7528;Thrift&#xFF0C;Rest.li&#x4F7F;&#x7528;JSON over HTTP&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B0;&#x4E00;&#x4EE3;&#x7684;RPC&#x6846;&#x67B6;&#x66F4;&#x52A0;&#x660E;&#x786E;&#x7684;&#x662F;&#xFF0C;&#x8FDC;&#x7A0B;&#x8BF7;&#x6C42;&#x4E0E;&#x672C;&#x5730;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E0D;&#x540C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Finagle&#x548C;Rest.li &#x4F7F;&#x7528;futures&#xFF08;promises&#xFF09;&#x6765;&#x5C01;&#x88C5;&#x53EF;&#x80FD;&#x5931;&#x8D25;&#x7684;&#x5F02;&#x6B65;&#x64CD;&#x4F5C;&#x3002;<code>Futures</code>&#x8FD8;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x9700;&#x8981;&#x5E76;&#x884C;&#x53D1;&#x51FA;&#x591A;&#x9879;&#x670D;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x7ED3;&#x679C;&#x5408;&#x5E76;&#x3010;45&#x3011;&#x3002; gRPC&#x652F;&#x6301;&#x6D41;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x8C03;&#x7528;&#x4E0D;&#x4EC5;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x548C;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x3010;46&#x3011;&#x3002;</p>
<p>&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x6846;&#x67B6;&#x8FD8;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x53D1;&#x73B0;&#xFF0C;&#x5373;&#x5141;&#x8BB8;&#x5BA2;&#x6237;&#x7AEF;&#x627E;&#x51FA;&#x5728;&#x54EA;&#x4E2A;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#x4E0A;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x670D;&#x52A1;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="ch6.html#&#x8BF7;&#x6C42;&#x8DEF;&#x7531;">&#x8BF7;&#x6C42;&#x8DEF;&#x7531;</a>&#x201D;&#x4E2D;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x7684;&#x81EA;&#x5B9A;&#x4E49;RPC&#x534F;&#x8BAE;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6BD4;&#x901A;&#x7528;&#x7684;JSON over REST&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4F46;&#x662F;&#xFF0C;RESTful API&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x663E;&#x8457;&#x7684;&#x4F18;&#x70B9;&#xFF1A;&#x5BF9;&#x4E8E;&#x5B9E;&#x9A8C;&#x548C;&#x8C03;&#x8BD5;&#xFF08;&#x53EA;&#x9700;&#x4F7F;&#x7528;Web&#x6D4F;&#x89C8;&#x5668;&#x6216;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;curl&#xFF0C;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x6216;&#x8F6F;&#x4EF6;&#x5B89;&#x88C5;&#x5373;&#x53EF;&#x5411;&#x5176;&#x8BF7;&#x6C42;&#xFF09;&#xFF0C;&#x5B83;&#x662F;&#x53D7;&#x652F;&#x6301;&#x7684;&#x6240;&#x6709;&#x7684;&#x4E3B;&#x6D41;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x5E73;&#x53F0;&#xFF0C;&#x8FD8;&#x6709;&#x5927;&#x91CF;&#x53EF;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF08;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7F13;&#x5B58;&#xFF0C;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#xFF0C;&#x4EE3;&#x7406;&#xFF0C;&#x9632;&#x706B;&#x5899;&#xFF0C;&#x76D1;&#x63A7;&#xFF0C;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#xFF0C;&#x6D4B;&#x8BD5;&#x5DE5;&#x5177;&#x7B49;&#xFF09;&#x7684;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;REST&#x4F3C;&#x4E4E;&#x662F;&#x516C;&#x5171;API&#x7684;&#x4E3B;&#x8981;&#x98CE;&#x683C;&#x3002; RPC&#x6846;&#x67B6;&#x7684;&#x4E3B;&#x8981;&#x91CD;&#x70B9;&#x5728;&#x4E8E;&#x540C;&#x4E00;&#x7EC4;&#x7EC7;&#x62E5;&#x6709;&#x7684;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x540C;&#x4E00;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x3002;</p>
<h4 id="&#x6570;&#x636E;&#x7F16;&#x7801;&#x4E0E;rpc&#x7684;&#x6F14;&#x5316;">&#x6570;&#x636E;&#x7F16;&#x7801;&#x4E0E;RPC&#x7684;&#x6F14;&#x5316;</h4>
<p>&#x5BF9;&#x4E8E;&#x53EF;&#x6F14;&#x5316;&#x6027;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x66F4;&#x6539;&#x548C;&#x90E8;&#x7F72;RPC&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4E0E;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x5E93;&#x6D41;&#x52A8;&#x7684;&#x6570;&#x636E;&#x76F8;&#x6BD4;&#xFF08;&#x5982;&#x4E0A;&#x4E00;&#x8282;&#x6240;&#x8FF0;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x6D41;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7684;&#x5047;&#x8BBE;&#xFF1A;&#x5047;&#x5B9A;&#x6240;&#x6709;&#x7684;&#x670D;&#x52A1;&#x5668;&#x90FD;&#x4F1A;&#x5148;&#x66F4;&#x65B0;&#xFF0C;&#x5176;&#x6B21;&#x662F;&#x6240;&#x6709;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x5728;&#x8BF7;&#x6C42;&#x4E0A;&#x5177;&#x6709;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x54CD;&#x5E94;&#x5177;&#x6709;&#x524D;&#x5411;&#x517C;&#x5BB9;&#x6027;&#x3002;</p>
<p>RPC&#x65B9;&#x6848;&#x7684;&#x524D;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x6027;&#x5C5E;&#x6027;&#x4ECE;&#x5B83;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x5F0F;&#x4E2D;&#x7EE7;&#x627F;</p>
<ul>
<li>Thrift&#xFF0C;gRPC&#xFF08;Protobuf&#xFF09;&#x548C;Avro RPC&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x76F8;&#x5E94;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x6F14;&#x53D8;&#x3002;</li>
<li>&#x5728;SOAP&#x4E2D;&#xFF0C;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x662F;&#x4F7F;&#x7528;XML&#x6A21;&#x5F0F;&#x6307;&#x5B9A;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x53EF;&#x4EE5;&#x6F14;&#x53D8;&#xFF0C;&#x4F46;&#x6709;&#x4E00;&#x4E9B;&#x5FAE;&#x5999;&#x7684;&#x9677;&#x9631;&#x3010;47&#x3011;&#x3002;</li>
<li>RESTful API&#x901A;&#x5E38;&#x4F7F;&#x7528;JSON&#xFF08;&#x6CA1;&#x6709;&#x6B63;&#x5F0F;&#x6307;&#x5B9A;&#x7684;&#x6A21;&#x5F0F;&#xFF09;&#x7528;&#x4E8E;&#x54CD;&#x5E94;&#xFF0C;&#x4EE5;&#x53CA;&#x7528;&#x4E8E;&#x8BF7;&#x6C42;&#x7684;JSON&#x6216;URI&#x7F16;&#x7801;/&#x8868;&#x5355;&#x7F16;&#x7801;&#x7684;&#x8BF7;&#x6C42;&#x53C2;&#x6570;&#x3002;&#x6DFB;&#x52A0;&#x53EF;&#x9009;&#x7684;&#x8BF7;&#x6C42;&#x53C2;&#x6570;&#x5E76;&#x5411;&#x54CD;&#x5E94;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x5B57;&#x6BB5;&#x901A;&#x5E38;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4FDD;&#x6301;&#x517C;&#x5BB9;&#x6027;&#x7684;&#x6539;&#x53D8;&#x3002;</li>
</ul>
<p>&#x7531;&#x4E8E;RPC&#x7ECF;&#x5E38;&#x88AB;&#x7528;&#x4E8E;&#x8DE8;&#x8D8A;&#x7EC4;&#x7EC7;&#x8FB9;&#x754C;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x6240;&#x4EE5;&#x670D;&#x52A1;&#x7684;&#x517C;&#x5BB9;&#x6027;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x6B64;&#x670D;&#x52A1;&#x7684;&#x63D0;&#x4F9B;&#x8005;&#x7ECF;&#x5E38;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x5176;&#x5BA2;&#x6237;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x5F3A;&#x8FEB;&#x4ED6;&#x4EEC;&#x5347;&#x7EA7;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9700;&#x8981;&#x957F;&#x671F;&#x4FDD;&#x6301;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x65E0;&#x9650;&#x671F;&#x7684;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x517C;&#x5BB9;&#x6027;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x901A;&#x5E38;&#x4F1A;&#x5E76;&#x6392;&#x7EF4;&#x62A4;&#x591A;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x670D;&#x52A1;API&#x3002;</p>
<p>&#x5173;&#x4E8E;API&#x7248;&#x672C;&#x5316;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF08;&#x5373;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5982;&#x4F55;&#x6307;&#x793A;&#x5B83;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#x7684;API&#xFF09;&#x6CA1;&#x6709;&#x4E00;&#x81F4;&#x610F;&#x89C1;&#x3010;48&#x3011;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;RESTful API&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5728;URL&#x6216;HTTP Accept&#x5934;&#x4E2D;&#x4F7F;&#x7528;&#x7248;&#x672C;&#x53F7;&#x3002;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;API&#x5BC6;&#x94A5;&#x6765;&#x6807;&#x8BC6;&#x7279;&#x5B9A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x7684;API&#x7248;&#x672C;&#x5B58;&#x50A8;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x5355;&#x72EC;&#x7684;&#x7BA1;&#x7406;&#x754C;&#x9762;&#x66F4;&#x65B0;&#x8BE5;&#x7248;&#x672C;&#x9009;&#x9879;&#x3010;49&#x3011;&#x3002;</p>
<h3 id="&#x6D88;&#x606F;&#x4F20;&#x9012;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;">&#x6D88;&#x606F;&#x4F20;&#x9012;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;</h3>
<p>&#x6211;&#x4EEC;&#x4E00;&#x76F4;&#x5728;&#x7814;&#x7A76;&#x4ECE;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x7F16;&#x7801;&#x6570;&#x636E;&#x6D41;&#x7684;&#x4E0D;&#x540C;&#x65B9;&#x5F0F;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;REST&#x548C;RPC&#xFF08;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x5E76;&#x671F;&#x671B;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x7684;&#x54CD;&#x5E94;&#xFF09;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5199;&#x5165;&#x7F16;&#x7801;&#x6570;&#x636E;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5728;&#x5C06;&#x6765;&#x518D;&#x6B21;&#x8BFB;&#x53D6;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x6700;&#x540E;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;RPC&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x5F02;&#x6B65;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7CFB;&#x7EDF;&#x3002;&#x5B83;&#x4EEC;&#x4E0E;RPC&#x7C7B;&#x4F3C;&#xFF0C;&#x56E0;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8BF7;&#x6C42;&#xFF08;&#x901A;&#x5E38;&#x79F0;&#x4E3A;&#x6D88;&#x606F;&#xFF09;&#x4EE5;&#x4F4E;&#x5EF6;&#x8FDF;&#x4F20;&#x9001;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;&#x5B83;&#x4EEC;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x7C7B;&#x4F3C;&#xFF0C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x76F4;&#x63A5;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x79F0;&#x4E3A;&#x6D88;&#x606F;&#x4EE3;&#x7406;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x6D88;&#x606F;&#x961F;&#x5217;&#x6216;&#x9762;&#x5411;&#x6D88;&#x606F;&#x7684;&#x4E2D;&#x95F4;&#x4EF6;&#xFF09;&#x7684;&#x4E2D;&#x4ECB;&#x6765;&#x4E34;&#x65F6;&#x5B58;&#x50A8;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x4E0E;&#x76F4;&#x63A5;RPC&#x76F8;&#x6BD4;&#xFF0C;&#x4F7F;&#x7528;&#x6D88;&#x606F;&#x4EE3;&#x7406;&#x6709;&#x51E0;&#x4E2A;&#x4F18;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x6536;&#x4EF6;&#x4EBA;&#x4E0D;&#x53EF;&#x7528;&#x6216;&#x8FC7;&#x8F7D;&#xFF0C;&#x53EF;&#x4EE5;&#x5145;&#x5F53;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x9760;&#x6027;&#x3002;</li>
<li>&#x5B83;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5C06;&#x6D88;&#x606F;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x5230;&#x5DF2;&#x7ECF;&#x5D29;&#x6E83;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x4ECE;&#x800C;&#x9632;&#x6B62;&#x6D88;&#x606F;&#x4E22;&#x5931;&#x3002;</li>
<li>&#x907F;&#x514D;&#x53D1;&#x4EF6;&#x4EBA;&#x9700;&#x8981;&#x77E5;&#x9053;&#x6536;&#x4EF6;&#x4EBA;&#x7684;IP&#x5730;&#x5740;&#x548C;&#x7AEF;&#x53E3;&#x53F7;&#xFF08;&#x8FD9;&#x5728;&#x865A;&#x62DF;&#x673A;&#x7ECF;&#x5E38;&#x51FA;&#x5165;&#x7684;&#x4E91;&#x90E8;&#x7F72;&#x4E2D;&#x7279;&#x522B;&#x6709;&#x7528;&#xFF09;&#x3002;</li>
<li>&#x5B83;&#x5141;&#x8BB8;&#x5C06;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x7ED9;&#x591A;&#x4E2A;&#x6536;&#x4EF6;&#x4EBA;&#x3002;</li>
<li>&#x5C06;&#x53D1;&#x4EF6;&#x4EBA;&#x4E0E;&#x6536;&#x4EF6;&#x4EBA;&#x903B;&#x8F91;&#x5206;&#x79BB;&#xFF08;&#x53D1;&#x4EF6;&#x4EBA;&#x53EA;&#x662F;&#x53D1;&#x5E03;&#x90AE;&#x4EF6;&#xFF0C;&#x4E0D;&#x5173;&#x5FC3;&#x4F7F;&#x7528;&#x8005;&#xFF09;&#x3002;</li>
</ul>
<p>&#x7136;&#x800C;&#xFF0C;&#x4E0E;RPC&#x76F8;&#x6BD4;&#xFF0C;&#x5DEE;&#x5F02;&#x5728;&#x4E8E;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x901A;&#x4FE1;&#x901A;&#x5E38;&#x662F;&#x5355;&#x5411;&#x7684;&#xFF1A;&#x53D1;&#x9001;&#x8005;&#x901A;&#x5E38;&#x4E0D;&#x671F;&#x671B;&#x6536;&#x5230;&#x5176;&#x6D88;&#x606F;&#x7684;&#x56DE;&#x590D;&#x3002;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#xFF0C;&#x4F46;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x901A;&#x9053;&#x4E0A;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x901A;&#x4FE1;&#x6A21;&#x5F0F;&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF1A;&#x53D1;&#x9001;&#x8005;&#x4E0D;&#x4F1A;&#x7B49;&#x5F85;&#x6D88;&#x606F;&#x88AB;&#x4F20;&#x9012;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x53D1;&#x9001;&#x5B83;&#xFF0C;&#x7136;&#x540E;&#x5FD8;&#x8BB0;&#x5B83;&#x3002;</p>
<h4 id="&#x6D88;&#x606F;&#x4EE3;&#x7406;">&#x6D88;&#x606F;&#x4EE3;&#x7406;</h4>
<p>&#x8FC7;&#x53BB;&#xFF0C;<strong>&#x6D88;&#x606F;&#x4EE3;&#x7406;&#xFF08;Message Broker&#xFF09;</strong>&#x4E3B;&#x8981;&#x662F;TIBCO&#xFF0C;IBM WebSphere&#x548C;webMethods&#x7B49;&#x516C;&#x53F8;&#x7684;&#x5546;&#x4E1A;&#x8F6F;&#x4EF6;&#x7684;&#x79C0;&#x573A;&#x3002;&#x6700;&#x8FD1;&#x50CF;RabbitMQ&#xFF0C;ActiveMQ&#xFF0C;HornetQ&#xFF0C;NATS&#x548C;Apache Kafka&#x8FD9;&#x6837;&#x7684;&#x5F00;&#x6E90;&#x5B9E;&#x73B0;&#x5DF2;&#x7ECF;&#x6D41;&#x884C;&#x8D77;&#x6765;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch11.html">&#x7B2C;11&#x7AE0;</a>&#x4E2D;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x6BD4;&#x8F83;&#x3002;</p>
<p>&#x8BE6;&#x7EC6;&#x7684;&#x4EA4;&#x4ED8;&#x8BED;&#x4E49;&#x56E0;&#x5B9E;&#x73B0;&#x548C;&#x914D;&#x7F6E;&#x800C;&#x5F02;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6D88;&#x606F;&#x4EE3;&#x7406;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x961F;&#x5217;&#x6216;&#x4E3B;&#x9898;&#xFF0C;&#x4EE3;&#x7406;&#x786E;&#x4FDD;&#x5C06;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x7ED9;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6D88;&#x8D39;&#x8005;&#x6216;&#x8BA2;&#x9605;&#x8005;&#x5230;&#x90A3;&#x4E2A;&#x961F;&#x5217;&#x6216;&#x4E3B;&#x9898;&#x3002;&#x5728;&#x540C;&#x4E00;&#x4E3B;&#x9898;&#x4E0A;&#x53EF;&#x4EE5;&#x6709;&#x8BB8;&#x591A;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x8BB8;&#x591A;&#x6D88;&#x8D39;&#x8005;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x53EA;&#x63D0;&#x4F9B;&#x5355;&#x5411;&#x6570;&#x636E;&#x6D41;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x672C;&#x8EAB;&#x53EF;&#x80FD;&#x4F1A;&#x5C06;&#x6D88;&#x606F;&#x53D1;&#x5E03;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x4E0A;&#xFF08;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x94FE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch11.html">&#x7B2C;11&#x7AE0;</a>&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x53D1;&#x9001;&#x7ED9;&#x539F;&#x59CB;&#x6D88;&#x606F;&#x7684;&#x53D1;&#x9001;&#x8005;&#x4F7F;&#x7528;&#x7684;&#x56DE;&#x590D;&#x961F;&#x5217;&#xFF08;&#x5141;&#x8BB8;&#x8BF7;&#x6C42;/&#x54CD;&#x5E94;&#x6570;&#x636E;&#x6D41;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;RPC&#xFF09;&#x3002;</p>
<p>&#x6D88;&#x606F;&#x4EE3;&#x7406;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B; - &#x6D88;&#x606F;&#x53EA;&#x662F;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x5143;&#x6570;&#x636E;&#x7684;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x7F16;&#x7801;&#x662F;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#xFF0C;&#x5219;&#x60A8;&#x53EF;&#x4EE5;&#x7075;&#x6D3B;&#x5730;&#x66F4;&#x6539;&#x53D1;&#x884C;&#x5546;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x72EC;&#x7ACB;&#x7F16;&#x7801;&#xFF0C;&#x5E76;&#x4EE5;&#x4EFB;&#x610F;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x90E8;&#x7F72;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6D88;&#x8D39;&#x8005;&#x91CD;&#x65B0;&#x53D1;&#x5E03;&#x6D88;&#x606F;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5C0F;&#x5FC3;&#x4FDD;&#x7559;&#x672A;&#x77E5;&#x5B57;&#x6BB5;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x524D;&#x9762;&#x5728;&#x6570;&#x636E;&#x5E93;&#x73AF;&#x5883;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x95EE;&#x9898;&#xFF08;<a href="img/fig4-7.png">&#x56FE;4-7</a>&#xFF09;&#x3002;</p>
<h4 id="&#x5206;&#x5E03;&#x5F0F;&#x7684;actor&#x6846;&#x67B6;">&#x5206;&#x5E03;&#x5F0F;&#x7684;Actor&#x6846;&#x67B6;</h4>
<p>Actor&#x6A21;&#x578B;&#x662F;&#x5355;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x5E76;&#x53D1;&#x7684;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x3002;&#x903B;&#x8F91;&#x88AB;&#x5C01;&#x88C5;&#x5728;&#x89D2;&#x8272;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x5904;&#x7406;&#x7EBF;&#x7A0B;&#xFF08;&#x4EE5;&#x53CA;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF0C;&#x9501;&#x5B9A;&#x548C;&#x6B7B;&#x9501;&#x7684;&#x76F8;&#x5173;&#x95EE;&#x9898;&#xFF09;&#x3002;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x901A;&#x5E38;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x6216;&#x5B9E;&#x4F53;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E9B;&#x672C;&#x5730;&#x72B6;&#x6001;&#xFF08;&#x4E0D;&#x4E0E;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x89D2;&#x8272;&#x5171;&#x4EAB;&#xFF09;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x5F02;&#x6B65;&#x6D88;&#x606F;&#x4E0E;&#x5176;&#x4ED6;&#x89D2;&#x8272;&#x901A;&#x4FE1;&#x3002;&#x6D88;&#x606F;&#x4F20;&#x9001;&#x4E0D;&#x4FDD;&#x8BC1;&#xFF1A;&#x5728;&#x67D0;&#x4E9B;&#x9519;&#x8BEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6D88;&#x606F;&#x5C06;&#x4E22;&#x5931;&#x3002;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x5904;&#x7406;&#x4E00;&#x6761;&#x6D88;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x89D2;&#x8272;&#x53EF;&#x4EE5;&#x7531;&#x6846;&#x67B6;&#x72EC;&#x7ACB;&#x8C03;&#x5EA6;&#x3002;</p>
<p>&#x5728;&#x5206;&#x5E03;&#x5F0F;Actor&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x6B64;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x7528;&#x4E8E;&#x8DE8;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x4F38;&#x7F29;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4E0D;&#x7BA1;&#x53D1;&#x9001;&#x65B9;&#x548C;&#x63A5;&#x6536;&#x65B9;&#x662F;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x8FD8;&#x662F;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x90FD;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x673A;&#x5236;&#x3002;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x5219;&#x8BE5;&#x6D88;&#x606F;&#x88AB;&#x900F;&#x660E;&#x5730;&#x7F16;&#x7801;&#x6210;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#xFF0C;&#x5E76;&#x5728;&#x53E6;&#x4E00;&#x4FA7;&#x89E3;&#x7801;&#x3002;</p>
<p>&#x4F4D;&#x7F6E;&#x900F;&#x660E;&#x5728;actor&#x6A21;&#x578B;&#x4E2D;&#x6BD4;&#x5728;RPC&#x4E2D;&#x6548;&#x679C;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;actor&#x6A21;&#x578B;&#x5DF2;&#x7ECF;&#x5047;&#x5B9A;&#x6D88;&#x606F;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x5355;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5C3D;&#x7BA1;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x5EF6;&#x8FDF;&#x53EF;&#x80FD;&#x6BD4;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5EF6;&#x8FDF;&#x66F4;&#x9AD8;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4F7F;&#x7528;&#x53C2;&#x4E0E;&#x8005;&#x6A21;&#x578B;&#x65F6;&#xFF0C;&#x672C;&#x5730;&#x548C;&#x8FDC;&#x7A0B;&#x901A;&#x4FE1;&#x4E4B;&#x95F4;&#x7684;&#x57FA;&#x672C;&#x4E0D;&#x5339;&#x914D;&#x662F;&#x8F83;&#x5C11;&#x7684;&#x3002;</p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x7684;Actor&#x6846;&#x67B6;&#x5B9E;&#x8D28;&#x4E0A;&#x662F;&#x5C06;&#x6D88;&#x606F;&#x4EE3;&#x7406;&#x548C;&#x89D2;&#x8272;&#x7F16;&#x7A0B;&#x6A21;&#x578B;&#x96C6;&#x6210;&#x5230;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#x4E2D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x6267;&#x884C;&#x57FA;&#x4E8E;&#x89D2;&#x8272;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#xFF0C;&#x5219;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x5411;&#x524D;&#x548C;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x6D88;&#x606F;&#x53EF;&#x80FD;&#x4F1A;&#x4ECE;&#x8FD0;&#x884C;&#x65B0;&#x7248;&#x672C;&#x7684;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x5230;&#x8FD0;&#x884C;&#x65E7;&#x7248;&#x672C;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;</p>
<p>&#x4E09;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x5206;&#x5E03;&#x5F0F;actor&#x6846;&#x67B6;&#x5904;&#x7406;&#x6D88;&#x606F;&#x7F16;&#x7801;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Akka&#x4F7F;&#x7528;Java&#x7684;&#x5185;&#x7F6E;&#x5E8F;&#x5217;&#x5316;&#xFF0C;&#x4E0D;&#x63D0;&#x4F9B;&#x524D;&#x5411;&#x6216;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x6027;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x7C7B;&#x4F3C;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x4E1C;&#x897F;&#x66FF;&#x4EE3;&#x5B83;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#x7684;&#x80FD;&#x529B;&#x3010;50&#x3011;&#x3002;</li>
<li>Orleans &#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x4E0D;&#x652F;&#x6301;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#x90E8;&#x7F72;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#x7F16;&#x7801;&#x683C;&#x5F0F;; &#x8981;&#x90E8;&#x7F72;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7FA4;&#x96C6;&#xFF0C;&#x5C06;&#x6D41;&#x91CF;&#x4ECE;&#x65E7;&#x7FA4;&#x96C6;&#x8FC1;&#x79FB;&#x5230;&#x65B0;&#x7FA4;&#x96C6;&#xFF0C;&#x7136;&#x540E;&#x5173;&#x95ED;&#x65E7;&#x7FA4;&#x96C6;&#x3010;51,52&#x3011;&#x3002; &#x50CF;Akka&#x4E00;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x81EA;&#x5B9A;&#x4E49;&#x5E8F;&#x5217;&#x5316;&#x63D2;&#x4EF6;&#x3002;</li>
<li>&#x5728;Erlang OTP&#x4E2D;&#xFF0C;&#x5BF9;&#x8BB0;&#x5F55;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x7684;&#xFF08;&#x5C3D;&#x7BA1;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x4E3A;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x8BBE;&#x8BA1;&#x7684;&#x529F;&#x80FD;&#xFF09;&#x3002; &#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x4ED4;&#x7EC6;&#x8BA1;&#x5212;&#x3010;53&#x3011;&#x3002; &#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5B9E;&#x9A8C;&#x6027;&#x7684;<code>maps</code>&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;2014&#x5E74;&#x5728;Erlang R17&#x4E2D;&#x5F15;&#x5165;&#x7684;&#x7C7B;&#x4F3C;&#x4E8E;JSON&#x7684;&#x7ED3;&#x6784;&#xFF09;&#x53EF;&#x80FD;&#x4F7F;&#x5F97;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5728;&#x672A;&#x6765;&#x66F4;&#x5BB9;&#x6613;&#x3010;54&#x3011;&#x3002;</li>
</ul>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x5C06;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8F6C;&#x6362;&#x4E3A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5B57;&#x8282;&#x6216;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x5B57;&#x8282;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x8FD9;&#x4E9B;&#x7F16;&#x7801;&#x7684;&#x7EC6;&#x8282;&#x4E0D;&#x4EC5;&#x5F71;&#x54CD;&#x5176;&#x6548;&#x7387;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x548C;&#x90E8;&#x7F72;&#x5B83;&#x4EEC;&#x7684;&#x9009;&#x9879;&#x3002;</p>
<p>&#x7279;&#x522B;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x670D;&#x52A1;&#x9700;&#x8981;&#x652F;&#x6301;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#xFF0C;&#x5176;&#x4E2D;&#x65B0;&#x7248;&#x672C;&#x7684;&#x670D;&#x52A1;&#x9010;&#x6B65;&#x90E8;&#x7F72;&#x5230;&#x5C11;&#x6570;&#x8282;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x540C;&#x65F6;&#x90E8;&#x7F72;&#x5230;&#x6240;&#x6709;&#x8282;&#x70B9;&#x3002;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#x5141;&#x8BB8;&#x5728;&#x4E0D;&#x505C;&#x673A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53D1;&#x5E03;&#x65B0;&#x7248;&#x672C;&#x7684;&#x670D;&#x52A1;&#xFF08;&#x4ECE;&#x800C;&#x9F13;&#x52B1;&#x5728;&#x7F55;&#x89C1;&#x7684;&#x5927;&#x578B;&#x7248;&#x672C;&#x4E0A;&#x9891;&#x7E41;&#x53D1;&#x5E03;&#x5C0F;&#x578B;&#x7248;&#x672C;&#xFF09;&#xFF0C;&#x5E76;&#x4F7F;&#x90E8;&#x7F72;&#x98CE;&#x9669;&#x964D;&#x4F4E;&#xFF08;&#x5141;&#x8BB8;&#x5728;&#x5F71;&#x54CD;&#x5927;&#x91CF;&#x7528;&#x6237;&#x4E4B;&#x524D;&#x68C0;&#x6D4B;&#x5E76;&#x56DE;&#x6EDA;&#x6709;&#x6545;&#x969C;&#x7684;&#x7248;&#x672C;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x5BF9;&#x4E8E;&#x53EF;&#x6F14;&#x5316;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x7684;&#x5BB9;&#x6613;&#x6027;&#x90FD;&#x662F;&#x975E;&#x5E38;&#x6709;&#x5229;&#x7684;&#x3002;</p>
<p>&#x5728;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#x671F;&#x95F4;&#xFF0C;&#x6216;&#x51FA;&#x4E8E;&#x5404;&#x79CD;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5047;&#x8BBE;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x6211;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x7CFB;&#x7EDF;&#x5468;&#x56F4;&#x6D41;&#x52A8;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4EE5;&#x63D0;&#x4F9B;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#xFF08;&#x65B0;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x65E7;&#x6570;&#x636E;&#xFF09;&#x548C;&#x5411;&#x524D;&#x517C;&#x5BB9;&#x6027;&#xFF08;&#x65E7;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x65B0;&#x6570;&#x636E;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x662F;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x51E0;&#x79CD;&#x6570;&#x636E;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x53CA;&#x5176;&#x517C;&#x5BB9;&#x6027;&#x5C5E;&#x6027;&#xFF1A;</p>
<ul>
<li>&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7279;&#x5B9A;&#x7684;&#x7F16;&#x7801;&#x4EC5;&#x9650;&#x4E8E;&#x5355;&#x4E00;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5E76;&#x4E14;&#x5F80;&#x5F80;&#x65E0;&#x6CD5;&#x63D0;&#x4F9B;&#x524D;&#x5411;&#x548C;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x6027;&#x3002;</li>
<li>JSON&#xFF0C;XML&#x548C;CSV&#x7B49;&#x6587;&#x672C;&#x683C;&#x5F0F;&#x975E;&#x5E38;&#x666E;&#x904D;&#xFF0C;&#x5176;&#x517C;&#x5BB9;&#x6027;&#x53D6;&#x51B3;&#x4E8E;&#x60A8;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x4ED6;&#x4EEC;&#x6709;&#x53EF;&#x9009;&#x7684;&#x6A21;&#x5F0F;&#x8BED;&#x8A00;&#xFF0C;&#x8FD9;&#x6709;&#x65F6;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x6709;&#x65F6;&#x662F;&#x4E00;&#x4E2A;&#x969C;&#x788D;&#x3002;&#x8FD9;&#x4E9B;&#x683C;&#x5F0F;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6709;&#x4E9B;&#x6A21;&#x7CCA;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x5FC5;&#x987B;&#x5C0F;&#x5FC3;&#x6570;&#x5B57;&#x548C;&#x4E8C;&#x8FDB;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x3002;</li>
<li>&#x50CF;Thrift&#xFF0C;Protocol Buffers&#x548C;Avro&#x8FD9;&#x6837;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6A21;&#x5F0F;&#x9A71;&#x52A8;&#x683C;&#x5F0F;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x6E05;&#x6670;&#x5B9A;&#x4E49;&#x7684;&#x524D;&#x5411;&#x548C;&#x540E;&#x5411;&#x517C;&#x5BB9;&#x6027;&#x8BED;&#x4E49;&#x8FDB;&#x884C;&#x7D27;&#x51D1;&#xFF0C;&#x9AD8;&#x6548;&#x7684;&#x7F16;&#x7801;&#x3002;&#x8FD9;&#x4E9B;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x8BED;&#x8A00;&#x7684;&#x6587;&#x6863;&#x548C;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x5728;&#x6570;&#x636E;&#x53EF;&#x8BFB;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#x3002;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x8FD8;&#x8BA8;&#x8BBA;&#x4E86;&#x6570;&#x636E;&#x6D41;&#x7684;&#x51E0;&#x79CD;&#x6A21;&#x5F0F;&#xFF0C;&#x8BF4;&#x660E;&#x4E86;&#x6570;&#x636E;&#x7F16;&#x7801;&#x662F;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x540C;&#x573A;&#x666F;&#xFF1A;</p>
<ul>
<li>&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8FDB;&#x7A0B;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x5E76;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x53D6;&#x8FDB;&#x7A0B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x89E3;&#x7801;</li>
<li>RPC&#x548C;REST API&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5BF9;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5BF9;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#x5E76;&#x5BF9;&#x54CD;&#x5E94;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x6700;&#x7EC8;&#x5BF9;&#x54CD;&#x5E94;&#x8FDB;&#x884C;&#x89E3;&#x7801;</li>
<li>&#x5F02;&#x6B65;&#x6D88;&#x606F;&#x4F20;&#x9012;&#xFF08;&#x4F7F;&#x7528;&#x6D88;&#x606F;&#x4EE3;&#x7406;&#x6216;&#x53C2;&#x4E0E;&#x8005;&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x6D88;&#x606F;&#x7531;&#x53D1;&#x9001;&#x8005;&#x7F16;&#x7801;&#x5E76;&#x7531;&#x63A5;&#x6536;&#x8005;&#x89E3;&#x7801;</li>
</ul>
<p>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C0F;&#x5FC3;&#x5730;&#x5F97;&#x51FA;&#x8FD9;&#x6837;&#x7684;&#x7ED3;&#x8BBA;&#xFF1A;&#x524D;&#x5411;&#x517C;&#x5BB9;&#x6027;&#x548C;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x613F;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6F14;&#x53D8;&#x8FC5;&#x901F;&#x3001;&#x654F;&#x6377;&#x90E8;&#x7F72;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;">&#x53C2;&#x8003;&#x6587;&#x732E;</h2>
<ol>
<li><p>&#x201C;<a href="http://docs.oracle.com/javase/7/docs/platform/serialization/spec/serialTOC.html" target="_blank">Java Object Serialization Specification</a>,&#x201D; <em>docs.oracle.com</em>, 2010.</p>
</li>
<li><p>&#x201C;<a href="http://ruby-doc.org/core-2.2.0/" target="_blank">Ruby 2.2.0 API Documentation</a>,&#x201D; <em>ruby-doc.org</em>, Dec 2014.</p>
</li>
<li><p>&#x201C;<a href="https://docs.python.org/3/library/pickle.html" target="_blank">The Python 3.4.3 Standard Library Reference Manual</a>,&#x201D; <em>docs.python.org</em>, February 2015.</p>
</li>
<li><p>&#x201C;<a href="https://github.com/EsotericSoftware/kryo" target="_blank">EsotericSoftware/kryo</a>,&#x201D; <em>github.com</em>, October 2014.</p>
</li>
<li><p>&#x201C;<a href="http://cwe.mitre.org/data/definitions/502.html" target="_blank">CWE-502:   Deserialization of Untrusted Data</a>,&#x201D; Common Weakness Enumeration, <em>cwe.mitre.org</em>,
  July 30, 2014.</p>
</li>
<li><p>Steve Breen:  &#x201C;<a href="http://foxglovesecurity.com/2015/11/06/what-do-weblogic-websphere-jboss-jenkins-opennms-and-your-application-have-in-common-this-vulnerability/" target="_blank">What   Do WebLogic, WebSphere, JBoss, Jenkins, OpenNMS, and Your Application Have in Common? This   Vulnerability</a>,&#x201D; <em>foxglovesecurity.com</em>, November 6, 2015.</p>
</li>
<li><p>Patrick McKenzie:  &#x201C;<a href="http://www.kalzumeus.com/2013/01/31/what-the-rails-security-issue-means-for-your-startup/" target="_blank">What   the Rails Security Issue Means for Your Startup</a>,&#x201D; <em>kalzumeus.com</em>, January 31, 2013.</p>
</li>
<li><p>Eishay Smith:  &#x201C;<a href="https://github.com/eishay/jvm-serializers/wiki" target="_blank">jvm-serializers wiki</a>,&#x201D;  <em>github.com</em>, November 2014.</p>
</li>
<li><p>&#x201C;<a href="http://c2.com/cgi/wiki?XmlIsaPoorCopyOfEssExpressions" target="_blank">XML Is a Poor Copy of S-Expressions</a>,&#x201D; <em>c2.com</em> wiki.</p>
</li>
<li><p>Matt Harris: &#x201C;<a href="https://groups.google.com/forum/#!topic/twitter-development-talk/ahbvo3VTIYI" target="_blank">Snowflake: An Update and Some Very Important Information</a>,&#x201D; email to <em>Twitter Development Talk</em> mailing list, October 19, 2010.</p>
</li>
<li><p>Shudi (Sandy) Gao, C. M. Sperberg-McQueen, and Henry S. Thompson: &#x201C;<a href="http://www.w3.org/XML/Schema" target="_blank">XML Schema 1.1</a>,&#x201D; W3C Recommendation, May 2001.</p>
</li>
<li><p>Francis Galiegue, Kris Zyp, and Gary Court: &#x201C;<a href="http://json-schema.org/" target="_blank">JSON Schema</a>,&#x201D; IETF Internet-Draft, February 2013.</p>
</li>
<li><p>Yakov Shafranovich: &#x201C;<a href="https://tools.ietf.org/html/rfc4180" target="_blank">RFC 4180: Common Format and MIME Type for Comma-Separated Values (CSV) Files</a>,&#x201D; October 2005.</p>
</li>
<li><p>&#x201C;<a href="http://msgpack.org/" target="_blank">MessagePack Specification</a>,&#x201D; <em>msgpack.org</em>. Mark Slee, Aditya Agarwal, and Marc Kwiatkowski: &#x201C;<a href="http://thrift.apache.org/static/files/thrift-20070401.pdf" target="_blank">Thrift: Scalable Cross-Language Services Implementation</a>,&#x201D; Facebook technical report, April 2007.</p>
</li>
<li><p>&#x201C;<a href="https://developers.google.com/protocol-buffers/docs/overview" target="_blank">Protocol Buffers Developer Guide</a>,&#x201D; Google, Inc., <em>developers.google.com</em>.</p>
</li>
<li><p>Igor Anishchenko: &#x201C;<a href="http://www.slideshare.net/IgorAnishchenko/pb-vs-thrift-vs-avro" target="_blank">Thrift vs Protocol Buffers vs Avro - Biased Comparison</a>,&#x201D; <em>slideshare.net</em>, September 17, 2012.</p>
</li>
<li><p>&#x201C;<a href="http://wiki.apache.org/thrift/LibraryFeatures" target="_blank">A Matrix of the Features Each Individual Language Library Supports</a>,&#x201D; <em>wiki.apache.org</em>.</p>
</li>
<li><p>Martin Kleppmann: &#x201C;<a href="http://martin.kleppmann.com/2012/12/05/schema-evolution-in-avro-protocol-buffers-thrift.html" target="_blank">Schema Evolution in Avro, Protocol Buffers and Thrift</a>,&#x201D; <em>martin.kleppmann.com</em>, December 5, 2012.</p>
</li>
<li><p>&#x201C;<a href="http://avro.apache.org/docs/1.7.7/" target="_blank">Apache Avro 1.7.7 Documentation</a>,&#x201D; <em>avro.apache.org</em>, July 2014.</p>
</li>
<li><p>Doug Cutting, Chad Walters, Jim Kellerman, et al.:
&#x201C;<a href="http://mail-archives.apache.org/mod_mbox/hadoop-general/200904.mbox/%3C49D53694.1050906@apache.org%3E" target="_blank">[PROPOSAL] New Subproject: Avro</a>,&#x201D; email thread on <em>hadoop-general</em> mailing list,
<em>mail-archives.apache.org</em>, April 2009.</p>
</li>
<li><p>Tony Hoare: &#x201C;<a href="http://www.infoq.com/presentations/Null-References-The-Billion-Dollar-Mistake-Tony-Hoare" target="_blank">Null References: The Billion Dollar Mistake</a>,&#x201D; at <em>QCon London</em>, March 2009.</p>
</li>
<li><p>Aditya Auradkar and Tom Quiggle:   &#x201C;<a href="https://engineering.linkedin.com/espresso/introducing-espresso-linkedins-hot-new-distributed-document-store" target="_blank">Introducing   Espresso&#x2014;LinkedIn&apos;s Hot New Distributed Document Store</a>,&#x201D; <em>engineering.linkedin.com</em>, January 21, 2015.</p>
</li>
<li><p>Jay Kreps: &#x201C;<a href="http://blog.confluent.io/2015/02/25/stream-data-platform-2/" target="_blank">Putting Apache Kafka to Use: A Practical Guide to Building a Stream Data Platform (Part 2)</a>,&#x201D; <em>blog.confluent.io</em>, February 25, 2015.</p>
</li>
<li><p>Gwen Shapira: &#x201C;<a href="http://radar.oreilly.com/2014/11/the-problem-of-managing-schemas.html" target="_blank">The Problem of Managing Schemas</a>,&#x201D; <em>radar.oreilly.com</em>, November 4, 2014.</p>
</li>
<li><p>&#x201C;<a href="http://pig.apache.org/docs/r0.14.0/" target="_blank">Apache Pig 0.14.0 Documentation</a>,&#x201D; <em>pig.apache.org</em>, November 2014.</p>
</li>
<li><p>John Larmouth: <a href="http://www.oss.com/asn1/resources/books-whitepapers-pubs/larmouth-asn1-book.pdf" target="_blank"><em>ASN.1Complete</em></a>. Morgan Kaufmann, 1999. ISBN: 978-0-122-33435-1</p>
</li>
<li><p>Russell Housley, Warwick Ford, Tim Polk, and David Solo: &#x201C;<a href="https://www.ietf.org/rfc/rfc2459.txt" target="_blank">RFC 2459: Internet X.509 Public Key Infrastructure: Certificate and CRL Profile</a>,&#x201D; IETF Network Working Group, Standards Track,
January 1999.</p>
</li>
<li><p>Lev Walkin: &#x201C;<a href="http://lionet.info/asn1c/blog/2010/09/21/question-extensibility-removing-fields/" target="_blank">Question: Extensibility and Dropping Fields</a>,&#x201D; <em>lionet.info</em>, September 21, 2010.</p>
</li>
<li><p>Jesse James Garrett: &#x201C;<a href="http://www.adaptivepath.com/ideas/ajax-new-approach-web-applications/" target="_blank">Ajax: A New Approach to Web Applications</a>,&#x201D; <em>adaptivepath.com</em>, February 18, 2005.</p>
</li>
<li><p>Sam Newman: <em>Building Microservices</em>. O&apos;Reilly Media, 2015. ISBN: 978-1-491-95035-7</p>
</li>
<li><p>Chris Richardson: &#x201C;<a href="http://www.infoq.com/articles/microservices-intro" target="_blank">Microservices: Decomposing Applications for Deployability and Scalability</a>,&#x201D; <em>infoq.com</em>, May 25, 2014.</p>
</li>
<li><p>Pat Helland: &#x201C;<a href="http://cidrdb.org/cidr2005/papers/P12.pdf" target="_blank">Data on the Outside Versus Data on the Inside</a>,&#x201D; at <em>2nd Biennial Conference on Innovative Data Systems Research</em> (CIDR), January 2005.</p>
</li>
<li><p>Roy Thomas Fielding: &#x201C;<a href="https://www.ics.uci.edu/~fielding/pubs/dissertation/fielding_dissertation.pdf" target="_blank">Architectural Styles and the Design of Network-Based Software Architectures</a>,&#x201D; PhD Thesis, University of California, Irvine, 2000.</p>
</li>
<li><p>Roy Thomas Fielding: &#x201C;<a href="http://roy.gbiv.com/untangled/2008/rest-apis-must-be-hypertext-driven" target="_blank">REST APIs Must Be Hypertext-Driven</a>,&#x201D; <em>roy.gbiv.com</em>, October 20 2008.</p>
</li>
<li><p>&#x201C;<a href="http://royal.pingdom.com/2010/10/15/rest-in-peace-soap/" target="_blank">REST in Peace, SOAP</a>,&#x201D; <em>royal.pingdom.com</em>, October 15, 2010.</p>
</li>
<li><p>&#x201C;<a href="https://www.innoq.com/resources/ws-standards-poster/" target="_blank">Web Services Standards as of Q1 2007</a>,&#x201D; <em>innoq.com</em>, February 2007.</p>
</li>
<li><p>Pete Lacey: &#x201C;<a href="http://harmful.cat-v.org/software/xml/soap/simple" target="_blank">The S Stands for Simple</a>,&#x201D; <em>harmful.cat-v.org</em>, November 15, 2006.</p>
</li>
<li><p>Stefan Tilkov: &#x201C;<a href="http://www.infoq.com/articles/pete-lacey-ws-criticism" target="_blank">Interview: Pete Lacey Criticizes Web Services</a>,&#x201D; <em>infoq.com</em>, December 12, 2006.</p>
</li>
<li><p>&#x201C;<a href="http://swagger.io/specification/" target="_blank">OpenAPI Specification (fka Swagger RESTful API Documentation Specification) Version 2.0</a>,&#x201D; <em>swagger.io</em>, September 8, 2014.</p>
</li>
<li><p>Michi Henning: &#x201C;<a href="http://queue.acm.org/detail.cfm?id=1142044" target="_blank">The Rise and Fall of CORBA</a>,&#x201D; <em>ACM Queue</em>, volume 4, number 5, pages 28&#x2013;34, June 2006.
<a href="http://dx.doi.org/10.1145/1142031.1142044" target="_blank">doi:10.1145/1142031.1142044</a></p>
</li>
<li><p>Andrew D. Birrell and Bruce Jay Nelson: &#x201C;<a href="http://www.cs.princeton.edu/courses/archive/fall03/cs518/papers/rpc.pdf" target="_blank">Implementing Remote Procedure Calls</a>,&#x201D; <em>ACM Transactions on Computer Systems</em> (TOCS), volume 2, number 1, pages 39&#x2013;59, February 1984. <a href="http://dx.doi.org/10.1145/2080.357392" target="_blank">doi:10.1145/2080.357392</a></p>
</li>
<li><p>Jim Waldo, Geoff Wyant, Ann Wollrath, and Sam Kendall: &#x201C;<a href="http://m.mirror.facebook.net/kde/devel/smli_tr-94-29.pdf" target="_blank">A Note on Distributed Computing</a>,&#x201D; Sun Microsystems Laboratories, Inc., Technical Report TR-94-29, November 1994.</p>
</li>
<li><p>Steve Vinoski: &#x201C;<a href="http://steve.vinoski.net/pdf/IEEE-Convenience_Over_Correctness.pdf" target="_blank">Convenience over Correctness</a>,&#x201D; <em>IEEE Internet Computing</em>, volume 12, number 4, pages 89&#x2013;92, July 2008. <a href="http://dx.doi.org/10.1109/MIC.2008.75" target="_blank">doi:10.1109/MIC.2008.75</a></p>
</li>
<li><p>Marius Eriksen: &#x201C;<a href="http://monkey.org/~marius/funsrv.pdf" target="_blank">Your Server as a Function</a>,&#x201D; at <em>7th Workshop on Programming Languages and Operating Systems</em> (PLOS), November 2013. <a href="http://dx.doi.org/10.1145/2525528.2525538" target="_blank">doi:10.1145/2525528.2525538</a></p>
</li>
<li><p>&#x201C;<a href="https://github.com/grpc/grpc-common" target="_blank">grpc-common Documentation</a>,&#x201D; Google, Inc., <em>github.com</em>, February 2015.</p>
</li>
<li><p>Aditya Narayan and Irina Singh:   &#x201C;<a href="http://www.ibm.com/developerworks/websphere/library/techarticles/0705_narayan/0705_narayan.html" target="_blank">Designing   and Versioning Compatible Web Services</a>,&#x201D; <em>ibm.com</em>, March 28, 2007.</p>
</li>
<li><p>Troy Hunt: &#x201C;<a href="http://www.troyhunt.com/2014/02/your-api-versioning-is-wrong-which-is.html" target="_blank">Your API Versioning Is Wrong, Which Is Why I Decided to Do It 3 Different Wrong Ways</a>,&#x201D; <em>troyhunt.com</em>, February 10, 2014.</p>
</li>
<li><p>&#x201C;<a href="https://stripe.com/docs/upgrades" target="_blank">API Upgrades</a>,&#x201D; Stripe, Inc., April 2015.</p>
</li>
<li><p>Jonas Bon&#xE9;r:   &#x201C;<a href="http://grokbase.com/t/gg/akka-user/138wd8j9e3/upgrade-in-an-akka-cluster" target="_blank">Upgrade in an   Akka Cluster</a>,&#x201D; email to <em>akka-user</em> mailing list, <em>grokbase.com</em>, August 28, 2013.</p>
</li>
<li><p>Philip A. Bernstein, Sergey Bykov, Alan Geller, et al.:   &#x201C;<a href="http://research.microsoft.com/pubs/210931/Orleans-MSR-TR-2014-41.pdf" target="_blank">Orleans:   Distributed Virtual Actors for Programmability and Scalability</a>,&#x201D; Microsoft Research Technical Report MSR-TR-2014-41, March 2014.</p>
</li>
<li><p>&#x201C;<a href="http://dotnet.github.io/orleans/" target="_blank">Microsoft Project   Orleans Documentation</a>,&#x201D; Microsoft Research, <em>dotnet.github.io</em>, 2015.</p>
</li>
<li><p>David Mercer, Sean Hinde, Yinso Chen, and Richard A O&apos;Keefe:  &#x201C;<a href="http://erlang.org/pipermail/erlang-questions/2007-October/030318.html" target="_blank">beginner:   Updating Data Structures</a>,&#x201D; email thread on <em>erlang-questions</em> mailing list, <em>erlang.com</em>,  October 29, 2007.</p>
</li>
<li><p>Fred Hebert:  &#x201C;<a href="http://learnyousomeerlang.com/maps" target="_blank">Postscript: Maps</a>,&#x201D; <em>learnyousomeerlang.com</em>,  April 9, 2014.</p>
</li>
</ol>
<hr>
<table>
<thead>
<tr>
<th>&#x4E0A;&#x4E00;&#x7AE0;</th>
<th>&#x76EE;&#x5F55;</th>
<th>&#x4E0B;&#x4E00;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><a href="ch3.html">&#x7B2C;&#x4E09;&#x7AE0;&#xFF1A;&#x5B58;&#x50A8;&#x4E0E;&#x68C0;&#x7D22;</a></td>
<td><a href="./">&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;</a></td>
<td><a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;</a></td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch3.html" class="navigation navigation-prev " aria-label="Previous page: 第三章：存储与检索">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="part-ii.html" class="navigation navigation-next " aria-label="Next page: 第二部分：分布式数据">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四章：编码与演化","level":"1.3.4","depth":2,"next":{"title":"第二部分：分布式数据","level":"1.4","depth":1,"path":"part-ii.md","ref":"part-ii.md","articles":[{"title":"第五章：复制","level":"1.4.1","depth":2,"path":"ch5.md","ref":"ch5.md","articles":[]},{"title":"第六章：分区","level":"1.4.2","depth":2,"path":"ch6.md","ref":"ch6.md","articles":[]},{"title":"第七章：事务","level":"1.4.3","depth":2,"path":"ch7.md","ref":"ch7.md","articles":[]},{"title":"第八章：分布式系统的麻烦","level":"1.4.4","depth":2,"path":"ch8.md","ref":"ch8.md","articles":[]},{"title":"第九章：一致性与共识","level":"1.4.5","depth":2,"path":"ch9.md","ref":"ch9.md","articles":[]}]},"previous":{"title":"第三章：存储与检索","level":"1.3.3","depth":2,"path":"ch3.md","ref":"ch3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing","mathjax-pro","livereload"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/ddia"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"livereload":{},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch4.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-21T05:58:49.715Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

