
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第五章：复制 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch6.html" />
    
    
    <link rel="prev" href="part-ii.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第五章：复制</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="5-&#x590D;&#x5236;">5. &#x590D;&#x5236;</h1>
<p><img src="img/ch5.png" alt=""></p>
<blockquote>
<p>&#x4E0E;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x7684;&#x4E1C;&#x897F;&#x6BD4;&#xFF0C;&apos;&#x4E0D;&#x53EF;&#x80FD;&apos;&#x51FA;&#x9519;&#x7684;&#x4E1C;&#x897F;&#x6700;&#x663E;&#x8457;&#x7684;&#x7279;&#x70B9;&#x5C31;&#x662F;&#xFF1A;&#x4E00;&#x65E6;&#x771F;&#x7684;&#x51FA;&#x9519;&#xFF0C;&#x901A;&#x5E38;&#x5C31;&#x5F7B;&#x5E95;&#x73A9;&#x5B8C;&#x4E86;&#x3002;</p>
<p>&#x2014;&#x2014;&#x9053;&#x683C;&#x62C9;&#x65AF;&#xB7;&#x4E9A;&#x5F53;&#x65AF;&#xFF08;1992&#xFF09;</p>
</blockquote>
<hr>
<p>[TOC]</p>
<p>&#x200B;    &#x590D;&#x5236;&#x610F;&#x5473;&#x7740;&#x5728;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x4FDD;&#x7559;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x526F;&#x672C;&#x3002;&#x6B63;&#x5982;&#x5728;<a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7B80;&#x4ECB;</a>&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x80FD;&#x590D;&#x5236;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x80FD;&#x51FA;&#x4E8E;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x539F;&#x56E0;&#xFF1A;</p>
<ul>
<li>&#x4F7F;&#x5F97;&#x6570;&#x636E;&#x4E0E;&#x7528;&#x6237;&#x5728;&#x5730;&#x7406;&#x4E0A;&#x63A5;&#x8FD1;&#xFF08;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x5EF6;&#x8FDF;&#xFF09;</li>
<li>&#x5373;&#x4F7F;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E5F;&#x80FD;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#xFF08;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#xFF09;</li>
<li>&#x4F38;&#x7F29;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x8BFB;&#x8BF7;&#x6C42;&#x7684;&#x673A;&#x5668;&#x6570;&#x91CF;&#xFF08;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x8BFB;&#x53D6;&#x541E;&#x5410;&#x91CF;&#xFF09;</li>
</ul>
<p>&#x672C;&#x7AE0;&#x5C06;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x6570;&#x636E;&#x96C6;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x90FD;&#x53EF;&#x4EE5;&#x4FDD;&#x5B58;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x526F;&#x672C;&#x3002;&#x5728;<a href="ch6.html">&#x7B2C;6&#x7AE0;</a>&#x4E2D;&#x5C06;&#x653E;&#x5BBD;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#xFF0C;&#x8BA8;&#x8BBA;&#x5BF9;&#x5355;&#x4E2A;&#x673A;&#x5668;&#x6765;&#x8BF4;&#x592A;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5206;&#x5272;&#xFF08;&#x5206;&#x7247;&#xFF09;&#x3002;&#x5728;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x590D;&#x5236;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x5404;&#x79CD;&#x6545;&#x969C;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x6545;&#x969C;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x590D;&#x5236;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x4F1A;&#x968F;&#x65F6;&#x95F4;&#x800C;&#x6539;&#x53D8;&#xFF0C;&#x90A3;&#x590D;&#x5236;&#x5C31;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x5C06;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4E00;&#x6B21;&#x5C31;&#x4E07;&#x4E8B;&#x5927;&#x5409;&#x3002;&#x590D;&#x5236;&#x7684;&#x56F0;&#x96BE;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x5904;&#x7406;&#x590D;&#x5236;&#x6570;&#x636E;&#x7684;<strong>&#x53D8;&#x66F4;&#xFF08;change&#xFF09;</strong>&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x672C;&#x7AE0;&#x6240;&#x8981;&#x8BB2;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x4E09;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x53D8;&#x66F4;&#x590D;&#x5236;&#x7B97;&#x6CD5;&#xFF1A;<strong>&#x5355;&#x9886;&#x5BFC;&#x8005;&#xFF08;single leader&#xFF09;</strong>&#xFF0C;<strong>&#x591A;&#x9886;&#x5BFC;&#x8005;&#xFF08;multi leader&#xFF09;</strong>&#x548C;<strong>&#x65E0;&#x9886;&#x5BFC;&#x8005;&#xFF08;leaderless&#xFF09;</strong>&#x3002;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x4F7F;&#x7528;&#x8FD9;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x590D;&#x5236;&#x65F6;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8BB8;&#x591A;&#x6743;&#x8861;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x590D;&#x5236;&#x8FD8;&#x662F;&#x5F02;&#x6B65;&#x590D;&#x5236;&#xFF1F;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5931;&#x8D25;&#x7684;&#x526F;&#x672C;&#xFF1F;&#x8FD9;&#x4E9B;&#x901A;&#x5E38;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x914D;&#x7F6E;&#x9009;&#x9879;&#xFF0C;&#x7EC6;&#x8282;&#x56E0;&#x6570;&#x636E;&#x5E93;&#x800C;&#x5F02;&#xFF0C;&#x4F46;&#x539F;&#x7406;&#x5728;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#x90FD;&#x7C7B;&#x4F3C;&#x3002;&#x672C;&#x7AE0;&#x4F1A;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x51B3;&#x7B56;&#x7684;&#x540E;&#x679C;&#x3002;</p>
<p>&#x200B;    &#x6570;&#x636E;&#x5E93;&#x7684;&#x590D;&#x5236;&#x7B97;&#x5F97;&#x4E0A;&#x662F;&#x8001;&#x751F;&#x5E38;&#x8C08;&#x4E86; &#x2014;&#x2014;70&#x5E74;&#x4EE3;&#x7814;&#x7A76;&#x5F97;&#x51FA;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#x81F3;&#x4ECA;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x53D8;&#x5316;&#x3010;1&#x3011;&#xFF0C;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x7684;&#x57FA;&#x672C;&#x7EA6;&#x675F;&#x4ECD;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x7136;&#x800C;&#x5728;&#x7814;&#x7A76;&#x4E4B;&#x5916;&#xFF0C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4ECD;&#x7136;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x53D8;&#x4E3A;&#x4E3B;&#x6D41;&#x53EA;&#x662F;&#x6700;&#x8FD1;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x3002;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x8FD9;&#x4E00;&#x9886;&#x57DF;&#x7684;&#x65B0;&#x624B;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x8BF8;&#x5982; <strong>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF08;eventual consistency&#xFF09;</strong> &#x7B49;&#x95EE;&#x9898;&#x5B58;&#x5728;&#x8BB8;&#x591A;&#x8BEF;&#x89E3;&#x3002;&#x5728;&#x201C;<a href="#&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;">&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;</a>&#x201D;&#x4E00;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x66F4;&#x52A0;&#x7CBE;&#x786E;&#x5730;&#x4E86;&#x89E3;&#x6700;&#x7EC8;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x8BA8;&#x8BBA;&#x8BF8;&#x5982; <strong>&#x8BFB;&#x5DF1;&#x4E4B;&#x5199;&#xFF08;read-your-writes&#xFF09;</strong> &#x548C; <strong>&#x5355;&#x8C03;&#x8BFB;&#xFF08;monotonic read&#xFF09;</strong> &#x4FDD;&#x8BC1;&#x7B49;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="&#x9886;&#x5BFC;&#x8005;&#x4E0E;&#x8FFD;&#x968F;&#x8005;">&#x9886;&#x5BFC;&#x8005;&#x4E0E;&#x8FFD;&#x968F;&#x8005;</h2>
<p>&#x200B;    &#x5B58;&#x50A8;&#x6570;&#x636E;&#x5E93;&#x526F;&#x672C;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x79F0;&#x4E3A; <strong>&#x526F;&#x672C;&#xFF08;replica&#xFF09;</strong> &#x3002;&#x5F53;&#x5B58;&#x5728;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x65F6;&#xFF0C;&#x4F1A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x51FA;&#x73B0;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x4F55;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x843D;&#x5728;&#x4E86;&#x6240;&#x6709;&#x7684;&#x526F;&#x672C;&#x4E0A;&#xFF1F;</p>
<p>&#x200B;    &#x6BCF;&#x4E00;&#x6B21;&#x5411;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x90FD;&#x9700;&#x8981;&#x4F20;&#x64AD;&#x5230;&#x6240;&#x6709;&#x526F;&#x672C;&#x4E0A;&#xFF0C;&#x5426;&#x5219;&#x526F;&#x672C;&#x5C31;&#x4F1A;&#x5305;&#x542B;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x6570;&#x636E;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x88AB;&#x79F0;&#x4E3A; <strong>&#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#xFF08;leader-based replication&#xFF09;</strong> &#xFF08;&#x4E5F;&#x79F0; <strong>&#x4E3B;&#x52A8;/&#x88AB;&#x52A8;&#xFF08;active/passive&#xFF09;</strong> &#x6216; <strong>&#x4E3B;/&#x4ECE;&#xFF08;master/slave&#xFF09;</strong> &#x590D;&#x5236;&#xFF09;&#xFF0C;&#x5982;<a href="#fig5-1.png">&#x56FE;5-1</a>&#x6240;&#x793A;&#x3002;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x526F;&#x672C;&#x4E4B;&#x4E00;&#x88AB;&#x6307;&#x5B9A;&#x4E3A; <strong>&#x9886;&#x5BFC;&#x8005;&#xFF08;leader&#xFF09;</strong>&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A; <strong>&#x4E3B;&#x5E93;&#xFF08;master|primary&#xFF09;</strong> &#x3002;&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x8981;&#x5411;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x5C06;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x7ED9;<strong>&#x9886;&#x5BFC;&#x8005;</strong>&#xFF0C;&#x9886;&#x5BFC;&#x8005;&#x4F1A;&#x5C06;&#x65B0;&#x6570;&#x636E;&#x5199;&#x5165;&#x5176;&#x672C;&#x5730;&#x5B58;&#x50A8;&#x3002;</li>
<li>&#x5176;&#x4ED6;&#x526F;&#x672C;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x8FFD;&#x968F;&#x8005;&#xFF08;followers&#xFF09;</strong>&#xFF0C;&#x4EA6;&#x79F0;&#x4E3A;<strong>&#x53EA;&#x8BFB;&#x526F;&#x672C;&#xFF08;read replicas&#xFF09;</strong>&#xFF0C;<strong>&#x4ECE;&#x5E93;&#xFF08;slaves&#xFF09;</strong>&#xFF0C;<strong>&#x5907;&#x5E93;&#xFF08; sencondaries&#xFF09;</strong>&#xFF0C;<strong>&#x70ED;&#x5907;&#xFF08;hot-standby&#xFF09;</strong><sup><a href="#fn_i" id="reffn_i">i</a></sup>&#x3002;&#x6BCF;&#x5F53;&#x9886;&#x5BFC;&#x8005;&#x5C06;&#x65B0;&#x6570;&#x636E;&#x5199;&#x5165;&#x672C;&#x5730;&#x5B58;&#x50A8;&#x65F6;&#xFF0C;&#x5B83;&#x4E5F;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x53D1;&#x9001;&#x7ED9;&#x6240;&#x6709;&#x7684;&#x8FFD;&#x968F;&#x8005;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x590D;&#x5236;&#x65E5;&#x5FD7;&#xFF08;replication log&#xFF09;</strong>&#x8BB0;&#x5F55;&#x6216;<strong>&#x53D8;&#x66F4;&#x6D41;&#xFF08;change stream&#xFF09;</strong>&#x3002;&#x6BCF;&#x4E2A;&#x8DDF;&#x968F;&#x8005;&#x4ECE;&#x9886;&#x5BFC;&#x8005;&#x62C9;&#x53D6;&#x65E5;&#x5FD7;&#xFF0C;&#x5E76;&#x76F8;&#x5E94;&#x66F4;&#x65B0;&#x5176;&#x672C;&#x5730;&#x6570;&#x636E;&#x5E93;&#x526F;&#x672C;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x6309;&#x7167;&#x9886;&#x5BFC;&#x8005;&#x5904;&#x7406;&#x7684;&#x76F8;&#x540C;&#x987A;&#x5E8F;&#x5E94;&#x7528;&#x6240;&#x6709;&#x5199;&#x5165;&#x3002;</li>
<li>&#x5F53;&#x5BA2;&#x6237;&#x60F3;&#x8981;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5411;&#x9886;&#x5BFC;&#x8005;&#x6216;&#x8FFD;&#x968F;&#x8005;&#x67E5;&#x8BE2;&#x3002; &#x4F46;&#x53EA;&#x6709;&#x9886;&#x5BFC;&#x8005;&#x624D;&#x80FD;&#x63A5;&#x53D7;&#x5199;&#x64CD;&#x4F5C;&#xFF08;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x4ECE;&#x5E93;&#x90FD;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF09;&#x3002;</li>
</ol>
<blockquote id="fn_i">
<sup>i</sup>. &#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x5BF9; <strong>&#x70ED;&#xFF08;hot&#xFF09;</strong>&#xFF0C;<strong>&#x6E29;&#xFF08;warm&#xFF09;</strong>&#xFF0C;<strong>&#x51B7;&#xFF08;cold&#xFF09;</strong> &#x5907;&#x4EFD;&#x670D;&#x52A1;&#x5668;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x5B9A;&#x4E49;&#x3002; &#x4F8B;&#x5982;&#x5728;PostgreSQL&#x4E2D;&#xFF0C;<strong>&#x70ED;&#x5907;&#xFF08;hot standby&#xFF09;</strong> &#x6307;&#x7684;&#x662F;&#x80FD;&#x63A5;&#x53D7;&#x5BA2;&#x6237;&#x7AEF;&#x8BFB;&#x8BF7;&#x6C42;&#x7684;&#x526F;&#x672C;&#x3002;&#x800C; <strong>&#x6E29;&#x5907;&#xFF08;warm standby&#xFF09;</strong> &#x53EA;&#x662F;&#x8FFD;&#x968F;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x4F46;&#x4E0D;&#x5904;&#x7406;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4EFB;&#x4F55;&#x67E5;&#x8BE2;&#x3002; &#x5C31;&#x672C;&#x4E66;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DEE;&#x5F02;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;<a href="#reffn_i" title="Jump back to footnote [i] in the text."> &#x21A9;</a>
</blockquote>
<p><img src="img/fig5-1.png" alt="">
<strong>&#x56FE;5-1 &#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;(&#x4E3B;-&#x4ECE;)&#x7684;&#x590D;&#x5236;</strong></p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x590D;&#x5236;&#x6A21;&#x5F0F;&#x662F;&#x8BB8;&#x591A;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5185;&#x7F6E;&#x529F;&#x80FD;&#xFF0C;&#x5982;PostgreSQL&#xFF08;&#x4ECE;9.0&#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF09;&#xFF0C;MySQL&#xFF0C;Oracle Data Guard &#x3010;2&#x3011;&#x548C;SQL Server&#x7684;AlwaysOn&#x53EF;&#x7528;&#x6027;&#x7EC4;&#x3010;3&#x3011;&#x3002; &#x5B83;&#x4E5F;&#x88AB;&#x7528;&#x4E8E;&#x4E00;&#x4E9B;&#x975E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5305;&#x62EC;MongoDB&#xFF0C;RethinkDB&#x548C;Espresso &#x3010;4&#x3011;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#x5E76;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#xFF1A;&#x50CF;Kafka &#x3010;5&#x3011;&#x548C;RabbitMQ&#x9AD8;&#x53EF;&#x7528;&#x961F;&#x5217;&#x3010;6&#x3011;&#x8FD9;&#x6837;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6D88;&#x606F;&#x4EE3;&#x7406;&#x4E5F;&#x4F7F;&#x7528;&#x5B83;&#x3002; &#x67D0;&#x4E9B;&#x7F51;&#x7EDC;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F8B;&#x5982;DRBD&#x8FD9;&#x6837;&#x7684;&#x5757;&#x590D;&#x5236;&#x8BBE;&#x5907;&#x4E5F;&#x4E0E;&#x4E4B;&#x7C7B;&#x4F3C;&#x3002;</p>
<h3 id="&#x540C;&#x6B65;&#x590D;&#x5236;&#x4E0E;&#x5F02;&#x6B65;&#x590D;&#x5236;">&#x540C;&#x6B65;&#x590D;&#x5236;&#x4E0E;&#x5F02;&#x6B65;&#x590D;&#x5236;</h3>
<p>&#x200B;    &#x590D;&#x5236;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7EC6;&#x8282;&#x662F;&#xFF1A;&#x590D;&#x5236;&#x662F; <strong>&#x540C;&#x6B65;&#xFF08;synchronously&#xFF09;</strong> &#x53D1;&#x751F;&#x8FD8;&#x662F; <strong>&#x5F02;&#x6B65;&#xFF08;asynchronously&#xFF09;</strong> &#x53D1;&#x751F;&#x3002; &#xFF08;&#x5728;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x9879;&#xFF0C;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x786C;&#x7F16;&#x7801;&#x4E3A;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x60F3;&#x8C61;<a href="fig5-1.png">&#x56FE;5-1</a>&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x7F51;&#x7AD9;&#x7684;&#x7528;&#x6237;&#x66F4;&#x65B0;&#x4ED6;&#x4EEC;&#x7684;&#x4E2A;&#x4EBA;&#x5934;&#x50CF;&#x3002;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x5BA2;&#x6237;&#x5411;&#x4E3B;&#x5E93;&#x53D1;&#x9001;&#x66F4;&#x65B0;&#x8BF7;&#x6C42;&#xFF1B;&#x4E0D;&#x4E45;&#x4E4B;&#x540E;&#x4E3B;&#x5E93;&#x5C31;&#x6536;&#x5230;&#x4E86;&#x8BF7;&#x6C42;&#x3002;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#xFF0C;&#x4E3B;&#x5E93;&#x53C8;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x8F6C;&#x53D1;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x4ECE;&#x5E93;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x4E3B;&#x5E93;&#x901A;&#x77E5;&#x5BA2;&#x6237;&#x66F4;&#x65B0;&#x6210;&#x529F;&#x3002;</p>
<p><a href="img/fig5-2.png">&#x56FE;5-2</a>&#x663E;&#x793A;&#x4E86;&#x7CFB;&#x7EDF;&#x5404;&#x4E2A;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#xFF1A;&#x7528;&#x6237;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4E3B;&#x5E93;&#x548C;&#x4E24;&#x4E2A;&#x4ECE;&#x5E93;&#x3002;&#x65F6;&#x95F4;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x6D41;&#x52A8;&#x3002;&#x8BF7;&#x6C42;&#x6216;&#x54CD;&#x5E94;&#x6D88;&#x606F;&#x7528;&#x7C97;&#x7BAD;&#x5934;&#x8868;&#x793A;&#x3002;</p>
<p><img src="img/fig5-2.png" alt="">
<strong>&#x56FE;5-2 &#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#xFF1A;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x4ECE;&#x5E93;&#x548C;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x4ECE;&#x5E93;</strong></p>
<p>&#x200B;    &#x5728;<a href="">&#x56FE;5-2</a>&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x4ECE;&#x5E93;1&#x7684;&#x590D;&#x5236;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF1A;&#x5728;&#x5411;&#x7528;&#x6237;&#x62A5;&#x544A;&#x5199;&#x5165;&#x6210;&#x529F;&#xFF0C;&#x5E76;&#x4F7F;&#x7ED3;&#x679C;&#x5BF9;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x53EF;&#x89C1;&#x4E4B;&#x524D;&#xFF0C;&#x4E3B;&#x5E93;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x4ECE;&#x5E93;1&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x786E;&#x4FDD;&#x4ECE;&#x5E93;1&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x3002;&#x4EE5;&#x53CA;&#x5728;&#x4F7F;&#x5199;&#x5165;&#x5BF9;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x89C1;&#x4E4B;&#x524D;&#x63A5;&#x6536;&#x5230;&#x5199;&#x5165;&#x3002;&#x8DDF;&#x968F;&#x8005;2&#x7684;&#x590D;&#x5236;&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF1A;&#x4E3B;&#x5E93;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x4F46;&#x4E0D;&#x7B49;&#x5F85;&#x4ECE;&#x5E93;&#x7684;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8FD9;&#x5E45;&#x56FE;&#x4E2D;&#xFF0C;&#x4ECE;&#x5E93;2&#x5904;&#x7406;&#x6D88;&#x606F;&#x524D;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x590D;&#x5236;&#x7684;&#x901F;&#x5EA6;&#x76F8;&#x5F53;&#x5FEB;&#xFF1A;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x80FD;&#x5728;&#x4E00;&#x79D2;&#x5411;&#x4ECE;&#x5E93;&#x5E94;&#x7528;&#x53D8;&#x66F4;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x63D0;&#x4F9B;&#x590D;&#x5236;&#x7528;&#x65F6;&#x7684;&#x4FDD;&#x8BC1;&#x3002;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ECE;&#x5E93;&#x53EF;&#x80FD;&#x843D;&#x540E;&#x4E3B;&#x5E93;&#x51E0;&#x5206;&#x949F;&#x6216;&#x66F4;&#x4E45;&#xFF1B;&#x4F8B;&#x5982;&#xFF1A;&#x4ECE;&#x5E93;&#x6B63;&#x5728;&#x4ECE;&#x6545;&#x969C;&#x4E2D;&#x6062;&#x590D;&#xFF0C;&#x7CFB;&#x7EDF;&#x5728;&#x6700;&#x5927;&#x5BB9;&#x91CF;&#x9644;&#x8FD1;&#x8FD0;&#x884C;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x8282;&#x70B9;&#x95F4;&#x5B58;&#x5728;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x200B;    &#x540C;&#x6B65;&#x590D;&#x5236;&#x7684;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x4ECE;&#x5E93;&#x4FDD;&#x8BC1;&#x6709;&#x4E0E;&#x4E3B;&#x5E93;&#x4E00;&#x81F4;&#x7684;&#x6700;&#x65B0;&#x6570;&#x636E;&#x526F;&#x672C;&#x3002;&#x5982;&#x679C;&#x4E3B;&#x5E93;&#x7A81;&#x7136;&#x5931;&#x6548;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x4FE1;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4ECD;&#x7136;&#x80FD;&#x5728;&#x4ECE;&#x5E93;&#x4E0A;&#x4E0A;&#x627E;&#x5230;&#x3002;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x6B65;&#x4ECE;&#x5E93;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF08;&#x6BD4;&#x5982;&#x5B83;&#x5DF2;&#x7ECF;&#x5D29;&#x6E83;&#xFF0C;&#x6216;&#x8005;&#x51FA;&#x73B0;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#xFF0C;&#x6216;&#x5176;&#x5B83;&#x4EFB;&#x4F55;&#x539F;&#x56E0;&#xFF09;&#xFF0C;&#x4E3B;&#x5E93;&#x5C31;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x3002;&#x4E3B;&#x5E93;&#x5FC5;&#x987B;&#x963B;&#x6B62;&#x6240;&#x6709;&#x5199;&#x5165;&#xFF0C;&#x5E76;&#x7B49;&#x5F85;&#x540C;&#x6B65;&#x526F;&#x672C;&#x518D;&#x6B21;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;&#x5C06;&#x6240;&#x6709;&#x4ECE;&#x5E93;&#x90FD;&#x8BBE;&#x7F6E;&#x4E3A;&#x540C;&#x6B65;&#x7684;&#x662F;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x7684;&#xFF1A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x4E2D;&#x65AD;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x505C;&#x6EDE;&#x4E0D;&#x524D;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x542F;&#x7528;&#x540C;&#x6B65;&#x590D;&#x5236;&#xFF0C;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x5176;&#x4E2D;<strong>&#x4E00;&#x4E2A;</strong>&#x8DDF;&#x968F;&#x8005;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x7684;&#x5219;&#x662F;&#x5F02;&#x6B65;&#x7684;&#x3002;&#x5982;&#x679C;&#x540C;&#x6B65;&#x4ECE;&#x5E93;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x7528;&#x6216;&#x7F13;&#x6162;&#xFF0C;&#x5219;&#x4F7F;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x4ECE;&#x5E93;&#x540C;&#x6B65;&#x3002;&#x8FD9;&#x4FDD;&#x8BC1;&#x4F60;&#x81F3;&#x5C11;&#x5728;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x62E5;&#x6709;&#x6700;&#x65B0;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#xFF1A;&#x4E3B;&#x5E93;&#x548C;&#x540C;&#x6B65;&#x4ECE;&#x5E93;&#x3002; &#x8FD9;&#x79CD;&#x914D;&#x7F6E;&#x6709;&#x65F6;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A; <strong>&#x534A;&#x540C;&#x6B65;&#xFF08;semi-synchronous&#xFF09;</strong>&#x3010;7&#x3011;&#x3002;</p>
<p>&#x200B;    &#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#x90FD;&#x914D;&#x7F6E;&#x4E3A;&#x5B8C;&#x5168;&#x5F02;&#x6B65;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4E3B;&#x5E93;&#x5931;&#x6548;&#x4E14;&#x4E0D;&#x53EF;&#x6062;&#x590D;&#xFF0C;&#x5219;&#x4EFB;&#x4F55;&#x5C1A;&#x672A;&#x590D;&#x5236;&#x7ED9;&#x4ECE;&#x5E93;&#x7684;&#x5199;&#x5165;&#x90FD;&#x4F1A;&#x4E22;&#x5931;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x5373;&#x4F7F;&#x5DF2;&#x7ECF;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x786E;&#x8BA4;&#x6210;&#x529F;&#xFF0C;&#x5199;&#x5165;&#x4E5F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1; <strong>&#x6301;&#x4E45;&#xFF08;Durable&#xFF09;</strong> &#x3002; &#x7136;&#x800C;&#xFF0C;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x5F02;&#x6B65;&#x7684;&#x914D;&#x7F6E;&#x4E5F;&#x6709;&#x4F18;&#x70B9;&#xFF1A;&#x5373;&#x4F7F;&#x6240;&#x6709;&#x7684;&#x4ECE;&#x5E93;&#x90FD;&#x843D;&#x540E;&#x4E86;&#xFF0C;&#x4E3B;&#x5E93;&#x4E5F;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x5199;&#x5165;&#x3002;</p>
<p>&#x200B;    &#x5F31;&#x5316;&#x7684;&#x6301;&#x4E45;&#x6027;&#x53EF;&#x80FD;&#x542C;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x574F;&#x7684;&#x6298;&#x8877;&#xFF0C;&#x7136;&#x800C;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x5DF2;&#x7ECF;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x4E86;&#xFF0C;&#x7279;&#x522B;&#x5F53;&#x6709;&#x5F88;&#x591A;&#x8FFD;&#x968F;&#x8005;&#xFF0C;&#x6216;&#x8FFD;&#x968F;&#x8005;&#x5F02;&#x5730;&#x5206;&#x5E03;&#x65F6;&#x3002; &#x7A0D;&#x540E;&#x5C06;&#x5728;&#x201C;<a href="#&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;">&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;</a>&#x201D;&#x4E2D;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<blockquote>
<h3 id="&#x5173;&#x4E8E;&#x590D;&#x5236;&#x7684;&#x7814;&#x7A76;">&#x5173;&#x4E8E;&#x590D;&#x5236;&#x7684;&#x7814;&#x7A76;</h3>
<p>&#x5BF9;&#x4E8E;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x7CFB;&#x7EDF;&#x800C;&#x8A00;&#xFF0C;&#x4E3B;&#x5E93;&#x6545;&#x969C;&#x65F6;&#x6709;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x4E25;&#x91CD;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x6B64;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x4ECD;&#x5728;&#x7814;&#x7A76;&#x4E0D;&#x4E22;&#x6570;&#x636E;&#x4F46;&#x4ECD;&#x80FD;&#x63D0;&#x4F9B;&#x826F;&#x597D;&#x6027;&#x80FD;&#x548C;&#x53EF;&#x7528;&#x6027;&#x7684;&#x590D;&#x5236;&#x65B9;&#x6CD5;&#x3002; &#x4F8B;&#x5982;&#xFF0C;<strong>&#x94FE;&#x5F0F;&#x590D;&#x5236;</strong>&#x3010;8,9&#x3011;]&#x662F;&#x540C;&#x6B65;&#x590D;&#x5236;&#x7684;&#x4E00;&#x79CD;&#x53D8;&#x4F53;&#xFF0C;&#x5DF2;&#x7ECF;&#x5728;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;Microsoft Azure&#x5B58;&#x50A8;&#x3010;10,11&#x3011;&#xFF09;&#x4E2D;&#x6210;&#x529F;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x590D;&#x5236;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x4E0E;<strong>&#x5171;&#x8BC6;&#xFF08;consensus&#xFF09;</strong>&#xFF08;&#x4F7F;&#x51E0;&#x4E2A;&#x8282;&#x70B9;&#x5C31;&#x67D0;&#x4E2A;&#x503C;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#xFF09;&#x4E4B;&#x95F4;&#x6709;&#x7740;&#x5BC6;&#x5207;&#x7684;&#x8054;&#x7CFB;&#xFF0C;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x5C06;&#x8BE6;&#x7EC6;&#x5730;&#x63A2;&#x8BA8;&#x8FD9;&#x4E00;&#x9886;&#x57DF;&#x7684;&#x7406;&#x8BBA;&#x3002;&#x672C;&#x7AE0;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x5B9E;&#x8DF5;&#x4E2D;&#x6570;&#x636E;&#x5E93;&#x5E38;&#x7528;&#x7684;&#x7B80;&#x5355;&#x590D;&#x5236;&#x5F62;&#x5F0F;&#x3002;</p>
</blockquote>
<h3 id="&#x8BBE;&#x7F6E;&#x65B0;&#x4ECE;&#x5E93;">&#x8BBE;&#x7F6E;&#x65B0;&#x4ECE;&#x5E93;</h3>
<p>&#x200B;    &#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4ECE;&#x5E93;&#xFF1A;&#x4E5F;&#x8BB8;&#x662F;&#x4E3A;&#x4E86;&#x589E;&#x52A0;&#x526F;&#x672C;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x6216;&#x66FF;&#x6362;&#x5931;&#x8D25;&#x7684;&#x8282;&#x70B9;&#x3002;&#x5982;&#x4F55;&#x786E;&#x4FDD;&#x65B0;&#x7684;&#x4ECE;&#x5E93;&#x62E5;&#x6709;&#x4E3B;&#x5E93;&#x6570;&#x636E;&#x7684;&#x7CBE;&#x786E;&#x526F;&#x672C;&#xFF1F;</p>
<p>&#x200B;    &#x7B80;&#x5355;&#x5730;&#x5C06;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4ECE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x901A;&#x5E38;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x65AD;&#x5411;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x6570;&#x636E;&#x603B;&#x662F;&#x5728;&#x4E0D;&#x65AD;&#x53D8;&#x5316;&#xFF0C;&#x6807;&#x51C6;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#x4F1A;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x603B;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x590D;&#x5236;&#x7684;&#x7ED3;&#x679C;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x610F;&#x4E49;&#x3002;</p>
<p>&#x200B;    &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9501;&#x5B9A;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x4F7F;&#x5176;&#x4E0D;&#x53EF;&#x7528;&#x4E8E;&#x5199;&#x5165;&#xFF09;&#x6765;&#x4F7F;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4F1A;&#x8FDD;&#x80CC;&#x9AD8;&#x53EF;&#x7528;&#x7684;&#x76EE;&#x6807;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x62C9;&#x8D77;&#x65B0;&#x7684;&#x4ECE;&#x5E93;&#x901A;&#x5E38;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x505C;&#x673A;&#x3002;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x8BB2;&#xFF0C;&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<ol>
<li>&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x83B7;&#x53D6;&#x4E3B;&#x5E93;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x5FEB;&#x7167;&#xFF08;&#x5982;&#x679C;&#x53EF;&#x80FD;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x9501;&#x5B9A;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x5177;&#x6709;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x662F;&#x5907;&#x4EFD;&#x5FC5;&#x9700;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x573A;&#x666F;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7B2C;&#x4E09;&#x65B9;&#x5DE5;&#x5177;&#xFF0C;&#x4F8B;&#x5982;MySQL&#x7684;innobackupex &#x3010;12&#x3011;&#x3002;</li>
<li>&#x5C06;&#x5FEB;&#x7167;&#x590D;&#x5236;&#x5230;&#x65B0;&#x7684;&#x4ECE;&#x5E93;&#x8282;&#x70B9;&#x3002;</li>
<li>&#x4ECE;&#x5E93;&#x8FDE;&#x63A5;&#x5230;&#x4E3B;&#x5E93;&#xFF0C;&#x5E76;&#x62C9;&#x53D6;&#x5FEB;&#x7167;&#x4E4B;&#x540E;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x3002;&#x8FD9;&#x8981;&#x6C42;&#x5FEB;&#x7167;&#x4E0E;&#x4E3B;&#x5E93;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x7CBE;&#x786E;&#x5173;&#x8054;&#x3002;&#x8BE5;&#x4F4D;&#x7F6E;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x540D;&#x79F0;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;PostgreSQL&#x5C06;&#x5176;&#x79F0;&#x4E3A; <strong>&#x65E5;&#x5FD7;&#x5E8F;&#x5217;&#x53F7;&#xFF08;log sequence number, LSN&#xFF09;</strong>&#xFF0C;MySQL&#x5C06;&#x5176;&#x79F0;&#x4E3A; <strong>&#x4E8C;&#x8FDB;&#x5236;&#x65E5;&#x5FD7;&#x5750;&#x6807;&#xFF08;binlog coordinates&#xFF09;</strong>&#x3002;</li>
<li>&#x5F53;&#x4ECE;&#x5E93;&#x5904;&#x7406;&#x5B8C;&#x5FEB;&#x7167;&#x4E4B;&#x540E;&#x79EF;&#x538B;&#x7684;&#x6570;&#x636E;&#x53D8;&#x66F4;&#xFF0C;&#x6211;&#x4EEC;&#x8BF4;&#x5B83; <strong>&#x8D76;&#x4E0A;&#xFF08;caught up&#xFF09;</strong> &#x4E86;&#x4E3B;&#x5E93;&#x3002;&#x73B0;&#x5728;&#x5B83;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x4E3B;&#x5E93;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#x53D8;&#x5316;&#x4E86;&#x3002;</li>
</ol>
<p>&#x5EFA;&#x7ACB;&#x4ECE;&#x5E93;&#x7684;&#x5B9E;&#x9645;&#x6B65;&#x9AA4;&#x56E0;&#x6570;&#x636E;&#x5E93;&#x800C;&#x5F02;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x5B8C;&#x5168;&#x81EA;&#x52A8;&#x5316;&#x7684;&#xFF0C;&#x800C;&#x5728;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x9700;&#x8981;&#x7531;&#x7BA1;&#x7406;&#x5458;&#x624B;&#x52A8;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x6709;&#x70B9;&#x795E;&#x79D8;&#x7684;&#x591A;&#x6B65;&#x9AA4;&#x5DE5;&#x4F5C;&#x6D41;&#x3002;</p>
<h3 id="&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;">&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;</h3>
<p>&#x200B;    &#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x8282;&#x70B9;&#x90FD;&#x53EF;&#x80FD;&#x5B95;&#x673A;&#xFF0C;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x610F;&#x5916;&#x7684;&#x6545;&#x969C;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x7531;&#x4E8E;&#x8BA1;&#x5212;&#x5185;&#x7684;&#x7EF4;&#x62A4;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x91CD;&#x542F;&#x673A;&#x5668;&#x4EE5;&#x5B89;&#x88C5;&#x5185;&#x6838;&#x5B89;&#x5168;&#x8865;&#x4E01;&#xFF09;&#x3002;&#x5BF9;&#x8FD0;&#x7EF4;&#x800C;&#x8A00;&#xFF0C;&#x80FD;&#x5728;&#x7CFB;&#x7EDF;&#x4E0D;&#x4E2D;&#x65AD;&#x670D;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x91CD;&#x542F;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x597D;&#x5904;&#x591A;&#x591A;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x4E2A;&#x522B;&#x8282;&#x70B9;&#x5931;&#x6548;&#xFF0C;&#x4E5F;&#x80FD;&#x4FDD;&#x6301;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x5C3D;&#x53EF;&#x80FD;&#x63A7;&#x5236;&#x8282;&#x70B9;&#x505C;&#x673A;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x4F55;&#x901A;&#x8FC7;&#x57FA;&#x4E8E;&#x4E3B;&#x5E93;&#x7684;&#x590D;&#x5236;&#x5B9E;&#x73B0;&#x9AD8;&#x53EF;&#x7528;&#xFF1F;</p>
<h4 id="&#x4ECE;&#x5E93;&#x5931;&#x6548;&#xFF1A;&#x8FFD;&#x8D76;&#x6062;&#x590D;">&#x4ECE;&#x5E93;&#x5931;&#x6548;&#xFF1A;&#x8FFD;&#x8D76;&#x6062;&#x590D;</h4>
<p>&#x200B;    &#x5728;&#x5176;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E2A;&#x4ECE;&#x5E93;&#x8BB0;&#x5F55;&#x4ECE;&#x4E3B;&#x5E93;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x3002;&#x5982;&#x679C;&#x4ECE;&#x5E93;&#x5D29;&#x6E83;&#x5E76;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x4E3B;&#x5E93;&#x548C;&#x4ECE;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x6682;&#x65F6;&#x4E2D;&#x65AD;&#xFF0C;&#x5219;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x6062;&#x590D;&#xFF1A;&#x4ECE;&#x5E93;&#x53EF;&#x4EE5;&#x4ECE;&#x65E5;&#x5FD7;&#x4E2D;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x53D1;&#x751F;&#x6545;&#x969C;&#x4E4B;&#x524D;&#x5904;&#x7406;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ECE;&#x5E93;&#x53EF;&#x4EE5;&#x8FDE;&#x63A5;&#x5230;&#x4E3B;&#x5E93;&#xFF0C;&#x5E76;&#x8BF7;&#x6C42;&#x5728;&#x4ECE;&#x5E93;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x65F6;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x3002;&#x5F53;&#x5E94;&#x7528;&#x5B8C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x540E;&#xFF0C;&#x5B83;&#x5C31;&#x8D76;&#x4E0A;&#x4E86;&#x4E3B;&#x5E93;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x7EE7;&#x7EED;&#x63A5;&#x6536;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x6D41;&#x3002;</p>
<h4 id="&#x4E3B;&#x5E93;&#x5931;&#x6548;&#xFF1A;&#x6545;&#x969C;&#x5207;&#x6362;">&#x4E3B;&#x5E93;&#x5931;&#x6548;&#xFF1A;&#x6545;&#x969C;&#x5207;&#x6362;</h4>
<p>&#x200B;    &#x4E3B;&#x5E93;&#x5931;&#x6548;&#x5904;&#x7406;&#x8D77;&#x6765;&#x76F8;&#x5F53;&#x68D8;&#x624B;&#xFF1A;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x4ECE;&#x5E93;&#x9700;&#x8981;&#x88AB;&#x63D0;&#x5347;&#x4E3A;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#xFF0C;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x53D1;&#x9001;&#x7ED9;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#xFF0C;&#x5176;&#x4ED6;&#x4ECE;&#x5E93;&#x9700;&#x8981;&#x5F00;&#x59CB;&#x62C9;&#x53D6;&#x6765;&#x81EA;&#x65B0;&#x4E3B;&#x5E93;&#x7684;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6545;&#x969C;&#x5207;&#x6362;&#xFF08;failover&#xFF09;</strong>&#x3002;</p>
<p>&#x200B;    &#x6545;&#x969C;&#x5207;&#x6362;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x8FDB;&#x884C;&#xFF08;&#x901A;&#x77E5;&#x7BA1;&#x7406;&#x5458;&#x4E3B;&#x5E93;&#x6302;&#x4E86;&#xFF0C;&#x5E76;&#x91C7;&#x53D6;&#x5FC5;&#x8981;&#x7684;&#x6B65;&#x9AA4;&#x6765;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#xFF09;&#x6216;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x3002;&#x81EA;&#x52A8;&#x6545;&#x969C;&#x5207;&#x6362;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x7531;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#x7EC4;&#x6210;&#xFF1A;</p>
<ol>
<li>&#x786E;&#x8BA4;&#x4E3B;&#x5E93;&#x5931;&#x6548;&#x3002;&#x6709;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x9519;&#xFF1A;&#x5D29;&#x6E83;&#xFF0C;&#x505C;&#x7535;&#xFF0C;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x7B49;&#x7B49;&#x3002;&#x6CA1;&#x6709;&#x4E07;&#x65E0;&#x4E00;&#x5931;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x68C0;&#x6D4B;&#x51FA;&#x73B0;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x4F7F;&#x7528; <strong>&#x8D85;&#x65F6;&#xFF08;Timeout&#xFF09;</strong> &#xFF1A;&#x8282;&#x70B9;&#x9891;&#x7E41;&#x5730;&#x76F8;&#x4E92;&#x6765;&#x56DE;&#x4F20;&#x9012;&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF08;&#x4F8B;&#x5982;30&#x79D2;&#xFF09;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF0C;&#x5C31;&#x8BA4;&#x4E3A;&#x5B83;&#x6302;&#x4E86;&#xFF08;&#x56E0;&#x4E3A;&#x8BA1;&#x5212;&#x5185;&#x7EF4;&#x62A4;&#x800C;&#x6545;&#x610F;&#x5173;&#x95ED;&#x4E3B;&#x5E93;&#x4E0D;&#x7B97;&#xFF09;&#x3002;</li>
<li>&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9009;&#x4E3E;&#x8FC7;&#x7A0B;&#xFF08;&#x4E3B;&#x5E93;&#x7531;&#x5269;&#x4F59;&#x526F;&#x672C;&#x4EE5;&#x591A;&#x6570;&#x9009;&#x4E3E;&#x4EA7;&#x751F;&#xFF09;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x7531;&#x4E4B;&#x524D;&#x9009;&#x5B9A;&#x7684;<strong>&#x63A7;&#x5236;&#x5668;&#x8282;&#x70B9;&#xFF08;controller node&#xFF09;</strong>&#x6765;&#x6307;&#x5B9A;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#x3002;&#x4E3B;&#x5E93;&#x7684;&#x6700;&#x4F73;&#x4EBA;&#x9009;&#x901A;&#x5E38;&#x662F;&#x62E5;&#x6709;&#x65E7;&#x4E3B;&#x5E93;&#x6700;&#x65B0;&#x6570;&#x636E;&#x526F;&#x672C;&#x7684;&#x4ECE;&#x5E93;&#xFF08;&#x6700;&#x5C0F;&#x5316;&#x6570;&#x636E;&#x635F;&#x5931;&#xFF09;&#x3002;&#x8BA9;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x540C;&#x610F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;<strong>&#x5171;&#x8BC6;</strong>&#x95EE;&#x9898;&#xFF0C;&#x5C06;&#x5728;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x3002;</li>
<li>&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x7CFB;&#x7EDF;&#x4EE5;&#x542F;&#x7528;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x73B0;&#x5728;&#x9700;&#x8981;&#x5C06;&#x5B83;&#x4EEC;&#x7684;&#x5199;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x7ED9;&#x65B0;&#x4E3B;&#x5E93;&#xFF08;&#x5C06;&#x5728;&#x201C;<a href="ch6.html#&#x8BF7;&#x6C42;&#x8DEF;&#x7531;">&#x8BF7;&#x6C42;&#x8DEF;&#x7531;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF09;&#x3002;&#x5982;&#x679C;&#x8001;&#x9886;&#x5BFC;&#x56DE;&#x6765;&#xFF0C;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x4E3B;&#x5E93;&#xFF0C;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x5176;&#x4ED6;&#x526F;&#x672C;&#x5DF2;&#x7ECF;&#x8BA9;&#x5B83;&#x4E0B;&#x53F0;&#x4E86;&#x3002;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x8001;&#x9886;&#x5BFC;&#x8BA4;&#x53EF;&#x65B0;&#x9886;&#x5BFC;&#xFF0C;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x4ECE;&#x5E93;&#x3002;</li>
</ol>
<p>&#x6545;&#x969C;&#x5207;&#x6362;&#x4F1A;&#x51FA;&#x73B0;&#x5F88;&#x591A;&#x5927;&#x9EBB;&#x70E6;&#xFF1A;</p>
<ul>
<li><p>&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5F02;&#x6B65;&#x590D;&#x5236;&#xFF0C;&#x5219;&#x65B0;&#x4E3B;&#x5E93;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x8001;&#x4E3B;&#x5E93;&#x5B95;&#x673A;&#x524D;&#x6700;&#x540E;&#x7684;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x9009;&#x51FA;&#x65B0;&#x4E3B;&#x5E93;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x8001;&#x4E3B;&#x5E93;&#x91CD;&#x65B0;&#x52A0;&#x5165;&#x96C6;&#x7FA4;&#xFF0C;&#x65B0;&#x4E3B;&#x5E93;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x53EF;&#x80FD;&#x4F1A;&#x6536;&#x5230;&#x51B2;&#x7A81;&#x7684;&#x5199;&#x5165;&#xFF0C;&#x90A3;&#x8FD9;&#x4E9B;&#x5199;&#x5165;&#x8BE5;&#x5982;&#x4F55;&#x5904;&#x7406;&#xFF1F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x7B80;&#x5355;&#x4E22;&#x5F03;&#x8001;&#x4E3B;&#x5E93;&#x672A;&#x590D;&#x5236;&#x7684;&#x5199;&#x5165;&#xFF0C;&#x8FD9;&#x5F88;&#x53EF;&#x80FD;&#x6253;&#x7834;&#x5BA2;&#x6237;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x6301;&#x4E45;&#x6027;&#x7684;&#x671F;&#x671B;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x9700;&#x8981;&#x548C;&#x5176;&#x4ED6;&#x5916;&#x90E8;&#x5B58;&#x50A8;&#x76F8;&#x534F;&#x8C03;&#xFF0C;&#x90A3;&#x4E48;&#x4E22;&#x5F03;&#x5199;&#x5165;&#x5185;&#x5BB9;&#x662F;&#x6781;&#x5176;&#x5371;&#x9669;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#x5728;GitHub &#x3010;13&#x3011;&#x7684;&#x4E00;&#x573A;&#x4E8B;&#x6545;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x8FC7;&#x65F6;&#x7684;MySQL&#x4ECE;&#x5E93;&#x88AB;&#x63D0;&#x5347;&#x4E3A;&#x4E3B;&#x5E93;&#x3002;&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x81EA;&#x589E;ID&#x4F5C;&#x4E3A;&#x4E3B;&#x952E;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x4E3B;&#x5E93;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x843D;&#x540E;&#x4E8E;&#x8001;&#x4E3B;&#x5E93;&#x7684;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x6240;&#x4EE5;&#x65B0;&#x4E3B;&#x5E93;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x4E86;&#x4E00;&#x4E9B;&#x5DF2;&#x7ECF;&#x88AB;&#x8001;&#x4E3B;&#x5E93;&#x5206;&#x914D;&#x6389;&#x7684;ID&#x4F5C;&#x4E3A;&#x4E3B;&#x952E;&#x3002;&#x8FD9;&#x4E9B;&#x4E3B;&#x952E;&#x4E5F;&#x5728;Redis&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x4E3B;&#x952E;&#x91CD;&#x7528;&#x4F7F;&#x5F97;MySQL&#x548C;Redis&#x4E2D;&#x6570;&#x636E;&#x4EA7;&#x751F;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x6700;&#x540E;&#x5BFC;&#x81F4;&#x4E00;&#x4E9B;&#x79C1;&#x6709;&#x6570;&#x636E;&#x6CC4;&#x6F0F;&#x5230;&#x9519;&#x8BEF;&#x7684;&#x7528;&#x6237;&#x624B;&#x4E2D;&#x3002;</p>
</li>
<li><p>&#x53D1;&#x751F;&#x67D0;&#x4E9B;&#x6545;&#x969C;&#x65F6;&#xFF08;&#x89C1;<a href="ch8.html">&#x7B2C;8&#x7AE0;</a>&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4EE5;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x4E3B;&#x5E93;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x79F0;&#x4E3A; <strong>&#x8111;&#x88C2;(split brain)</strong>&#xFF0C;&#x975E;&#x5E38;&#x5371;&#x9669;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E3B;&#x5E93;&#x90FD;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x673A;&#x5236;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;">&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;</a>&#x201D;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x5C31;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#x6216;&#x635F;&#x574F;&#x3002;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x91C7;&#x53D6;&#x4E86;&#x5B89;&#x5168;&#x9632;&#x8303;&#x63AA;&#x65BD;&#xFF1A;&#x5F53;&#x68C0;&#x6D4B;&#x5230;&#x4E24;&#x4E2A;&#x4E3B;&#x5E93;&#x8282;&#x70B9;&#x540C;&#x65F6;&#x5B58;&#x5728;&#x65F6;&#x4F1A;&#x5173;&#x95ED;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x8282;&#x70B9;<sup><a href="#fn_ii" id="reffn_ii">ii</a></sup>&#xFF0C;&#x4F46;&#x8BBE;&#x8BA1;&#x7C97;&#x7CD9;&#x7684;&#x673A;&#x5236;&#x53EF;&#x80FD;&#x6700;&#x540E;&#x4F1A;&#x5BFC;&#x81F4;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x88AB;&#x5173;&#x95ED;&#x3010;14&#x3011;&#x3002;</p>
<blockquote id="fn_ii">
<sup>ii</sup>. &#x8FD9;&#x79CD;&#x673A;&#x5236;&#x79F0;&#x4E3A; <strong>&#x5C4F;&#x853D;&#xFF08;fencing&#xFF09;</strong>&#xFF0C;&#x5145;&#x6EE1;&#x611F;&#x60C5;&#x7684;&#x672F;&#x8BED;&#x662F;&#xFF1A;<strong>&#x7206;&#x5F7C;&#x4E4B;&#x5934;&#xFF08;Shoot The Other Node In The Head, STONITH&#xFF09;</strong>&#x3002;<a href="#reffn_ii" title="Jump back to footnote [ii] in the text."> &#x21A9;</a>
</blockquote>
</li>
<li><p>&#x4E3B;&#x5E93;&#x88AB;&#x5BA3;&#x544A;&#x6B7B;&#x4EA1;&#x4E4B;&#x524D;&#x7684;&#x6B63;&#x786E;&#x8D85;&#x65F6;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x914D;&#x7F6E;&#xFF1F;&#x5728;&#x4E3B;&#x5E93;&#x5931;&#x6548;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x4E5F;&#x8D8A;&#x957F;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8D85;&#x65F6;&#x8BBE;&#x7F6E;&#x592A;&#x77ED;&#xFF0C;&#x53C8;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x6545;&#x969C;&#x5207;&#x6362;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E34;&#x65F6;&#x8D1F;&#x8F7D;&#x5CF0;&#x503C;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x8282;&#x70B9;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x8D85;&#x65F6;&#xFF0C;&#x6216;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5305;&#x5EF6;&#x8FDF;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x5904;&#x4E8E;&#x9AD8;&#x8D1F;&#x8F7D;&#x6216;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x7684;&#x56F0;&#x6270;&#x4E4B;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x6545;&#x969C;&#x5207;&#x6362;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x60C5;&#x51B5;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#x7CD5;&#x3002;</p>
</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x6CA1;&#x6709;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5373;&#x4F7F;&#x8F6F;&#x4EF6;&#x652F;&#x6301;&#x81EA;&#x52A8;&#x6545;&#x969C;&#x5207;&#x6362;&#xFF0C;&#x4E0D;&#x5C11;&#x8FD0;&#x7EF4;&#x56E2;&#x961F;&#x8FD8;&#x662F;&#x66F4;&#x613F;&#x610F;&#x624B;&#x52A8;&#x6267;&#x884C;&#x6545;&#x969C;&#x5207;&#x6362;&#x3002;</p>
<p>&#x8282;&#x70B9;&#x6545;&#x969C;&#x3001;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7F51;&#x7EDC;&#x3001;&#x5BF9;&#x526F;&#x672C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x6301;&#x4E45;&#x6027;&#xFF0C;&#x53EF;&#x7528;&#x6027;&#x548C;&#x5EF6;&#x8FDF;&#x7684;&#x6743;&#x8861; &#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x3002;<a href="ch8.html">&#x7B2C;8&#x7AE0;</a>&#x548C;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x5C06;&#x66F4;&#x6DF1;&#x5165;&#x5730;&#x8BA8;&#x8BBA;&#x5B83;&#x4EEC;&#x3002;</p>
<h3 id="&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x7684;&#x5B9E;&#x73B0;">&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x7684;&#x5B9E;&#x73B0;</h3>
<p>&#x57FA;&#x4E8E;&#x4E3B;&#x5E93;&#x7684;&#x590D;&#x5236;&#x5E95;&#x5C42;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#xFF1F;&#x5B9E;&#x8DF5;&#x4E2D;&#x6709;&#x597D;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x590D;&#x5236;&#x65B9;&#x5F0F;&#xFF0C;&#x6240;&#x4EE5;&#x5148;&#x7B80;&#x8981;&#x5730;&#x770B;&#x4E00;&#x4E0B;&#x3002;</p>
<h4 id="&#x57FA;&#x4E8E;&#x8BED;&#x53E5;&#x7684;&#x590D;&#x5236;">&#x57FA;&#x4E8E;&#x8BED;&#x53E5;&#x7684;&#x590D;&#x5236;</h4>
<p>&#x200B;    &#x5728;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E3B;&#x5E93;&#x8BB0;&#x5F55;&#x4E0B;&#x5B83;&#x6267;&#x884C;&#x7684;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#xFF08;<strong>&#x8BED;&#x53E5;&#xFF08;statement&#xFF09;</strong>&#xFF09;&#x5E76;&#x5C06;&#x8BE5;&#x8BED;&#x53E5;&#x65E5;&#x5FD7;&#x53D1;&#x9001;&#x7ED9;&#x5176;&#x4ECE;&#x5E93;&#x3002;&#x5BF9;&#x4E8E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x4E2A;<code>INSERT</code>&#xFF0C;<code>UPDATE</code>&#x6216;<code>DELETE</code>&#x8BED;&#x53E5;&#x90FD;&#x88AB;&#x8F6C;&#x53D1;&#x7ED9;&#x6BCF;&#x4E2A;&#x4ECE;&#x5E93;&#xFF0C;&#x6BCF;&#x4E2A;&#x4ECE;&#x5E93;&#x89E3;&#x6790;&#x5E76;&#x6267;&#x884C;&#x8BE5;SQL&#x8BED;&#x53E5;&#xFF0C;&#x5C31;&#x50CF;&#x4ECE;&#x5BA2;&#x6237;&#x7AEF;&#x6536;&#x5230;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x867D;&#x7136;&#x542C;&#x4E0A;&#x53BB;&#x5F88;&#x5408;&#x7406;&#xFF0C;&#x4F46;&#x6709;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x4F1A;&#x641E;&#x7838;&#x8FD9;&#x79CD;&#x590D;&#x5236;&#x65B9;&#x5F0F;&#xFF1A;</p>
<ul>
<li>&#x4EFB;&#x4F55;&#x8C03;&#x7528; <strong>&#x975E;&#x786E;&#x5B9A;&#x6027;&#x51FD;&#x6570;&#xFF08;nondeterministic&#xFF09;</strong> &#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x4E0A;&#x751F;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x503C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;<code>NOW()</code>&#x83B7;&#x53D6;&#x5F53;&#x524D;&#x65E5;&#x671F;&#x65F6;&#x95F4;&#xFF0C;&#x6216;&#x4F7F;&#x7528;<code>RAND()</code>&#x83B7;&#x53D6;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8BED;&#x53E5;&#x4F7F;&#x7528;&#x4E86;<strong>&#x81EA;&#x589E;&#x5217;&#xFF08;auto increment&#xFF09;</strong>&#xFF0C;&#x6216;&#x8005;&#x4F9D;&#x8D56;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x73B0;&#x6709;&#x6570;&#x636E;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;<code>UPDATE ... WHERE &lt;&#x67D0;&#x4E9B;&#x6761;&#x4EF6;&gt;</code>&#xFF09;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5728;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x4E0A;&#x6309;&#x7167;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x5B83;&#x4EEC;&#xFF0C;&#x5426;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x6548;&#x679C;&#x3002;&#x5F53;&#x6709;&#x591A;&#x4E2A;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x65F6;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x9650;&#x5236;&#x3002;</li>
<li>&#x6709;&#x526F;&#x4F5C;&#x7528;&#x7684;&#x8BED;&#x53E5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x89E6;&#x53D1;&#x5668;&#xFF0C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF0C;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x7684;&#x51FD;&#x6570;&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x4E0A;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x9664;&#x975E;&#x526F;&#x4F5C;&#x7528;&#x662F;&#x7EDD;&#x5BF9;&#x786E;&#x5B9A;&#x7684;&#x3002;</li>
</ul>
<p>&#x7684;&#x786E;&#x6709;&#x529E;&#x6CD5;&#x7ED5;&#x5F00;&#x8FD9;&#x4E9B;&#x95EE;&#x9898; &#x2014;&#x2014;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x8BED;&#x53E5;&#x88AB;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x4E3B;&#x5E93;&#x53EF;&#x4EE5;&#x7528;&#x56FA;&#x5B9A;&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x66FF;&#x6362;&#x4EFB;&#x4F55;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x4EE5;&#x4FBF;&#x4ECE;&#x5E93;&#x83B7;&#x5F97;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8FB9;&#x7F18;&#x60C5;&#x51B5;&#x5B9E;&#x5728;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x901A;&#x5E38;&#x4F1A;&#x9009;&#x62E9;&#x5176;&#x4ED6;&#x7684;&#x590D;&#x5236;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x200B;    &#x57FA;&#x4E8E;&#x8BED;&#x53E5;&#x7684;&#x590D;&#x5236;&#x5728;5.1&#x7248;&#x672C;&#x524D;&#x7684;MySQL&#x4E2D;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x76F8;&#x5F53;&#x7D27;&#x51D1;&#xFF0C;&#x73B0;&#x5728;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x8FD8;&#x5728;&#x7528;&#x3002;&#x4F46;&#x73B0;&#x5728;&#x5728;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x8BED;&#x53E5;&#x4E2D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;MySQL&#x4F1A;&#x5207;&#x6362;&#x5230;&#x57FA;&#x4E8E;&#x884C;&#x7684;&#x590D;&#x5236;&#xFF08;&#x7A0D;&#x540E;&#x8BA8;&#x8BBA;&#xFF09;&#x3002; VoltDB&#x4F7F;&#x7528;&#x4E86;&#x57FA;&#x4E8E;&#x8BED;&#x53E5;&#x7684;&#x590D;&#x5236;&#xFF0C;&#x4F46;&#x8981;&#x6C42;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x662F;&#x786E;&#x5B9A;&#x6027;&#x7684;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x3010;15&#x3011;&#x3002;</p>
<h4 id="&#x4F20;&#x8F93;&#x9884;&#x5199;&#x5F0F;&#x65E5;&#x5FD7;&#xFF08;wal&#xFF09;">&#x4F20;&#x8F93;&#x9884;&#x5199;&#x5F0F;&#x65E5;&#x5FD7;&#xFF08;WAL&#xFF09;</h4>
<p>&#x5728;<a href="ch3.html">&#x7B2C;3&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5982;&#x4F55;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x8868;&#x793A;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#xFF0C;&#x901A;&#x5E38;&#x5199;&#x64CD;&#x4F5C;&#x90FD;&#x662F;&#x8FFD;&#x52A0;&#x5230;&#x65E5;&#x5FD7;&#x4E2D;&#xFF1A;</p>
<ul>
<li>&#x5BF9;&#x4E8E;&#x65E5;&#x5FD7;&#x7ED3;&#x6784;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#SSTables&#x548C;LSM&#x6811;">SSTables&#x548C;LSM&#x6811;</a>&#x201D;&#xFF09;&#xFF0C;&#x65E5;&#x5FD7;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x5B58;&#x50A8;&#x4F4D;&#x7F6E;&#x3002;&#x65E5;&#x5FD7;&#x6BB5;&#x5728;&#x540E;&#x53F0;&#x538B;&#x7F29;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x8986;&#x5199;&#x5355;&#x4E2A;&#x78C1;&#x76D8;&#x5757;&#x7684;<a href="ch3.html#B&#x6811;">B&#x6811;</a>&#xFF0C;&#x6BCF;&#x6B21;&#x4FEE;&#x6539;&#x90FD;&#x4F1A;&#x5148;&#x5199;&#x5165; <strong>&#x9884;&#x5199;&#x5F0F;&#x65E5;&#x5FD7;&#xFF08;Write Ahead Log, WAL&#xFF09;</strong>&#xFF0C;&#x4EE5;&#x4FBF;&#x5D29;&#x6E83;&#x540E;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#x5230;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;&#x3002;</li>
</ul>
<p>&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65E5;&#x5FD7;&#x90FD;&#x662F;&#x5305;&#x542B;&#x6240;&#x6709;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x7684;&#x4EC5;&#x8FFD;&#x52A0;&#x5B57;&#x8282;&#x5E8F;&#x5217;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x65E5;&#x5FD7;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x6784;&#x5EFA;&#x526F;&#x672C;&#xFF1A;&#x9664;&#x4E86;&#x5C06;&#x65E5;&#x5FD7;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x4E4B;&#x5916;&#xFF0C;&#x4E3B;&#x5E93;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x7ED9;&#x5176;&#x4ECE;&#x5E93;&#x3002;</p>
<p>&#x200B;    &#x5F53;&#x4ECE;&#x5E93;&#x5E94;&#x7528;&#x8FD9;&#x4E2A;&#x65E5;&#x5FD7;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x5EFA;&#x7ACB;&#x548C;&#x4E3B;&#x5E93;&#x4E00;&#x6A21;&#x4E00;&#x6837;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x526F;&#x672C;&#x3002;</p>
<p>&#x200B;    PostgreSQL&#x548C;Oracle&#x7B49;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x590D;&#x5236;&#x65B9;&#x6CD5;&#x3010;16&#x3011;&#x3002;&#x4E3B;&#x8981;&#x7F3A;&#x70B9;&#x662F;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x7684;&#x6570;&#x636E;&#x975E;&#x5E38;&#x5E95;&#x5C42;&#xFF1A;WAL&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x78C1;&#x76D8;&#x5757;&#x4E2D;&#x7684;&#x54EA;&#x4E9B;&#x5B57;&#x8282;&#x53D1;&#x751F;&#x4E86;&#x66F4;&#x6539;&#x3002;&#x8FD9;&#x4F7F;&#x590D;&#x5236;&#x4E0E;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x7D27;&#x5BC6;&#x8026;&#x5408;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x5176;&#x5B58;&#x50A8;&#x683C;&#x5F0F;&#x4ECE;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x66F4;&#x6539;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x901A;&#x5E38;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x4E3B;&#x5E93;&#x548C;&#x4ECE;&#x5E93;&#x4E0A;&#x8FD0;&#x884C;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x200B;    &#x770B;&#x4E0A;&#x53BB;&#x8FD9;&#x53EF;&#x80FD;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5FAE;&#x5C0F;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x5374;&#x53EF;&#x80FD;&#x5BF9;&#x8FD0;&#x7EF4;&#x4EA7;&#x751F;&#x5DE8;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5982;&#x679C;&#x590D;&#x5236;&#x534F;&#x8BAE;&#x5141;&#x8BB8;&#x4ECE;&#x5E93;&#x4F7F;&#x7528;&#x6BD4;&#x4E3B;&#x5E93;&#x66F4;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x7248;&#x672C;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5148;&#x5347;&#x7EA7;&#x4ECE;&#x5E93;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x6545;&#x969C;&#x5207;&#x6362;&#xFF0C;&#x4F7F;&#x5347;&#x7EA7;&#x540E;&#x7684;&#x8282;&#x70B9;&#x4E4B;&#x4E00;&#x6210;&#x4E3A;&#x65B0;&#x7684;&#x4E3B;&#x5E93;&#xFF0C;&#x4ECE;&#x800C;&#x6267;&#x884C;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x7684;&#x96F6;&#x505C;&#x673A;&#x5347;&#x7EA7;&#x3002;&#x5982;&#x679C;&#x590D;&#x5236;&#x534F;&#x8BAE;&#x4E0D;&#x5141;&#x8BB8;&#x7248;&#x672C;&#x4E0D;&#x5339;&#x914D;&#xFF08;&#x4F20;&#x8F93;WAL&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x5219;&#x6B64;&#x7C7B;&#x5347;&#x7EA7;&#x9700;&#x8981;&#x505C;&#x673A;&#x3002;</p>
<h4 id="&#x903B;&#x8F91;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#xFF08;&#x57FA;&#x4E8E;&#x884C;&#xFF09;">&#x903B;&#x8F91;&#x65E5;&#x5FD7;&#x590D;&#x5236;&#xFF08;&#x57FA;&#x4E8E;&#x884C;&#xFF09;</h4>
<p>&#x200B;    &#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x590D;&#x5236;&#x548C;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65E5;&#x5FD7;&#x683C;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x4ECE;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5185;&#x90E8;&#x5206;&#x79BB;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x79CD;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x88AB;&#x79F0;&#x4E3A;&#x903B;&#x8F91;&#x65E5;&#x5FD7;&#xFF0C;&#x4EE5;&#x5C06;&#x5176;&#x4E0E;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x7684;&#xFF08;&#x7269;&#x7406;&#xFF09;&#x6570;&#x636E;&#x8868;&#x793A;&#x533A;&#x5206;&#x5F00;&#x6765;&#x3002;</p>
<p>&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684;&#x903B;&#x8F91;&#x65E5;&#x5FD7;&#x901A;&#x5E38;&#x662F;&#x4EE5;&#x884C;&#x7684;&#x7C92;&#x5EA6;&#x63CF;&#x8FF0;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x8868;&#x7684;&#x5199;&#x5165;&#x7684;&#x8BB0;&#x5F55;&#x5E8F;&#x5217;&#xFF1A;</p>
<ul>
<li>&#x5BF9;&#x4E8E;&#x63D2;&#x5165;&#x7684;&#x884C;&#xFF0C;&#x65E5;&#x5FD7;&#x5305;&#x542B;&#x6240;&#x6709;&#x5217;&#x7684;&#x65B0;&#x503C;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x5220;&#x9664;&#x7684;&#x884C;&#xFF0C;&#x65E5;&#x5FD7;&#x5305;&#x542B;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x5DF2;&#x5220;&#x9664;&#x7684;&#x884C;&#x3002;&#x901A;&#x5E38;&#x662F;&#x4E3B;&#x952E;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8868;&#x4E0A;&#x6CA1;&#x6709;&#x4E3B;&#x952E;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x8BB0;&#x5F55;&#x6240;&#x6709;&#x5217;&#x7684;&#x65E7;&#x503C;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x66F4;&#x65B0;&#x7684;&#x884C;&#xFF0C;&#x65E5;&#x5FD7;&#x5305;&#x542B;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x66F4;&#x65B0;&#x7684;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;&#x6240;&#x6709;&#x5217;&#x7684;&#x65B0;&#x503C;&#xFF08;&#x6216;&#x81F3;&#x5C11;&#x6240;&#x6709;&#x5DF2;&#x66F4;&#x6539;&#x7684;&#x5217;&#x7684;&#x65B0;&#x503C;&#xFF09;&#x3002;</li>
</ul>
<p>&#x4FEE;&#x6539;&#x591A;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x4F1A;&#x751F;&#x6210;&#x591A;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#xFF0C;&#x540E;&#x9762;&#x8DDF;&#x7740;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x6307;&#x51FA;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x3002; MySQL&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x65E5;&#x5FD7;&#xFF08;&#x5F53;&#x914D;&#x7F6E;&#x4E3A;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x884C;&#x7684;&#x590D;&#x5236;&#x65F6;&#xFF09;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x3010;17&#x3011;&#x3002;</p>
<p>&#x200B;    &#x7531;&#x4E8E;&#x903B;&#x8F91;&#x65E5;&#x5FD7;&#x4E0E;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5185;&#x90E8;&#x5206;&#x79BB;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x66F4;&#x5BB9;&#x6613;&#x5730;&#x4FDD;&#x6301;&#x5411;&#x540E;&#x517C;&#x5BB9;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x9886;&#x5BFC;&#x8005;&#x548C;&#x8DDF;&#x968F;&#x8005;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x751A;&#x81F3;&#x4E0D;&#x540C;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x3002;</p>
<p>&#x200B;    &#x5BF9;&#x4E8E;&#x5916;&#x90E8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x903B;&#x8F91;&#x65E5;&#x5FD7;&#x683C;&#x5F0F;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x89E3;&#x6790;&#x3002;&#x5982;&#x679C;&#x8981;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5185;&#x5BB9;&#x53D1;&#x9001;&#x5230;&#x5916;&#x90E8;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x590D;&#x5236;&#x5230;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x8FDB;&#x884C;&#x79BB;&#x7EBF;&#x5206;&#x6790;&#xFF0C;&#x6216;&#x5EFA;&#x7ACB;&#x81EA;&#x5B9A;&#x4E49;&#x7D22;&#x5F15;&#x548C;&#x7F13;&#x5B58;&#x3010;18&#x3011;&#x3002; &#x8FD9;&#x79CD;&#x6280;&#x672F;&#x88AB;&#x79F0;&#x4E3A; <strong>&#x6570;&#x636E;&#x53D8;&#x66F4;&#x6355;&#x83B7;&#xFF08;change data capture&#xFF09;</strong>&#xFF0C;&#x7B2C;11&#x7AE0;&#x5C06;&#x91CD;&#x65B0;&#x8BB2;&#x5230;&#x5B83;&#x3002;</p>
<h4 id="&#x57FA;&#x4E8E;&#x89E6;&#x53D1;&#x5668;&#x7684;&#x590D;&#x5236;">&#x57FA;&#x4E8E;&#x89E6;&#x53D1;&#x5668;&#x7684;&#x590D;&#x5236;</h4>
<p>&#x200B;    &#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x63CF;&#x8FF0;&#x7684;&#x590D;&#x5236;&#x65B9;&#x6CD5;&#x662F;&#x7531;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x4E0D;&#x6D89;&#x53CA;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x3002;&#x4F46;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x53EA;&#x60F3;&#x590D;&#x5236;&#x6570;&#x636E;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x6216;&#x8005;&#x60F3;&#x4ECE;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x60A8;&#x9700;&#x8981;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x903B;&#x8F91;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;">&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;</a>&#x201D;&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5C06;&#x590D;&#x5236;&#x79FB;&#x52A8;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C42;&#x3002;</p>
<p>&#x200B;    &#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x5982;Oracle Golden Gate &#x3010;19&#x3011;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x5E93;&#x65E5;&#x5FD7;&#xFF0C;&#x4F7F;&#x5F97;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x8BB8;&#x591A;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x81EA;&#x5E26;&#x7684;&#x529F;&#x80FD;&#xFF1A;&#x89E6;&#x53D1;&#x5668;&#x548C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x200B;    &#x89E6;&#x53D1;&#x5668;&#x5141;&#x8BB8;&#x60A8;&#x6CE8;&#x518C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x4E2D;&#x53D1;&#x751F;&#x6570;&#x636E;&#x66F4;&#x6539;&#xFF08;&#x5199;&#x5165;&#x4E8B;&#x52A1;&#xFF09;&#x65F6;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x3002;&#x89E6;&#x53D1;&#x5668;&#x6709;&#x673A;&#x4F1A;&#x5C06;&#x66F4;&#x6539;&#x8BB0;&#x5F55;&#x5230;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x8868;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x5916;&#x90E8;&#x7A0B;&#x5E8F;&#x8BFB;&#x53D6;&#x8FD9;&#x4E2A;&#x8868;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x4EFB;&#x4F55;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5904;&#x7406;&#xFF0C;&#x4F1A;&#x540E;&#x5C06;&#x6570;&#x636E;&#x53D8;&#x66F4;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x53BB;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Databus for Oracle &#x3010;20&#x3011;&#x548C;Bucardo for Postgres &#x3010;21&#x3011;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x5DE5;&#x4F5C;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x57FA;&#x4E8E;&#x89E6;&#x53D1;&#x5668;&#x7684;&#x590D;&#x5236;&#x901A;&#x5E38;&#x6BD4;&#x5176;&#x4ED6;&#x590D;&#x5236;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x5E76;&#x4E14;&#x6BD4;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5185;&#x7F6E;&#x590D;&#x5236;&#x66F4;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x9650;&#x5236;&#x3002;&#x7136;&#x800C;&#x7531;&#x4E8E;&#x5176;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x4ECD;&#x7136;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<h2 id="&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;">&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;</h2>
<p>&#x200B;    &#x5BB9;&#x5FCD;&#x8282;&#x70B9;&#x6545;&#x969C;&#x53EA;&#x662F;&#x9700;&#x8981;&#x590D;&#x5236;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x3002;&#x6B63;&#x5982;&#x5728;<a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;</a>&#x7684;&#x4ECB;&#x7ECD;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#xFF08;&#x5904;&#x7406;&#x6BD4;&#x5355;&#x4E2A;&#x673A;&#x5668;&#x66F4;&#x591A;&#x7684;&#x8BF7;&#x6C42;&#xFF09;&#x548C;&#x5EF6;&#x8FDF;&#xFF08;&#x8BA9;&#x526F;&#x672C;&#x5728;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x4E0A;&#x66F4;&#x63A5;&#x8FD1;&#x7528;&#x6237;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x57FA;&#x4E8E;&#x4E3B;&#x5E93;&#x7684;&#x590D;&#x5236;&#x8981;&#x6C42;&#x6240;&#x6709;&#x5199;&#x5165;&#x90FD;&#x7531;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x53EA;&#x8BFB;&#x67E5;&#x8BE2;&#x53EF;&#x4EE5;&#x7531;&#x4EFB;&#x4F55;&#x526F;&#x672C;&#x5904;&#x7406;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x8BFB;&#x591A;&#x5199;&#x5C11;&#x7684;&#x573A;&#x666F;&#xFF08;Web&#x4E0A;&#x7684;&#x5E38;&#x89C1;&#x6A21;&#x5F0F;&#xFF09;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x9009;&#x62E9;&#x662F;&#x521B;&#x5EFA;&#x5F88;&#x591A;&#x4ECE;&#x5E93;&#xFF0C;&#x5E76;&#x5C06;&#x8BFB;&#x8BF7;&#x6C42;&#x5206;&#x6563;&#x5230;&#x6240;&#x6709;&#x7684;&#x4ECE;&#x5E93;&#x4E0A;&#x53BB;&#x3002;&#x8FD9;&#x6837;&#x80FD;&#x51CF;&#x5C0F;&#x4E3B;&#x5E93;&#x7684;&#x8D1F;&#x8F7D;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x5411;&#x6700;&#x8FD1;&#x7684;&#x526F;&#x672C;&#x53D1;&#x9001;&#x8BFB;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8FD9;&#x79CD;&#x4F38;&#x7F29;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x53EA;&#x9700;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x8FFD;&#x968F;&#x8005;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x53EA;&#x8BFB;&#x8BF7;&#x6C42;&#x7684;&#x670D;&#x52A1;&#x5BB9;&#x91CF;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x9002;&#x7528;&#x4E8E;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x2014;&#x2014;&#x5982;&#x679C;&#x5C1D;&#x8BD5;&#x540C;&#x6B65;&#x590D;&#x5236;&#x5230;&#x6240;&#x6709;&#x8FFD;&#x968F;&#x8005;&#xFF0C;&#x5219;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x6545;&#x969C;&#x6216;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x5C06;&#x4F7F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x5199;&#x5165;&#x3002;&#x800C;&#x4E14;&#x8D8A;&#x591A;&#x7684;&#x8282;&#x70B9;&#x8D8A;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5173;&#x95ED;&#xFF0C;&#x6240;&#x4EE5;&#x5B8C;&#x5168;&#x540C;&#x6B65;&#x7684;&#x914D;&#x7F6E;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4ECE;&#x5F02;&#x6B65;&#x4ECE;&#x5E93;&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x4ECE;&#x5E93;&#x843D;&#x540E;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x8FC7;&#x65F6;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x51FA;&#x73B0;&#x660E;&#x663E;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#xFF1A;&#x540C;&#x65F6;&#x5BF9;&#x4E3B;&#x5E93;&#x548C;&#x4ECE;&#x5E93;&#x6267;&#x884C;&#x76F8;&#x540C;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x56E0;&#x4E3A;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x5199;&#x5165;&#x90FD;&#x53CD;&#x6620;&#x5728;&#x4ECE;&#x5E93;&#x4E2D;&#x3002;&#x8FD9;&#x79CD;&#x4E0D;&#x4E00;&#x81F4;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6682;&#x65F6;&#x7684;&#x72B6;&#x6001;&#x2014;&#x2014;&#x5982;&#x679C;&#x505C;&#x6B62;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x5E76;&#x7B49;&#x5F85;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4ECE;&#x5E93;&#x6700;&#x7EC8;&#x4F1A;&#x8D76;&#x4E0A;&#x5E76;&#x4E0E;&#x4E3B;&#x5E93;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x8FD9;&#x79CD;&#x6548;&#x5E94;&#x88AB;&#x79F0;&#x4E3A; <strong>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF08;eventually consistency&#xFF09;</strong><sup><a href="#fn_iii" id="reffn_iii">iii</a></sup>&#x3010;22,23&#x3011;</p>
<blockquote id="fn_iii">
<sup>iii</sup>. &#x9053;&#x683C;&#x62C9;&#x65AF;&#xB7;&#x7279;&#x91CC;&#xFF08;Douglas Terry&#xFF09;&#x7B49;&#x4EBA;&#x521B;&#x9020;&#x4E86;&#x672F;&#x8BED;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x3002; &#x3010;24&#x3011; &#x5E76;&#x7ECF;&#x7531;Werner Vogels &#x3010;22&#x3011;&#x63A8;&#x5E7F;&#xFF0C;&#x6210;&#x4E3A;&#x8BB8;&#x591A;NoSQL&#x9879;&#x76EE;&#x7684;&#x53E3;&#x53F7;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x4E0D;&#x53EA;&#x6709;NoSQL&#x6570;&#x636E;&#x5E93;&#x662F;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x7684;&#xFF1A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x8FFD;&#x968F;&#x8005;&#x4E5F;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7279;&#x6027;&#x3002;<a href="#reffn_iii" title="Jump back to footnote [iii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x201C;&#x6700;&#x7EC8;&#x201D;&#x4E00;&#x8BCD;&#x6545;&#x610F;&#x542B;&#x7CCA;&#x4E0D;&#x6E05;&#xFF1A;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x526F;&#x672C;&#x843D;&#x540E;&#x7684;&#x7A0B;&#x5EA6;&#x662F;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x7684;&#x3002;&#x5728;&#x6B63;&#x5E38;&#x7684;&#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;<strong>&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#xFF08;replication lag&#xFF09;</strong>&#xFF0C;&#x5373;&#x5199;&#x5165;&#x4E3B;&#x5E93;&#x5230;&#x53CD;&#x6620;&#x81F3;&#x4ECE;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x662F;&#x51E0;&#x5206;&#x4E4B;&#x4E00;&#x79D2;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x5E76;&#x4E0D;&#x663E;&#x773C;&#x3002;&#x4F46;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5728;&#x63A5;&#x8FD1;&#x6781;&#x9650;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FD0;&#x884C;&#xFF0C;&#x6216;&#x7F51;&#x7EDC;&#x4E2D;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF0C;&#x5EF6;&#x8FDF;&#x53EF;&#x4EE5;&#x8F7B;&#x800C;&#x6613;&#x4E3E;&#x5730;&#x8D85;&#x8FC7;&#x51E0;&#x79D2;&#xFF0C;&#x751A;&#x81F3;&#x51E0;&#x5206;&#x949F;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x4E3A;&#x6EDE;&#x540E;&#x65F6;&#x95F4;&#x592A;&#x957F;&#x5F15;&#x5165;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x53EF;&#x4E0D;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x8BBA;&#x95EE;&#x9898;&#xFF0C;&#x66F4;&#x662F;&#x5E94;&#x7528;&#x8BBE;&#x8BA1;&#x4E2D;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x771F;&#x5B9E;&#x95EE;&#x9898;&#x3002;&#x672C;&#x8282;&#x5C06;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x4E09;&#x4E2A;&#x7531;&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5E76;&#x7B80;&#x8FF0;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="&#x8BFB;&#x5DF1;&#x4E4B;&#x5199;">&#x8BFB;&#x5DF1;&#x4E4B;&#x5199;</h3>
<p>&#x200B;    &#x8BB8;&#x591A;&#x5E94;&#x7528;&#x8BA9;&#x7528;&#x6237;&#x63D0;&#x4EA4;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x67E5;&#x770B;&#x4ED6;&#x4EEC;&#x63D0;&#x4EA4;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x53EF;&#x80FD;&#x662F;&#x7528;&#x6237;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x5BF9;&#x8BA8;&#x8BBA;&#x4E3B;&#x9898;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x6216;&#x5176;&#x4ED6;&#x7C7B;&#x4F3C;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x63D0;&#x4EA4;&#x65B0;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x7ED9;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x7528;&#x6237;&#x67E5;&#x770B;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x8FFD;&#x968F;&#x8005;&#x8BFB;&#x53D6;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x7ECF;&#x5E38;&#x88AB;&#x67E5;&#x770B;&#xFF0C;&#x4F46;&#x53EA;&#x662F;&#x5076;&#x5C14;&#x5199;&#x5165;&#xFF0C;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x5408;&#x9002;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x5BF9;&#x4E8E;&#x5F02;&#x6B65;&#x590D;&#x5236;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x6765;&#x4E86;&#x3002;&#x5982;<a href="fig5-3.png">&#x56FE;5-3</a>&#x6240;&#x793A;&#xFF1A;&#x5982;&#x679C;&#x7528;&#x6237;&#x5728;&#x5199;&#x5165;&#x540E;&#x9A6C;&#x4E0A;&#x5C31;&#x67E5;&#x770B;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x65B0;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5C1A;&#x672A;&#x5230;&#x8FBE;&#x526F;&#x672C;&#x3002;&#x5BF9;&#x7528;&#x6237;&#x800C;&#x8A00;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x662F;&#x521A;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x4E22;&#x5931;&#x4E86;&#xFF0C;&#x7528;&#x6237;&#x4F1A;&#x4E0D;&#x9AD8;&#x5174;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x3002;</p>
<p><img src="img/fig5-3.png" alt=""></p>
<p><strong>&#x56FE;5-3 &#x7528;&#x6237;&#x5199;&#x5165;&#x540E;&#x4ECE;&#x65E7;&#x526F;&#x672C;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3002;&#x9700;&#x8981;&#x5199;&#x540E;&#x8BFB;(read-after-write)&#x7684;&#x4E00;&#x81F4;&#x6027;&#x6765;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;</strong></p>
<p>&#x200B;    &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981; <strong>&#x8BFB;&#x5199;&#x4E00;&#x81F4;&#x6027;&#xFF08;read-after-write consistency&#xFF09;</strong>&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A; <strong>&#x8BFB;&#x5DF1;&#x4E4B;&#x5199;&#x4E00;&#x81F4;&#x6027;&#xFF08;read-your-writes consistency&#xFF09;</strong>&#x3010;24&#x3011;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4FDD;&#x8BC1;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x9875;&#x9762;&#xFF0C;&#x4ED6;&#x4EEC;&#x603B;&#x4F1A;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x63D0;&#x4EA4;&#x7684;&#x4EFB;&#x4F55;&#x66F4;&#x65B0;&#x3002;&#x5B83;&#x4E0D;&#x4F1A;&#x5BF9;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x7684;&#x5199;&#x5165;&#x505A;&#x51FA;&#x627F;&#x8BFA;&#xFF1A;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x7684;&#x66F4;&#x65B0;&#x53EF;&#x80FD;&#x7A0D;&#x7B49;&#x624D;&#x4F1A;&#x770B;&#x5230;&#x3002;&#x5B83;&#x4FDD;&#x8BC1;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x7684;&#x8F93;&#x5165;&#x5DF2;&#x88AB;&#x6B63;&#x786E;&#x4FDD;&#x5B58;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x5728;&#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B9E;&#x73B0;&#x8BFB;&#x540E;&#x4E00;&#x81F4;&#x6027;&#xFF1F;&#x6709;&#x5404;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x91CC;&#x8BF4;&#x4E00;&#x4E9B;&#xFF1A;</p>
<ul>
<li><p>&#x8BFB;&#x7528;&#x6237;<strong>&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x4FEE;&#x6539;&#x8FC7;</strong>&#x7684;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x90FD;&#x4ECE;&#x4E3B;&#x5E93;&#x8BFB;&#xFF1B;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x6709;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x7528;&#x5B9E;&#x9645;&#x67E5;&#x8BE2;&#x5C31;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x7528;&#x6237;&#x662F;&#x5426;&#x4FEE;&#x6539;&#x4E86;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x7528;&#x6237;&#x4E2A;&#x4EBA;&#x8D44;&#x6599;&#x4FE1;&#x606F;&#x901A;&#x5E38;&#x53EA;&#x80FD;&#x7531;&#x7528;&#x6237;&#x672C;&#x4EBA;&#x7F16;&#x8F91;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x7531;&#x5176;&#x4ED6;&#x4EBA;&#x7F16;&#x8F91;&#x3002;&#x56E0;&#x6B64;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x89C4;&#x5219;&#x662F;&#xFF1A;&#x4ECE;&#x4E3B;&#x5E93;&#x8BFB;&#x53D6;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x7684;&#x6863;&#x6848;&#xFF0C;&#x5728;&#x4ECE;&#x5E93;&#x8BFB;&#x53D6;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x7684;&#x6863;&#x6848;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x90FD;&#x53EF;&#x80FD;&#x88AB;&#x7528;&#x6237;&#x7F16;&#x8F91;&#xFF0C;&#x90A3;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5C31;&#x6CA1;&#x7528;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x90FD;&#x5FC5;&#x987B;&#x4ECE;&#x4E3B;&#x5E93;&#x8BFB;&#x53D6;&#xFF08;&#x6269;&#x5BB9;&#x8BFB;&#x5C31;&#x6CA1;&#x6548;&#x679C;&#x4E86;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6807;&#x51C6;&#x6765;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x4ECE;&#x4E3B;&#x5E93;&#x8BFB;&#x53D6;&#x3002;&#x4F8B;&#x5982;&#x53EF;&#x4EE5;&#x8DDF;&#x8E2A;&#x4E0A;&#x6B21;&#x66F4;&#x65B0;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5728;&#x4E0A;&#x6B21;&#x66F4;&#x65B0;&#x540E;&#x7684;&#x4E00;&#x5206;&#x949F;&#x5185;&#xFF0C;&#x4ECE;&#x4E3B;&#x5E93;&#x8BFB;&#x3002;&#x8FD8;&#x53EF;&#x4EE5;&#x76D1;&#x63A7;&#x4ECE;&#x5E93;&#x7684;&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#xFF0C;&#x9632;&#x6B62;&#x5BF9;&#x4EFB;&#x610F;&#x6BD4;&#x4E3B;&#x5E93;&#x6EDE;&#x540E;&#x8D85;&#x8FC7;&#x4E00;&#x5206;&#x949F;&#x7684;&#x4ECE;&#x5E93;&#x53D1;&#x51FA;&#x67E5;&#x8BE2;&#x3002;</p>
</li>
<li><p>&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x8BB0;&#x4F4F;&#x6700;&#x8FD1;&#x4E00;&#x6B21;&#x5199;&#x5165;&#x7684;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x4ECE;&#x5E93;&#x4E3A;&#x8BE5;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x67E5;&#x8BE2;&#x65F6;&#xFF0C;&#x8BE5;&#x65F6;&#x95F4;&#x6233;&#x524D;&#x7684;&#x53D8;&#x66F4;&#x90FD;&#x5DF2;&#x7ECF;&#x4F20;&#x64AD;&#x5230;&#x4E86;&#x672C;&#x4ECE;&#x5E93;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x5F53;&#x524D;&#x4ECE;&#x5E93;&#x4E0D;&#x591F;&#x65B0;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x4ECE;&#x5E93;&#x8BFB;&#xFF0C;&#x6216;&#x8005;&#x7B49;&#x5F85;&#x4ECE;&#x5E93;&#x8FFD;&#x8D76;&#x4E0A;&#x6765;&#x3002;</p>
<p>&#x65F6;&#x95F4;&#x6233;&#x53EF;&#x4EE5;&#x662F;&#x903B;&#x8F91;&#x65F6;&#x95F4;&#x6233;&#xFF08;&#x6307;&#x793A;&#x5199;&#x5165;&#x987A;&#x5E8F;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4F8B;&#x5982;&#x65E5;&#x5FD7;&#x5E8F;&#x5217;&#x53F7;&#xFF09;&#x6216;&#x5B9E;&#x9645;&#x7CFB;&#x7EDF;&#x65F6;&#x949F;&#xFF08;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65F6;&#x949F;&#x540C;&#x6B65;&#x53D8;&#x5F97;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF1B;&#x53C2;&#x9605;&#x201C;<a href="ch8.html#&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x65F6;&#x949F;">&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x65F6;&#x949F;</a>&#x201D;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x60A8;&#x7684;&#x526F;&#x672C;&#x5206;&#x5E03;&#x5728;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF08;&#x51FA;&#x4E8E;&#x53EF;&#x7528;&#x6027;&#x76EE;&#x7684;&#x4E0E;&#x7528;&#x6237;&#x5C3D;&#x91CF;&#x5728;&#x5730;&#x7406;&#x4E0A;&#x63A5;&#x8FD1;&#xFF09;&#xFF0C;&#x5219;&#x4F1A;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;&#x3002;&#x4EFB;&#x4F55;&#x9700;&#x8981;&#x7531;&#x9886;&#x5BFC;&#x8005;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x7684;&#x8BF7;&#x6C42;&#x90FD;&#x5FC5;&#x987B;&#x8DEF;&#x7531;&#x5230;&#x5305;&#x542B;&#x4E3B;&#x5E93;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;</p>
</li>
</ul>
<p>&#x53E6;&#x4E00;&#x79CD;&#x590D;&#x6742;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF1A;&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x4ECE;&#x591A;&#x4E2A;&#x8BBE;&#x5907;&#x8BF7;&#x6C42;&#x670D;&#x52A1;&#xFF0C;&#x4F8B;&#x5982;&#x684C;&#x9762;&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x79FB;&#x52A8;APP&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x80FD;&#x5C31;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x8DE8;&#x8BBE;&#x5907;&#x7684;&#x5199;&#x540E;&#x8BFB;&#x4E00;&#x81F4;&#x6027;&#xFF1A;&#x5982;&#x679C;&#x7528;&#x6237;&#x5728;&#x67D0;&#x4E2A;&#x8BBE;&#x5907;&#x4E0A;&#x8F93;&#x5165;&#x4E86;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x8BBE;&#x5907;&#x4E0A;&#x67E5;&#x770B;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x521A;&#x8F93;&#x5165;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x8BB0;&#x4F4F;&#x7528;&#x6237;&#x4E0A;&#x6B21;&#x66F4;&#x65B0;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x65B9;&#x6CD5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x53F0;&#x8BBE;&#x5907;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x4E0D;&#x77E5;&#x9053;&#x53E6;&#x4E00;&#x53F0;&#x8BBE;&#x5907;&#x4E0A;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x3002;&#x5143;&#x6570;&#x636E;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x5B58;&#x50A8;&#x3002;</li>
<li>&#x5982;&#x679C;&#x526F;&#x672C;&#x5206;&#x5E03;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5F88;&#x96BE;&#x4FDD;&#x8BC1;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x8BBE;&#x5907;&#x7684;&#x8FDE;&#x63A5;&#x4F1A;&#x8DEF;&#x7531;&#x5230;&#x540C;&#x4E00;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002; &#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x53F0;&#x5F0F;&#x8BA1;&#x7B97;&#x673A;&#x4F7F;&#x7528;&#x5BB6;&#x5EAD;&#x5BBD;&#x5E26;&#x8FDE;&#x63A5;&#xFF0C;&#x800C;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4F7F;&#x7528;&#x8702;&#x7A9D;&#x6570;&#x636E;&#x7F51;&#x7EDC;&#xFF0C;&#x5219;&#x8BBE;&#x5907;&#x7684;&#x7F51;&#x7EDC;&#x8DEF;&#x7EBF;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x8BFB;&#x4E3B;&#x5E93;&#xFF0C;&#x53EF;&#x80FD;&#x9996;&#x5148;&#x9700;&#x8981;&#x628A;&#x6765;&#x81EA;&#x540C;&#x4E00;&#x7528;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x8DEF;&#x7531;&#x5230;&#x540C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;</li>
</ul>
<h3 id="&#x5355;&#x8C03;&#x8BFB;">&#x5355;&#x8C03;&#x8BFB;</h3>
<p>&#x200B;    &#x4ECE;&#x5F02;&#x6B65;&#x4ECE;&#x5E93;&#x8BFB;&#x53D6;&#x7B2C;&#x4E8C;&#x4E2A;&#x5F02;&#x5E38;&#x4F8B;&#x5B50;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230; <strong>&#x65F6;&#x5149;&#x5012;&#x6D41;&#xFF08;moving backward in time&#xFF09;</strong>&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x7528;&#x6237;&#x4ECE;&#x4E0D;&#x540C;&#x4ECE;&#x5E93;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x8BFB;&#x53D6;&#xFF0C;&#x5C31;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<a href="img/fig5-4.png">&#x56FE;5-4</a>&#x663E;&#x793A;&#x4E86;&#x7528;&#x6237;2345&#x4E24;&#x6B21;&#x8FDB;&#x884C;&#x76F8;&#x540C;&#x7684;&#x67E5;&#x8BE2;&#xFF0C;&#x9996;&#x5148;&#x67E5;&#x8BE2;&#x4E86;&#x4E00;&#x4E2A;&#x5EF6;&#x8FDF;&#x5F88;&#x5C0F;&#x7684;&#x4ECE;&#x5E93;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x4E00;&#x4E2A;&#x5EF6;&#x8FDF;&#x8F83;&#x5927;&#x7684;&#x4ECE;&#x5E93;&#x3002; &#xFF08;&#x5982;&#x679C;&#x7528;&#x6237;&#x5237;&#x65B0;&#x7F51;&#x9875;&#xFF0C;&#x800C;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x88AB;&#x8DEF;&#x7531;&#x5230;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x3002;&#xFF09;&#x7B2C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x8FD4;&#x56DE;&#x6700;&#x8FD1;&#x7531;&#x7528;&#x6237;1234&#x6DFB;&#x52A0;&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x4F46;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x67E5;&#x8BE2;&#x4E0D;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x56E0;&#x4E3A;&#x6EDE;&#x540E;&#x7684;&#x4ECE;&#x5E93;&#x8FD8;&#x6CA1;&#x6709;&#x62C9;&#x53D6;&#x5199;&#x5165;&#x5185;&#x5BB9;&#x3002;&#x5728;&#x6548;&#x679C;&#x4E0A;&#x76F8;&#x6BD4;&#x7B2C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x67E5;&#x8BE2;&#x662F;&#x5728;&#x66F4;&#x65E9;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x6765;&#x89C2;&#x5BDF;&#x7CFB;&#x7EDF;&#x3002;&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#xFF0C;&#x90A3;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;2345&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053;&#x7528;&#x6237;1234&#x6700;&#x8FD1;&#x6DFB;&#x52A0;&#x4E86;&#x8BC4;&#x8BBA;&#x3002;&#x4F46;&#x5982;&#x679C;&#x7528;&#x6237;2345&#x5148;&#x770B;&#x89C1;&#x7528;&#x6237;1234&#x7684;&#x8BC4;&#x8BBA;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x770B;&#x5230;&#x5B83;&#x6D88;&#x5931;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x7528;&#x6237;2345&#xFF0C;&#x5C31;&#x5F88;&#x8BA9;&#x4EBA;&#x5934;&#x5927;&#x4E86;&#x3002;</p>
<p><img src="img/fig5-4.png" alt=""></p>
<p><strong>&#x56FE;5-4 &#x7528;&#x6237;&#x9996;&#x5148;&#x4ECE;&#x65B0;&#x526F;&#x672C;&#x8BFB;&#x53D6;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x65E7;&#x526F;&#x672C;&#x8BFB;&#x53D6;&#x3002;&#x65F6;&#x5149;&#x5012;&#x6D41;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5355;&#x8C03;&#x7684;&#x8BFB;&#x53D6;&#x3002;</strong></p>
<p>&#x200B;    <strong>&#x5355;&#x8C03;&#x8BFB;&#xFF08;Monotonic reads&#xFF09;</strong>&#x3010;23&#x3011;&#x4FDD;&#x8BC1;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6BD4; <strong>&#x5F3A;&#x4E00;&#x81F4;&#x6027;&#xFF08;strong consistency&#xFF09;</strong> &#x66F4;&#x5F31;&#xFF0C;&#x4F46;&#x6BD4; <strong>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF08;eventually consistency&#xFF09;</strong> &#x66F4;&#x5F3A;&#x7684;&#x4FDD;&#x8BC1;&#x3002;&#x5F53;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x65E7;&#x503C;&#xFF1B;&#x5355;&#x8C03;&#x8BFB;&#x53D6;&#x4EC5;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x987A;&#x5E8F;&#x5730;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x8BFB;&#x53D6;&#xFF0C;&#x5219;&#x4ED6;&#x4EEC;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x65F6;&#x95F4;&#x540E;&#x9000;&#xFF0C;&#x5373;&#xFF0C;&#x5982;&#x679C;&#x5148;&#x524D;&#x8BFB;&#x53D6;&#x5230;&#x8F83;&#x65B0;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x540E;&#x7EED;&#x8BFB;&#x53D6;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x65E7;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x200B;    &#x5B9E;&#x73B0;&#x5355;&#x8C03;&#x8BFB;&#x53D6;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x662F;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x603B;&#x662F;&#x4ECE;&#x540C;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#xFF08;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x526F;&#x672C;&#x8BFB;&#x53D6;&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x7528;&#x6237;ID&#x7684;&#x6563;&#x5217;&#x6765;&#x9009;&#x62E9;&#x526F;&#x672C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x968F;&#x673A;&#x9009;&#x62E9;&#x526F;&#x672C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x526F;&#x672C;&#x5931;&#x8D25;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x67E5;&#x8BE2;&#x5C06;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x8DEF;&#x7531;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x3002;</p>
<h3 id="&#x4E00;&#x81F4;&#x524D;&#x7F00;&#x8BFB;">&#x4E00;&#x81F4;&#x524D;&#x7F00;&#x8BFB;</h3>
<p>&#x7B2C;&#x4E09;&#x4E2A;&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x4F8B;&#x5B50;&#x8FDD;&#x53CD;&#x4E86;&#x56E0;&#x679C;&#x5F8B;&#x3002; &#x60F3;&#x8C61;&#x4E00;&#x4E0B;Poons&#x5148;&#x751F;&#x548C;Cake&#x592B;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4EE5;&#x4E0B;&#x7B80;&#x77ED;&#x5BF9;&#x8BDD;&#xFF1A;</p>
<blockquote>
<p><em>Mr. Poons</em>
&#x200B;    Mrs. Cake&#xFF0C;&#x4F60;&#x80FD;&#x770B;&#x5230;&#x591A;&#x8FDC;&#x7684;&#x672A;&#x6765;&#xFF1F;</p>
<p><em>Mrs. Cake</em>
&#x200B;    &#x901A;&#x5E38;&#x7EA6;&#x5341;&#x79D2;&#x949F;&#xFF0C;Mr. Poons. </p>
</blockquote>
<p>&#x8FD9;&#x4E24;&#x53E5;&#x8BDD;&#x4E4B;&#x95F4;&#x6709;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#xFF1A;Cake&#x592B;&#x4EBA;&#x542C;&#x5230;&#x4E86;Poons&#x5148;&#x751F;&#x7684;&#x95EE;&#x9898;&#x5E76;&#x56DE;&#x7B54;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x200B;    &#x73B0;&#x5728;&#xFF0C;&#x60F3;&#x8C61;&#x7B2C;&#x4E09;&#x4E2A;&#x4EBA;&#x6B63;&#x5728;&#x901A;&#x8FC7;&#x4ECE;&#x5E93;&#x6765;&#x542C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8BDD;&#x3002; Cake&#x592B;&#x4EBA;&#x8BF4;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x5EF6;&#x8FDF;&#x5F88;&#x4F4E;&#x7684;&#x4ECE;&#x5E93;&#x8BFB;&#x53D6;&#x7684;&#xFF0C;&#x4F46;Poons&#x5148;&#x751F;&#x6240;&#x8BF4;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4ECE;&#x5E93;&#x7684;&#x5EF6;&#x8FDF;&#x8981;&#x5927;&#x7684;&#x591A;&#xFF08;&#x89C1;<a href="img/fig5-5.png">&#x56FE;5-5</a>&#xFF09;&#x3002; &#x4E8E;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x89C2;&#x5BDF;&#x8005;&#x4F1A;&#x542C;&#x5230;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<blockquote>
<p><em>Mrs. Cake</em>
&#x200B;    &#x901A;&#x5E38;&#x7EA6;&#x5341;&#x79D2;&#x949F;&#xFF0C;Mr. Poons. </p>
<p><em>Mr. Poons</em>
&#x200B;    Mrs. Cake&#xFF0C;&#x4F60;&#x80FD;&#x770B;&#x5230;&#x591A;&#x8FDC;&#x7684;&#x672A;&#x6765;&#xFF1F;</p>
</blockquote>
<p>&#x5BF9;&#x4E8E;&#x89C2;&#x5BDF;&#x8005;&#x6765;&#x8BF4;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;Cake&#x592B;&#x4EBA;&#x5728;Poons&#x5148;&#x751F;&#x53D1;&#x95EE;&#x524D;&#x5C31;&#x56DE;&#x7B54;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;
 &#x8FD9;&#x79CD;&#x8D85;&#x80FD;&#x529B;&#x8BA9;&#x4EBA;&#x5370;&#x8C61;&#x6DF1;&#x523B;&#xFF0C;&#x4F46;&#x4E5F;&#x4F1A;&#x628A;&#x4EBA;&#x641E;&#x7CCA;&#x6D82;&#x3002;&#x3010;25&#x3011;&#x3002;</p>
<p><img src="img/fig5-5.png" alt=""></p>
<p><strong>&#x56FE;5-5 &#x5982;&#x679C;&#x67D0;&#x4E9B;&#x5206;&#x533A;&#x7684;&#x590D;&#x5236;&#x901F;&#x5EA6;&#x6162;&#x4E8E;&#x5176;&#x4ED6;&#x5206;&#x533A;&#xFF0C;&#x90A3;&#x4E48;&#x89C2;&#x5BDF;&#x8005;&#x5728;&#x770B;&#x5230;&#x95EE;&#x9898;&#x4E4B;&#x524D;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x7B54;&#x6848;&#x3002;</strong></p>
<p>&#x200B;    &#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#xFF0C;&#x9700;&#x8981;&#x53E6;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x4FDD;&#x8BC1;&#xFF1A;<strong>&#x4E00;&#x81F4;&#x524D;&#x7F00;&#x8BFB;&#xFF08;consistent prefix reads&#xFF09;</strong>&#x3010;23&#x3011;&#x3002; &#x8FD9;&#x4E2A;&#x4FDD;&#x8BC1;&#x8BF4;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x7CFB;&#x5217;&#x5199;&#x5165;&#x6309;&#x67D0;&#x4E2A;&#x987A;&#x5E8F;&#x53D1;&#x751F;&#xFF0C;&#x90A3;&#x4E48;&#x4EFB;&#x4F55;&#x4EBA;&#x8BFB;&#x53D6;&#x8FD9;&#x4E9B;&#x5199;&#x5165;&#x65F6;&#xFF0C;&#x4E5F;&#x4F1A;&#x770B;&#x89C1;&#x5B83;&#x4EEC;&#x4EE5;&#x540C;&#x6837;&#x7684;&#x987A;&#x5E8F;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x662F;<strong>&#x5206;&#x533A;&#xFF08;partitioned&#xFF09;</strong>&#xFF08;<strong>&#x5206;&#x7247;&#xFF08;sharded&#xFF09;</strong>&#xFF09;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x95EE;&#x9898;&#xFF0C;&#x5C06;&#x5728;&#x7B2C;6&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x603B;&#x662F;&#x4EE5;&#x76F8;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x5E94;&#x7528;&#x5199;&#x5165;&#xFF0C;&#x5219;&#x8BFB;&#x53D6;&#x603B;&#x662F;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x524D;&#x7F00;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x4F46;&#x662F;&#x5728;&#x8BB8;&#x591A;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x533A;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x5B58;&#x5728;<strong>&#x5168;&#x5C40;&#x5199;&#x5165;&#x987A;&#x5E8F;</strong>&#xFF1A;&#x5F53;&#x7528;&#x6237;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x6570;&#x636E;&#x5E93;&#x7684;&#x67D0;&#x4E9B;&#x90E8;&#x5206;&#x5904;&#x4E8E;&#x8F83;&#x65E7;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x67D0;&#x4E9B;&#x5904;&#x4E8E;&#x8F83;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x200B;    &#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#xFF0C;&#x786E;&#x4FDD;&#x4EFB;&#x4F55;&#x56E0;&#x679C;&#x76F8;&#x5173;&#x7684;&#x5199;&#x5165;&#x90FD;&#x5199;&#x5165;&#x76F8;&#x540C;&#x7684;&#x5206;&#x533A;&#x3002;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x65E0;&#x6CD5;&#x9AD8;&#x6548;&#x5B8C;&#x6210;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x663E;&#x5F0F;&#x8DDF;&#x8E2A;&#x56E0;&#x679C;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x672C;&#x4E66;&#x5C06;&#x5728;&#x201C;&#x5173;&#x7CFB;&#x4E0E;&#x5E76;&#x53D1;&#x201D;&#x4E00;&#x8282;&#x4E2D;&#x8FD4;&#x56DE;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x3002;</p>
<h3 id="&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;">&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</h3>
<p>&#x200B;    &#x5728;&#x4F7F;&#x7528;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x7684;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x589E;&#x52A0;&#x5230;&#x51E0;&#x5206;&#x949F;&#x751A;&#x81F3;&#x51E0;&#x5C0F;&#x65F6;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x5982;&#x679C;&#x7B54;&#x6848;&#x662F;&#x201C;&#x6CA1;&#x95EE;&#x9898;&#x201D;&#xFF0C;&#x90A3;&#x5F88;&#x597D;&#x3002;&#x4F46;&#x5982;&#x679C;&#x7ED3;&#x679C;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x662F;&#x4E0D;&#x597D;&#x4F53;&#x9A8C;&#xFF0C;&#x90A3;&#x4E48;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x6765;&#x63D0;&#x4F9B;&#x66F4;&#x5F3A;&#x7684;&#x4FDD;&#x8BC1;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4F8B;&#x5982;<strong>&#x5199;&#x540E;&#x8BFB;</strong>&#x3002;&#x660E;&#x660E;&#x662F;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x5374;&#x5047;&#x8BBE;&#x590D;&#x5236;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x591A;&#x9EBB;&#x70E6;&#x7684;&#x6839;&#x6E90;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6BD4;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x5E93;&#x66F4;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x4F8B;&#x5982;&#x901A;&#x8FC7;&#x4E3B;&#x5E93;&#x8FDB;&#x884C;&#x67D0;&#x79CD;&#x8BFB;&#x53D6;&#x3002;&#x4F46;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x662F;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x5FAE;&#x5999;&#x7684;&#x590D;&#x5236;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x4FE1;&#x8D56;&#x4ED6;&#x4EEC;&#x7684;&#x6570;&#x636E;&#x5E93;&#x201C;&#x505A;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#x201D;&#xFF0C;&#x90A3;&#x8BE5;&#x591A;&#x597D;&#x5440;&#x3002;&#x8FD9;&#x5C31;&#x662F; <strong>&#x4E8B;&#x52A1;&#xFF08;transaction&#xFF09;</strong> &#x5B58;&#x5728;&#x7684;&#x539F;&#x56E0;&#xFF1A;<strong>&#x6570;&#x636E;&#x5E93;&#x901A;&#x8FC7;&#x4E8B;&#x52A1;&#x63D0;&#x4F9B;&#x5F3A;&#x5927;&#x7684;&#x4FDD;&#x8BC1;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x200B;    &#x5355;&#x8282;&#x70B9;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x3002;&#x7136;&#x800C;&#x5728;&#x8D70;&#x5411;&#x5206;&#x5E03;&#x5F0F;&#xFF08;&#x590D;&#x5236;&#x548C;&#x5206;&#x533A;&#xFF09;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x8BB8;&#x591A;&#x7CFB;&#x7EDF;&#x653E;&#x5F03;&#x4E86;&#x4E8B;&#x52A1;&#x3002;&#x58F0;&#x79F0;&#x4E8B;&#x52A1;&#x5728;&#x6027;&#x80FD;&#x548C;&#x53EF;&#x7528;&#x6027;&#x4E0A;&#x7684;&#x4EE3;&#x4EF7;&#x592A;&#x9AD8;&#xFF0C;&#x5E76;&#x65AD;&#x8A00;&#x5728;&#x53EF;&#x4F38;&#x7F29;&#x7CFB;&#x7EDF;&#x4E2D;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x53D9;&#x8FF0;&#x6709;&#x4E00;&#x4E9B;&#x9053;&#x7406;&#xFF0C;&#x4F46;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x672C;&#x4E66;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x5C06;&#x63D0;&#x51FA;&#x66F4;&#x4E3A;&#x7EC6;&#x81F4;&#x7684;&#x89C2;&#x70B9;&#x3002;&#x7B2C;&#x4E03;&#x7AE0;&#x548C;&#x7B2C;&#x4E5D;&#x7AE0;&#x5C06;&#x56DE;&#x5230;&#x4E8B;&#x52A1;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x5E76;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x66FF;&#x4EE3;&#x673A;&#x5236;&#x3002;</p>
<h2 id="&#x591A;&#x4E3B;&#x590D;&#x5236;">&#x591A;&#x4E3B;&#x590D;&#x5236;</h2>
<p>&#x200B;    &#x672C;&#x7AE0;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#x67B6;&#x6784;&#x3002; &#x867D;&#x7136;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x200B;    &#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x5E93;&#xFF0C;&#x800C;&#x6240;&#x6709;&#x7684;&#x5199;&#x5165;&#x90FD;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x5B83;&#x3002;&#x5982;&#x679C;&#x51FA;&#x4E8E;&#x4EFB;&#x4F55;&#x539F;&#x56E0;&#xFF08;&#x4F8B;&#x5982;&#x548C;&#x4E3B;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4E2D;&#x65AD;&#xFF09;&#x65E0;&#x6CD5;&#x8FDE;&#x63A5;&#x5230;&#x4E3B;&#x5E93;&#xFF0C; &#x5C31;&#x65E0;&#x6CD5;&#x5411;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x3002;</p>
<blockquote id="fn_iv">
<sup>iv</sup>. &#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x88AB;&#x5206;&#x533A;&#xFF08;&#x89C1;&#x7B2C;6&#x7AE0;&#xFF09;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x9886;&#x5BFC;&#x3002; &#x4E0D;&#x540C;&#x7684;&#x5206;&#x533A;&#x53EF;&#x80FD;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x6709;&#x5176;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#x8282;&#x70B9;&#x3002;<a href="#reffn_iv" title="Jump back to footnote [iv] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#x6A21;&#x578B;&#x7684;&#x81EA;&#x7136;&#x5EF6;&#x4F38;&#x662F;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x63A5;&#x53D7;&#x5199;&#x5165;&#x3002; &#x590D;&#x5236;&#x4ECD;&#x7136;&#x4EE5;&#x540C;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#x53D1;&#x751F;&#xFF1A;&#x5904;&#x7406;&#x5199;&#x5165;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x5FC5;&#x987B;&#x5C06;&#x8BE5;&#x6570;&#x636E;&#x66F4;&#x6539;&#x8F6C;&#x53D1;&#x7ED9;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x3002; &#x79F0;&#x4E4B;&#x4E3A;<strong>&#x591A;&#x9886;&#x5BFC;&#x8005;&#x914D;&#x7F6E;</strong>&#xFF08;&#x4E5F;&#x79F0;&#x591A;&#x4E3B;&#x3001;&#x591A;&#x6D3B;&#x590D;&#x5236;&#xFF09;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#x540C;&#x65F6;&#x626E;&#x6F14;&#x5176;&#x4ED6;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x8FFD;&#x968F;&#x8005;&#x3002;</p>
<h3 id="&#x591A;&#x4E3B;&#x590D;&#x5236;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;">&#x591A;&#x4E3B;&#x590D;&#x5236;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;</h3>
<p>&#x200B;    &#x5728;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x90E8;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x4E3B;&#x5E93;&#x5F88;&#x5C11;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x597D;&#x5904;&#x5F88;&#x5C11;&#x8D85;&#x8FC7;&#x590D;&#x6742;&#x6027;&#x7684;&#x4EE3;&#x4EF7;&#x3002; &#x4F46;&#x5728;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x591A;&#x6D3B;&#x914D;&#x7F6E;&#x662F;&#x4E5F;&#x5408;&#x7406;&#x7684;&#x3002;</p>
<h4 id="&#x8FD0;&#x7EF4;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;">&#x8FD0;&#x7EF4;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;</h4>
<p>&#x200B;    &#x5047;&#x5982;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x526F;&#x672C;&#x5206;&#x6563;&#x5728;&#x597D;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF08;&#x4E5F;&#x8BB8;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x6545;&#x969C;&#xFF0C;&#x6216;&#x5730;&#x7406;&#x4E0A;&#x66F4;&#x63A5;&#x8FD1;&#x7528;&#x6237;&#xFF09;&#x3002; &#x4F7F;&#x7528;&#x5E38;&#x89C4;&#x7684;&#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#x8BBE;&#x7F6E;&#xFF0C;&#x4E3B;&#x5E93;&#x5FC5;&#x987B;&#x4F4D;&#x4E8E;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x4E14;&#x6240;&#x6709;&#x5199;&#x5165;&#x90FD;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7;&#x8BE5;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;</p>
<p>&#x200B;    &#x591A;&#x9886;&#x5BFC;&#x8005;&#x914D;&#x7F6E;&#x4E2D;&#x53EF;&#x4EE5;&#x5728;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x90FD;&#x6709;&#x4E3B;&#x5E93;&#x3002; <a href="img/fig5-6.png">&#x56FE;5-6</a>&#x5C55;&#x793A;&#x4E86;&#x8FD9;&#x4E2A;&#x67B6;&#x6784;&#x7684;&#x6837;&#x5B50;&#x3002; &#x5728;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x4F7F;&#x7528;&#x5E38;&#x89C4;&#x7684;&#x4E3B;&#x4ECE;&#x590D;&#x5236;&#xFF1B;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E4B;&#x95F4;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x4E3B;&#x5E93;&#x90FD;&#x4F1A;&#x5C06;&#x5176;&#x66F4;&#x6539;&#x590D;&#x5236;&#x5230;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x4E3B;&#x5E93;&#x4E2D;&#x3002; </p>
<p><img src="img/fig5-6.png" alt=""></p>
<p><strong>&#x56FE;5-6 &#x8DE8;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x591A;&#x4E3B;&#x590D;&#x5236;</strong></p>
<p>&#x6211;&#x4EEC;&#x6765;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x5728;&#x8FD0;&#x7EF4;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x65F6;&#xFF0C;&#x5355;&#x4E3B;&#x548C;&#x591A;&#x4E3B;&#x7684;&#x9002;&#x5E94;&#x60C5;&#x51B5;&#x3002;</p>
<p><strong><em>&#x6027;&#x80FD;</em></strong></p>
<p>&#x200B;    &#x5728;&#x5355;&#x6D3B;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x90FD;&#x5FC5;&#x987B;&#x7A7F;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x8FDB;&#x5165;&#x4E3B;&#x5E93;&#x6240;&#x5728;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x589E;&#x52A0;&#x5199;&#x5165;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x8FDD;&#x80CC;&#x4E86;&#x8BBE;&#x7F6E;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x521D;&#x5FC3;&#x3002;&#x5728;&#x591A;&#x6D3B;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5199;&#x64CD;&#x4F5C;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x5730;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E0E;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E4B;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x5BF9;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x662F;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x611F;&#x89C9;&#x5230;&#x7684;&#x6027;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x597D;&#x3002;</p>
<p><strong><em>&#x5BB9;&#x5FCD;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x505C;&#x673A;</em></strong></p>
<p>&#x200B;    &#x5728;&#x5355;&#x4E3B;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E3B;&#x5E93;&#x6240;&#x5728;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x6545;&#x969C;&#x5207;&#x6362;&#x53EF;&#x4EE5;&#x4F7F;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x91CC;&#x7684;&#x8FFD;&#x968F;&#x8005;&#x6210;&#x4E3A;&#x9886;&#x5BFC;&#x8005;&#x3002;&#x5728;&#x591A;&#x6D3B;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4E8E;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x53D1;&#x751F;&#x6545;&#x969C;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5F52;&#x961F;&#x65F6;&#xFF0C;&#x590D;&#x5236;&#x4F1A;&#x81EA;&#x52A8;&#x8D76;&#x4E0A;&#x3002;</p>
<p><strong><em>&#x5BB9;&#x5FCD;&#x7F51;&#x7EDC;&#x95EE;&#x9898;</em></strong></p>
<p>&#x200B;    &#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x901A;&#x5E38;&#x7A7F;&#x8FC7;&#x516C;&#x5171;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4E0D;&#x5982;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x7684;&#x672C;&#x5730;&#x7F51;&#x7EDC;&#x53EF;&#x9760;&#x3002;&#x5355;&#x4E3B;&#x914D;&#x7F6E;&#x5BF9;&#x8FD9;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x95EE;&#x9898;&#x975E;&#x5E38;&#x654F;&#x611F;&#xFF0C;&#x56E0;&#x4E3A;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#x8FDB;&#x884C;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x662F;&#x540C;&#x6B65;&#x7684;&#x3002;&#x91C7;&#x7528;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x529F;&#x80FD;&#x7684;&#x591A;&#x6D3B;&#x914D;&#x7F6E;&#x901A;&#x5E38;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x627F;&#x53D7;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#xFF1A;&#x4E34;&#x65F6;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x5E76;&#x4E0D;&#x4F1A;&#x59A8;&#x788D;&#x6B63;&#x5728;&#x5904;&#x7406;&#x7684;&#x5199;&#x5165;&#x3002;</p>
<p>&#x200B;    &#x6709;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x652F;&#x6301;&#x591A;&#x4E3B;&#x914D;&#x7F6E;&#xFF0C;&#x4F46;&#x4F7F;&#x7528;&#x5916;&#x90E8;&#x5DE5;&#x5177;&#x5B9E;&#x73B0;&#x4E5F;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x4E8E;MySQL&#x7684;Tungsten Replicator &#x3010;26&#x3011;&#xFF0C;&#x7528;&#x4E8E;PostgreSQL&#x7684;BDR&#x3010;27&#x3011;&#x4EE5;&#x53CA;&#x7528;&#x4E8E;Oracle&#x7684;GoldenGate &#x3010;19&#x3011;&#x3002;</p>
<p>&#x200B;    &#x5C3D;&#x7BA1;&#x591A;&#x4E3B;&#x590D;&#x5236;&#x6709;&#x8FD9;&#x4E9B;&#x4F18;&#x52BF;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x7F3A;&#x70B9;&#xFF1A;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x53EF;&#x80FD;&#x4F1A;&#x540C;&#x65F6;&#x4FEE;&#x6539;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5199;&#x51B2;&#x7A81;&#x662F;&#x5FC5;&#x987B;&#x89E3;&#x51B3;&#x7684;&#xFF08;&#x5982;<a href="img/fig5-6.png">&#x56FE;5-6</a>&#x4E2D;&#x201C;<a href="#&#x51B2;&#x7A81;&#x89E3;&#x51B3;">&#x51B2;&#x7A81;&#x89E3;&#x51B3;</a>&#x201D;&#xFF09;&#x3002;&#x672C;&#x4E66;&#x5C06;&#x5728;&#x201C;<a href="#&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;">&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;</a>&#x201D;&#x4E2D;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x200B;    &#x7531;&#x4E8E;&#x591A;&#x4E3B;&#x590D;&#x5236;&#x5728;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x90FD;&#x5C5E;&#x4E8E;&#x6539;&#x88C5;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x5E38;&#x5E38;&#x5B58;&#x5728;&#x5FAE;&#x5999;&#x7684;&#x914D;&#x7F6E;&#x7F3A;&#x9677;&#xFF0C;&#x4E14;&#x7ECF;&#x5E38;&#x4E0E;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5E93;&#x529F;&#x80FD;&#x4E4B;&#x95F4;&#x51FA;&#x73B0;&#x610F;&#x5916;&#x7684;&#x53CD;&#x5E94;&#x3002;&#x4F8B;&#x5982;&#x81EA;&#x589E;&#x4E3B;&#x952E;&#x3001;&#x89E6;&#x53D1;&#x5668;&#x3001;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;&#x7B49;&#xFF0C;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x9EBB;&#x70E6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x591A;&#x4E3B;&#x590D;&#x5236;&#x5F80;&#x5F80;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5371;&#x9669;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x907F;&#x514D;&#x3010;28&#x3011;&#x3002;</p>
<h4 id="&#x9700;&#x8981;&#x79BB;&#x7EBF;&#x64CD;&#x4F5C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;">&#x9700;&#x8981;&#x79BB;&#x7EBF;&#x64CD;&#x4F5C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;</h4>
<p>&#x200B;    &#x591A;&#x4E3B;&#x590D;&#x5236;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x9002;&#x7528;&#x573A;&#x666F;&#x662F;&#xFF1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x65AD;&#x7F51;&#x4E4B;&#x540E;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x624B;&#x673A;&#xFF0C;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x548C;&#x5176;&#x4ED6;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x65E5;&#x5386;&#x5E94;&#x7528;&#x3002;&#x65E0;&#x8BBA;&#x8BBE;&#x5907;&#x76EE;&#x524D;&#x662F;&#x5426;&#x6709;&#x4E92;&#x8054;&#x7F51;&#x8FDE;&#x63A5;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x80FD;&#x968F;&#x65F6;&#x67E5;&#x770B;&#x4F60;&#x7684;&#x4F1A;&#x8BAE;&#xFF08;&#x53D1;&#x51FA;&#x8BFB;&#x53D6;&#x8BF7;&#x6C42;&#xFF09;&#xFF0C;&#x8F93;&#x5165;&#x65B0;&#x7684;&#x4F1A;&#x8BAE;&#xFF08;&#x53D1;&#x51FA;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#xFF09;&#x3002;&#x5982;&#x679C;&#x5728;&#x79BB;&#x7EBF;&#x72B6;&#x6001;&#x4E0B;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x8BBE;&#x5907;&#x4E0B;&#x6B21;&#x4E0A;&#x7EBF;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x548C;&#x5176;&#x4ED6;&#x8BBE;&#x5907;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BBE;&#x5907;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5145;&#x5F53;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x672C;&#x5730;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x5B83;&#x63A5;&#x53D7;&#x5199;&#x8BF7;&#x6C42;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6240;&#x6709;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x65E5;&#x5386;&#x526F;&#x672C;&#x4E4B;&#x95F4;&#x540C;&#x6B65;&#x65F6;&#xFF0C;&#x5B58;&#x5728;&#x5F02;&#x6B65;&#x7684;&#x591A;&#x4E3B;&#x590D;&#x5236;&#x8FC7;&#x7A0B;&#x3002;&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x53EF;&#x80FD;&#x662F;&#x51E0;&#x5C0F;&#x65F6;&#x751A;&#x81F3;&#x51E0;&#x5929;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x4F55;&#x65F6;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x4E92;&#x8054;&#x7F51;&#x3002;</p>
<p>&#x200B;    &#x4ECE;&#x67B6;&#x6784;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x79CD;&#x8BBE;&#x7F6E;&#x5B9E;&#x9645;&#x4E0A;&#x4E0E;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E4B;&#x95F4;&#x7684;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x7C7B;&#x4F3C;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BBE;&#x5907;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x201D;&#xFF0C;&#x800C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x662F;&#x6781;&#x5EA6;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x3002;&#x4ECE;&#x5386;&#x53F2;&#x4E0A;&#x5404;&#x7C7B;&#x65E5;&#x5386;&#x540C;&#x6B65;&#x529F;&#x80FD;&#x7684;&#x7834;&#x70C2;&#x5B9E;&#x73B0;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x60F3;&#x628A;&#x591A;&#x6D3B;&#x914D;&#x597D;&#x662F;&#x591A;&#x4E48;&#x56F0;&#x96BE;&#x7684;&#x4E00;&#x4EF6;&#x4E8B;&#x3002;</p>
<p>&#x200B;    &#x6709;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x65E8;&#x5728;&#x4F7F;&#x8FD9;&#x79CD;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x914D;&#x7F6E;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x4F8B;&#x5982;&#xFF0C;CouchDB&#x5C31;&#x662F;&#x4E3A;&#x8FD9;&#x79CD;&#x64CD;&#x4F5C;&#x6A21;&#x5F0F;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3010;29&#x3011;&#x3002;</p>
<h4 id="&#x534F;&#x540C;&#x7F16;&#x8F91;">&#x534F;&#x540C;&#x7F16;&#x8F91;</h4>
<p>&#x200B;    &#x5B9E;&#x65F6;&#x534F;&#x4F5C;&#x7F16;&#x8F91;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x4EBA;&#x540C;&#x65F6;&#x7F16;&#x8F91;&#x6587;&#x6863;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Etherpad &#x3010;30&#x3011;&#x548C;Google Docs &#x3010;31&#x3011;&#x5141;&#x8BB8;&#x591A;&#x4EBA;&#x540C;&#x65F6;&#x7F16;&#x8F91;&#x6587;&#x672C;&#x6587;&#x6863;&#x6216;&#x7535;&#x5B50;&#x8868;&#x683C;&#xFF08;&#x8BE5;&#x7B97;&#x6CD5;&#x5728;&#x201C;<a href="#&#x81EA;&#x52A8;&#x51B2;&#x7A81;&#x89E3;&#x51B3;">&#x81EA;&#x52A8;&#x51B2;&#x7A81;&#x89E3;&#x51B3;</a>&#x201D;&#x4E2D;&#x7B80;&#x8981;&#x8BA8;&#x8BBA;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x5C06;&#x534F;&#x4F5C;&#x5F0F;&#x7F16;&#x8F91;&#x89C6;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x590D;&#x5236;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4E0E;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x79BB;&#x7EBF;&#x7F16;&#x8F91;&#x7528;&#x4F8B;&#x6709;&#x8BB8;&#x591A;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x7F16;&#x8F91;&#x6587;&#x6863;&#x65F6;&#xFF0C;&#x6240;&#x505A;&#x7684;&#x66F4;&#x6539;&#x5C06;&#x7ACB;&#x5373;&#x5E94;&#x7528;&#x5230;&#x5176;&#x672C;&#x5730;&#x526F;&#x672C;&#xFF08;Web&#x6D4F;&#x89C8;&#x5668;&#x6216;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6587;&#x6863;&#x72B6;&#x6001;&#xFF09;&#xFF0C;&#x5E76;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x5230;&#x670D;&#x52A1;&#x5668;&#x548C;&#x7F16;&#x8F91;&#x540C;&#x4E00;&#x6587;&#x6863;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x8981;&#x4FDD;&#x8BC1;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x7F16;&#x8F91;&#x51B2;&#x7A81;&#xFF0C;&#x5219;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x5148;&#x53D6;&#x5F97;&#x6587;&#x6863;&#x7684;&#x9501;&#x5B9A;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6237;&#x624D;&#x80FD;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7F16;&#x8F91;&#x3002;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x60F3;&#x8981;&#x7F16;&#x8F91;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#xFF0C;&#x4ED6;&#x4EEC;&#x9996;&#x5148;&#x5FC5;&#x987B;&#x7B49;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x63D0;&#x4EA4;&#x4FEE;&#x6539;&#x5E76;&#x91CA;&#x653E;&#x9501;&#x5B9A;&#x3002;&#x8FD9;&#x79CD;&#x534F;&#x4F5C;&#x6A21;&#x5F0F;&#x76F8;&#x5F53;&#x4E8E;&#x5728;&#x9886;&#x5BFC;&#x8005;&#x4E0A;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x7684;&#x5355;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x52A0;&#x901F;&#x534F;&#x4F5C;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x5C06;&#x66F4;&#x6539;&#x7684;&#x5355;&#x4F4D;&#x8BBE;&#x7F6E;&#x5F97;&#x975E;&#x5E38;&#x5C0F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x6309;&#x952E;&#xFF09;&#xFF0C;&#x5E76;&#x907F;&#x514D;&#x9501;&#x5B9A;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x7F16;&#x8F91;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x7684;&#x6240;&#x6709;&#x6311;&#x6218;&#xFF0C;&#x5305;&#x62EC;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x3010;32&#x3011;&#x3002;</p>
<h3 id="&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;">&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;</h3>
<p>&#x200B;    &#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x7684;&#x6700;&#x5927;&#x95EE;&#x9898;&#x662F;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5199;&#x51B2;&#x7A81;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x200B;    &#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x7531;&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x7F16;&#x8F91;&#x7684;&#x7EF4;&#x57FA;&#x9875;&#x9762;&#xFF0C;&#x5982;<a href="img/fig5-7.png">&#x56FE;5-7</a>&#x6240;&#x793A;&#x3002;&#x7528;&#x6237;1&#x5C06;&#x9875;&#x9762;&#x7684;&#x6807;&#x9898;&#x4ECE;A&#x66F4;&#x6539;&#x4E3A;B&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6237;2&#x540C;&#x65F6;&#x5C06;&#x6807;&#x9898;&#x4ECE;A&#x66F4;&#x6539;&#x4E3A;C&#x3002;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x66F4;&#x6539;&#x5DF2;&#x6210;&#x529F;&#x5E94;&#x7528;&#x5230;&#x5176;&#x672C;&#x5730;&#x4E3B;&#x5E93;&#x3002;&#x4F46;&#x5F53;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x51B2;&#x7A81;&#x3010;33&#x3011;&#x3002;&#x5355;&#x4E3B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x6B64;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="img/fig5-7.png" alt=""></p>
<p><strong>&#x56FE;5-7 &#x4E24;&#x4E2A;&#x4E3B;&#x5E93;&#x540C;&#x65F6;&#x66F4;&#x65B0;&#x540C;&#x4E00;&#x8BB0;&#x5F55;&#x5F15;&#x8D77;&#x7684;&#x5199;&#x5165;&#x51B2;&#x7A81;</strong></p>
<h4 id="&#x540C;&#x6B65;&#x4E0E;&#x5F02;&#x6B65;&#x51B2;&#x7A81;&#x68C0;&#x6D4B;">&#x540C;&#x6B65;&#x4E0E;&#x5F02;&#x6B65;&#x51B2;&#x7A81;&#x68C0;&#x6D4B;</h4>
<p>&#x200B;    &#x5728;&#x5355;&#x4E3B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x5199;&#x5165;&#x5C06;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x5E76;&#x7B49;&#x5F85;&#x7B2C;&#x4E00;&#x4E2A;&#x5199;&#x5165;&#x5B8C;&#x6210;&#xFF0C;&#x6216;&#x4E2D;&#x6B62;&#x7B2C;&#x4E8C;&#x4E2A;&#x5199;&#x5165;&#x4E8B;&#x52A1;&#xFF0C;&#x5F3A;&#x5236;&#x7528;&#x6237;&#x91CD;&#x8BD5;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5728;&#x591A;&#x6D3B;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x5199;&#x5165;&#x90FD;&#x662F;&#x6210;&#x529F;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x7A0D;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x4EC5;&#x4EC5;&#x5F02;&#x6B65;&#x5730;&#x68C0;&#x6D4B;&#x5230;&#x51B2;&#x7A81;&#x3002;&#x90A3;&#x65F6;&#x8981;&#x6C42;&#x7528;&#x6237;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x53EF;&#x80FD;&#x4E3A;&#x65F6;&#x5DF2;&#x665A;&#x3002;</p>
<p>&#x200B;    &#x539F;&#x5219;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#x540C;&#x6B65; - &#x5373;&#x7B49;&#x5F85;&#x5199;&#x5165;&#x88AB;&#x590D;&#x5236;&#x5230;&#x6240;&#x6709;&#x526F;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x544A;&#x8BC9;&#x7528;&#x6237;&#x5199;&#x5165;&#x6210;&#x529F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x60A8;&#x5C06;&#x5931;&#x53BB;&#x591A;&#x4E3B;&#x590D;&#x5236;&#x7684;&#x4E3B;&#x8981;&#x4F18;&#x70B9;&#xFF1A;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x72EC;&#x7ACB;&#x63A5;&#x53D7;&#x5199;&#x5165;&#x3002;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x8981;&#x540C;&#x6B65;&#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x4E3B;&#x7A0B;&#x5E8F;&#x590D;&#x5236;&#x3002;</p>
<h4 id="&#x907F;&#x514D;&#x51B2;&#x7A81;">&#x907F;&#x514D;&#x51B2;&#x7A81;</h4>
<p>&#x200B;    &#x5904;&#x7406;&#x51B2;&#x7A81;&#x7684;&#x6700;&#x7B80;&#x5355;&#x7684;&#x7B56;&#x7565;&#x5C31;&#x662F;&#x907F;&#x514D;&#x5B83;&#x4EEC;&#xFF1A;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x7279;&#x5B9A;&#x8BB0;&#x5F55;&#x7684;&#x6240;&#x6709;&#x5199;&#x5165;&#x90FD;&#x901A;&#x8FC7;&#x540C;&#x4E00;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x90A3;&#x4E48;&#x51B2;&#x7A81;&#x5C31;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x7531;&#x4E8E;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x5904;&#x7406;&#x7684;&#x8BB8;&#x591A;&#x5B9E;&#x73B0;&#x51B2;&#x7A81;&#x76F8;&#x5F53;&#x4E0D;&#x597D;&#xFF0C;&#x907F;&#x514D;&#x51B2;&#x7A81;&#x662F;&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x63A8;&#x8350;&#x7684;&#x65B9;&#x6CD5;&#x3010;34&#x3011;&#x3002;</p>
<p>&#x200B;    &#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7F16;&#x8F91;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x6765;&#x81EA;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x59CB;&#x7EC8;&#x8DEF;&#x7531;&#x5230;&#x540C;&#x4E00;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8BE5;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x9886;&#x5BFC;&#x8005;&#x8FDB;&#x884C;&#x8BFB;&#x5199;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x201C;&#x5BB6;&#x5EAD;&#x201D;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF08;&#x53EF;&#x80FD;&#x6839;&#x636E;&#x7528;&#x6237;&#x7684;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x9009;&#x62E9;&#xFF09;&#xFF0C;&#x4F46;&#x4ECE;&#x4EFB;&#x4F55;&#x7528;&#x6237;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x914D;&#x7F6E;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x662F;&#x5355;&#x4E00;&#x7684;&#x9886;&#x5BFC;&#x8005;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x6709;&#x65F6;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x6539;&#x6307;&#x5B9A;&#x7684;&#x8BB0;&#x5F55;&#x7684;&#x4E3B;&#x5E93;&#x2014;&#x2014;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x5C06;&#x6D41;&#x91CF;&#x91CD;&#x65B0;&#x8DEF;&#x7531;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x5DF2;&#x7ECF;&#x8FC1;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x73B0;&#x5728;&#x66F4;&#x63A5;&#x8FD1;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x51B2;&#x7A81;&#x907F;&#x514D;&#x4F1A;&#x4E2D;&#x65AD;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x4E3B;&#x5E93;&#x540C;&#x65F6;&#x5199;&#x5165;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<h4 id="&#x6536;&#x655B;&#x81F3;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;">&#x6536;&#x655B;&#x81F3;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;</h4>
<p>&#x200B;    &#x5355;&#x4E3B;&#x6570;&#x636E;&#x5E93;&#x6309;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#xFF1A;&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x6709;&#x591A;&#x4E2A;&#x66F4;&#x65B0;&#xFF0C;&#x5219;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5199;&#x64CD;&#x4F5C;&#x5C06;&#x51B3;&#x5B9A;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x6700;&#x7EC8;&#x503C;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x591A;&#x4E3B;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7684;&#x5199;&#x5165;&#x987A;&#x5E8F;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x7EC8;&#x503C;&#x5E94;&#x8BE5;&#x662F;&#x4EC0;&#x4E48;&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#x3002;&#x5728;<a href="img/fig5-7.png">&#x56FE;5-7</a>&#x4E2D;&#xFF0C;&#x5728;&#x4E3B;&#x5E93;1&#x4E2D;&#x6807;&#x9898;&#x9996;&#x5148;&#x66F4;&#x65B0;&#x4E3A;B&#x800C;&#x540E;&#x66F4;&#x65B0;&#x4E3A;C&#xFF1B;&#x5728;&#x4E3B;&#x5E93;2&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x66F4;&#x65B0;&#x4E3A;C&#xFF0C;&#x7136;&#x540E;&#x66F4;&#x65B0;&#x4E3A;B&#x3002;&#x4E24;&#x4E2A;&#x987A;&#x5E8F;&#x90FD;&#x4E0D;&#x662F;&#x201C;&#x66F4;&#x6B63;&#x786E;&#x201D;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x53EA;&#x662F;&#x6309;&#x7167;&#x5B83;&#x770B;&#x5230;&#x5199;&#x5165;&#x7684;&#x987A;&#x5E8F;&#x5199;&#x5165;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x636E;&#x5E93;&#x6700;&#x7EC8;&#x5C06;&#x5904;&#x4E8E;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;&#xFF1A;&#x6700;&#x7EC8;&#x503C;&#x5C06;&#x662F;&#x5728;&#x4E3B;&#x5E93;1&#x7684;C&#x548C;&#x4E3B;&#x5E93;2&#x7684;B&#x3002;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x590D;&#x5236;&#x65B9;&#x6848;&#x90FD;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x5728;&#x6240;&#x6709;&#x526F;&#x672C;&#x4E2D;&#x6700;&#x7EC8;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x4EE5;&#x4E00;&#x79CD; <strong>&#x6536;&#x655B;&#xFF08;convergent&#xFF09;</strong> &#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6240;&#x6709;&#x526F;&#x672C;&#x5FC5;&#x987B;&#x5728;&#x6240;&#x6709;&#x53D8;&#x66F4;&#x590D;&#x5236;&#x5B8C;&#x6210;&#x65F6;&#x6536;&#x655B;&#x81F3;&#x4E00;&#x4E2A;&#x76F8;&#x540C;&#x7684;&#x6700;&#x7EC8;&#x503C;&#x3002;</p>
<p>&#x5B9E;&#x73B0;&#x51B2;&#x7A81;&#x5408;&#x5E76;&#x89E3;&#x51B3;&#x6709;&#x591A;&#x79CD;&#x9014;&#x5F84;&#xFF1A;</p>
<ul>
<li>&#x7ED9;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;ID&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x4E00;&#x4E2A;&#x957F;&#x7684;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x4E00;&#x4E2A;UUID&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x952E;&#x548C;&#x503C;&#x7684;&#x54C8;&#x5E0C;&#xFF09;&#xFF0C;&#x6311;&#x9009;&#x6700;&#x9AD8;ID&#x7684;&#x5199;&#x5165;&#x4F5C;&#x4E3A;&#x80DC;&#x5229;&#x8005;&#xFF0C;&#x5E76;&#x4E22;&#x5F03;&#x5176;&#x4ED6;&#x5199;&#x5165;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;LWW, last write wins&#xFF09;</strong>&#x3002;&#x867D;&#x7136;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5F88;&#x6D41;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x6570;&#x636E;&#x4E22;&#x5931;&#x3010;35&#x3011;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="#&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;">&#x672C;&#x7AE0;&#x672B;&#x5C3E;</a>&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;LWW&#x3002;</li>
<li>&#x4E3A;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;ID&#xFF0C;ID&#x7F16;&#x53F7;&#x66F4;&#x9AD8;&#x7684;&#x5199;&#x5165;&#x5177;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x4E22;&#x5931;&#x3002;</li>
<li>&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5C06;&#x8FD9;&#x4E9B;&#x503C;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x8D77; - &#x4F8B;&#x5982;&#xFF0C;&#x6309;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x6392;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x8FDE;&#x63A5;&#x5B83;&#x4EEC;&#xFF08;&#x5728;<a href="img/fig5-7.png">&#x56FE;5-7</a>&#x4E2D;&#xFF0C;&#x5408;&#x5E76;&#x7684;&#x6807;&#x9898;&#x53EF;&#x80FD;&#x7C7B;&#x4F3C;&#x4E8E;&#x201C;B/C&#x201D;&#xFF09;&#x3002;</li>
<li>&#x7528;&#x4E00;&#x79CD;&#x53EF;&#x4FDD;&#x7559;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x7684;&#x663E;&#x5F0F;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x8BB0;&#x5F55;&#x51B2;&#x7A81;&#xFF0C;&#x5E76;&#x7F16;&#x5199;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#xFF08;&#x4E5F;&#x8BB8;&#x901A;&#x8FC7;&#x63D0;&#x793A;&#x7528;&#x6237;&#x7684;&#x65B9;&#x5F0F;&#xFF09;&#x3002;</li>
</ul>
<h4 id="&#x81EA;&#x5B9A;&#x4E49;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x903B;&#x8F91;">&#x81EA;&#x5B9A;&#x4E49;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x903B;&#x8F91;</h4>
<p>&#x200B;    &#x4F5C;&#x4E3A;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x6700;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x591A;&#x4E3B;&#x590D;&#x5236;&#x5DE5;&#x5177;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x903B;&#x8F91;&#x3002;&#x8BE5;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5728;&#x5199;&#x5165;&#x6216;&#x8BFB;&#x53D6;&#x65F6;&#x6267;&#x884C;&#xFF1A;</p>
<p><strong><em>&#x5199;&#x65F6;&#x6267;&#x884C;</em></strong></p>
<p>&#x200B;    &#x53EA;&#x8981;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x68C0;&#x6D4B;&#x5230;&#x590D;&#x5236;&#x66F4;&#x6539;&#x65E5;&#x5FD7;&#x4E2D;&#x5B58;&#x5728;&#x51B2;&#x7A81;&#xFF0C;&#x5C31;&#x4F1A;&#x8C03;&#x7528;&#x51B2;&#x7A81;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Bucardo&#x5141;&#x8BB8;&#x60A8;&#x4E3A;&#x6B64;&#x7F16;&#x5199;&#x4E00;&#x6BB5;Perl&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x4E2A;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x4E0D;&#x80FD;&#x63D0;&#x793A;&#x7528;&#x6237;&#x2014;&#x2014;&#x5B83;&#x5728;&#x540E;&#x53F0;&#x8FDB;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x5FEB;&#x901F;&#x6267;&#x884C;&#x3002;</p>
<p><strong><em>&#x8BFB;&#x65F6;&#x6267;&#x884C;</em></strong></p>
<p>&#x200B;    &#x5F53;&#x68C0;&#x6D4B;&#x5230;&#x51B2;&#x7A81;&#x65F6;&#xFF0C;&#x6240;&#x6709;&#x51B2;&#x7A81;&#x5199;&#x5165;&#x88AB;&#x5B58;&#x50A8;&#x3002;&#x4E0B;&#x4E00;&#x6B21;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x4F1A;&#x5C06;&#x8FD9;&#x4E9B;&#x591A;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x6570;&#x636E;&#x8FD4;&#x56DE;&#x7ED9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x793A;&#x7528;&#x6237;&#x6216;&#x81EA;&#x52A8;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#xFF0C;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x5199;&#x56DE;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4F8B;&#x5982;&#xFF0C;CouchDB&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x901A;&#x5E38;&#x9002;&#x7528;&#x4E8E;&#x5355;&#x4E2A;&#x884C;&#x6216;&#x6587;&#x6863;&#x5C42;&#x9762;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x3010;36&#x3011;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x6709;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4F1A;&#x539F;&#x5B50;&#x6027;&#x5730;&#x8FDB;&#x884C;&#x51E0;&#x6B21;&#x4E0D;&#x540C;&#x7684;&#x5199;&#x5165;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;7&#x7AE0;&#xFF09;&#xFF0C;&#x5219;&#x5BF9;&#x4E8E;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x800C;&#x8A00;&#xFF0C;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x4ECD;&#x9700;&#x5206;&#x5F00;&#x5355;&#x72EC;&#x8003;&#x8651;&#x3002;</p>
<blockquote>
<h4 id="&#x9898;&#x5916;&#x8BDD;&#xFF1A;&#x81EA;&#x52A8;&#x51B2;&#x7A81;&#x89E3;&#x51B3;">&#x9898;&#x5916;&#x8BDD;&#xFF1A;&#x81EA;&#x52A8;&#x51B2;&#x7A81;&#x89E3;&#x51B3;</h4>
<p>&#x200B;    &#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x89C4;&#x5219;&#x53EF;&#x80FD;&#x5F88;&#x5FEB;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF0C;&#x5E76;&#x4E14;&#x81EA;&#x5B9A;&#x4E49;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;&#x4E9A;&#x9A6C;&#x900A;&#x662F;&#x4E00;&#x4E2A;&#x7ECF;&#x5E38;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7531;&#x4E8E;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4EE4;&#x4EBA;&#x610F;&#x5916;&#x7684;&#x6548;&#x679C;&#xFF1A;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4EE5;&#x6765;&#xFF0C;&#x8D2D;&#x7269;&#x8F66;&#x4E0A;&#x7684;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x903B;&#x8F91;&#x5C06;&#x4FDD;&#x7559;&#x6DFB;&#x52A0;&#x5230;&#x8D2D;&#x7269;&#x8F66;&#x7684;&#x7269;&#x54C1;&#xFF0C;&#x4F46;&#x4E0D;&#x5305;&#x62EC;&#x4ECE;&#x8D2D;&#x7269;&#x8F66;&#x4E2D;&#x79FB;&#x9664;&#x7684;&#x7269;&#x54C1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x987E;&#x5BA2;&#x6709;&#x65F6;&#x4F1A;&#x770B;&#x5230;&#x7269;&#x54C1;&#x91CD;&#x65B0;&#x51FA;&#x73B0;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x8D2D;&#x7269;&#x8F66;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x88AB;&#x79FB;&#x8D70;&#x3010;37&#x3011;&#x3002;</p>
<p>&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x7814;&#x7A76;&#x6765;&#x81EA;&#x52A8;&#x89E3;&#x51B3;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x4FEE;&#x6539;&#x5F15;&#x8D77;&#x7684;&#x51B2;&#x7A81;&#x3002;&#x6709;&#x51E0;&#x884C;&#x7814;&#x7A76;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#xFF1A;</p>
<ul>
<li><strong>&#x65E0;&#x51B2;&#x7A81;&#x590D;&#x5236;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF08;Conflict-free replicated datatypes&#xFF09;</strong>&#xFF08;CRDT&#xFF09;&#x3010;32,38&#x3011;&#x662F;&#x53EF;&#x4EE5;&#x7531;&#x591A;&#x4E2A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x7F16;&#x8F91;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x6620;&#x5C04;&#xFF0C;&#x6709;&#x5E8F;&#x5217;&#x8868;&#xFF0C;&#x8BA1;&#x6570;&#x5668;&#x7B49;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x4EEC;&#x4EE5;&#x5408;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x81EA;&#x52A8;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x3002;&#x4E00;&#x4E9B;CRDT&#x5DF2;&#x7ECF;&#x5728;Riak 2.0&#x4E2D;&#x5B9E;&#x73B0;&#x3010;39,40&#x3011;&#x3002;</li>
<li><strong>&#x53EF;&#x5408;&#x5E76;&#x7684;&#x6301;&#x4E45;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;Mergeable persistent data structures&#xFF09;</strong>&#x3010;41&#x3011;&#x663E;&#x5F0F;&#x8DDF;&#x8E2A;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;Git&#x7248;&#x672C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x4E09;&#x5411;&#x5408;&#x5E76;&#x529F;&#x80FD;&#xFF08;&#x800C;CRDT&#x4F7F;&#x7528;&#x53CC;&#x5411;&#x5408;&#x5E76;&#xFF09;&#x3002;</li>
<li><strong>&#x53EF;&#x6267;&#x884C;&#x7684;&#x8F6C;&#x6362;&#xFF08;operational transformation&#xFF09;</strong>[42]&#x662F;Etherpad &#x3010;30&#x3011;&#x548C;Google Docs &#x3010;31&#x3011;&#x7B49;&#x5408;&#x4F5C;&#x7F16;&#x8F91;&#x5E94;&#x7528;&#x80CC;&#x540E;&#x7684;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x7B97;&#x6CD5;&#x3002;&#x5B83;&#x662F;&#x4E13;&#x4E3A;&#x540C;&#x65F6;&#x7F16;&#x8F91;&#x9879;&#x76EE;&#x7684;&#x6709;&#x5E8F;&#x5217;&#x8868;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x6784;&#x6210;&#x6587;&#x672C;&#x6587;&#x6863;&#x7684;&#x5B57;&#x7B26;&#x5217;&#x8868;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x8FD8;&#x5F88;&#x5E74;&#x8F7B;&#xFF0C;&#x4F46;&#x5F88;&#x53EF;&#x80FD;&#x5C06;&#x6765;&#x5B83;&#x4EEC;&#x5C06;&#x88AB;&#x96C6;&#x6210;&#x5230;&#x66F4;&#x591A;&#x7684;&#x590D;&#x5236;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;&#x81EA;&#x52A8;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5904;&#x7406;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x6570;&#x636E;&#x540C;&#x6B65;&#x66F4;&#x4E3A;&#x7B80;&#x5355;&#x3002;</p>
</blockquote>
<h4 id="&#x4EC0;&#x4E48;&#x662F;&#x51B2;&#x7A81;&#xFF1F;">&#x4EC0;&#x4E48;&#x662F;&#x51B2;&#x7A81;&#xFF1F;</h4>
<p>&#x200B;    &#x6709;&#x4E9B;&#x51B2;&#x7A81;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x3002;&#x5728;<a href="img/fig5-7.png">&#x56FE;5-7</a>&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x5199;&#x64CD;&#x4F5C;&#x5E76;&#x53D1;&#x5730;&#x4FEE;&#x6539;&#x4E86;&#x540C;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x4E2D;&#x7684;&#x540C;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x503C;&#x3002;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x200B;    &#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x51B2;&#x7A81;&#x53EF;&#x80FD;&#x66F4;&#x4E3A;&#x5FAE;&#x5999;&#xFF0C;&#x96BE;&#x4EE5;&#x53D1;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x4F1A;&#x8BAE;&#x5BA4;&#x9884;&#x8BA2;&#x7CFB;&#x7EDF;&#xFF1A;&#x5B83;&#x8BB0;&#x5F55;&#x8C01;&#x8BA2;&#x4E86;&#x54EA;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x7684;&#x54EA;&#x4E2A;&#x623F;&#x95F4;&#x3002;&#x5E94;&#x7528;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x623F;&#x95F4;&#x53EA;&#x6709;&#x4E00;&#x7EC4;&#x4EBA;&#x540C;&#x65F6;&#x9884;&#x5B9A;&#xFF08;&#x5373;&#x4E0D;&#x5F97;&#x6709;&#x76F8;&#x540C;&#x623F;&#x95F4;&#x7684;&#x91CD;&#x53E0;&#x9884;&#x8BA2;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x65F6;&#x4E3A;&#x540C;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x521B;&#x5EFA;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x9884;&#x8BA2;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x3002;&#x5373;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x9884;&#x8BA2;&#x4E4B;&#x524D;&#x68C0;&#x67E5;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x6B21;&#x9884;&#x8BA2;&#x662F;&#x7531;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x9886;&#x5BFC;&#x8005;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x200B;    &#x73B0;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x73B0;&#x6210;&#x7684;&#x7B54;&#x6848;&#xFF0C;&#x4F46;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x66F4;&#x597D;&#x5730;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C;7&#x7AE0;&#x4E2D;&#x770B;&#x5230;&#x66F4;&#x591A;&#x7684;&#x51B2;&#x7A81;&#x793A;&#x4F8B;&#xFF0C;&#x5728;<a href="ch12.html">&#x7B2C;12&#x7AE0;</a>&#x4E2D;&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x7528;&#x4E8E;&#x68C0;&#x6D4B;&#x548C;&#x89E3;&#x51B3;&#x590D;&#x5236;&#x7CFB;&#x7EDF;&#x4E2D;&#x51B2;&#x7A81;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="&#x591A;&#x4E3B;&#x590D;&#x5236;&#x62D3;&#x6251;">&#x591A;&#x4E3B;&#x590D;&#x5236;&#x62D3;&#x6251;</h3>
<p>&#x200B;    <strong>&#x590D;&#x5236;&#x62D3;&#x6251;</strong>&#xFF08;replication topology&#xFF09;&#x63CF;&#x8FF0;&#x5199;&#x5165;&#x4ECE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4F20;&#x64AD;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x901A;&#x4FE1;&#x8DEF;&#x5F84;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x4E24;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x5982;<a href="">&#x56FE;5-7</a>&#x6240;&#x793A;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#xFF1A;&#x9886;&#x5BFC;&#x8005;1&#x5FC5;&#x987B;&#x628A;&#x4ED6;&#x6240;&#x6709;&#x7684;&#x5199;&#x5230;&#x9886;&#x5BFC;&#x8005;2&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x5F53;&#x6709;&#x4E24;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x9886;&#x5BFC;&#xFF0C;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x62D3;&#x6251;&#x662F;&#x53EF;&#x80FD;&#x7684;&#x3002;<a href="">&#x56FE;5-8</a>&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x4E86;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="img/fig5-8.png" alt=""></p>
<p><strong>&#x56FE;5-8 &#x4E09;&#x4E2A;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x7684;&#x793A;&#x4F8B;&#x62D3;&#x6251;&#x3002;</strong></p>
<p>&#x200B;    &#x6700;&#x666E;&#x904D;&#x7684;&#x62D3;&#x6251;&#x662F;&#x5168;&#x90E8;&#x5230;&#x5168;&#x90E8;&#xFF08;<a href="">&#x56FE;5-8 [c]</a>&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#x5C06;&#x5176;&#x5199;&#x5165;&#x6BCF;&#x4E2A;&#x5176;&#x4ED6;&#x9886;&#x5BFC;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E5F;&#x4F1A;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x53D7;&#x9650;&#x5236;&#x7684;&#x62D3;&#x6251;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;MySQL&#x4EC5;&#x652F;&#x6301;<strong>&#x73AF;&#x5F62;&#x62D3;&#x6251;&#xFF08;circular topology&#xFF09;</strong>&#x3010;34&#x3011;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x63A5;&#x6536;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5199;&#x5165;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E9B;&#x5199;&#x5165;&#xFF08;&#x52A0;&#x4E0A;&#x81EA;&#x5DF1;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#xFF09;&#x8F6C;&#x53D1;&#x7ED9;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#x5177;&#x6709;&#x661F;&#x5F62;&#x7684;&#x5F62;&#x72B6;<sup><a href="#fn_v" id="reffn_v">v</a></sup>&#x3002;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x6839;&#x8282;&#x70B9;&#x5C06;&#x5199;&#x5165;&#x8F6C;&#x53D1;&#x7ED9;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x3002;&#x661F;&#x578B;&#x62D3;&#x6251;&#x53EF;&#x4EE5;&#x63A8;&#x5E7F;&#x5230;&#x6811;&#x3002;</p>
<blockquote id="fn_v">
<sup>v</sup>. &#x4E0D;&#x8981;&#x4E0E;&#x661F;&#x578B;&#x6A21;&#x5F0F;&#x6DF7;&#x6DC6;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="ch2.html#&#x5206;&#x6790;&#x6A21;&#x5F0F;&#xFF1A;&#x661F;&#x578B;&#x8FD8;&#x662F;&#x96EA;&#x82B1;">&#x5206;&#x6790;&#x6A21;&#x5F0F;&#xFF1A;&#x661F;&#x578B;&#x8FD8;&#x662F;&#x96EA;&#x82B1;</a>&#x201D;&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x63CF;&#x8FF0;&#x4E86;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x62D3;&#x6251;&#x3002;<a href="#reffn_v" title="Jump back to footnote [v] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x5728;&#x5706;&#x5F62;&#x548C;&#x661F;&#x5F62;&#x62D3;&#x6251;&#x4E2D;&#xFF0C;&#x5199;&#x5165;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x5230;&#x8FBE;&#x6240;&#x6709;&#x526F;&#x672C;&#x4E4B;&#x524D;&#x901A;&#x8FC7;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8282;&#x70B9;&#x9700;&#x8981;&#x8F6C;&#x53D1;&#x4ECE;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x6536;&#x5230;&#x7684;&#x6570;&#x636E;&#x66F4;&#x6539;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x65E0;&#x9650;&#x590D;&#x5236;&#x5FAA;&#x73AF;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x88AB;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x90FD;&#x88AB;&#x6807;&#x8BB0;&#x4E86;&#x6240;&#x6709;&#x5DF2;&#x7ECF;&#x8FC7;&#x7684;&#x8282;&#x70B9;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x3010;43&#x3011;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6536;&#x5230;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x6807;&#x8BB0;&#x7684;&#x6570;&#x636E;&#x66F4;&#x6539;&#x65F6;&#xFF0C;&#x8BE5;&#x6570;&#x636E;&#x66F4;&#x6539;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x56E0;&#x4E3A;&#x8282;&#x70B9;&#x77E5;&#x9053;&#x5B83;&#x5DF2;&#x7ECF;&#x88AB;&#x5904;&#x7406;&#x8FC7;&#x3002;</p>
<p>&#x200B;    &#x5FAA;&#x73AF;&#x548C;&#x661F;&#x578B;&#x62D3;&#x6251;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x4E2D;&#x65AD;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x590D;&#x5236;&#x6D88;&#x606F;&#x6D41;&#xFF0C;&#x5BFC;&#x81F4;&#x5B83;&#x4EEC;&#x65E0;&#x6CD5;&#x901A;&#x4FE1;&#xFF0C;&#x76F4;&#x5230;&#x8282;&#x70B9;&#x4FEE;&#x590D;&#x3002;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x4E3A;&#x5728;&#x53D1;&#x751F;&#x6545;&#x969C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x5728;&#x5927;&#x591A;&#x6570;&#x90E8;&#x7F72;&#x4E2D;&#xFF0C;&#x8FD9;&#x79CD;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x5FC5;&#x987B;&#x624B;&#x52A8;&#x5B8C;&#x6210;&#x3002;&#x66F4;&#x5BC6;&#x96C6;&#x8FDE;&#x63A5;&#x7684;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#xFF08;&#x4F8B;&#x5982;&#x5168;&#x90E8;&#x5230;&#x5168;&#x90E8;&#xFF09;&#x7684;&#x5BB9;&#x9519;&#x6027;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x6D88;&#x606F;&#x6CBF;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x8DEF;&#x5F84;&#x4F20;&#x64AD;&#xFF0C;&#x907F;&#x514D;&#x5355;&#x70B9;&#x6545;&#x969C;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5168;&#x90E8;&#x5230;&#x5168;&#x90E8;&#x7684;&#x62D3;&#x6251;&#x4E5F;&#x53EF;&#x80FD;&#x6709;&#x95EE;&#x9898;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x4E00;&#x4E9B;&#x7F51;&#x7EDC;&#x94FE;&#x63A5;&#x53EF;&#x80FD;&#x6BD4;&#x5176;&#x4ED6;&#x7F51;&#x7EDC;&#x94FE;&#x63A5;&#x66F4;&#x5FEB;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#xFF09;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E9B;&#x590D;&#x5236;&#x6D88;&#x606F;&#x53EF;&#x80FD;&#x201C;&#x8D85;&#x8FC7;&#x201D;&#x5176;&#x4ED6;&#x590D;&#x5236;&#x6D88;&#x606F;&#xFF0C;&#x5982;<a href="img/fig5-9.png">&#x56FE;5-9</a>&#x6240;&#x793A;&#x3002;</p>
<p><img src="img/fig5-9.png" alt=""></p>
<p><strong>&#x56FE;5-9 &#x4F7F;&#x7528;&#x591A;&#x4E3B;&#x7A0B;&#x5E8F;&#x590D;&#x5236;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x67D0;&#x4E9B;&#x526F;&#x672C;&#x4E2D;&#x5199;&#x5165;&#x9519;&#x8BEF;&#x7684;&#x987A;&#x5E8F;&#x3002;</strong></p>
<p>&#x200B;    &#x5728;<a href="img/fig5-9.png">&#x56FE;5-9</a>&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;A&#x5411;&#x4E3B;&#x5E93;1&#x7684;&#x8868;&#x4E2D;&#x63D2;&#x5165;&#x4E00;&#x884C;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;B&#x5728;&#x4E3B;&#x5E93;3&#x4E0A;&#x66F4;&#x65B0;&#x8BE5;&#x884C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E3B;&#x5E93;2&#x53EF;&#x4EE5;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x63A5;&#x6536;&#x5199;&#x5165;&#xFF1A;&#x5B83;&#x53EF;&#x4EE5;&#x9996;&#x5148;&#x63A5;&#x6536;&#x66F4;&#x65B0;&#xFF08;&#x5176;&#x4E2D;&#xFF0C;&#x4ECE;&#x5B83;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x884C;&#x7684;&#x66F4;&#x65B0;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4EC5;&#x5728;&#x7A0D;&#x540E;&#x63A5;&#x6536;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x63D2;&#x5165;&#xFF08;&#x5176;&#x5E94;&#x8BE5;&#x5728;&#x66F4;&#x65B0;&#x4E4B;&#x524D;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x6211;&#x4EEC;&#x5728;&#x201C;<a href="ch8.html#&#x4E00;&#x81F4;&#x524D;&#x7F00;&#x8BFB;">&#x4E00;&#x81F4;&#x524D;&#x7F00;&#x8BFB;</a>&#x201D;&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF1A;&#x66F4;&#x65B0;&#x53D6;&#x51B3;&#x4E8E;&#x5148;&#x524D;&#x7684;&#x63D2;&#x5165;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5148;&#x5904;&#x7406;&#x63D2;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5904;&#x7406;&#x66F4;&#x65B0;&#x3002;&#x4EC5;&#x4EC5;&#x5728;&#x6BCF;&#x4E00;&#x6B21;&#x5199;&#x5165;&#x65F6;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x65F6;&#x949F;&#x4E0D;&#x53EF;&#x80FD;&#x88AB;&#x5145;&#x5206;&#x5730;&#x540C;&#x6B65;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x4E3B;&#x5E93;2&#x5904;&#x6B63;&#x786E;&#x5730;&#x6392;&#x5E8F;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#xFF08;&#x89C1;<a href="ch8.html">&#x7B2C;8&#x7AE0;</a>&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x8981;&#x6B63;&#x786E;&#x6392;&#x5E8F;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x79F0;&#x4E3A; <strong>&#x7248;&#x672C;&#x5411;&#x91CF;&#xFF08;version vectors&#xFF09;</strong> &#x7684;&#x6280;&#x672F;&#xFF0C;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#x5C06;&#x8BA8;&#x8BBA;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;">&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;</a>&#x201D;&#xFF09;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x51B2;&#x7A81;&#x68C0;&#x6D4B;&#x6280;&#x672F;&#x5728;&#x8BB8;&#x591A;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x7CFB;&#x7EDF;&#x4E2D;&#x6267;&#x884C;&#x5F97;&#x4E0D;&#x597D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x64B0;&#x5199;&#x672C;&#x6587;&#x65F6;&#xFF0C;PostgreSQL BDR&#x4E0D;&#x63D0;&#x4F9B;&#x5199;&#x5165;&#x7684;&#x56E0;&#x679C;&#x6392;&#x5E8F;&#x3010;27&#x3011;&#xFF0C;&#x800C;Tungsten Replicator for MySQL&#x751A;&#x81F3;&#x4E0D;&#x5C1D;&#x8BD5;&#x68C0;&#x6D4B;&#x51B2;&#x7A81;&#x3010;34&#x3011;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x60A8;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x5177;&#x6709;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x529F;&#x80FD;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4ED4;&#x7EC6;&#x9605;&#x8BFB;&#x6587;&#x6863;&#xFF0C;&#x5E76;&#x5F7B;&#x5E95;&#x6D4B;&#x8BD5;&#x60A8;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5B83;&#x786E;&#x5B9E;&#x63D0;&#x4F9B;&#x4E86;&#x60A8;&#x8BA4;&#x4E3A;&#x5177;&#x6709;&#x7684;&#x4FDD;&#x8BC1;&#x3002;</p>
<h2 id="&#x65E0;&#x4E3B;&#x590D;&#x5236;">&#x65E0;&#x4E3B;&#x590D;&#x5236;</h2>
<p>&#x200B;    &#x6211;&#x4EEC;&#x5728;&#x672C;&#x7AE0;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x590D;&#x5236;&#x65B9;&#x6CD5; &#x2014;&#x2014;&#x5355;&#x4E3B;&#x590D;&#x5236;&#x3001;&#x591A;&#x4E3B;&#x590D;&#x5236;&#x2014;&#x2014;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x60F3;&#x6CD5;&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x4E00;&#x4E2A;&#x4E3B;&#x5E93;&#x53D1;&#x9001;&#x5199;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x8D1F;&#x8D23;&#x5C06;&#x5199;&#x5165;&#x590D;&#x5236;&#x5230;&#x5176;&#x4ED6;&#x526F;&#x672C;&#x3002;&#x4E3B;&#x5E93;&#x51B3;&#x5B9A;&#x5199;&#x5165;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x800C;&#x4ECE;&#x5E93;&#x6309;&#x76F8;&#x540C;&#x987A;&#x5E8F;&#x5E94;&#x7528;&#x4E3B;&#x5E93;&#x7684;&#x5199;&#x5165;&#x3002;</p>
<p>&#x200B;    &#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x653E;&#x5F03;&#x4E3B;&#x5E93;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x4EFB;&#x4F55;&#x526F;&#x672C;&#x76F4;&#x63A5;&#x63A5;&#x53D7;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5199;&#x5165;&#x3002;&#x6700;&#x65E9;&#x7684;&#x4E00;&#x4E9B;&#x7684;&#x590D;&#x5236;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x662F;<strong>&#x65E0;&#x9886;&#x5BFC;&#x7684;&#xFF08;leaderless&#xFF09;</strong>&#x3010;1,44&#x3011;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E3B;&#x5BFC;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x51E0;&#x4E4E;&#x5DF2;&#x88AB;&#x5FD8;&#x5374;&#x3002;&#x5728;&#x4E9A;&#x9A6C;&#x900A;&#x5C06;&#x5176;&#x7528;&#x4E8E;&#x5176;&#x5185;&#x90E8;&#x7684;Dynamo&#x7CFB;&#x7EDF;<sup><a href="#fn_vi" id="reffn_vi">vi</a></sup>&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x518D;&#x4E00;&#x6B21;&#x6210;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x79CD;&#x65F6;&#x5C1A;&#x67B6;&#x6784;&#x3010;37&#x3011;&#x3002; Riak&#xFF0C;Cassandra&#x548C;Voldemort&#x662F;&#x7531;Dynamo&#x542F;&#x53D1;&#x7684;&#x65E0;&#x9886;&#x5BFC;&#x590D;&#x5236;&#x6A21;&#x578B;&#x7684;&#x5F00;&#x6E90;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x7C7B;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<em>Dynamo&#x98CE;&#x683C;</em>&#x3002;</p>
<blockquote id="fn_vi">
<sup>vi</sup>. Dynamo&#x4E0D;&#x9002;&#x7528;&#x4E8E;Amazon&#x4EE5;&#x5916;&#x7684;&#x7528;&#x6237;&#x3002; &#x4EE4;&#x4EBA;&#x56F0;&#x60D1;&#x7684;&#x662F;&#xFF0C;AWS&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;DynamoDB&#x7684;&#x6258;&#x7BA1;&#x6570;&#x636E;&#x5E93;&#x4EA7;&#x54C1;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF1A;&#x5B83;&#x57FA;&#x4E8E;&#x5355;&#x5F15;&#x5BFC;&#x7A0B;&#x5E8F;&#x590D;&#x5236;&#x3002;<a href="#reffn_vi" title="Jump back to footnote [vi] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x5728;&#x4E00;&#x4E9B;&#x65E0;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x76F4;&#x63A5;&#x5C06;&#x5199;&#x5165;&#x53D1;&#x9001;&#x5230;&#x5230;&#x51E0;&#x4E2A;&#x526F;&#x672C;&#x4E2D;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A; <strong>&#x534F;&#x8C03;&#x8005;&#xFF08;coordinator&#xFF09;</strong> &#x8282;&#x70B9;&#x4EE3;&#x8868;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x5199;&#x5165;&#x3002;&#x4F46;&#x4E0E;&#x4E3B;&#x5E93;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x540C;&#xFF0C;&#x534F;&#x8C03;&#x8005;&#x4E0D;&#x6267;&#x884C;&#x7279;&#x5B9A;&#x7684;&#x5199;&#x5165;&#x987A;&#x5E8F;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x4E0A;&#x7684;&#x5DEE;&#x5F02;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x6709;&#x7740;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<h3 id="&#x5F53;&#x8282;&#x70B9;&#x6545;&#x969C;&#x65F6;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;">&#x5F53;&#x8282;&#x70B9;&#x6545;&#x969C;&#x65F6;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;</h3>
<p>&#x200B;    &#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x4E09;&#x4E2A;&#x526F;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x76EE;&#x524D;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x6216;&#x8BB8;&#x6B63;&#x5728;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x4EE5;&#x5B89;&#x88C5;&#x7CFB;&#x7EDF;&#x66F4;&#x65B0;&#x3002;&#x5728;&#x57FA;&#x4E8E;&#x4E3B;&#x673A;&#x7684;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x5199;&#x5165;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x6267;&#x884C;&#x6545;&#x969C;&#x5207;&#x6362;&#xFF08;&#x53C2;&#x9605;&#x300C;<a href="#&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;">&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;</a>&#x300D;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5728;&#x65E0;&#x9886;&#x5BFC;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x6545;&#x969C;&#x5207;&#x6362;&#x4E0D;&#x5B58;&#x5728;&#x3002;<a href="img/fig5-10.png">&#x56FE;5-10</a>&#x663E;&#x793A;&#x4E86;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x7528;&#x6237;1234&#xFF09;&#x5E76;&#x884C;&#x53D1;&#x9001;&#x5199;&#x5165;&#x5230;&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x4E24;&#x4E2A;&#x53EF;&#x7528;&#x526F;&#x672C;&#x63A5;&#x53D7;&#x5199;&#x5165;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x53EF;&#x7528;&#x526F;&#x672C;&#x9519;&#x8FC7;&#x4E86;&#x5B83;&#x3002;&#x5047;&#x8BBE;&#x4E09;&#x4E2A;&#x526F;&#x672C;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x627F;&#x8BA4;&#x5199;&#x5165;&#x662F;&#x8DB3;&#x591F;&#x7684;&#xFF1A;&#x5728;&#x7528;&#x6237;1234&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x4E24;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x54CD;&#x5E94;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5199;&#x5165;&#x6210;&#x529F;&#x3002;&#x5BA2;&#x6237;&#x7B80;&#x5355;&#x5730;&#x5FFD;&#x7565;&#x4E86;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x9519;&#x8FC7;&#x4E86;&#x5199;&#x5165;&#x7684;&#x4E8B;&#x5B9E;&#x3002;</p>
<p><img src="img/fig5-10.png" alt=""></p>
<p><strong>&#x56FE;5-10 &#x6CD5;&#x5B9A;&#x5199;&#x5165;&#xFF0C;&#x6CD5;&#x5B9A;&#x8BFB;&#x53D6;&#xFF0C;&#x5E76;&#x5728;&#x8282;&#x70B9;&#x4E2D;&#x65AD;&#x540E;&#x8BFB;&#x4FEE;&#x590D;&#x3002;</strong></p>
<p>&#x200B;    &#x73B0;&#x5728;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x8282;&#x70B9;&#x91CD;&#x65B0;&#x8054;&#x673A;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5F00;&#x59CB;&#x8BFB;&#x53D6;&#x5B83;&#x3002;&#x8282;&#x70B9;&#x5173;&#x95ED;&#x65F6;&#x53D1;&#x751F;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x90FD;&#x4ECE;&#x8BE5;&#x8282;&#x70B9;&#x4E22;&#x5931;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x4ECE;&#x8BE5;&#x8282;&#x70B9;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x5C06;&#x9648;&#x65E7;&#xFF08;&#x8FC7;&#x65F6;&#xFF09;&#x503C;&#x89C6;&#x4E3A;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5B83;&#x4E0D;&#x4EC5;&#x4EC5;&#x53D1;&#x9001;&#x5B83;&#x7684;&#x8BF7;&#x6C42;&#x5230;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#xFF1A;&#x8BFB;&#x8BF7;&#x6C42;&#x4E5F;&#x88AB;&#x5E76;&#x884C;&#x5730;&#x53D1;&#x9001;&#x5230;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x5BA2;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x83B7;&#x5F97;&#x4E0D;&#x540C;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x5373;&#x6765;&#x81EA;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6700;&#x65B0;&#x503C;&#x548C;&#x6765;&#x81EA;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x9648;&#x65E7;&#x503C;&#x3002;&#x7248;&#x672C;&#x53F7;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x54EA;&#x4E2A;&#x503C;&#x66F4;&#x65B0;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;">&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;</a>&#x201D;&#xFF09;&#x3002;</p>
<h4 id="&#x8BFB;&#x4FEE;&#x590D;&#x548C;&#x53CD;&#x71B5;">&#x8BFB;&#x4FEE;&#x590D;&#x548C;&#x53CD;&#x71B5;</h4>
<p>&#x200B;    &#x590D;&#x5236;&#x65B9;&#x6848;&#x5E94;&#x786E;&#x4FDD;&#x6700;&#x7EC8;&#x5C06;&#x6240;&#x6709;&#x6570;&#x636E;&#x590D;&#x5236;&#x5230;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x8282;&#x70B9;&#x91CD;&#x65B0;&#x8054;&#x673A;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x5982;&#x4F55;&#x8D76;&#x4E0A;&#x5B83;&#x9519;&#x8FC7;&#x7684;&#x5199;&#x5165;&#xFF1F;</p>
<p>&#x200B;    &#x5728;Dynamo&#x98CE;&#x683C;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E2D;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x673A;&#x5236;&#xFF1A;</p>
<p><strong><em>&#x8BFB;&#x4FEE;&#x590D;&#xFF08;Read repair&#xFF09;</em></strong></p>
<p>&#x200B;    &#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x5E76;&#x884C;&#x8BFB;&#x53D6;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x5230;&#x4EFB;&#x4F55;&#x9648;&#x65E7;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;<a href="img/fig5-10.png">&#x56FE;5-10</a>&#x4E2D;&#xFF0C;&#x7528;&#x6237;2345&#x83B7;&#x5F97;&#x4E86;&#x6765;&#x81EA;&#x526F;&#x672C;3&#x7684;&#x7248;&#x672C;6&#x503C;&#x548C;&#x6765;&#x81EA;&#x526F;&#x672C;1&#x548C;2&#x7684;&#x7248;&#x672C;7&#x503C;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x73B0;&#x526F;&#x672C;3&#x5177;&#x6709;&#x9648;&#x65E7;&#x503C;&#xFF0C;&#x5E76;&#x5C06;&#x65B0;&#x503C;&#x5199;&#x56DE;&#x5230;&#x8BE5;&#x526F;&#x672C;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x9002;&#x7528;&#x4E8E;&#x8BFB;&#x9891;&#x7E41;&#x7684;&#x503C;&#x3002;</p>
<p><strong><em>&#x53CD;&#x71B5;&#x8FC7;&#x7A0B;&#xFF08;Anti-entropy process&#xFF09;</em></strong></p>
<p>&#x200B;    &#x6B64;&#x5916;&#xFF0C;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5177;&#x6709;&#x540E;&#x53F0;&#x8FDB;&#x7A0B;&#xFF0C;&#x8BE5;&#x8FDB;&#x7A0B;&#x4E0D;&#x65AD;&#x67E5;&#x627E;&#x526F;&#x672C;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x5DEE;&#x5F02;&#xFF0C;&#x5E76;&#x5C06;&#x4EFB;&#x4F55;&#x7F3A;&#x5C11;&#x7684;&#x6570;&#x636E;&#x4ECE;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x3002;&#x4E0E;&#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#x4E2D;&#x7684;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x4E0D;&#x540C;&#xFF0C;&#x6B64;&#x53CD;&#x71B5;&#x8FC7;&#x7A0B;&#x4E0D;&#x4F1A;&#x4EE5;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7684;&#x987A;&#x5E8F;&#x590D;&#x5236;&#x5199;&#x5165;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x590D;&#x5236;&#x6570;&#x636E;&#x4E4B;&#x524D;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x663E;&#x8457;&#x7684;&#x5EF6;&#x8FDF;&#x3002;</p>
<p>&#x200B;    &#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x7CFB;&#x7EDF;&#x90FD;&#x5B9E;&#x73B0;&#x4E86;&#x8FD9;&#x4E24;&#x4E2A;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;Voldemort&#x76EE;&#x524D;&#x6CA1;&#x6709;&#x53CD;&#x71B5;&#x8FC7;&#x7A0B;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x53CD;&#x71B5;&#x8FC7;&#x7A0B;&#xFF0C;&#x67D0;&#x4E9B;&#x526F;&#x672C;&#x4E2D;&#x5F88;&#x5C11;&#x8BFB;&#x53D6;&#x7684;&#x503C;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E86;&#x6301;&#x4E45;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BFB;&#x53D6;&#x503C;&#x65F6;&#x624D;&#x6267;&#x884C;&#x8BFB;&#x4FEE;&#x590D;&#x3002;</p>
<h4 id="&#x8BFB;&#x5199;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;">&#x8BFB;&#x5199;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;</h4>
<p>&#x200B;    &#x5728;<a href="img/fig5-10.png">&#x56FE;5-10</a>&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x5373;&#x4F7F;&#x4EC5;&#x5728;&#x4E09;&#x4E2A;&#x526F;&#x672C;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x4E0A;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5199;&#x5165;&#x4ECD;&#x7136;&#x662F;&#x6210;&#x529F;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E09;&#x4E2A;&#x526F;&#x672C;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x63A5;&#x53D7;&#x4E86;&#x5199;&#x5165;&#xFF0C;&#x4F1A;&#x600E;&#x6837;&#xFF1F;&#x6211;&#x4EEC;&#x80FD;&#x63A8;&#x591A;&#x8FDC;&#x5462;&#xFF1F;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x6BCF;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x610F;&#x5473;&#x7740;&#x5728;&#x4E09;&#x4E2A;&#x526F;&#x672C;&#x4E2D;&#x81F3;&#x5C11;&#x6709;&#x4E24;&#x4E2A;&#x51FA;&#x73B0;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x81F3;&#x591A;&#x6709;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x53EF;&#x80FD;&#x662F;&#x9648;&#x65E7;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4ECE;&#x81F3;&#x5C11;&#x4E24;&#x4E2A;&#x526F;&#x672C;&#x8BFB;&#x53D6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x662F;&#x6700;&#x65B0;&#x7684;&#x3002;&#x5982;&#x679C;&#x7B2C;&#x4E09;&#x4E2A;&#x526F;&#x672C;&#x505C;&#x673A;&#x6216;&#x54CD;&#x5E94;&#x901F;&#x5EA6;&#x7F13;&#x6162;&#xFF0C;&#x5219;&#x8BFB;&#x53D6;&#x4ECD;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x8FD4;&#x56DE;&#x6700;&#x65B0;&#x503C;&#x3002;</p>
<p>&#x200B;    &#x66F4;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x6709;n&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x5FC5;&#x987B;&#x7531;w&#x8282;&#x70B9;&#x786E;&#x8BA4;&#x624D;&#x80FD;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6210;&#x529F;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x81F3;&#x5C11;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BFB;&#x53D6;&#x67E5;&#x8BE2;r&#x4E2A;&#x8282;&#x70B9;&#x3002; &#xFF08;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;$n = 3&#xFF0C;w = 2&#xFF0C;r = 2$&#xFF09;&#x3002;&#x53EA;&#x8981;$w + r&gt; n$&#xFF0C;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x5728;&#x8BFB;&#x53D6;&#x65F6;&#x83B7;&#x5F97;&#x6700;&#x65B0;&#x7684;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;r&#x4E2A;&#x8BFB;&#x53D6;&#x4E2D;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x662F;&#x6700;&#x65B0;&#x7684;&#x3002;&#x9075;&#x5FAA;&#x8FD9;&#x4E9B;r&#x503C;&#xFF0C;w&#x503C;&#x7684;&#x8BFB;&#x5199;&#x79F0;&#x4E3A;<strong>&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF08;quorum&#xFF09;</strong><sup><a href="#fn_vii" id="reffn_vii">vii</a></sup>&#x7684;&#x8BFB;&#x548C;&#x5199;&#x3010;44&#x3011;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#xFF0C;r&#x548C;w&#x662F;&#x6709;&#x6548;&#x8BFB;&#x5199;&#x6240;&#x9700;&#x7684;&#x6700;&#x4F4E;&#x7968;&#x6570;&#x3002;</p>
<blockquote id="fn_vii">
<sup>vii</sup>. &#x6709;&#x65F6;&#x5019;&#x8FD9;&#x79CD;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x88AB;&#x79F0;&#x4E3A;&#x4E25;&#x683C;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF0C;&#x76F8;&#x5BF9;&#x201C;&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x201D;&#x800C;&#x8A00;&#xFF08;&#x89C1;&#x201C;<a href="#&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E0E;&#x63D0;&#x793A;&#x79FB;&#x4EA4;">&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E0E;&#x63D0;&#x793A;&#x79FB;&#x4EA4;</a>&#x201D;&#xFF09;<a href="#reffn_vii" title="Jump back to footnote [vii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x5728;Dynamo&#x98CE;&#x683C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x53C2;&#x6570;n&#xFF0C;w&#x548C;r&#x901A;&#x5E38;&#x662F;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x9009;&#x62E9;&#x662F;&#x4F7F;n&#x4E3A;&#x5947;&#x6570;&#xFF08;&#x901A;&#x5E38;&#x4E3A;3&#x6216;5&#xFF09;&#x5E76;&#x8BBE;&#x7F6E; $w = r =&#xFF08;n + 1&#xFF09;/ 2$&#xFF08;&#x5411;&#x4E0A;&#x53D6;&#x6574;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x66F4;&#x6539;&#x6570;&#x5B57;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BBE;&#x7F6E;$w = n$&#x548C;$r = 1$&#x7684;&#x5199;&#x5165;&#x5F88;&#x5C11;&#x4E14;&#x8BFB;&#x53D6;&#x6B21;&#x6570;&#x8F83;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x53EF;&#x80FD;&#x4F1A;&#x53D7;&#x76CA;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x8BFB;&#x53D6;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF0C;&#x4F46;&#x5177;&#x6709;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x8282;&#x70B9;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x5931;&#x8D25;&#x7684;&#x7F3A;&#x70B9;&#x3002;</p>
<blockquote>
<p>&#x96C6;&#x7FA4;&#x4E2D;&#x53EF;&#x80FD;&#x6709;&#x591A;&#x4E8E;n&#x7684;&#x8282;&#x70B9;&#x3002;&#xFF08;&#x96C6;&#x7FA4;&#x7684;&#x673A;&#x5668;&#x6570;&#x53EF;&#x80FD;&#x591A;&#x4E8E;&#x526F;&#x672C;&#x6570;&#x76EE;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x503C;&#x53EA;&#x80FD;&#x5B58;&#x50A8;&#x5728;n&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x3002; &#x8FD9;&#x5141;&#x8BB8;&#x5BF9;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x4ECE;&#x800C;&#x652F;&#x6301;&#x53EF;&#x4EE5;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x96C6;&#x66F4;&#x5927;&#x7684;&#x6570;&#x636E;&#x96C6;&#x3002; &#x5C06;&#x5728;&#x7B2C;6&#x7AE0;&#x56DE;&#x5230;&#x5206;&#x533A;&#x3002;</p>
</blockquote>
<p>&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x6761;&#x4EF6;$w + r&gt; n$&#x5141;&#x8BB8;&#x7CFB;&#x7EDF;&#x5BB9;&#x5FCD;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;$w &lt;n$&#xFF0C;&#x5982;&#x679C;&#x8282;&#x70B9;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5199;&#x5165;&#x3002;</li>
<li>&#x5982;&#x679C;$r &lt;n$&#xFF0C;&#x5982;&#x679C;&#x8282;&#x70B9;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x8BFB;&#x53D6;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;$n = 3&#xFF0C;w = 2&#xFF0C;r = 2$&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x8282;&#x70B9;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;$n = 5&#xFF0C;w = 3&#xFF0C;r = 3$&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x4E24;&#x4E2A;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x8282;&#x70B9;&#x3002; &#x8FD9;&#x4E2A;&#x6848;&#x4F8B;&#x5982;<a href="img/fig5-11.png">&#x56FE;5-11</a>&#x6240;&#x793A;&#x3002;</li>
<li>&#x901A;&#x5E38;&#xFF0C;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x59CB;&#x7EC8;&#x5E76;&#x884C;&#x53D1;&#x9001;&#x5230;&#x6240;&#x6709;n&#x4E2A;&#x526F;&#x672C;&#x3002; &#x53C2;&#x6570;w&#x548C;r&#x51B3;&#x5B9A;&#x6211;&#x4EEC;&#x7B49;&#x5F85;&#x591A;&#x5C11;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x5373;&#x5728;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x8BFB;&#x6216;&#x5199;&#x6210;&#x529F;&#x4E4B;&#x524D;&#xFF0C;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x8282;&#x70B9;&#x9700;&#x8981;&#x62A5;&#x544A;&#x6210;&#x529F;&#x3002;</li>
</ul>
<p><img src="img/fig5-11.png" alt=""></p>
<p><strong>&#x56FE;5-11  &#x5982;&#x679C;$w + r &gt; n$&#xFF0C;&#x8BFB;&#x53D6;r&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;r&#x526F;&#x672C;&#x5FC5;&#x7136;&#x5305;&#x542B;&#x4E86;&#x6700;&#x8FD1;&#x7684;&#x6210;&#x529F;&#x5199;&#x5165;</strong></p>
<p>&#x200B;    &#x5982;&#x679C;&#x5C11;&#x4E8E;&#x6240;&#x9700;&#x7684;w&#x6216;r&#x8282;&#x70B9;&#x53EF;&#x7528;&#xFF0C;&#x5219;&#x5199;&#x5165;&#x6216;&#x8BFB;&#x53D6;&#x5C06;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x3002; &#x7531;&#x4E8E;&#x8BB8;&#x591A;&#x539F;&#x56E0;&#xFF0C;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4E0D;&#x53EF;&#x7528;&#xFF1A;&#x56E0;&#x4E3A;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x9519;&#x8BEF;&#xFF08;&#x7531;&#x4E8E;&#x78C1;&#x76D8;&#x5DF2;&#x6EE1;&#x800C;&#x65E0;&#x6CD5;&#x5199;&#x5165;&#xFF09;&#x5BFC;&#x81F4;&#x8282;&#x70B9;&#x5173;&#x95ED;&#xFF08;&#x5D29;&#x6E83;&#xFF0C;&#x5173;&#x95ED;&#x7535;&#x6E90;&#xFF09;&#xFF0C;&#x7531;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x8282;&#x70B9;&#xFF0C;&#x6216;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x3002; &#x6211;&#x4EEC;&#x53EA;&#x5173;&#x5FC3;&#x8282;&#x70B9;&#x662F;&#x5426;&#x8FD4;&#x56DE;&#x4E86;&#x6210;&#x529F;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x533A;&#x5206;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<h3 id="&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x5C40;&#x9650;&#x6027;">&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x5C40;&#x9650;&#x6027;</h3>
<p>&#x200B;    &#x5982;&#x679C;&#x4F60;&#x6709;n&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x9009;&#x62E9;w&#x548C;r&#xFF0C;&#x4F7F;&#x5F97;$w + r&gt; n$&#xFF0C;&#x4F60;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x671F;&#x671B;&#x6BCF;&#x4E2A;&#x8BFB;&#x53D6;&#x8FD4;&#x56DE;&#x4E3A;&#x4E00;&#x4E2A;&#x952E;&#x5199;&#x7684;&#x6700;&#x8FD1;&#x7684;&#x503C;&#x3002;&#x60C5;&#x51B5;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x5199;&#x7684;&#x8282;&#x70B9;&#x96C6;&#x5408;&#x548C;&#x4F60;&#x8BFB;&#x8FC7;&#x7684;&#x8282;&#x70B9;&#x96C6;&#x5408;&#x5FC5;&#x987B;&#x91CD;&#x53E0;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x60A8;&#x8BFB;&#x53D6;&#x7684;&#x8282;&#x70B9;&#x4E2D;&#x5FC5;&#x987B;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x6700;&#x65B0;&#x503C;&#x7684;&#x8282;&#x70B9;&#xFF08;&#x5982;<a href="img/fig5-11.png">&#x56FE;5-11</a>&#x6240;&#x793A;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x901A;&#x5E38;&#xFF0C;r&#x548C;w&#x88AB;&#x9009;&#x4E3A;&#x591A;&#x6570;&#xFF08;&#x8D85;&#x8FC7; $n/2$ &#xFF09;&#x8282;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x786E;&#x4FDD;&#x4E86;$w + r&gt; n$&#xFF0C;&#x540C;&#x65F6;&#x4ECD;&#x7136;&#x5BB9;&#x5FCD;&#x591A;&#x8FBE;$n/2$&#x4E2A;&#x8282;&#x70B9;&#x6545;&#x969C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E0D;&#x4E00;&#x5B9A;&#x5FC5;&#x987B;&#x662F;&#x5927;&#x591A;&#x6570;&#xFF0C;&#x53EA;&#x662F;&#x8BFB;&#x5199;&#x4F7F;&#x7528;&#x7684;&#x8282;&#x70B9;&#x4EA4;&#x96C6;&#x81F3;&#x5C11;&#x9700;&#x8981;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x5176;&#x4ED6;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x7684;&#x914D;&#x7F6E;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x7684;&#x8BBE;&#x8BA1;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3010;45&#x3011;&#x3002;</p>
<p>&#x200B;    &#x60A8;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;w&#x548C;r&#x8BBE;&#x7F6E;&#x4E3A;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4EE5;&#x4F7F;$w + r&#x2264;n$&#xFF08;&#x5373;&#x6CD5;&#x5B9A;&#x6761;&#x4EF6;&#x4E0D;&#x6EE1;&#x8DB3;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x4ECD;&#x5C06;&#x88AB;&#x53D1;&#x9001;&#x5230;n&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4F46;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#x53EA;&#x9700;&#x8981;&#x5C11;&#x91CF;&#x7684;&#x6210;&#x529F;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x200B;    &#x8F83;&#x5C0F;&#x7684;w&#x548C;r&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x8BFB;&#x53D6;&#x8FC7;&#x65F6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x60A8;&#x7684;&#x8BFB;&#x53D6;&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x4E0D;&#x5305;&#x542B;&#x5177;&#x6709;&#x6700;&#x65B0;&#x503C;&#x7684;&#x8282;&#x70B9;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8FD9;&#x79CD;&#x914D;&#x7F6E;&#x5141;&#x8BB8;&#x66F4;&#x4F4E;&#x7684;&#x5EF6;&#x8FDF;&#x548C;&#x66F4;&#x9AD8;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF1A;&#x5982;&#x679C;&#x5B58;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#xFF0C;&#x5E76;&#x4E14;&#x8BB8;&#x591A;&#x526F;&#x672C;&#x53D8;&#x5F97;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x7684;&#x673A;&#x4F1A;&#x66F4;&#x5927;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x53EF;&#x8FBE;&#x526F;&#x672C;&#x7684;&#x6570;&#x91CF;&#x4F4E;&#x4E8E;w&#x6216;r&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x624D;&#x5206;&#x522B;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x7528;&#x4E8E;&#x5199;&#x5165;&#x6216;&#x8BFB;&#x53D6;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x5728;$w + r&gt; n$&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x8FD4;&#x56DE;&#x9648;&#x65E7;&#x503C;&#x7684;&#x8FB9;&#x7F18;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF08;&#x89C1;&#x201C;<a href="#&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E0E;&#x63D0;&#x793A;&#x79FB;&#x4EA4;">&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E0E;&#x63D0;&#x793A;&#x79FB;&#x4EA4;</a>&#x201D;&#xFF09;&#xFF0C;w&#x4E2A;&#x5199;&#x5165;&#x548C;r&#x4E2A;&#x8BFB;&#x53D6;&#x843D;&#x5728;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;r&#x8282;&#x70B9;&#x548C;w&#x4E4B;&#x95F4;&#x4E0D;&#x518D;&#x4FDD;&#x8BC1;&#x6709;&#x91CD;&#x53E0;&#x8282;&#x70B9;&#x3010;46&#x3011;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5199;&#x5165;&#x540C;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x4E0D;&#x6E05;&#x695A;&#x54EA;&#x4E00;&#x4E2A;&#x5148;&#x53D1;&#x751F;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x552F;&#x4E00;&#x5B89;&#x5168;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5408;&#x5E76;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;171&#x9875;&#x7684;&#x201C;&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;&#x201D;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6839;&#x636E;&#x65F6;&#x95F4;&#x6233;&#xFF08;&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF09;&#x6311;&#x9009;&#x51FA;&#x4E00;&#x4E2A;&#x80DC;&#x8005;&#xFF0C;&#x5219;&#x7531;&#x4E8E;&#x65F6;&#x949F;&#x504F;&#x5DEE;[35]&#xFF0C;&#x5199;&#x5165;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8FD4;&#x56DE;&#x201C;<a href="#&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;">&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;</a>&#x201D;&#x4E2D;&#x7684;&#x6B64;&#x4E3B;&#x9898;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5199;&#x64CD;&#x4F5C;&#x4E0E;&#x8BFB;&#x64CD;&#x4F5C;&#x540C;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x5199;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x4EC5;&#x53CD;&#x6620;&#x5728;&#x67D0;&#x4E9B;&#x526F;&#x672C;&#x4E0A;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x786E;&#x5B9A;&#x8BFB;&#x53D6;&#x662F;&#x8FD4;&#x56DE;&#x65E7;&#x503C;&#x8FD8;&#x662F;&#x65B0;&#x503C;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5199;&#x64CD;&#x4F5C;&#x5728;&#x67D0;&#x4E9B;&#x526F;&#x672C;&#x4E0A;&#x6210;&#x529F;&#xFF0C;&#x800C;&#x5728;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E0A;&#x5931;&#x8D25;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x78C1;&#x76D8;&#x5DF2;&#x6EE1;&#xFF09;&#xFF0C;&#x5728;&#x5C0F;&#x4E8E;w&#x4E2A;&#x526F;&#x672C;&#x4E0A;&#x5199;&#x5165;&#x6210;&#x529F;&#x3002;&#x6240;&#x4EE5;&#x6574;&#x4F53;&#x5224;&#x5B9A;&#x5199;&#x5165;&#x5931;&#x8D25;&#xFF0C;&#x4F46;&#x6574;&#x4F53;&#x5199;&#x5165;&#x5931;&#x8D25;&#x5E76;&#x6CA1;&#x6709;&#x5728;&#x5199;&#x5165;&#x6210;&#x529F;&#x7684;&#x526F;&#x672C;&#x4E0A;&#x56DE;&#x6EDA;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5199;&#x5165;&#x867D;&#x7136;&#x62A5;&#x544A;&#x5931;&#x8D25;&#xFF0C;&#x540E;&#x7EED;&#x7684;&#x8BFB;&#x53D6;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x8BFB;&#x53D6;&#x8FD9;&#x6B21;&#x5931;&#x8D25;&#x5199;&#x5165;&#x7684;&#x503C;&#x3010;47&#x3011;&#x3002;</li>
<li>&#x5982;&#x679C;&#x643A;&#x5E26;&#x65B0;&#x503C;&#x7684;&#x8282;&#x70B9;&#x5931;&#x8D25;&#xFF0C;&#x9700;&#x8981;&#x8BFB;&#x53D6;&#x5176;&#x4ED6;&#x5E26;&#x6709;&#x65E7;&#x503C;&#x7684;&#x526F;&#x672C;&#x3002;&#x5E76;&#x4E14;&#x5176;&#x6570;&#x636E;&#x4ECE;&#x5E26;&#x6709;&#x65E7;&#x503C;&#x7684;&#x526F;&#x672C;&#x4E2D;&#x6062;&#x590D;&#xFF0C;&#x5219;&#x5B58;&#x50A8;&#x65B0;&#x503C;&#x7684;&#x526F;&#x672C;&#x6570;&#x53EF;&#x80FD;&#x4F1A;&#x4F4E;&#x4E8E;w&#xFF0C;&#x4ECE;&#x800C;&#x6253;&#x7834;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x6761;&#x4EF6;&#x3002;</li>
<li>&#x5373;&#x4F7F;&#x4E00;&#x5207;&#x5DE5;&#x4F5C;&#x6B63;&#x5E38;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x4E0D;&#x5E78;&#x5730;&#x51FA;&#x73B0;&#x5173;&#x4E8E;<strong>&#x65F6;&#x5E8F;&#xFF08;timing&#xFF09;</strong> &#x7684;&#x8FB9;&#x7F18;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C;334&#x9875;&#x4E0A;&#x7684;&#x201C;<a href="ch9.html#&#x7EBF;&#x6027;&#x5316;&#x548C;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;">&#x7EBF;&#x6027;&#x5316;&#x548C;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;</a>&#x201D;&#x4E2D;&#x770B;&#x5230;&#x8FD9;&#x70B9;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5C3D;&#x7BA1;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4F3C;&#x4E4E;&#x4FDD;&#x8BC1;&#x8BFB;&#x53D6;&#x8FD4;&#x56DE;&#x6700;&#x65B0;&#x7684;&#x5199;&#x5165;&#x503C;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x5E76;&#x4E0D;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002; Dynamo&#x98CE;&#x683C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x9488;&#x5BF9;&#x53EF;&#x4EE5;&#x5FCD;&#x53D7;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x7528;&#x4F8B;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x53C2;&#x6570;w&#x548C;r&#x6765;&#x8C03;&#x6574;&#x8BFB;&#x53D6;&#x9648;&#x65E7;&#x503C;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x4F46;&#x628A;&#x5B83;&#x4EEC;&#x5F53;&#x6210;&#x7EDD;&#x5BF9;&#x7684;&#x4FDD;&#x8BC1;&#x662F;&#x4E0D;&#x660E;&#x667A;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5C24;&#x5176;&#x662F;&#xFF0C;&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x201C;<a href="#">&#x4E0E;&#x5EF6;&#x8FDF;&#x6709;&#x5173;&#x7684;&#x95EE;&#x9898;</a>&#x201D;&#xFF08;&#x8BFB;&#x53D6;&#x60A8;&#x7684;&#x5199;&#x5165;&#xFF0C;&#x5355;&#x8C03;&#x8BFB;&#x53D6;&#x6216;&#x4E00;&#x81F4;&#x7684;&#x524D;&#x7F00;&#x8BFB;&#x53D6;&#xFF09;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x56E0;&#x6B64;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5F02;&#x5E38;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;&#x66F4;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x4FDD;&#x8BC1;&#x901A;&#x5E38;&#x9700;&#x8981;<strong>&#x4E8B;&#x52A1;</strong>&#x6216;<strong>&#x5171;&#x8BC6;</strong>&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch7.html">&#x7B2C;&#x4E03;&#x7AE0;</a>&#x548C;<a href="ch9.html">&#x7B2C;&#x4E5D;&#x7AE0;</a>&#x56DE;&#x5230;&#x8FD9;&#x4E9B;&#x8BDD;&#x9898;&#x3002;</p>
<h4 id="&#x76D1;&#x63A7;&#x9648;&#x65E7;&#x5EA6;">&#x76D1;&#x63A7;&#x9648;&#x65E7;&#x5EA6;</h4>
<p>&#x200B;    &#x4ECE;&#x8FD0;&#x7EF4;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x76D1;&#x89C6;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5426;&#x8FD4;&#x56DE;&#x6700;&#x65B0;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x9648;&#x65E7;&#x7684;&#x8BFB;&#x53D6;&#xFF0C;&#x60A8;&#x4E5F;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x590D;&#x5236;&#x7684;&#x5065;&#x5EB7;&#x72B6;&#x51B5;&#x3002;&#x5982;&#x679C;&#x663E;&#x8457;&#x843D;&#x540E;&#xFF0C;&#x5E94;&#x8BE5;&#x63D0;&#x9192;&#x60A8;&#xFF0C;&#x4EE5;&#x4FBF;&#x60A8;&#x53EF;&#x4EE5;&#x8C03;&#x67E5;&#x539F;&#x56E0;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x6216;&#x8D85;&#x8F7D;&#x8282;&#x70B9;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5BF9;&#x4E8E;&#x57FA;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x590D;&#x5236;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x4F1A;&#x516C;&#x5F00;&#x590D;&#x5236;&#x6EDE;&#x540E;&#x7684;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x63D0;&#x4F9B;&#x7ED9;&#x76D1;&#x89C6;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5199;&#x5165;&#x6309;&#x7167;&#x76F8;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x5E94;&#x7528;&#x4E8E;&#x9886;&#x5BFC;&#x8005;&#x548C;&#x8FFD;&#x968F;&#x8005;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5728;&#x590D;&#x5236;&#x65E5;&#x5FD7;&#x4E2D;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF08;&#x5728;&#x672C;&#x5730;&#x5E94;&#x7528;&#x7684;&#x5199;&#x5165;&#x6B21;&#x6570;&#xFF09;&#x3002;&#x901A;&#x8FC7;&#x4ECE;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#x4E2D;&#x51CF;&#x53BB;&#x968F;&#x4ECE;&#x8005;&#x7684;&#x5F53;&#x524D;&#x4F4D;&#x7F6E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;&#x590D;&#x5236;&#x6EDE;&#x540E;&#x91CF;&#x3002;</p>
<p>&#x200B;    &#x7136;&#x800C;&#xFF0C;&#x5728;&#x65E0;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x56FA;&#x5B9A;&#x7684;&#x5199;&#x5165;&#x987A;&#x5E8F;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x76D1;&#x63A7;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x4F7F;&#x7528;&#x8BFB;&#x4FEE;&#x590D;&#xFF08;&#x6CA1;&#x6709;&#x53CD;&#x71B5;&#x8FC7;&#x7A0B;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x503C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x591A;&#x5927;&#x7684;&#x9650;&#x5236;&#x662F;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x7684; - &#x5982;&#x679C;&#x4E00;&#x4E2A;&#x503C;&#x5F88;&#x5C11;&#x88AB;&#x8BFB;&#x53D6;&#xFF0C;&#x90A3;&#x4E48;&#x7531;&#x4E00;&#x4E2A;&#x9648;&#x65E7;&#x526F;&#x672C;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#x53EF;&#x80FD;&#x662F;&#x53E4;&#x8001;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x8861;&#x91CF;&#x65E0;&#x4E3B;&#x590D;&#x5236;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x590D;&#x5236;&#x9648;&#x65E7;&#x5EA6;&#x7684;&#x7814;&#x7A76;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x53C2;&#x6570;n&#xFF0C;w&#x548C;r&#x6765;&#x9884;&#x6D4B;&#x9648;&#x65E7;&#x8BFB;&#x53D6;&#x7684;&#x9884;&#x671F;&#x767E;&#x5206;&#x6BD4;&#x3010;48&#x3011;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x5E38;&#x89C1;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5C06;&#x8FC7;&#x65F6;&#x6D4B;&#x91CF;&#x503C;&#x5305;&#x542B;&#x5728;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6807;&#x51C6;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x4E2D;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#x3002;&#x6700;&#x7EC8;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x662F;&#x6545;&#x610F;&#x6A21;&#x7CCA;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x53EF;&#x64CD;&#x4F5C;&#x6027;&#x6765;&#x8BF4;&#xFF0C;&#x80FD;&#x591F;&#x91CF;&#x5316;&#x201C;&#x6700;&#x7EC8;&#x201D;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<h3 id="&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E0E;&#x63D0;&#x793A;&#x79FB;&#x4EA4;">&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E0E;&#x63D0;&#x793A;&#x79FB;&#x4EA4;</h3>
<p>&#x200B;    &#x5408;&#x7406;&#x914D;&#x7F6E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x53EF;&#x4EE5;&#x4F7F;&#x6570;&#x636E;&#x5E93;&#x65E0;&#x9700;&#x6545;&#x969C;&#x5207;&#x6362;&#x5373;&#x53EF;&#x5BB9;&#x5FCD;&#x4E2A;&#x522B;&#x8282;&#x70B9;&#x7684;&#x6545;&#x969C;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x4E2A;&#x522B;&#x8282;&#x70B9;&#x53D8;&#x6162;&#xFF0C;&#x56E0;&#x4E3A;&#x8BF7;&#x6C42;&#x4E0D;&#x5FC5;&#x7B49;&#x5F85;&#x6240;&#x6709;n&#x4E2A;&#x8282;&#x70B9;&#x54CD;&#x5E94;&#x2014;&#x2014;&#x5F53;w&#x6216;r&#x8282;&#x70B9;&#x54CD;&#x5E94;&#x65F6;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD4;&#x56DE;&#x3002;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x4F4E;&#x5EF6;&#x65F6;&#x3001;&#x4E14;&#x80FD;&#x591F;&#x5BB9;&#x5FCD;&#x5076;&#x5C14;&#x8BFB;&#x5230;&#x9648;&#x65E7;&#x503C;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x4F7F;&#x65E0;&#x4E3B;&#x590D;&#x5236;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5F88;&#x6709;&#x5438;&#x5F15;&#x529B;&#x3002;</p>
<p>&#x200B;    &#x7136;&#x800C;&#xFF0C;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF08;&#x5982;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#xFF09;&#x5E76;&#x4E0D;&#x50CF;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x7684;&#x90A3;&#x6837;&#x5177;&#x6709;&#x5BB9;&#x9519;&#x6027;&#x3002;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x4ECE;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8282;&#x70B9;&#x4E0A;&#x5207;&#x65AD;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x662F;&#x6D3B;&#x7740;&#x7684;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x80FD;&#x80FD;&#x591F;&#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x4EEC;&#xFF0C;&#x4F46;&#x662F;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8282;&#x70B9;&#x5207;&#x65AD;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x6B7B;&#x4EA1;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5269;&#x4F59;&#x7684;&#x53EF;&#x7528;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x5C11;&#x4E8E;&#x53EF;&#x7528;&#x8282;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x7684;&#x7FA4;&#x96C6;&#x4E2D;&#xFF08;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x660E;&#x663E;&#x591A;&#x4E8E;n&#x4E2A;&#xFF09;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x671F;&#x95F4;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x80FD;&#x8FDE;&#x63A5;&#x5230;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x8282;&#x70B9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x4E3A;&#x7279;&#x5B9A;&#x503C;&#x7EC4;&#x6210;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x7684;&#x8282;&#x70B9;&#x4EEC;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x6743;&#x8861;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x5C06;&#x9519;&#x8BEF;&#x8FD4;&#x56DE;&#x7ED9;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;w&#x6216;r&#x8282;&#x70B9;&#x7684;&#x6CD5;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x6240;&#x6709;&#x8BF7;&#x6C42;&#x662F;&#x5426;&#x66F4;&#x597D;&#xFF1F;</li>
<li>&#x6216;&#x8005;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x5199;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B83;&#x4EEC;&#x5199;&#x5165;&#x4E00;&#x4E9B;&#x53EF;&#x8FBE;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4F46;&#x4E0D;&#x5728;&#x8FD9;&#x4E9B;&#x503C;&#x901A;&#x5E38;&#x5B58;&#x5728;&#x7684;n&#x4E2A;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#xFF1F;</li>
</ul>
<p>&#x540E;&#x8005;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;<strong>&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF08;sloppy quorum&#xFF09;</strong>&#x3010;37&#x3011;&#xFF1A;&#x5199;&#x548C;&#x8BFB;&#x4ECD;&#x7136;&#x9700;&#x8981;w&#x548C;r&#x6210;&#x529F;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x4E9B;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x4E0D;&#x5728;&#x6307;&#x5B9A;&#x7684;n&#x4E2A;&#x201C;&#x4E3B;&#x201D;&#x8282;&#x70B9;&#x4E2D;&#x7684;&#x503C;&#x3002;&#x6BD4;&#x65B9;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x628A;&#x81EA;&#x5DF1;&#x9501;&#x5728;&#x623F;&#x5B50;&#x5916;&#x9762;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x6572;&#x5F00;&#x90BB;&#x5C45;&#x7684;&#x95E8;&#xFF0C;&#x95EE;&#x4F60;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x6682;&#x65F6;&#x505C;&#x7559;&#x5728;&#x6C99;&#x53D1;&#x4E0A;&#x3002;</p>
<p>&#x200B;    &#x4E00;&#x65E6;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#xFF0C;&#x4EE3;&#x8868;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E34;&#x65F6;&#x63A5;&#x53D7;&#x7684;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x90FD;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x9002;&#x5F53;&#x7684;&#x201C;&#x672C;&#x5730;&#x201D;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;<strong>&#x63D0;&#x793A;&#x79FB;&#x4EA4;&#xFF08;hinted handoff&#xFF09;</strong>&#x3002; &#xFF08;&#x4E00;&#x65E6;&#x4F60;&#x518D;&#x6B21;&#x627E;&#x5230;&#x4F60;&#x7684;&#x623F;&#x5B50;&#x7684;&#x94A5;&#x5319;&#xFF0C;&#x4F60;&#x7684;&#x90BB;&#x5C45;&#x793C;&#x8C8C;&#x5730;&#x8981;&#x6C42;&#x4F60;&#x79BB;&#x5F00;&#x6C99;&#x53D1;&#x56DE;&#x5BB6;&#x3002;&#xFF09;</p>
<p>&#x200B;    &#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x5BF9;&#x5199;&#x5165;&#x53EF;&#x7528;&#x6027;&#x7684;&#x63D0;&#x9AD8;&#x7279;&#x522B;&#x6709;&#x7528;&#xFF1A;&#x53EA;&#x8981;&#x6709;&#x4EFB;&#x4F55;w&#x8282;&#x70B9;&#x53EF;&#x7528;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5C31;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x5199;&#x5165;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5373;&#x4F7F;&#x5F53;$w + r&gt; n$&#x65F6;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x786E;&#x5B9A;&#x8BFB;&#x53D6;&#x67D0;&#x4E2A;&#x952E;&#x7684;&#x6700;&#x65B0;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x65B0;&#x7684;&#x503C;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x4E34;&#x65F6;&#x5199;&#x5165;&#x4E86;n&#x4E4B;&#x5916;&#x7684;&#x67D0;&#x4E9B;&#x8282;&#x70B9;&#x3010;47&#x3011;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x4F20;&#x7EDF;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x3002;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x4FDD;&#x8BC1;&#xFF0C;&#x5373;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;w&#x8282;&#x70B9;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;r&#x8282;&#x70B9;&#x7684;&#x8BFB;&#x53D6;&#x76F4;&#x5230;&#x63D0;&#x793A;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x6240;&#x6709;&#x5E38;&#x89C1;&#x7684;Dynamo&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x5BBD;&#x677E;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x662F;&#x53EF;&#x9009;&#x7684;&#x3002;&#x5728;Riak&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x9ED8;&#x8BA4;&#x662F;&#x542F;&#x7528;&#x7684;&#xFF0C;&#x800C;&#x5728;Cassandra&#x548C;Voldemort&#x4E2D;&#x5B83;&#x4EEC;&#x9ED8;&#x8BA4;&#x662F;&#x7981;&#x7528;&#x7684;&#x3010;46,49,50&#x3011;&#x3002;</p>
<h4 id="&#x8FD0;&#x7EF4;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;">&#x8FD0;&#x7EF4;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;</h4>
<p>&#x200B;    &#x6211;&#x4EEC;&#x5148;&#x524D;&#x8BA8;&#x8BBA;&#x4E86;&#x8DE8;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x590D;&#x5236;&#x4F5C;&#x4E3A;&#x591A;&#x4E3B;&#x590D;&#x5236;&#x7684;&#x7528;&#x4F8B;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x591A;&#x4E3B;&#x590D;&#x5236;">&#x591A;&#x4E3B;&#x590D;&#x5236;</a>&#x201D;&#xFF09;&#x3002;&#x65E0;&#x4E3B;&#x590D;&#x5236;&#x8FD8;&#x9002;&#x7528;&#x4E8E;&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x65E8;&#x5728;&#x5BB9;&#x5FCD;&#x51B2;&#x7A81;&#x7684;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x548C;&#x5EF6;&#x8FDF;&#x5C16;&#x5CF0;&#x3002;</p>
<p>&#x200B;    Cassandra&#x548C;Voldemort&#x5728;&#x6B63;&#x5E38;&#x7684;&#x65E0;&#x4E3B;&#x6A21;&#x578B;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x4ED6;&#x4EEC;&#x7684;&#x591A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x652F;&#x6301;&#xFF1A;&#x526F;&#x672C;&#x7684;&#x6570;&#x91CF;n&#x5305;&#x62EC;&#x6240;&#x6709;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5728;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E2D;&#x60A8;&#x60F3;&#x62E5;&#x6709;&#x7684;&#x526F;&#x672C;&#x7684;&#x6570;&#x91CF;&#x3002;&#x65E0;&#x8BBA;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5982;&#x4F55;&#xFF0C;&#x6BCF;&#x4E2A;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5199;&#x5165;&#x90FD;&#x4F1A;&#x53D1;&#x9001;&#x5230;&#x6240;&#x6709;&#x526F;&#x672C;&#xFF0C;&#x4F46;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x5E38;&#x53EA;&#x7B49;&#x5F85;&#x6765;&#x81EA;&#x5176;&#x672C;&#x5730;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x7684;&#x6CD5;&#x5B9A;&#x8282;&#x70B9;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x4ECE;&#x800C;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x8DE8;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x94FE;&#x8DEF;&#x5EF6;&#x8FDF;&#x548C;&#x4E2D;&#x65AD;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5BF9;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x9AD8;&#x5EF6;&#x8FDF;&#x5199;&#x5165;&#x901A;&#x5E38;&#x88AB;&#x914D;&#x7F6E;&#x4E3A;&#x5F02;&#x6B65;&#x53D1;&#x751F;&#xFF0C;&#x5C3D;&#x7BA1;&#x914D;&#x7F6E;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3010;50,51&#x3011;&#x3002;</p>
<p>&#x200B;    Riak&#x5C06;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x6570;&#x636E;&#x5E93;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x901A;&#x4FE1;&#x4FDD;&#x6301;&#x5728;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x672C;&#x5730;&#xFF0C;&#x56E0;&#x6B64;n&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#x7684;&#x526F;&#x672C;&#x6570;&#x91CF;&#x3002;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x4E4B;&#x95F4;&#x7684;&#x8DE8;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x590D;&#x5236;&#x5728;&#x540E;&#x53F0;&#x5F02;&#x6B65;&#x53D1;&#x751F;&#xFF0C;&#x5176;&#x98CE;&#x683C;&#x7C7B;&#x4F3C;&#x4E8E;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x3010;52&#x3011;&#x3002;</p>
<h3 id="&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;">&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;</h3>
<p>&#x200B;    Dynamo&#x98CE;&#x683C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x540C;&#x65F6;&#x5199;&#x5165;&#x76F8;&#x540C;&#x7684;Key&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5373;&#x4F7F;&#x4F7F;&#x7528;&#x4E25;&#x683C;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E5F;&#x4F1A;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0E;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x76F8;&#x4F3C;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;">&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;</a>&#x201D;&#xFF09;&#xFF0C;&#x4F46;&#x5728;Dynamo&#x6837;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5728;<strong>&#x8BFB;&#x4FEE;&#x590D;</strong>&#x6216;<strong>&#x63D0;&#x793A;&#x79FB;&#x4EA4;</strong>&#x671F;&#x95F4;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x200B;    &#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x7531;&#x4E8E;&#x53EF;&#x53D8;&#x7684;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x548C;&#x90E8;&#x5206;&#x6545;&#x969C;&#xFF0C;&#x4E8B;&#x4EF6;&#x53EF;&#x80FD;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x5230;&#x8FBE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;<a href="img/fig5-12.png">&#x56FE;5-12</a>&#x663E;&#x793A;&#x4E86;&#x4E24;&#x4E2A;&#x5BA2;&#x6237;&#x673A;A&#x548C;B&#x540C;&#x65F6;&#x5199;&#x5165;&#x4E09;&#x8282;&#x70B9;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x533A;&#x4E2D;&#x7684;&#x952E;X&#xFF1A;</p>
<ul>
<li>&#x8282;&#x70B9; 1 &#x63A5;&#x6536;&#x6765;&#x81EA; A &#x7684;&#x5199;&#x5165;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x6682;&#x65F6;&#x4E2D;&#x65AD;&#xFF0C;&#x4ECE;&#x4E0D;&#x63A5;&#x6536;&#x6765;&#x81EA; B &#x7684;&#x5199;&#x5165;&#x3002;</li>
<li>&#x8282;&#x70B9; 2 &#x9996;&#x5148;&#x63A5;&#x6536;&#x6765;&#x81EA; A &#x7684;&#x5199;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x63A5;&#x6536;&#x6765;&#x81EA; B &#x7684;&#x5199;&#x5165;&#x3002;</li>
<li>&#x8282;&#x70B9; 3 &#x9996;&#x5148;&#x63A5;&#x6536;&#x6765;&#x81EA; B &#x7684;&#x5199;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x4ECE; A &#x5199;&#x5165;&#x3002;</li>
</ul>
<p><img src="img/fig5-12.png" alt=""></p>
<p><strong>&#x56FE;5-12 &#x5E76;&#x53D1;&#x5199;&#x5165;Dynamo&#x98CE;&#x683C;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF1A;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x7684;&#x987A;&#x5E8F;&#x3002;</strong></p>
<p>&#x200B;    &#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x53EA;&#x8981;&#x63A5;&#x6536;&#x5230;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#x5C31;&#x7B80;&#x5355;&#x5730;&#x8986;&#x76D6;&#x4E86;&#x67D0;&#x4E2A;&#x952E;&#x7684;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x8282;&#x70B9;&#x5C31;&#x4F1A;&#x6C38;&#x4E45;&#x5730;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5982;<a href="img/fig5-12.png">&#x56FE;5-12</a>&#x4E2D;&#x7684;&#x6700;&#x7EC8;&#x83B7;&#x53D6;&#x8BF7;&#x6C42;&#x6240;&#x793A;&#xFF1A;&#x8282;&#x70B9;2&#x8BA4;&#x4E3A; X &#x7684;&#x6700;&#x7EC8;&#x503C;&#x662F; B&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x8BA4;&#x4E3A;&#x503C;&#x662F; A &#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x6700;&#x7EC8;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#xFF0C;&#x526F;&#x672C;&#x5E94;&#x8BE5;&#x8D8B;&#x4E8E;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;&#x5982;&#x4F55;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF1F;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x590D;&#x5236;&#x7684;&#x6570;&#x636E;&#x5E93;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;&#x5B9E;&#x73B0;&#x90FD;&#x5F88;&#x7CDF;&#x7CD5;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x907F;&#x514D;&#x4E22;&#x5931;&#x6570;&#x636E;&#xFF0C;&#x4F60;&#xFF08;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF09;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5F88;&#x591A;&#x6709;&#x5173;&#x6570;&#x636E;&#x5E93;&#x51B2;&#x7A81;&#x5904;&#x7406;&#x7684;&#x5185;&#x90E8;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x201C;<a href="#&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;">&#x5904;&#x7406;&#x5199;&#x51B2;&#x7A81;</a>&#x201D;&#x4E00;&#x8282;&#x4E2D;&#x5DF2;&#x7ECF;&#x7B80;&#x8981;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E9B;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x7684;&#x6280;&#x672F;&#x3002;&#x5728;&#x603B;&#x7ED3;&#x672C;&#x7AE0;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x63A2;&#x8BA8;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;&#x4E22;&#x5F03;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF09;">&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;&#x4E22;&#x5F03;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF09;</h4>
<p>&#x200B;    &#x5B9E;&#x73B0;&#x6700;&#x7EC8;&#x878D;&#x5408;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x58F0;&#x660E;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x53EA;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x6700; <strong>&#x201C;&#x6700;&#x8FD1;&#x201D;</strong> &#x7684;&#x503C;&#xFF0C;&#x5E76;&#x5141;&#x8BB8; <strong>&#x201C;&#x66F4;&#x65E7;&#x201D;</strong> &#x7684;&#x503C;&#x88AB;&#x8986;&#x76D6;&#x548C;&#x629B;&#x5F03;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x53EA;&#x8981;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x79CD;&#x660E;&#x786E;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x786E;&#x5B9A;&#x54EA;&#x4E2A;&#x5199;&#x662F;&#x201C;&#x6700;&#x8FD1;&#x7684;&#x201D;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x6700;&#x7EC8;&#x90FD;&#x88AB;&#x590D;&#x5236;&#x5230;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x90A3;&#x4E48;&#x590D;&#x5236;&#x6700;&#x7EC8;&#x4F1A;&#x6536;&#x655B;&#x5230;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;</p>
<p>&#x200B;    &#x6B63;&#x5982; <strong>&#x201C;&#x6700;&#x8FD1;&#x201D;</strong> &#x7684;&#x5F15;&#x53F7;&#x6240;&#x8868;&#x660E;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5176;&#x5B9E;&#x9887;&#x5177;&#x8BEF;&#x5BFC;&#x6027;&#x3002;&#x5728;<a href="img/fig5-12.png">&#x56FE;5-12</a>&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x6570;&#x636E;&#x5E93;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x53E6;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x6E05;&#x695A;&#x54EA;&#x4E00;&#x4E2A;&#x5148;&#x53D1;&#x751F;&#x4E86;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8BF4;&#x201C;&#x53D1;&#x751F;&#x201D;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF1A;&#x6211;&#x4EEC;&#x8BF4;&#x5199;&#x5165;&#x662F; <strong>&#x5E76;&#x53D1;&#xFF08;concurrent&#xFF09;</strong> &#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5373;&#x4F7F;&#x5199;&#x5165;&#x6CA1;&#x6709;&#x81EA;&#x7136;&#x7684;&#x6392;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x5F3A;&#x5236;&#x4EFB;&#x610F;&#x6392;&#x5E8F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x9644;&#x52A0;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x6311;&#x9009;&#x6700; <strong>&#x201C;&#x6700;&#x8FD1;&#x201D;</strong> &#x7684;&#x6700;&#x5927;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x5E76;&#x4E22;&#x5F03;&#x5177;&#x6709;&#x8F83;&#x65E9;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x3002;&#x8FD9;&#x79CD;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x7B97;&#x6CD5;&#x88AB;&#x79F0;&#x4E3A; <strong>&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;LWW, last write wins&#xFF09;</strong>&#xFF0C;&#x662F;Cassandra &#x3010;53&#x3011;&#x552F;&#x4E00;&#x652F;&#x6301;&#x7684;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x662F;Riak &#x3010;35&#x3011;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x200B;    LWW&#x5B9E;&#x73B0;&#x4E86;&#x6700;&#x7EC8;&#x6536;&#x655B;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x4F46;&#x4EE5;<strong>&#x6301;&#x4E45;&#x6027;</strong>&#x4E3A;&#x4EE3;&#x4EF7;&#xFF1A;&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;Key&#x6709;&#x591A;&#x4E2A;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4EEC;&#x90FD;&#x88AB;&#x62A5;&#x544A;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x6210;&#x529F;&#xFF08;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x88AB;&#x5199;&#x5165; w &#x4E2A;&#x526F;&#x672C;&#xFF09;&#xFF0C;&#x4F46;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5199;&#x5165;&#x5C06;&#x5B58;&#x6D3B;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x5199;&#x5165;&#x5C06;&#x88AB;&#x9759;&#x9ED8;&#x4E22;&#x5F03;&#x3002;&#x6B64;&#x5916;&#xFF0C;LWW&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4F1A;&#x5220;&#x9664;&#x4E0D;&#x662F;&#x5E76;&#x53D1;&#x7684;&#x5199;&#x5165;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7684;&#x201C;<a href="ch8.html#&#x6709;&#x5E8F;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x95F4;&#x6233;">&#x6709;&#x5E8F;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x95F4;&#x6233;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x200B;    &#x6709;&#x4E00;&#x4E9B;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x7F13;&#x5B58;&#xFF0C;&#x5176;&#x4E2D;&#x4E22;&#x5931;&#x7684;&#x5199;&#x5165;&#x53EF;&#x80FD;&#x662F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E22;&#x5931;&#x6570;&#x636E;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#xFF0C;LWW&#x662F;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x70C2;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x200B;    &#x4E0E;LWW&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x7684;&#x552F;&#x4E00;&#x5B89;&#x5168;&#x65B9;&#x6CD5;&#x662F;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x952E;&#x53EA;&#x5199;&#x5165;&#x4E00;&#x6B21;&#xFF0C;&#x7136;&#x540E;&#x89C6;&#x4E3A;&#x4E0D;&#x53EF;&#x53D8;&#xFF0C;&#x4ECE;&#x800C;&#x907F;&#x514D;&#x5BF9;&#x540C;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x66F4;&#x65B0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Cassandra&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;UUID&#x4F5C;&#x4E3A;&#x952E;&#xFF0C;&#x4ECE;&#x800C;&#x4E3A;&#x6BCF;&#x4E2A;&#x5199;&#x64CD;&#x4F5C;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x952E;&#x3010;53&#x3011;&#x3002;</p>
<h4 id="&#x6B64;&#x524D;&#x53D1;&#x751F;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x5E76;&#x53D1;">&#x201C;&#x6B64;&#x524D;&#x53D1;&#x751F;&#x201D;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x5E76;&#x53D1;</h4>
<p>&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x662F;&#x5E76;&#x53D1;&#x7684;&#xFF1F;&#x4E3A;&#x4E86;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x76F4;&#x89C9;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#xFF1A;</p>
<ul>
<li>&#x5728;<a href="fig5-9.png">&#x56FE;5-9</a>&#x4E2D;&#xFF0C;&#x4E24;&#x4E2A;&#x5199;&#x5165;&#x4E0D;&#x662F;&#x5E76;&#x53D1;&#x7684;&#xFF1A;A&#x7684;&#x63D2;&#x5165;&#x53D1;&#x751F;&#x5728;B&#x7684;&#x589E;&#x91CF;&#x4E4B;&#x524D;&#xFF0C;&#x56E0;&#x4E3A;B&#x9012;&#x589E;&#x7684;&#x503C;&#x662F;A&#x63D2;&#x5165;&#x7684;&#x503C;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;B&#x7684;&#x64CD;&#x4F5C;&#x5EFA;&#x7ACB;&#x5728;A&#x7684;&#x64CD;&#x4F5C;&#x4E0A;&#xFF0C;&#x6240;&#x4EE5;B&#x7684;&#x64CD;&#x4F5C;&#x5FC5;&#x987B;&#x6709;&#x540E;&#x6765;&#x53D1;&#x751F;&#x3002;&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x8BF4;B&#x662F; <strong>&#x56E0;&#x679C;&#x4F9D;&#x8D56;&#xFF08;causally dependent&#xFF09;</strong> &#x4E8E;A</li>
<li>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;<a href="fig5-12.png">&#x56FE;5-12</a>&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x5199;&#x5165;&#x662F;&#x5E76;&#x53D1;&#x7684;&#xFF1A;&#x5F53;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x542F;&#x52A8;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x5B83;&#x4E0D;&#x77E5;&#x9053;&#x53E6;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x4E5F;&#x6B63;&#x5728;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x540C;&#x6837;&#x7684;Key&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x4E0D;&#x5B58;&#x5728;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;&#x64CD;&#x4F5C;B&#x4E86;&#x89E3;&#x64CD;&#x4F5C;A&#xFF0C;&#x6216;&#x8005;&#x4F9D;&#x8D56;&#x4E8E;A&#xFF0C;&#x6216;&#x8005;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x6784;&#x5EFA;&#x4E8E;&#x64CD;&#x4F5C;A&#x4E4B;&#x4E0A;&#xFF0C;&#x5219;&#x64CD;&#x4F5C;A&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;B&#x4E4B;&#x524D;&#x53D1;&#x751F;&#x3002;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x662F;&#x5426;&#x53D1;&#x751F;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5B9A;&#x4E49;&#x4EC0;&#x4E48;&#x5E76;&#x53D1;&#x7684;&#x5173;&#x952E;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x90FD;&#x4E0D;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4E4B;&#x524D;&#x53D1;&#x751F;&#xFF0C;&#x90A3;&#x4E48;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5E76;&#x53D1;&#x7684;&#xFF08;&#x5373;&#xFF0C;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x53E6;&#x4E00;&#x4E2A;&#xFF09;&#x3010;54&#x3011;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;A&#x548C;B&#xFF0C;&#x5C31;&#x6709;&#x4E09;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#xFF1A;A&#x5728;B&#x4E4B;&#x524D;&#x53D1;&#x751F;&#xFF0C;&#x6216;&#x8005;B&#x5728;A&#x4E4B;&#x524D;&#x53D1;&#x751F;&#xFF0C;&#x6216;&#x8005;A&#x548C;B&#x5E76;&#x53D1;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x6765;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x662F;&#x5E76;&#x53D1;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x53D1;&#x751F;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x5219;&#x540E;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x5E94;&#x8BE5;&#x8986;&#x76D6;&#x8F83;&#x65E9;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x662F;&#x5E76;&#x53D1;&#x7684;&#xFF0C;&#x5219;&#x5B58;&#x5728;&#x9700;&#x8981;&#x89E3;&#x51B3;&#x7684;&#x51B2;&#x7A81;&#x3002;</p>
<blockquote>
<h4 id="&#x5E76;&#x53D1;&#x6027;&#xFF0C;&#x65F6;&#x95F4;&#x548C;&#x76F8;&#x5BF9;&#x6027;">&#x5E76;&#x53D1;&#x6027;&#xFF0C;&#x65F6;&#x95F4;&#x548C;&#x76F8;&#x5BF9;&#x6027;</h4>
<p>&#x200B;    &#x5982;&#x679C;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C; <strong>&#x201C;&#x540C;&#x65F6;&#x201D;</strong> &#x53D1;&#x751F;&#xFF0C;&#x4F3C;&#x4E4E;&#x5E94;&#x8BE5;&#x79F0;&#x4E3A;&#x5E76;&#x53D1;&#x2014;&#x2014;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x5B57;&#x9762;&#x65F6;&#x95F4;&#x4E0A;&#x91CD;&#x53E0;&#x4E0E;&#x5426;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x7531;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x65F6;&#x949F;&#x95EE;&#x9898;&#xFF0C;&#x73B0;&#x5B9E;&#x4E2D;&#x662F;&#x5F88;&#x96BE;&#x5224;&#x65AD;&#x4E24;&#x4E2A;&#x4E8B;&#x4EF6;&#x662F;&#x5426;<strong>&#x540C;&#x65F6;</strong>&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch8.html">&#x7B2C;8&#x7AE0;</a>&#x4E2D;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x5B9A;&#x4E49;&#x5E76;&#x53D1;&#x6027;&#xFF0C;&#x786E;&#x5207;&#x7684;&#x65F6;&#x95F4;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x90FD;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x5BF9;&#x65B9;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x5C31;&#x79F0;&#x8FD9;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;<strong>&#x5E76;&#x53D1;</strong>&#xFF0C;&#x800C;&#x4E0D;&#x7BA1;&#x5B83;&#x4EEC;&#x53D1;&#x751F;&#x7684;&#x7269;&#x7406;&#x65F6;&#x95F4;&#x3002;&#x4EBA;&#x4EEC;&#x6709;&#x65F6;&#x628A;&#x8FD9;&#x4E2A;&#x539F;&#x7406;&#x548C;&#x72ED;&#x4E49;&#x76F8;&#x5BF9;&#x8BBA;&#x7684;&#x7269;&#x7406;&#x5B66;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x3010;54&#x3011;&#xFF0C;&#x5B83;&#x5F15;&#x5165;&#x4E86;&#x4FE1;&#x606F;&#x4E0D;&#x80FD;&#x6BD4;&#x5149;&#x901F;&#x66F4;&#x5FEB;&#x7684;&#x601D;&#x60F3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x77ED;&#x4E8E;&#x5149;&#x901A;&#x8FC7;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x90A3;&#x4E48;&#x53D1;&#x751F;&#x4E00;&#x5B9A;&#x8DDD;&#x79BB;&#x7684;&#x4E24;&#x4E2A;&#x4E8B;&#x4EF6;&#x4E0D;&#x53EF;&#x80FD;&#x76F8;&#x4E92;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x5149;&#x901F;&#x539F;&#x5219;&#x4E0A;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x5F71;&#x54CD;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;<strong>&#x5E76;&#x884C;&#x7684;</strong>&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x7F13;&#x6162;&#x6216;&#x4E2D;&#x65AD;&#xFF0C;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x95F4;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF0C;&#x4E14;&#x4ECD;&#x7136;&#x662F;&#x5E76;&#x53D1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x963B;&#x6B62;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x610F;&#x8BC6;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
</blockquote>
<h4 id="&#x6355;&#x83B7;&#x6B64;&#x524D;&#x53D1;&#x751F;&#x5173;&#x7CFB;">&#x6355;&#x83B7;&quot;&#x6B64;&#x524D;&#x53D1;&#x751F;&quot;&#x5173;&#x7CFB;</h4>
<p>&#x200B;    &#x6765;&#x770B;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x786E;&#x5B9A;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x4E3A;&#x5E76;&#x53D1;&#x7684;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x4E2A;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4E4B;&#x524D;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x4E00;&#x4E2A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5F00;&#x59CB;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5236;&#x5B9A;&#x4E86;&#x5982;&#x4F55;&#x5728;&#x5355;&#x4E2A;&#x526F;&#x672C;&#x4E0A;&#x5B8C;&#x6210;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x8BE5;&#x65B9;&#x6CD5;&#x6982;&#x62EC;&#x4E3A;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x7684;&#x65E0;&#x9886;&#x5BFC;&#x8005;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p><a href="">&#x56FE;5-13</a>&#x663E;&#x793A;&#x4E86;&#x4E24;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x540C;&#x65F6;&#x5411;&#x540C;&#x4E00;&#x8D2D;&#x7269;&#x8F66;&#x6DFB;&#x52A0;&#x9879;&#x76EE;&#x3002; &#xFF08;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x7684;&#x4F8B;&#x5B50;&#x8BA9;&#x4F60;&#x89C9;&#x5F97;&#x592A;&#x9EBB;&#x70E6;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#xFF0C;&#x4E24;&#x4E2A;&#x7A7A;&#x4E2D;&#x4EA4;&#x901A;&#x7BA1;&#x5236;&#x5458;&#x540C;&#x65F6;&#x628A;&#x98DE;&#x673A;&#x6DFB;&#x52A0;&#x5230;&#x4ED6;&#x4EEC;&#x6B63;&#x5728;&#x8DDF;&#x8E2A;&#x7684;&#x533A;&#x57DF;&#xFF09;&#x6700;&#x521D;&#xFF0C;&#x8D2D;&#x7269;&#x8F66;&#x662F;&#x7A7A;&#x7684;&#x3002;&#x5728;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5411;&#x6570;&#x636E;&#x5E93;&#x53D1;&#x51FA;&#x4E94;&#x6B21;&#x5199;&#x5165;&#xFF1A;</p>
<ol>
<li>&#x5BA2;&#x6237;&#x7AEF; 1 &#x5C06;&#x725B;&#x5976;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#x3002;&#x8FD9;&#x662F;&#x8BE5;&#x952E;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x5199;&#x5165;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x6210;&#x529F;&#x5B58;&#x50A8;&#x4E86;&#x5B83;&#x5E76;&#x4E3A;&#x5176;&#x5206;&#x914D;&#x7248;&#x672C;&#x53F7;1&#xFF0C;&#x6700;&#x540E;&#x5C06;&#x503C;&#x4E0E;&#x7248;&#x672C;&#x53F7;&#x4E00;&#x8D77;&#x56DE;&#x9001;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</li>
<li>&#x5BA2;&#x6237;&#x7AEF; 2 &#x5C06;&#x9E21;&#x86CB;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x5BA2;&#x6237;&#x7AEF; 1 &#x540C;&#x65F6;&#x6DFB;&#x52A0;&#x4E86;&#x725B;&#x5976;&#xFF08;&#x5BA2;&#x6237;&#x7AEF; 2 &#x8BA4;&#x4E3A;&#x5B83;&#x7684;&#x9E21;&#x86CB;&#x662F;&#x8D2D;&#x7269;&#x8F66;&#x4E2D;&#x7684;&#x552F;&#x4E00;&#x7269;&#x54C1;&#xFF09;&#x3002;&#x670D;&#x52A1;&#x5668;&#x4E3A;&#x6B64;&#x5199;&#x5165;&#x5206;&#x914D;&#x7248;&#x672C;&#x53F7; 2&#xFF0C;&#x5E76;&#x5C06;&#x9E21;&#x86CB;&#x548C;&#x725B;&#x5976;&#x5B58;&#x50A8;&#x4E3A;&#x4E24;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x503C;&#x3002;&#x7136;&#x540E;&#x5B83;&#x5C06;&#x8FD9;&#x4E24;&#x4E2A;&#x503C;<strong>&#x90FD;</strong>&#x53CD;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF; 2 &#xFF0C;&#x5E76;&#x9644;&#x4E0A;&#x7248;&#x672C;&#x53F7; 2 &#x3002;</li>
<li>&#x5BA2;&#x6237;&#x7AEF; 1 &#x4E0D;&#x77E5;&#x9053;&#x5BA2;&#x6237;&#x7AEF; 2 &#x7684;&#x5199;&#x5165;&#xFF0C;&#x60F3;&#x8981;&#x5C06;&#x9762;&#x7C89;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#xFF0C;&#x56E0;&#x6B64;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x7684;&#x8D2D;&#x7269;&#x8F66;&#x5185;&#x5BB9;&#x5E94;&#x8BE5;&#x662F; [&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;]&#x3002;&#x5B83;&#x5C06;&#x6B64;&#x503C;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x5148;&#x524D;&#x5411;&#x5BA2;&#x6237;&#x7AEF; 1 &#x63D0;&#x4F9B;&#x7684;&#x7248;&#x672C;&#x53F7; 1 &#x4E00;&#x8D77;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x4ECE;&#x7248;&#x672C;&#x53F7;&#x4E2D;&#x77E5;&#x9053;[&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;]&#x7684;&#x5199;&#x5165;&#x53D6;&#x4EE3;&#x4E86;[&#x725B;&#x5976;]&#x7684;&#x5148;&#x524D;&#x503C;&#xFF0C;&#x4F46;&#x4E0E;[&#x9E21;&#x86CB;]&#x7684;&#x503C;&#x662F;<strong>&#x5E76;&#x53D1;</strong>&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x7248;&#x672C; 3 &#x5206;&#x914D;&#x7ED9;[&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;]&#xFF0C;&#x8986;&#x76D6;&#x7248;&#x672C;1&#x503C;[&#x725B;&#x5976;]&#xFF0C;&#x4F46;&#x4FDD;&#x7559;&#x7248;&#x672C; 2 &#x7684;&#x503C;[&#x86CB;]&#xFF0C;&#x5E76;&#x5C06;&#x6240;&#x6709;&#x7684;&#x503C;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF; 1 &#x3002;</li>
<li>&#x540C;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF; 2 &#x60F3;&#x8981;&#x52A0;&#x5165;&#x706B;&#x817F;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x5BA2;&#x7AEF;&#x6237; 1 &#x521A;&#x521A;&#x52A0;&#x4E86;&#x9762;&#x7C89;&#x3002;&#x5BA2;&#x6237;&#x7AEF; 2 &#x5728;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x4E2D;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x4E86;&#x4E24;&#x4E2A;&#x503C;[&#x725B;&#x5976;]&#x548C;[&#x86CB;]&#xFF0C;&#x6240;&#x4EE5;&#x5BA2;&#x6237;&#x7AEF; 2 &#x73B0;&#x5728;&#x5408;&#x5E76;&#x8FD9;&#x4E9B;&#x503C;&#xFF0C;&#x5E76;&#x6DFB;&#x52A0;&#x706B;&#x817F;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x503C;&#xFF0C;[&#x9E21;&#x86CB;&#xFF0C;&#x725B;&#x5976;&#xFF0C;&#x706B;&#x817F;]&#x3002;&#x5B83;&#x5C06;&#x8FD9;&#x4E2A;&#x503C;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E26;&#x7740;&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;&#x53F7; 2 &#x3002;&#x670D;&#x52A1;&#x5668;&#x68C0;&#x6D4B;&#x5230;&#x65B0;&#x503C;&#x4F1A;&#x8986;&#x76D6;&#x7248;&#x672C; 2 [&#x9E21;&#x86CB;]&#xFF0C;&#x4F46;&#x65B0;&#x503C;&#x4E5F;&#x4F1A;&#x4E0E;&#x7248;&#x672C; 3 [&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;]<strong>&#x5E76;&#x53D1;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x5269;&#x4E0B;&#x7684;&#x4E24;&#x4E2A;&#x662F;v3 [&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;]&#xFF0C;&#x548C;v4&#xFF1A;[&#x9E21;&#x86CB;&#xFF0C;&#x725B;&#x5976;&#xFF0C;&#x706B;&#x817F;]</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF; 1 &#x60F3;&#x8981;&#x52A0;&#x57F9;&#x6839;&#x3002;&#x5B83;&#x4EE5;&#x524D;&#x5728;v3&#x4E2D;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;[&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;]&#x548C;[&#x9E21;&#x86CB;]&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x5408;&#x5E76;&#x8FD9;&#x4E9B;&#xFF0C;&#x6DFB;&#x52A0;&#x57F9;&#x6839;&#xFF0C;&#x5E76;&#x5C06;&#x6700;&#x7EC8;&#x503C;[&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;&#xFF0C;&#x9E21;&#x86CB;&#xFF0C;&#x57F9;&#x6839;]&#x8FDE;&#x540C;&#x7248;&#x672C;&#x53F7;v3&#x53D1;&#x5F80;&#x670D;&#x52A1;&#x5668;&#x3002;&#x8FD9;&#x4F1A;&#x8986;&#x76D6;v3[&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;]&#xFF08;&#x8BF7;&#x6CE8;&#x610F;[&#x9E21;&#x86CB;]&#x5DF2;&#x7ECF;&#x5728;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x88AB;&#x8986;&#x76D6;&#xFF09;&#xFF0C;&#x4F46;&#x4E0E;v4[&#x9E21;&#x86CB;&#xFF0C;&#x725B;&#x5976;&#xFF0C;&#x706B;&#x817F;]&#x5E76;&#x53D1;&#xFF0C;&#x6240;&#x4EE5;&#x670D;&#x52A1;&#x5668;&#x4FDD;&#x7559;&#x8FD9;&#x4E24;&#x4E2A;&#x5E76;&#x53D1;&#x503C;&#x3002;</li>
</ol>
<p><img src="img/fig5-13.png" alt=""></p>
<p><strong>&#x56FE;5-13  &#x6355;&#x83B7;&#x4E24;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x95F4;&#x7684;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#xFF0C;&#x540C;&#x65F6;&#x7F16;&#x8F91;&#x8D2D;&#x7269;&#x8F66;&#x3002;</strong></p>
<p>&#x200B;    <a href="img/fig5-13.png">&#x56FE;5-13</a>&#x4E2D;&#x7684;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x6D41;&#x5982;<a href="img/fig5-14.png">&#x56FE;5-14</a>&#x6240;&#x793A;&#x3002; &#x7BAD;&#x5934;&#x8868;&#x793A;&#x54EA;&#x4E2A;&#x64CD;&#x4F5C;&#x53D1;&#x751F;&#x5728;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x540E;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x77E5;&#x9053;&#x6216;&#x4F9D;&#x8D56;&#x4E8E;&#x8F83;&#x65E9;&#x7684;&#x64CD;&#x4F5C;&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5B8C;&#x5168;&#x638C;&#x63E1;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x603B;&#x662F;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x65E7;&#x7248;&#x672C;&#x7684;&#x503C;&#x6700;&#x7EC8;&#x4F1A;&#x88AB;&#x8986;&#x76D6;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x3002;</p>
<p><img src="img/fig5-14.png" alt=""></p>
<p><strong>&#x56FE;5-14 &#x56FE;5-13&#x4E2D;&#x7684;&#x56E0;&#x679C;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x56FE;&#x3002;</strong></p>
<p>&#x200B;    &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x7248;&#x672C;&#x53F7;&#x6765;&#x786E;&#x5B9A;&#x4E24;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x662F;&#x5E76;&#x53D1;&#x7684;&#x2014;&#x2014;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x89E3;&#x91CA;&#x8BE5;&#x503C;&#x672C;&#x8EAB;&#xFF08;&#x56E0;&#x6B64;&#x8BE5;&#x503C;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF09;&#x3002;&#x8BE5;&#x7B97;&#x6CD5;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x670D;&#x52A1;&#x5668;&#x4E3A;&#x6BCF;&#x4E2A;&#x952E;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x6BCF;&#x6B21;&#x5199;&#x5165;&#x952E;&#x65F6;&#x90FD;&#x589E;&#x52A0;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x5E76;&#x5C06;&#x65B0;&#x7248;&#x672C;&#x53F7;&#x4E0E;&#x5199;&#x5165;&#x7684;&#x503C;&#x4E00;&#x8D77;&#x5B58;&#x50A8;&#x3002;</li>
<li>&#x5F53;&#x5BA2;&#x6237;&#x7AEF;&#x8BFB;&#x53D6;&#x952E;&#x65F6;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x8FD4;&#x56DE;&#x6240;&#x6709;&#x672A;&#x8986;&#x76D6;&#x7684;&#x503C;&#x4EE5;&#x53CA;&#x6700;&#x65B0;&#x7684;&#x7248;&#x672C;&#x53F7;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x5199;&#x5165;&#x524D;&#x5FC5;&#x987B;&#x8BFB;&#x53D6;&#x3002;</li>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x5199;&#x5165;&#x952E;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x4E4B;&#x524D;&#x8BFB;&#x53D6;&#x7684;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x5C06;&#x4E4B;&#x524D;&#x8BFB;&#x53D6;&#x7684;&#x6240;&#x6709;&#x503C;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x8D77;&#x3002; &#xFF08;&#x6765;&#x81EA;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x53EF;&#x4EE5;&#x50CF;&#x8BFB;&#x53D6;&#x4E00;&#x6837;&#xFF0C;&#x8FD4;&#x56DE;&#x6240;&#x6709;&#x5F53;&#x524D;&#x503C;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x50CF;&#x8D2D;&#x7269;&#x8F66;&#x793A;&#x4F8B;&#x90A3;&#x6837;&#x8FDE;&#x63A5;&#x591A;&#x4E2A;&#x5199;&#x5165;&#x3002;&#xFF09;</li>
<li>&#x5F53;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x5230;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x7248;&#x672C;&#x53F7;&#x7684;&#x5199;&#x5165;&#x65F6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8986;&#x76D6;&#x8BE5;&#x7248;&#x672C;&#x53F7;&#x6216;&#x66F4;&#x4F4E;&#x7248;&#x672C;&#x7684;&#x6240;&#x6709;&#x503C;&#xFF08;&#x56E0;&#x4E3A;&#x5B83;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x5DF2;&#x7ECF;&#x88AB;&#x5408;&#x5E76;&#x5230;&#x65B0;&#x7684;&#x503C;&#x4E2D;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x6240;&#x6709;&#x503C;&#x66F4;&#x9AD8;&#x7248;&#x672C;&#x53F7;&#xFF08;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x503C;&#x4E0E;&#x4F20;&#x5165;&#x7684;&#x5199;&#x5165;&#x540C;&#x65F6;&#x53D1;&#x751F;&#xFF09;&#x3002;</li>
</ul>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x5199;&#x5165;&#x5305;&#x542B;&#x524D;&#x4E00;&#x6B21;&#x8BFB;&#x53D6;&#x7684;&#x7248;&#x672C;&#x53F7;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x5199;&#x5165;&#x7684;&#x662F;&#x54EA;&#x4E00;&#x79CD;&#x72B6;&#x6001;&#x3002;&#x5982;&#x679C;&#x5728;&#x4E0D;&#x5305;&#x542B;&#x7248;&#x672C;&#x53F7;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x5219;&#x4E0E;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x5199;&#x64CD;&#x4F5C;&#x5E76;&#x53D1;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4E0D;&#x4F1A;&#x8986;&#x76D6;&#x4EFB;&#x4F55;&#x5185;&#x5BB9; &#x2014;&#x2014; &#x53EA;&#x4F1A;&#x5728;&#x968F;&#x540E;&#x7684;&#x8BFB;&#x53D6;&#x4E2D;&#x4F5C;&#x4E3A;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x503C;&#x8FD4;&#x56DE;&#x3002;</p>
<h4 id="&#x5408;&#x5E76;&#x540C;&#x65F6;&#x5199;&#x5165;&#x7684;&#x503C;">&#x5408;&#x5E76;&#x540C;&#x65F6;&#x5199;&#x5165;&#x7684;&#x503C;</h4>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x88AB;&#x65E0;&#x58F0;&#x5730;&#x4E22;&#x5F03;&#xFF0C;&#x4F46;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#xFF1A;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x64CD;&#x4F5C;&#x5E76;&#x53D1;&#x53D1;&#x751F;&#xFF0C;&#x5219;&#x5BA2;&#x6237;&#x7AEF;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x5408;&#x5E76;&#x5E76;&#x53D1;&#x5199;&#x5165;&#x7684;&#x503C;&#x6765;&#x64E6;&#x5C41;&#x80A1;&#x3002; Riak&#x79F0;&#x8FD9;&#x4E9B;&#x5E76;&#x53D1;&#x503C;<strong>&#x5144;&#x5F1F;&#xFF08;siblings&#xFF09;</strong>&#x3002;</p>
<p>&#x200B;    &#x5408;&#x5E76;&#x5144;&#x5F1F;&#x503C;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x4E0E;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x4E2D;&#x7684;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x76F8;&#x540C;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x524D;&#x8BA8;&#x8BBA;&#x8FC7;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;">&#x5904;&#x7406;&#x5199;&#x5165;&#x51B2;&#x7A81;</a>&#x201D;&#xFF09;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6839;&#x636E;&#x7248;&#x672C;&#x53F7;&#x6216;&#x65F6;&#x95F4;&#x6233;&#xFF08;&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF09;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x4F46;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E22;&#x5931;&#x6570;&#x636E;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x505A;&#x66F4;&#x806A;&#x660E;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x200B;    &#x4EE5;&#x8D2D;&#x7269;&#x8F66;&#x4E3A;&#x4F8B;&#xFF0C;&#x4E00;&#x79CD;&#x5408;&#x7406;&#x7684;&#x5408;&#x5E76;&#x5144;&#x5F1F;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x96C6;&#x5408;&#x6C42;&#x5E76;&#x3002;&#x5728;<a href="img/fig5-14.png">&#x56FE;5-14</a>&#x4E2D;&#xFF0C;&#x6700;&#x540E;&#x7684;&#x4E24;&#x4E2A;&#x5144;&#x5F1F;&#x662F;[&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;&#xFF0C;&#x9E21;&#x86CB;&#xFF0C;&#x718F;&#x8089;]&#x548C;[&#x9E21;&#x86CB;&#xFF0C;&#x725B;&#x5976;&#xFF0C;&#x706B;&#x817F;]&#x3002;&#x6CE8;&#x610F;&#x725B;&#x5976;&#x548C;&#x9E21;&#x86CB;&#x51FA;&#x73B0;&#x5728;&#x4E24;&#x4E2A;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x6BCF;&#x4E2A;&#x53EA;&#x5199;&#x4E00;&#x6B21;&#x3002;&#x5408;&#x5E76;&#x7684;&#x4EF7;&#x503C;&#x53EF;&#x80FD;&#x662F;&#x50CF;[&#x725B;&#x5976;&#xFF0C;&#x9762;&#x7C89;&#xFF0C;&#x9E21;&#x86CB;&#xFF0C;&#x57F9;&#x6839;&#xFF0C;&#x706B;&#x817F;]&#xFF0C;&#x6CA1;&#x6709;&#x91CD;&#x590D;&#x3002;</p>
<p>&#x200B;    &#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8BA9;&#x4EBA;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x4ED6;&#x4EEC;&#x7684;&#x624B;&#x63A8;&#x8F66;&#x4E2D;<strong>&#x5220;&#x9664;</strong>&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EC5;&#x4EC5;&#x6DFB;&#x52A0;&#x4E1C;&#x897F;&#xFF0C;&#x90A3;&#x4E48;&#x628A;&#x5144;&#x5F1F;&#x6C42;&#x5E76;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x5408;&#x5E76;&#x4E86;&#x4E24;&#x4E2A;&#x5144;&#x5F1F;&#x624B;&#x63A8;&#x8F66;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5144;&#x5F1F;&#x503C;&#x91CC;&#x5220;&#x6389;&#x4E86;&#x5B83;&#xFF0C;&#x90A3;&#x4E48;&#x88AB;&#x5220;&#x9664;&#x7684;&#x9879;&#x76EE;&#x4F1A;&#x91CD;&#x65B0;&#x51FA;&#x73B0;&#x5728;&#x5144;&#x5F1F;&#x7684;&#x5E76;&#x96C6;&#x4E2D;&#x3010;37&#x3011;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x5728;&#x5220;&#x9664;&#x65F6;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x5730;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5220;&#x9664;&#xFF1B;&#x76F8;&#x53CD;&#xFF0C;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x7559;&#x4E0B;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x5408;&#x9002;&#x7248;&#x672C;&#x53F7;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x4EE5;&#x6307;&#x793A;&#x5408;&#x5E76;&#x5144;&#x5F1F;&#x65F6;&#x8BE5;&#x9879;&#x76EE;&#x5DF2;&#x88AB;&#x5220;&#x9664;&#x3002;&#x8FD9;&#x79CD;&#x5220;&#x9664;&#x6807;&#x8BB0;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5893;&#x7891;&#xFF08;tombstone&#xFF09;</strong>&#x3002; &#xFF08;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x5728;&#x201C;<a href="ch3.html#&#x54C8;&#x5E0C;&#x7D22;&#x5F15;">&#x54C8;&#x5E0C;&#x7D22;&#x5F15;&#x201D;</a>&#x4E2D;&#x7684;&#x65E5;&#x5FD7;&#x538B;&#x7F29;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x770B;&#x5230;&#x4E86;&#x5893;&#x7891;&#x3002;&#xFF09;</p>
<p>&#x200B;    &#x56E0;&#x4E3A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x5408;&#x5E76;&#x5144;&#x5F1F;&#x662F;&#x590D;&#x6742;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x88AB;&#x8BBE;&#x8BA1;&#x51FA;&#x6765;&#x7528;&#x4E8E;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x8FD9;&#x79CD;&#x5408;&#x5E76;&#xFF0C;&#x5982;&#x201C;<a href="">&#x81EA;&#x52A8;&#x51B2;&#x7A81;&#x89E3;&#x51B3;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Riak&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x652F;&#x6301;&#x4F7F;&#x7528;&#x79F0;&#x4E3A;CRDT&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5BB6;&#x65CF;&#x3010;38,39,55&#x3011;&#x53EF;&#x4EE5;&#x4EE5;&#x5408;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x81EA;&#x52A8;&#x5408;&#x5E76;&#x5144;&#x5F1F;&#xFF0C;&#x5305;&#x62EC;&#x4FDD;&#x7559;&#x5220;&#x9664;&#x3002;</p>
<h4 id="&#x7248;&#x672C;&#x5411;&#x91CF;">&#x7248;&#x672C;&#x5411;&#x91CF;</h4>
<p>&#x200B;    <a href="img/fig5-13.png">&#x56FE;5-13</a>&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x3002;&#x5F53;&#x6709;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x4F46;&#x6CA1;&#x6709;&#x9886;&#x5BFC;&#x8005;&#x65F6;&#xFF0C;&#x7B97;&#x6CD5;&#x5982;&#x4F55;&#x4FEE;&#x6539;&#xFF1F;</p>
<p>&#x200B;    <a href="img/fig5-13.png">&#x56FE;5-13</a>&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#x6765;&#x6355;&#x83B7;&#x64CD;&#x4F5C;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x5E76;&#x53D1;&#x63A5;&#x53D7;&#x5199;&#x5165;&#x65F6;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x9664;&#x4E86;&#x5BF9;&#x6BCF;&#x4E2A;&#x952E;&#x4F7F;&#x7528;&#x7248;&#x672C;&#x53F7;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x5728;<strong>&#x6BCF;&#x4E2A;&#x526F;&#x672C;</strong>&#x4E2D;&#x4F7F;&#x7528;&#x7248;&#x672C;&#x53F7;&#x3002;&#x6BCF;&#x4E2A;&#x526F;&#x672C;&#x5728;&#x5904;&#x7406;&#x5199;&#x5165;&#x65F6;&#x589E;&#x52A0;&#x81EA;&#x5DF1;&#x7684;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x5E76;&#x4E14;&#x8DDF;&#x8E2A;&#x4ECE;&#x5176;&#x4ED6;&#x526F;&#x672C;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x7248;&#x672C;&#x53F7;&#x3002;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x6307;&#x51FA;&#x4E86;&#x8981;&#x8986;&#x76D6;&#x54EA;&#x4E9B;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x4FDD;&#x7559;&#x54EA;&#x4E9B;&#x503C;&#x4F5C;&#x4E3A;&#x5144;&#x5F1F;&#x3002;</p>
<p>&#x200B;    &#x6240;&#x6709;&#x526F;&#x672C;&#x7684;&#x7248;&#x672C;&#x53F7;&#x96C6;&#x5408;&#x79F0;&#x4E3A;<strong>&#x7248;&#x672C;&#x5411;&#x91CF;&#xFF08;version vector&#xFF09;</strong>&#x3010;56&#x3011;&#x3002;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x7684;&#x4E00;&#x4E9B;&#x53D8;&#x4F53;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x53EF;&#x80FD;&#x662F;&#x5728;Riak 2.0 &#x3010;58,59&#x3011;&#x4E2D;&#x4F7F;&#x7528;&#x7684;<strong>&#x5206;&#x6563;&#x7248;&#x672C;&#x77E2;&#x91CF;&#xFF08;dotted version vector&#xFF09;</strong>&#x3010;57&#x3011;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x4F1A;&#x6DF1;&#x5165;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x4E0E;&#x6211;&#x4EEC;&#x5728;&#x8D2D;&#x7269;&#x8F66;&#x793A;&#x4F8B;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#x200B;    &#x4E0E;<a href="img/fig5-13.png">&#x56FE;5-13</a>&#x4E2D;&#x7684;&#x7248;&#x672C;&#x53F7;&#x4E00;&#x6837;&#xFF0C;&#x5F53;&#x8BFB;&#x53D6;&#x503C;&#x65F6;&#xFF0C;&#x7248;&#x672C;&#x5411;&#x91CF;&#x4F1A;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x526F;&#x672C;&#x53D1;&#x9001;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5E76;&#x4E14;&#x968F;&#x540E;&#x5199;&#x5165;&#x503C;&#x65F6;&#x9700;&#x8981;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x56DE;&#x6570;&#x636E;&#x5E93;&#x3002;&#xFF08;Riak&#x5C06;&#x7248;&#x672C;&#x5411;&#x91CF;&#x7F16;&#x7801;&#x4E3A;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5B83;&#x79F0;&#x4E3A;<strong>&#x56E0;&#x679C;&#x4E0A;&#x4E0B;&#x6587;&#xFF08;causal context&#xFF09;</strong>&#xFF09;&#x3002;&#x7248;&#x672C;&#x5411;&#x91CF;&#x5141;&#x8BB8;&#x6570;&#x636E;&#x5E93;&#x533A;&#x5206;&#x8986;&#x76D6;&#x5199;&#x5165;&#x548C;&#x5E76;&#x53D1;&#x5199;&#x5165;&#x3002;</p>
<p>&#x200B;    &#x53E6;&#x5916;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x5355;&#x4E2A;&#x526F;&#x672C;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5408;&#x5E76;&#x5144;&#x5F1F;&#x3002;&#x7248;&#x672C;&#x5411;&#x91CF;&#x7ED3;&#x6784;&#x786E;&#x4FDD;&#x4ECE;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x8BFB;&#x53D6;&#x5E76;&#x968F;&#x540E;&#x5199;&#x56DE;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x53EF;&#x80FD;&#x4F1A;&#x521B;&#x5EFA;&#x5144;&#x5F1F;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x5144;&#x5F1F;&#x59D0;&#x59B9;&#x5408;&#x5E76;&#x6B63;&#x786E;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x6570;&#x636E;&#x3002;</p>
<blockquote>
<h4 id="&#x7248;&#x672C;&#x5411;&#x91CF;&#x548C;&#x5411;&#x91CF;&#x65F6;&#x949F;">&#x7248;&#x672C;&#x5411;&#x91CF;&#x548C;&#x5411;&#x91CF;&#x65F6;&#x949F;</h4>
<p>&#x200B;    &#x7248;&#x672C;&#x5411;&#x91CF;&#x6709;&#x65F6;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x77E2;&#x91CF;&#x65F6;&#x949F;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4EEC;&#x4E0D;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002; &#x5DEE;&#x522B;&#x5F88;&#x5FAE;&#x5999;&#x2014;&#x2014;&#x8BF7;&#x53C2;&#x9605;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x7684;&#x7EC6;&#x8282;&#x3010;57,60,61&#x3011;&#x3002; &#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5728;&#x6BD4;&#x8F83;&#x526F;&#x672C;&#x7684;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x7248;&#x672C;&#x5411;&#x91CF;&#x662F;&#x6B63;&#x786E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
</blockquote>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8003;&#x5BDF;&#x4E86;&#x590D;&#x5236;&#x7684;&#x95EE;&#x9898;&#x3002;&#x590D;&#x5236;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x51E0;&#x4E2A;&#x76EE;&#x7684;&#xFF1A;</p>
<p><strong><em>&#x9AD8;&#x53EF;&#x7528;&#x6027;</em></strong></p>
<p>&#x200B;    &#x5373;&#x4F7F;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#xFF08;&#x6216;&#x591A;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x6216;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF09;&#x505C;&#x673A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x80FD;&#x4FDD;&#x6301;&#x7CFB;&#x7EDF;&#x6B63;&#x5E38;&#x8FD0;&#x884C;</p>
<p><strong><em>&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x7684;&#x64CD;&#x4F5C;</em></strong></p>
<p>&#x200B;    &#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x65F6;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;</p>
<p><strong><em>&#x5EF6;&#x8FDF;</em></strong></p>
<p>&#x200B;    &#x5C06;&#x6570;&#x636E;&#x653E;&#x7F6E;&#x5728;&#x8DDD;&#x79BB;&#x7528;&#x6237;&#x8F83;&#x8FD1;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4EE5;&#x4FBF;&#x7528;&#x6237;&#x80FD;&#x591F;&#x66F4;&#x5FEB;&#x5730;&#x4E0E;&#x5176;&#x4EA4;&#x4E92;</p>
<p><strong><em>&#x53EF;&#x4F38;&#x7F29;&#x6027;</em></strong></p>
<p>&#x200B;    &#x80FD;&#x591F;&#x5904;&#x7406;&#x6BD4;&#x5355;&#x4E2A;&#x673A;&#x5668;&#x66F4;&#x9AD8;&#x7684;&#x8BFB;&#x53D6;&#x91CF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5BF9;&#x526F;&#x672C;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x6765;&#x5904;&#x7406;</p>
<p>&#x200B;    &#x5C3D;&#x7BA1;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x76EE;&#x6807; - &#x5728;&#x51E0;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x4FDD;&#x7559;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x4F46;&#x590D;&#x5236;&#x5374;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x68D8;&#x624B;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x9700;&#x8981;&#x4ED4;&#x7EC6;&#x8003;&#x8651;&#x5E76;&#x53D1;&#x548C;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5E76;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x6545;&#x969C;&#x7684;&#x540E;&#x679C;&#x3002;&#x81F3;&#x5C11;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5904;&#x7406;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#x8282;&#x70B9;&#x548C;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#xFF08;&#x751A;&#x81F3;&#x4E0D;&#x8003;&#x8651;&#x66F4;&#x9690;&#x853D;&#x7684;&#x6545;&#x969C;&#xFF0C;&#x4F8B;&#x5982;&#x7531;&#x4E8E;&#x8F6F;&#x4EF6;&#x9519;&#x8BEF;&#x5BFC;&#x81F4;&#x7684;&#x65E0;&#x63D0;&#x793A;&#x6570;&#x636E;&#x635F;&#x574F;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x590D;&#x5236;&#x7684;&#x4E09;&#x79CD;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p><strong><em>&#x5355;&#x4E3B;&#x590D;&#x5236;</em></strong></p>
<p>&#x200B;    &#x5BA2;&#x6237;&#x7AEF;&#x5C06;&#x6240;&#x6709;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x53D1;&#x9001;&#x5230;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#xFF08;&#x9886;&#x5BFC;&#x8005;&#xFF09;&#xFF0C;&#x8BE5;&#x8282;&#x70B9;&#x5C06;&#x6570;&#x636E;&#x66F4;&#x6539;&#x4E8B;&#x4EF6;&#x6D41;&#x53D1;&#x9001;&#x5230;&#x5176;&#x4ED6;&#x526F;&#x672C;&#xFF08;&#x8FFD;&#x968F;&#x8005;&#xFF09;&#x3002;&#x8BFB;&#x53D6;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x526F;&#x672C;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x4ECE;&#x8FFD;&#x968F;&#x8005;&#x8BFB;&#x53D6;&#x53EF;&#x80FD;&#x662F;&#x9648;&#x65E7;&#x7684;&#x3002;</p>
<p><strong><em>&#x591A;&#x4E3B;&#x590D;&#x5236;</em></strong></p>
<p>&#x200B;    &#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x5230;&#x51E0;&#x4E2A;&#x9886;&#x5BFC;&#x8282;&#x70B9;&#x4E4B;&#x4E00;&#xFF0C;&#x5176;&#x4E2D;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x90FD;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x5199;&#x5165;&#x3002;&#x9886;&#x5BFC;&#x8005;&#x5C06;&#x6570;&#x636E;&#x66F4;&#x6539;&#x4E8B;&#x4EF6;&#x6D41;&#x53D1;&#x9001;&#x7ED9;&#x5F7C;&#x6B64;&#x4EE5;&#x53CA;&#x4EFB;&#x4F55;&#x8DDF;&#x968F;&#x8005;&#x8282;&#x70B9;&#x3002;</p>
<p><strong><em>&#x65E0;&#x4E3B;&#x590D;&#x5236;</em></strong></p>
<p>&#x200B;    &#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x5230;&#x51E0;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x4ECE;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x5E76;&#x884C;&#x8BFB;&#x53D6;&#xFF0C;&#x4EE5;&#x68C0;&#x6D4B;&#x548C;&#x7EA0;&#x6B63;&#x5177;&#x6709;&#x9648;&#x65E7;&#x6570;&#x636E;&#x7684;&#x8282;&#x70B9;&#x3002;
&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;&#x3002;&#x5355;&#x4E3B;&#x590D;&#x5236;&#x662F;&#x975E;&#x5E38;&#x6D41;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x3002;&#x5728;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x8282;&#x70B9;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x548C;&#x5EF6;&#x8FDF;&#x5CF0;&#x503C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x548C;&#x65E0;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x53EF;&#x4EE5;&#x66F4;&#x52A0;&#x7A33;&#x5065;&#xFF0C;&#x4F46;&#x4EE5;&#x66F4;&#x96BE;&#x4EE5;&#x63A8;&#x7406;&#x5E76;&#x4EC5;&#x63D0;&#x4F9B;&#x975E;&#x5E38;&#x5F31;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x4FDD;&#x8BC1;&#x4E3A;&#x4EE3;&#x4EF7;&#x3002;</p>
<p>&#x200B;    &#x590D;&#x5236;&#x53EF;&#x4EE5;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5F02;&#x6B65;&#x7684;&#xFF0C;&#x5728;&#x53D1;&#x751F;&#x6545;&#x969C;&#x65F6;&#x5BF9;&#x7CFB;&#x7EDF;&#x884C;&#x4E3A;&#x6709;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5C3D;&#x7BA1;&#x5728;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x5E73;&#x7A33;&#x65F6;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x901F;&#x5EA6;&#x5F88;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x590D;&#x5236;&#x6EDE;&#x540E;&#x589E;&#x52A0;&#x548C;&#x670D;&#x52A1;&#x5668;&#x6545;&#x969C;&#x65F6;&#x8981;&#x5F04;&#x6E05;&#x695A;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#x5931;&#x8D25;&#x4E86;&#xFF0C;&#x5E76;&#x4E14;&#x4F60;&#x63A8;&#x52A8;&#x4E00;&#x4E2A;&#x5F02;&#x6B65;&#x66F4;&#x65B0;&#x7684;&#x8FFD;&#x968F;&#x8005;&#x6210;&#x4E3A;&#x65B0;&#x7684;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x8FD1;&#x627F;&#x8BFA;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x3002;</p>
<p>&#x200B;    &#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x4E00;&#x4E9B;&#x53EF;&#x80FD;&#x7531;&#x590D;&#x5236;&#x6EDE;&#x540E;&#x5F15;&#x8D77;&#x7684;&#x5947;&#x602A;&#x6548;&#x5E94;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x4E00;&#x4E9B;&#x6709;&#x52A9;&#x4E8E;&#x51B3;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x590D;&#x5236;&#x6EDE;&#x540E;&#x65F6;&#x7684;&#x884C;&#x4E3A;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x6A21;&#x578B;&#xFF1A;</p>
<p><strong><em>&#x5199;&#x540E;&#x8BFB;</em></strong></p>
<p>&#x200B;    &#x7528;&#x6237;&#x5E94;&#x8BE5;&#x603B;&#x662F;&#x770B;&#x5230;&#x81EA;&#x5DF1;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p><strong><em>&#x5355;&#x8C03;&#x8BFB;</em></strong></p>
<p>   &#x7528;&#x6237;&#x5728;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x770B;&#x5230;&#x6570;&#x636E;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x5E94;&#x8BE5;&#x5728;&#x67D0;&#x4E2A;&#x65E9;&#x671F;&#x65F6;&#x95F4;&#x70B9;&#x770B;&#x5230;&#x6570;&#x636E;&#x3002;</p>
<p><strong><em>&#x4E00;&#x81F4;&#x524D;&#x7F00;&#x8BFB;</em></strong></p>
<p>&#x200B;    &#x7528;&#x6237;&#x5E94;&#x8BE5;&#x5C06;&#x6570;&#x636E;&#x89C6;&#x4E3A;&#x5177;&#x6709;&#x56E0;&#x679C;&#x610F;&#x4E49;&#x7684;&#x72B6;&#x6001;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x6309;&#x7167;&#x6B63;&#x786E;&#x7684;&#x987A;&#x5E8F;&#x67E5;&#x770B;&#x95EE;&#x9898;&#x53CA;&#x5176;&#x7B54;&#x590D;&#x3002;</p>
<p>&#x200B;    &#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x548C;&#x65E0;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x65B9;&#x6CD5;&#x6240;&#x56FA;&#x6709;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF1A;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x5199;&#x5165;&#x5E76;&#x53D1;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x3002;&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x80FD;&#x4F7F;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x6765;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x53D1;&#x751F;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x4EEC;&#x662F;&#x5426;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x8C08;&#x5230;&#x4E86;&#x901A;&#x8FC7;&#x5408;&#x5E76;&#x5E76;&#x53D1;&#x66F4;&#x65B0;&#x6765;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#x7814;&#x7A76;&#x5206;&#x5E03;&#x5728;&#x591A;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x8FC7;&#x590D;&#x5236;&#x7684;&#x5BF9;&#x5E94;&#x65B9;&#x5F0F;&#xFF1A;&#x5C06;&#x5927;&#x6570;&#x636E;&#x96C6;&#x5206;&#x5272;&#x6210;&#x5206;&#x533A;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;">&#x53C2;&#x8003;&#x6587;&#x732E;</h2>
<ol>
<li><p>Bruce G. Lindsay, Patricia Griffiths Selinger, C. Galtieri, et al.:
&#x201C;<a href="http://domino.research.ibm.com/library/cyberdig.nsf/papers/A776EC17FC2FCE73852579F100578964/$File/RJ2571.pdf" target="_blank">Notes on Distributed Databases</a>,&#x201D; IBM Research, Research Report RJ2571(33471), July 1979.</p>
</li>
<li><p>&#x201C;<a href="http://www.oracle.com/technetwork/database/availability/active-data-guard-wp-12c-1896127.pdf" target="_blank">Oracle Active Data Guard Real-Time Data Protection and Availability</a>,&#x201D; Oracle White Paper, June 2013.</p>
</li>
<li><p>&#x201C;<a href="http://msdn.microsoft.com/en-us/library/hh510230.aspx" target="_blank">AlwaysOn Availability Groups</a>,&#x201D; in <em>SQL Server Books Online</em>, Microsoft, 2012.</p>
</li>
<li><p>Lin Qiao, Kapil Surlaker, Shirshanka Das, et al.: &#x201C;<a href="http://www.slideshare.net/amywtang/espresso-20952131" target="_blank">On Brewing Fresh Espresso: LinkedIn&#x2019;s Distributed Data Serving Platform</a>,&#x201D; at <em>ACM International Conference on Management of Data</em> (SIGMOD), June 2013.</p>
</li>
<li><p>Jun Rao: &#x201C;<a href="http://www.slideshare.net/junrao/kafka-replication-apachecon2013" target="_blank">Intra-Cluster Replication for Apache Kafka</a>,&#x201D; at <em>ApacheCon North America</em>, February 2013.</p>
</li>
<li><p>&#x201C;<a href="https://www.rabbitmq.com/ha.html" target="_blank">Highly Available Queues</a>,&#x201D; in <em>RabbitMQ Server Documentation</em>, Pivotal Software, Inc., 2014.</p>
</li>
<li><p>Yoshinori Matsunobu: &#x201C;<a href="http://yoshinorimatsunobu.blogspot.co.uk/2014/04/semi-synchronous-replication-at-facebook.html" target="_blank">Semi-Synchronous Replication at Facebook</a>,&#x201D; <em>yoshinorimatsunobu.blogspot.co.uk</em>, April 1, 2014.</p>
</li>
<li><p>Robbert van Renesse and Fred B. Schneider: &#x201C;<a href="http://static.usenix.org/legacy/events/osdi04/tech/full_papers/renesse/renesse.pdf" target="_blank">Chain Replication for Supporting High Throughput and Availability</a>,&#x201D; at <em>6th USENIX Symposium on Operating System Design and Implementation</em> (OSDI), December 2004.</p>
</li>
<li><p>Jeff Terrace and Michael J. Freedman: &#x201C;<a href="https://www.usenix.org/legacy/event/usenix09/tech/full_papers/terrace/terrace.pdf" target="_blank">Object Storage on CRAQ: High-Throughput Chain Replication for Read-Mostly Workloads</a>,&#x201D; at <em>USENIX Annual Technical Conference</em> (ATC), June 2009.</p>
</li>
<li><p>Brad Calder, Ju Wang, Aaron Ogus, et al.: &#x201C;<a href="http://sigops.org/sosp/sosp11/current/2011-Cascais/printable/11-calder.pdf" target="_blank">Windows Azure Storage: A Highly Available Cloud Storage Service with Strong Consistency</a>,&#x201D; at <em>23rd ACM Symposium on Operating Systems Principles</em> (SOSP), October 2011.</p>
</li>
<li><p>Andrew Wang: &#x201C;<a href="http://umbrant.com/blog/2016/windows_azure_storage.html" target="_blank">Windows Azure Storage</a>,&#x201D; <em>umbrant.com</em>, February 4, 2016.</p>
</li>
<li><p>&#x201C;<a href="https://www.percona.com/doc/percona-xtrabackup/2.1/index.html" target="_blank">Percona    Xtrabackup - Documentation</a>,&#x201D; Percona LLC, 2014.</p>
</li>
<li><p>Jesse Newland: &#x201C;<a href="https://github.com/blog/1261-github-availability-this-week" target="_blank">GitHub Availability This   Week</a>,&#x201D; <em>github.com</em>, September 14, 2012.</p>
</li>
<li><p>Mark Imbriaco:  &#x201C;<a href="https://github.com/blog/1364-downtime-last-saturday" target="_blank">Downtime Last Saturday</a>,&#x201D;  <em>github.com</em>, December 26, 2012.</p>
</li>
<li><p>John Hugg: &#x201C;<a href="https://www.youtube.com/watch?v=gJRj3vJL4wE" target="_blank">&#x2018;All in&#x2019; with Determinism for Performance and Testing in Distributed Systems</a>,&#x201D; at <em>Strange Loop</em>, September 2015. Amit Kapila: &#x201C;<a href="http://www.pgcon.org/2012/schedule/attachments/258_212_Internals%20Of%20PostgreSQL%20Wal.pdf" target="_blank">WAL Internals of PostgreSQL</a>,&#x201D; at <em>PostgreSQL Conference</em> (PGCon), May 2012.</p>
</li>
<li><p><a href="http://dev.mysql.com/doc/internals/en/index.html" target="_blank"><em>MySQL Internals Manual</em></a>. Oracle, 2014.</p>
</li>
<li><p>Yogeshwer Sharma, Philippe Ajoux, Petchean Ang, et al.: &#x201C;<a href="https://www.usenix.org/system/files/conference/nsdi15/nsdi15-paper-sharma.pdf" target="_blank">Wormhole: Reliable Pub-Sub to Support Geo-Replicated Internet Services</a>,&#x201D; at <em>12th USENIX Symposium on Networked Systems Design and Implementation</em> (NSDI), May 2015.</p>
</li>
<li><p>&#x201C;<a href="http://www.oracle.com/us/products/middleware/data-integration/oracle-goldengate-realtime-access-2031152.pdf" target="_blank">Oracle GoldenGate 12c: Real-Time Access to Real-Time Information</a>,&#x201D; Oracle White Paper, October 2013.</p>
</li>
<li><p>Shirshanka Das, Chavdar Botev, Kapil Surlaker, et al.: &#x201C;<a href="http://www.socc2012.org/s18-das.pdf" target="_blank">All Aboard the Databus!</a>,&#x201D; at
<em>ACM Symposium on Cloud Computing</em> (SoCC), October 2012.</p>
</li>
<li><p>Greg Sabino Mullane: &#x201C;<a href="http://blog.endpoint.com/2014/06/bucardo-5-multimaster-postgres-released.html" target="_blank">Version 5 of Bucardo Database Replication System</a>,&#x201D; <em>blog.endpoint.com</em>, June 23, 2014.</p>
</li>
<li><p>Werner Vogels: &#x201C;<a href="http://queue.acm.org/detail.cfm?id=1466448" target="_blank">Eventually Consistent</a>,&#x201D; <em>ACM Queue</em>, volume 6, number 6, pages 14&#x2013;19, October 2008.
<a href="http://dx.doi.org/10.1145/1466443.1466448" target="_blank">doi:10.1145/1466443.1466448</a></p>
</li>
<li><p>Douglas B. Terry: &#x201C;<a href="http://research.microsoft.com/pubs/157411/ConsistencyAndBaseballReport.pdf" target="_blank">Replicated Data Consistency Explained Through Baseball</a>,&#x201D; Microsoft Research, Technical Report MSR-TR-2011-137, October 2011.</p>
</li>
<li><p>Douglas B. Terry, Alan J. Demers, Karin Petersen, et al.: &#x201C;<a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.71.2269&amp;rep=rep1&amp;type=pdf" target="_blank">Session Guarantees for Weakly Consistent Replicated Data</a>,&#x201D; at <em>3rd International Conference on Parallel and Distributed Information Systems</em> (PDIS), September 1994. <a href="http://dx.doi.org/10.1109/PDIS.1994.331722" target="_blank">doi:10.1109/PDIS.1994.331722</a></p>
</li>
<li><p>Terry Pratchett: <em>Reaper Man: A Discworld Novel</em>. Victor Gollancz, 1991. ISBN: 978-0-575-04979-6</p>
</li>
<li><p>&#x201C;<a href="http://tungsten-replicator.org/" target="_blank">Tungsten Replicator</a>,&#x201D; Continuent, Inc., 2014.</p>
</li>
<li><p>&#x201C;<a href="http://bdr-project.org/docs/next/index.html" target="_blank">BDR 0.10.0 Documentation</a>,&#x201D; The PostgreSQL Global Development Group, <em>bdr-project.org</em>, 2015.</p>
</li>
<li><p>Robert Hodges:
&#x201C;<a href="http://scale-out-blog.blogspot.co.uk/2012/04/if-you-must-deploy-multi-master.html" target="_blank">If You <em>Must</em> Deploy Multi-Master Replication, Read This First</a>,&#x201D; <em>scale-out-blog.blogspot.co.uk</em>,
March 30, 2012.</p>
</li>
<li><p>J. Chris Anderson, Jan Lehnardt, and Noah Slater: <em>CouchDB: The Definitive Guide</em>. O&apos;Reilly Media, 2010.
ISBN: 978-0-596-15589-6</p>
</li>
<li><p>AppJet, Inc.: &#x201C;<a href="https://github.com/ether/etherpad-lite/blob/e2ce9dc/doc/easysync/easysync-full-description.pdf" target="_blank">Etherpad and EasySync Technical Manual</a>,&#x201D; <em>github.com</em>, March 26, 2011.</p>
</li>
<li><p>John Day-Richter: &#x201C;<a href="http://googledrive.blogspot.com/2010/09/whats-different-about-new-google-docs.html" target="_blank">What&#x2019;s Different About the New Google Docs: Making Collaboration Fast</a>,&#x201D; <em>googledrive.blogspot.com</em>, 23 September 2010.</p>
</li>
<li><p>Martin Kleppmann and Alastair R. Beresford: &#x201C;<a href="http://arxiv.org/abs/1608.03960" target="_blank">A Conflict-Free Replicated JSON Datatype</a>,&#x201D;
arXiv:1608.03960, August 13, 2016.</p>
</li>
<li><p>Frazer Clement: &#x201C;<a href="http://messagepassing.blogspot.co.uk/2011/10/eventual-consistency-detecting.html" target="_blank">Eventual Consistency &#x2013; Detecting Conflicts</a>,&#x201D; <em>messagepassing.blogspot.co.uk</em>, October 20, 2011.</p>
</li>
<li><p>Robert Hodges: &#x201C;<a href="https://www.percona.com/live/mysql-conference-2013/sessions/state-art-mysql-multi-master-replication" target="_blank">State of the Art for MySQL Multi-Master Replication</a>,&#x201D; at <em>Percona Live: MySQL Conference &amp; Expo</em>, April 2013.</p>
</li>
<li><p>John Daily: &#x201C;<a href="http://basho.com/clocks-are-bad-or-welcome-to-distributed-systems/" target="_blank">Clocks Are Bad, or,   Welcome to the Wonderful World of Distributed Systems</a>,&#x201D; <em>basho.com</em>, November 12, 2013.</p>
</li>
<li><p>Riley Berton: &#x201C;<a href="http://sdf.org/~riley/blog/2016/01/04/is-bi-directional-replication-bdr-in-postgres-transactional/" target="_blank">Is Bi-Directional Replication (BDR) in Postgres Transactional?</a>,&#x201D; <em>sdf.org</em>, January 4, 2016.</p>
</li>
<li><p>Giuseppe DeCandia, Deniz Hastorun, Madan Jampani, et al.: &#x201C;<a href="http://www.allthingsdistributed.com/files/amazon-dynamo-sosp2007.pdf" target="_blank">Dynamo: Amazon&apos;s Highly Available Key-Value Store</a>,&#x201D; at <em>21st ACM Symposium on Operating Systems Principles</em> (SOSP), October 2007.</p>
</li>
<li><p>Marc Shapiro, Nuno Pregui&#xE7;a, Carlos Baquero, and Marek Zawirski: &#x201C;<a href="http://hal.inria.fr/inria-00555588/" target="_blank">A Comprehensive Study of   Convergent and Commutative Replicated Data Types</a>,&#x201D; INRIA Research Report no. 7506,
  January 2011.</p>
</li>
<li><p>Sam Elliott:  &#x201C;<a href="https://speakerdeck.com/lenary/crdts-an-update-or-just-a-put" target="_blank">CRDTs: An UPDATE (or   Maybe Just a PUT)</a>,&#x201D; at <em>RICON West</em>, October 2013.</p>
</li>
<li><p>Russell Brown:  &#x201C;<a href="https://gist.github.com/russelldb/f92f44bdfb619e089a4d" target="_blank">A Bluffers Guide to CRDTs in   Riak</a>,&#x201D; <em>gist.github.com</em>, October 28, 2013.</p>
</li>
<li><p>Benjamin Farinier, Thomas Gazagnaire, and Anil Madhavapeddy: &#x201C;<a href="http://gazagnaire.org/pub/FGM15.pdf" target="_blank">Mergeable Persistent Data   Structures</a>,&#x201D; at <em>26es Journ&#xE9;es Francophones des Langages Applicatifs</em> (JFLA),  January 2015.</p>
</li>
<li><p>Chengzheng Sun and Clarence Ellis: &#x201C;<a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.53.933&amp;rep=rep1&amp;type=pdf" target="_blank">Operational   Transformation in Real-Time Group Editors: Issues, Algorithms, and Achievements</a>,&#x201D; at  <em>ACM Conference on Computer Supported Cooperative Work</em> (CSCW), November 1998.</p>
</li>
<li><p>Lars Hofhansl: &#x201C;<a href="https://issues.apache.org/jira/browse/HBASE-7709" target="_blank">HBASE-7709: Infinite Loop Possible in Master/Master Replication</a>,&#x201D; <em>issues.apache.org</em>, January 29, 2013.</p>
</li>
<li><p>David K. Gifford: &#x201C;<a href="http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.84.7698" target="_blank">Weighted Voting for Replicated Data</a>,&#x201D; at <em>7th ACM Symposium on Operating Systems Principles</em> (SOSP), December 1979. <a href="http://dx.doi.org/10.1145/800215.806583" target="_blank">doi:10.1145/800215.806583</a></p>
</li>
<li><p>Heidi Howard, Dahlia Malkhi, and Alexander Spiegelman: &#x201C;<a href="https://arxiv.org/abs/1608.06696" target="_blank">Flexible Paxos: Quorum Intersection Revisited</a>,&#x201D; <em>arXiv:1608.06696</em>, August 24, 2016.</p>
</li>
<li><p>Joseph Blomstedt: &#x201C;<a href="http://lists.basho.com/pipermail/riak-users_lists.basho.com/2012-January/007157.html" target="_blank">Re:   Absolute Consistency</a>,&#x201D; email to <em>riak-users</em> mailing list, <em>lists.basho.com</em>,
  January 11, 2012.</p>
</li>
<li><p>Joseph Blomstedt:  &#x201C;<a href="https://vimeo.com/51973001" target="_blank">Bringing Consistency to Riak</a>,&#x201D; at <em>RICON West</em>,  October 2012.</p>
</li>
<li><p>Peter Bailis, Shivaram Venkataraman, Michael J. Franklin, et al.: &#x201C;<a href="http://www.bailis.org/papers/pbs-cacm2014.pdf" target="_blank">Quantifying Eventual Consistency with PBS</a>,&#x201D; <em>Communications of the ACM</em>, volume 57, number 8, pages 93&#x2013;102, August 2014. <a href="http://dx.doi.org/10.1145/2632792" target="_blank">doi:10.1145/2632792</a></p>
</li>
<li><p>Jonathan Ellis: &#x201C;<a href="http://www.datastax.com/dev/blog/modern-hinted-handoff" target="_blank">Modern Hinted Handoff</a>,&#x201D; <em>datastax.com</em>, December 11, 2012.</p>
</li>
<li><p>&#x201C;<a href="https://github.com/voldemort/voldemort/wiki" target="_blank">Project Voldemort Wiki</a>,&#x201D; <em>github.com</em>, 2013.</p>
</li>
<li><p>&#x201C;<a href="http://www.datastax.com/documentation/cassandra/2.0/index.html" target="_blank">Apache Cassandra 2.0 Documentation</a>,&#x201D; DataStax, Inc., 2014.</p>
</li>
<li><p>&#x201C;<a href="http://basho.com/assets/MultiDatacenter_Replication.pdf" target="_blank">Riak Enterprise: Multi-Datacenter Replication</a>.&#x201D; Technical whitepaper, Basho Technologies, Inc.,
September 2014.</p>
</li>
<li><p>Jonathan Ellis: &#x201C;<a href="http://www.datastax.com/dev/blog/why-cassandra-doesnt-need-vector-clocks" target="_blank">Why Cassandra Doesn&apos;t Need Vector Clocks</a>,&#x201D; <em>datastax.com</em>, September 2, 2013.</p>
</li>
<li><p>Leslie Lamport: &#x201C;<a href="http://research.microsoft.com/en-US/um/people/Lamport/pubs/time-clocks.pdf" target="_blank">Time, Clocks, and the Ordering of Events in a Distributed System</a>,&#x201D; <em>Communications of the ACM</em>, volume 21, number 7, pages 558&#x2013;565, July 1978. <a href="http://dx.doi.org/10.1145/359545.359563" target="_blank">doi:10.1145/359545.359563</a></p>
</li>
<li><p>Joel Jacobson: &#x201C;<a href="http://blog.joeljacobson.com/riak-2-0-data-types/" target="_blank">Riak 2.0: Data Types</a>,&#x201D; <em>blog.joeljacobson.com</em>, March 23, 2014.</p>
</li>
<li><p>D. Stott Parker Jr., Gerald J. Popek, Gerard Rudisin, et al.: &#x201C;<a href="http://zoo.cs.yale.edu/classes/cs426/2013/bib/parker83detection.pdf" target="_blank">Detection of Mutual Inconsistency in Distributed Systems</a>,&#x201D; <em>IEEE Transactions on Software Engineering</em>, volume 9, number 3, pages 240&#x2013;247, May 1983. <a href="http://dx.doi.org/10.1109/TSE.1983.236733" target="_blank">doi:10.1109/TSE.1983.236733</a></p>
</li>
<li><p>Nuno Pregui&#xE7;a, Carlos Baquero, Paulo S&#xE9;rgio Almeida, et al.: &#x201C;<a href="http://arxiv.org/pdf/1011.5808v1.pdf" target="_blank">Dotted Version Vectors: Logical Clocks for Optimistic Replication</a>,&#x201D; arXiv:1011.5808, November 26, 2010.</p>
</li>
<li><p>Sean Cribbs: &#x201C;<a href="https://www.youtube.com/watch?v=HHkKPdOi-ZU" target="_blank">A Brief History of Time in Riak</a>,&#x201D; at <em>RICON</em>, October 2014.</p>
</li>
<li><p>Russell Brown: &#x201C;<a href="http://basho.com/posts/technical/vector-clocks-revisited-part-2-dotted-version-vectors/" target="_blank">Vector Clocks Revisited Part 2: Dotted Version Vectors</a>,&#x201D; <em>basho.com</em>, November 10, 2015.</p>
</li>
<li><p>Carlos Baquero: &#x201C;<a href="https://haslab.wordpress.com/2011/07/08/version-vectors-are-not-vector-clocks/" target="_blank">Version Vectors Are Not Vector Clocks</a>,&#x201D; <em>haslab.wordpress.com</em>, July 8, 2011.</p>
</li>
<li><p>Reinhard Schwarz and Friedemann Mattern: &#x201C;<a href="http://dcg.ethz.ch/lectures/hs08/seminar/papers/mattern4.pdf" target="_blank">Detecting Causal Relationships in Distributed Computations: In Search of the Holy Grail</a>,&#x201D; <em>Distributed Computing</em>, volume 7, number 3, pages 149&#x2013;174, March 1994. <a href="http://dx.doi.org/10.1007/BF02277859" target="_blank">doi:10.1007/BF02277859</a></p>
</li>
</ol>
<hr>
<table>
<thead>
<tr>
<th style="text-align:center">&#x4E0A;&#x4E00;&#x7AE0;</th>
<th style="text-align:center">&#x76EE;&#x5F55;</th>
<th style="text-align:center">&#x4E0B;&#x4E00;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center"><a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;</a></td>
<td style="text-align:center"><a href="./">&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;</a></td>
<td style="text-align:center"><a href="ch6.html">&#x7B2C;&#x516D;&#x7AE0;&#xFF1A;&#x5206;&#x533A;</a></td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="part-ii.html" class="navigation navigation-prev " aria-label="Previous page: 第二部分：分布式数据">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch6.html" class="navigation navigation-next " aria-label="Next page: 第六章：分区">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第五章：复制","level":"1.4.1","depth":2,"next":{"title":"第六章：分区","level":"1.4.2","depth":2,"path":"ch6.md","ref":"ch6.md","articles":[]},"previous":{"title":"第二部分：分布式数据","level":"1.4","depth":1,"path":"part-ii.md","ref":"part-ii.md","articles":[{"title":"第五章：复制","level":"1.4.1","depth":2,"path":"ch5.md","ref":"ch5.md","articles":[]},{"title":"第六章：分区","level":"1.4.2","depth":2,"path":"ch6.md","ref":"ch6.md","articles":[]},{"title":"第七章：事务","level":"1.4.3","depth":2,"path":"ch7.md","ref":"ch7.md","articles":[]},{"title":"第八章：分布式系统的麻烦","level":"1.4.4","depth":2,"path":"ch8.md","ref":"ch8.md","articles":[]},{"title":"第九章：一致性与共识","level":"1.4.5","depth":2,"path":"ch9.md","ref":"ch9.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing","mathjax-pro","livereload"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/ddia"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"livereload":{},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch5.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-21T05:58:49.715Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

