
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第七章：事务 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch8.html" />
    
    
    <link rel="prev" href="ch6.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第七章：事务</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="7-&#x4E8B;&#x52A1;">7. &#x4E8B;&#x52A1;</h1>
<p><img src="img/ch7.png" alt=""></p>
<blockquote>
<p>&#x200B;    &#x4E00;&#x4E9B;&#x4F5C;&#x8005;&#x58F0;&#x79F0;&#xFF0C;&#x652F;&#x6301;&#x901A;&#x7528;&#x7684;&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#x4EE3;&#x4EF7;&#x592A;&#x5927;&#xFF0C;&#x4F1A;&#x5E26;&#x6765;&#x6027;&#x80FD;&#x4E0E;&#x53EF;&#x7528;&#x6027;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8BA9;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x5904;&#x7406;&#x8FC7;&#x5EA6;&#x4F7F;&#x7528;&#x4E8B;&#x52A1;&#x5BFC;&#x81F4;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x603B;&#x6BD4;&#x7F3A;&#x5C11;&#x4E8B;&#x52A1;&#x7F16;&#x7A0B;&#x597D;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x200B;    &#x2014;&#x2014;James Corbett&#x7B49;&#x4EBA;&#xFF0C;Spanner&#xFF1A;Google&#x7684;&#x5168;&#x7403;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#xFF08;2012&#xFF09;</p>
</blockquote>
<hr>
<p>[TOC]</p>
<p>&#x5728;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x6B8B;&#x9177;&#x73B0;&#x5B9E;&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x90FD;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#xFF1A;</p>
<ul>
<li>&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x3001;&#x786C;&#x4EF6;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF08;&#x5305;&#x62EC;&#x5199;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x5230;&#x4E00;&#x534A;&#x65F6;&#xFF09;&#x3002;</li>
<li>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#x5D29;&#x6E83;&#xFF08;&#x5305;&#x62EC;&#x4E00;&#x7CFB;&#x5217;&#x64CD;&#x4F5C;&#x7684;&#x4E2D;&#x95F4;&#xFF09;&#x3002;</li>
<li>&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x53EF;&#x80FD;&#x4F1A;&#x610F;&#x5916;&#x5207;&#x65AD;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x5E94;&#x7528;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x6216;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x3002;</li>
<li>&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x80FD;&#x4F1A;&#x540C;&#x65F6;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8986;&#x76D6;&#x5F7C;&#x6B64;&#x7684;&#x66F4;&#x6539;&#x3002;</li>
<li>&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x80FD;&#x8BFB;&#x53D6;&#x5230;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x53EA;&#x66F4;&#x65B0;&#x4E86;&#x4E00;&#x90E8;&#x5206;&#x3002;</li>
<li>&#x5BA2;&#x6237;&#x4E4B;&#x95F4;&#x7684;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x9519;&#x8BEF;&#x3002;</li>
</ul>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x6545;&#x969C;&#xFF0C;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x707E;&#x96BE;&#x6027;&#x6545;&#x969C;&#x3002;&#x4F46;&#x662F;&#x5B9E;&#x73B0;&#x5BB9;&#x9519;&#x673A;&#x5236;&#x5DE5;&#x4F5C;&#x91CF;&#x5DE8;&#x5927;&#x3002;&#x9700;&#x8981;&#x4ED4;&#x7EC6;&#x8003;&#x8651;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x771F;&#x6B63;&#x7BA1;&#x7528;&#x3002;</p>
<p>&#x200B;    &#x6570;&#x5341;&#x5E74;&#x6765;&#xFF0C;<strong>&#x4E8B;&#x52A1;&#xFF08;transaction&#xFF09;</strong> &#x4E00;&#x76F4;&#x662F;&#x7B80;&#x5316;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x9996;&#x9009;&#x673A;&#x5236;&#x3002;&#x4E8B;&#x52A1;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x591A;&#x4E2A;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x5355;&#x5143;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x3002;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x8BB2;&#xFF0C;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x88AB;&#x89C6;&#x4F5C;&#x5355;&#x4E2A;&#x64CD;&#x4F5C;&#x6765;&#x6267;&#x884C;&#xFF1A;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x8981;&#x4E48;&#x6210;&#x529F;&#xFF08;<strong>&#x63D0;&#x4EA4;&#xFF08;commit&#xFF09;</strong>&#xFF09;&#x8981;&#x4E48;&#x5931;&#x8D25;&#xFF08;<strong>&#x4E2D;&#x6B62;&#xFF08;abort&#xFF09;</strong>&#xFF0C;<strong>&#x56DE;&#x6EDA;&#xFF08;rollback&#xFF09;</strong>&#xFF09;&#x3002;&#x5982;&#x679C;&#x5931;&#x8D25;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x91CD;&#x8BD5;&#x3002;&#x5BF9;&#x4E8E;&#x4E8B;&#x52A1;&#x6765;&#x8BF4;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x591A;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x7528;&#x518D;&#x62C5;&#x5FC3;&#x90E8;&#x5206;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x4E86;&#xFF0C;&#x5373;&#x67D0;&#x4E9B;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#xFF0C;&#x67D0;&#x4E9B;&#x5931;&#x8D25;&#xFF08;&#x65E0;&#x8BBA;&#x51FA;&#x4E8E;&#x4F55;&#x79CD;&#x539F;&#x56E0;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x548C;&#x4E8B;&#x52A1;&#x6253;&#x4EA4;&#x9053;&#x65F6;&#x95F4;&#x957F;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x5B83;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x4E0D;&#x5E94;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x7406;&#x6240;&#x5F53;&#x7136;&#x3002;&#x4E8B;&#x52A1;&#x4E0D;&#x662F;&#x5929;&#x7136;&#x5B58;&#x5728;&#x7684;&#xFF1B;&#x5B83;&#x4EEC;&#x662F;&#x4E3A;&#x4E86;<strong>&#x7B80;&#x5316;&#x5E94;&#x7528;&#x7F16;&#x7A0B;&#x6A21;&#x578B;</strong>&#x800C;&#x521B;&#x5EFA;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x4E8B;&#x52A1;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x5730;&#x5FFD;&#x7565;&#x67D0;&#x4E9B;&#x6F5C;&#x5728;&#x7684;&#x9519;&#x8BEF;&#x60C5;&#x51B5;&#x548C;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x4F1A;&#x66FF;&#x5E94;&#x7528;&#x5904;&#x7406;&#x597D;&#x8FD9;&#x4E9B;&#x3002;&#xFF08;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x5B89;&#x5168;&#x4FDD;&#x8BC1;&#xFF08;safety guarantees&#xFF09;</strong>&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x5E94;&#x7528;&#x90FD;&#x9700;&#x8981;&#x4E8B;&#x52A1;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x5F31;&#x5316;&#x4E8B;&#x52A1;&#x4FDD;&#x8BC1;&#x3001;&#x6216;&#x5B8C;&#x5168;&#x653E;&#x5F03;&#x4E8B;&#x52A1;&#x4E5F;&#x662F;&#x6709;&#x597D;&#x5904;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x6027;&#x80FD;&#x6216;&#x66F4;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#xFF09;&#x3002;&#x4E00;&#x4E9B;&#x5B89;&#x5168;&#x5C5E;&#x6027;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x200B;    &#x600E;&#x6837;&#x77E5;&#x9053;&#x4F60;&#x662F;&#x5426;&#x9700;&#x8981;&#x4E8B;&#x52A1;&#xFF1F;&#x4E3A;&#x4E86;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x786E;&#x5207;&#x7406;&#x89E3;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7684;&#x5B89;&#x5168;&#x4FDD;&#x969C;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x4EE3;&#x4EF7;&#x3002;&#x5C3D;&#x7BA1;&#x4E4D;&#x770B;&#x4E8B;&#x52A1;&#x4F3C;&#x4E4E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x6709;&#x8BB8;&#x591A;&#x5FAE;&#x5999;&#x4F46;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x5728;&#x8D77;&#x4F5C;&#x7528;&#x3002;</p>
<p>&#x200B;    &#x672C;&#x7AE0;&#x5C06;&#x7814;&#x7A76;&#x8BB8;&#x591A;&#x51FA;&#x9519;&#x6848;&#x4F8B;&#xFF0C;&#x5E76;&#x63A2;&#x7D22;&#x6570;&#x636E;&#x5E93;&#x7528;&#x4E8E;&#x9632;&#x8303;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x7B97;&#x6CD5;&#x3002;&#x5C24;&#x5176;&#x4F1A;&#x6DF1;&#x5165;<strong>&#x5E76;&#x53D1;&#x63A7;&#x5236;</strong>&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x8BA8;&#x8BBA;&#x5404;&#x79CD;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x5982;&#x4F55;&#x5B9E;&#x73B0;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#xFF0C;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x548C;<strong>&#x53EF;&#x4E32;&#x884C;&#x5316;</strong>&#x7B49;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;</p>
<p>&#x200B;    &#x672C;&#x7AE0;&#x540C;&#x65F6;&#x9002;&#x7528;&#x4E8E;&#x5355;&#x673A;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#xFF1B;&#x5728;<a href="ch8.html">&#x7B2C;8&#x7AE0;</a>&#x4E2D;&#x5C06;&#x91CD;&#x70B9;&#x8BA8;&#x8BBA;&#x4EC5;&#x51FA;&#x73B0;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x7279;&#x6B8A;&#x6311;&#x6218;&#x3002;</p>
<h2 id="&#x4E8B;&#x52A1;&#x7684;&#x68D8;&#x624B;&#x6982;&#x5FF5;">&#x4E8B;&#x52A1;&#x7684;&#x68D8;&#x624B;&#x6982;&#x5FF5;</h2>
<p>&#x200B;    &#x73B0;&#x4ECA;&#xFF0C;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x548C;&#x4E00;&#x4E9B;&#x975E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x652F;&#x6301;<strong>&#x4E8B;&#x52A1;</strong>&#x3002;&#x5176;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x9075;&#x5FAA;IBM System R&#xFF08;&#x7B2C;&#x4E00;&#x4E2A;SQL&#x6570;&#x636E;&#x5E93;&#xFF09;&#x5728;1975&#x5E74;&#x5F15;&#x5165;&#x7684;&#x98CE;&#x683C;&#x3010;1,2,3&#x3011;&#x3002;40&#x5E74;&#x91CC;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E00;&#x4E9B;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;&#xFF0C;&#x4F46;&#x603B;&#x4F53;&#x601D;&#x8DEF;&#x5927;&#x540C;&#x5C0F;&#x5F02;&#xFF1A;MySQL&#xFF0C;PostgreSQL&#xFF0C;Oracle&#xFF0C;SQL Server&#x7B49;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#x652F;&#x6301;&#x4E0E;System R&#x5F02;&#x4E4E;&#x5BFB;&#x5E38;&#x5730;&#x76F8;&#x4F3C;&#x3002;</p>
<p>2000&#x5E74;&#x4EE5;&#x540E;&#xFF0C;&#x975E;&#x5173;&#x7CFB;&#xFF08;NoSQL&#xFF09;&#x6570;&#x636E;&#x5E93;&#x5F00;&#x59CB;&#x666E;&#x53CA;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x65B0;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x9009;&#x62E9;&#xFF08;&#x53C2;&#x89C1;&#x7B2C;2&#x7AE0;&#xFF09;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x9ED8;&#x8BA4;&#x5305;&#x542B;&#x590D;&#x5236;&#xFF08;&#x7B2C;5&#x7AE0;&#xFF09;&#x548C;&#x5206;&#x533A;&#xFF08;&#x7B2C;6&#x7AE0;&#xFF09;&#x6765;&#x6539;&#x5584;&#x5173;&#x7CFB;&#x73B0;&#x72B6;&#x3002;&#x4E8B;&#x52A1;&#x662F;&#x8FD9;&#x79CD;&#x8FD0;&#x52A8;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#xFF1A;&#x8FD9;&#x4E9B;&#x65B0;&#x4E00;&#x4EE3;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5E93;&#x5B8C;&#x5168;&#x653E;&#x5F03;&#x4E86;&#x4E8B;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x4E86;&#x8FD9;&#x4E2A;&#x8BCD;&#xFF0C;&#x63CF;&#x8FF0;&#x6BD4;&#x4EE5;&#x524D;&#x7406;&#x89E3;&#x6240;&#x66F4;&#x5F31;&#x7684;&#x4E00;&#x5957;&#x4FDD;&#x8BC1;&#x3010;4&#x3011;&#x3002;</p>
<p>&#x968F;&#x7740;&#x8FD9;&#x79CD;&#x65B0;&#x578B;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7092;&#x4F5C;&#xFF0C;&#x4EBA;&#x4EEC;&#x666E;&#x904D;&#x8BA4;&#x4E3A;&#x4E8B;&#x52A1;&#x662F;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x7684;&#x5BF9;&#x7ACB;&#x9762;&#xFF0C;&#x4EFB;&#x4F55;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x90FD;&#x5FC5;&#x987B;&#x653E;&#x5F03;&#x4E8B;&#x52A1;&#x4EE5;&#x4FDD;&#x6301;&#x826F;&#x597D;&#x7684;&#x6027;&#x80FD;&#x548C;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x3010;5,6&#x3011;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x6709;&#x65F6;&#x5C06;&#x4E8B;&#x52A1;&#x4FDD;&#x8BC1;&#x4F5C;&#x4E3A;&#x201C;&#x91CD;&#x8981;&#x5E94;&#x7528;&#x201D;&#x548C;&#x201C;&#x6709;&#x4EF7;&#x503C;&#x6570;&#x636E;&#x201D;&#x7684;&#x57FA;&#x672C;&#x8981;&#x6C42;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x89C2;&#x70B9;&#x90FD;&#x662F;<strong>&#x7EAF;&#x7CB9;&#x7684;&#x5938;&#x5F20;</strong>&#x3002;</p>
<p>&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x7B80;&#x5355;&#xFF1A;&#x4E0E;&#x5176;&#x4ED6;&#x6280;&#x672F;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#x4E00;&#x6837;&#xFF0C;&#x4E8B;&#x52A1;&#x6709;&#x5176;&#x4F18;&#x52BF;&#x548C;&#x5C40;&#x9650;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x6743;&#x8861;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x4E8B;&#x52A1;&#x6240;&#x63D0;&#x4F9B;&#x4FDD;&#x8BC1;&#x7684;&#x7EC6;&#x8282;&#x2014;&#x2014;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x4E2D;&#x8FD8;&#x662F;&#x5728;&#x5404;&#x79CD;&#x6781;&#x7AEF;&#xFF08;&#x4F46;&#x662F;&#x73B0;&#x5B9E;&#x5B58;&#x5728;&#xFF09;&#x60C5;&#x51B5;&#x4E0B;&#x3002;</p>
<h3 id="acid&#x7684;&#x542B;&#x4E49;">ACID&#x7684;&#x542B;&#x4E49;</h3>
<p>&#x4E8B;&#x52A1;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x5B89;&#x5168;&#x4FDD;&#x8BC1;&#xFF0C;&#x901A;&#x5E38;&#x7531;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x9996;&#x5B57;&#x6BCD;&#x7F29;&#x7565;&#x8BCD;ACID&#x6765;&#x63CF;&#x8FF0;&#xFF0C;ACID&#x4EE3;&#x8868;<strong>&#x539F;&#x5B50;&#x6027;&#xFF08;Atomicity&#xFF09;</strong>&#xFF0C;<strong>&#x4E00;&#x81F4;&#x6027;&#xFF08;Consistency&#xFF09;</strong>&#xFF0C;<strong>&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;</strong>&#x548C;<strong>&#x6301;&#x4E45;&#x6027;&#xFF08;Durability&#xFF09;</strong>&#x3002;&#x5B83;&#x7531;TheoH&#xE4;rder&#x548C;Andreas Reuter&#x4E8E;1983&#x5E74;&#x521B;&#x5EFA;&#xFF0C;&#x65E8;&#x5728;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5BB9;&#x9519;&#x673A;&#x5236;&#x5EFA;&#x7ACB;&#x7CBE;&#x786E;&#x7684;&#x672F;&#x8BED;&#x3002;</p>
<p>&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x5E93;&#x7684;ACID&#x5B9E;&#x73B0;&#x5E76;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x5173;&#x4E8E;<strong>&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;</strong> &#x7684;&#x542B;&#x4E49;&#x5C31;&#x6709;&#x8BB8;&#x591A;&#x542B;&#x7CCA;&#x4E0D;&#x6E05;&#x3010;8&#x3011;&#x3002;&#x9AD8;&#x5C42;&#x6B21;&#x4E0A;&#x7684;&#x60F3;&#x6CD5;&#x5F88;&#x7F8E;&#x597D;&#xFF0C;&#x4F46;&#x9B54;&#x9B3C;&#x9690;&#x85CF;&#x5728;&#x7EC6;&#x8282;&#x91CC;&#x3002;&#x4ECA;&#x5929;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x58F0;&#x79F0;&#x81EA;&#x5DF1;&#x201C;&#x7B26;&#x5408;ACID&#x201D;&#x65F6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x80FD;&#x671F;&#x5F85;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x4FDD;&#x8BC1;&#x5E76;&#x4E0D;&#x6E05;&#x695A;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;ACID&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x5DF2;&#x7ECF;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x8425;&#x9500;&#x672F;&#x8BED;&#x3002;</p>
<p>&#xFF08;&#x4E0D;&#x7B26;&#x5408;ACID&#x6807;&#x51C6;&#x7684;&#x7CFB;&#x7EDF;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;BASE&#xFF0C;&#x5B83;&#x4EE3;&#x8868;<strong>&#x57FA;&#x672C;&#x53EF;&#x7528;&#x6027;&#xFF08;Basically Available&#xFF09;</strong>&#xFF0C;<strong>&#x8F6F;&#x72B6;&#x6001;&#xFF08;Soft State&#xFF09;</strong>&#x548C;<strong>&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF08;Eventual consistency&#xFF09;</strong>&#x3010;9&#x3011;&#xFF0C;&#x8FD9;&#x6BD4;ACID&#x7684;&#x5B9A;&#x4E49;&#x66F4;&#x52A0;&#x6A21;&#x7CCA;&#xFF0C;&#x4F3C;&#x4E4E;BASE&#x7684;&#x552F;&#x4E00;&#x5408;&#x7406;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x201C;&#x4E0D;&#x662F;ACID&#x201D;&#xFF0C;&#x5373;&#x5B83;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x4EFB;&#x4F55;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x3002;&#xFF09;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x9694;&#x79BB;&#x6027;&#x548C;&#x6301;&#x4E45;&#x6027;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x63D0;&#x70BC;&#x51FA;&#x4E8B;&#x52A1;&#x7684;&#x601D;&#x60F3;&#x3002;</p>
<h4 id="&#x539F;&#x5B50;&#x6027;&#xFF08;atomicity&#xFF09;">&#x539F;&#x5B50;&#x6027;&#xFF08;Atomicity&#xFF09;</h4>
<p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x539F;&#x5B50;&#x662F;&#x6307;&#x4E0D;&#x80FD;&#x5206;&#x89E3;&#x6210;&#x5C0F;&#x90E8;&#x5206;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x8FD9;&#x4E2A;&#x8BCD;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x4E0D;&#x540C;&#x9886;&#x57DF;&#x4E2D;&#x610F;&#x5473;&#x7740;&#x76F8;&#x4F3C;&#x4F46;&#x53C8;&#x5FAE;&#x5999;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x65E0;&#x6CD5;&#x770B;&#x5230;&#x8BE5;&#x64CD;&#x4F5C;&#x7684;&#x4E00;&#x534A;&#x7ED3;&#x679C;&#x3002;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x5904;&#x4E8E;&#x64CD;&#x4F5C;&#x4E4B;&#x524D;&#x6216;&#x64CD;&#x4F5C;&#x4E4B;&#x540E;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECB;&#x4E8E;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;ACID&#x7684;&#x539F;&#x5B50;&#x6027;&#x5E76;<strong>&#x4E0D;</strong>&#x662F;&#x5173;&#x4E8E;<strong>&#x5E76;&#x53D1;&#xFF08;concurrent&#xFF09;</strong>&#x7684;&#x3002;&#x5B83;&#x5E76;&#x4E0D;&#x662F;&#x5728;&#x63CF;&#x8FF0;&#x5982;&#x679C;&#x51E0;&#x4E2A;&#x8FDB;&#x7A0B;&#x8BD5;&#x56FE;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5305;&#x542B;&#x5728;&#x7F29;&#x5199; <strong><em>I</em></strong> &#x4E2D;&#xFF0C;&#x5373;<a href="#&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;"><strong>&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;</strong></a></p>
<p>ACID&#x7684;&#x539F;&#x5B50;&#x6027;&#x800C;&#x662F;&#x63CF;&#x8FF0;&#x4E86;&#x5F53;&#x5BA2;&#x6237;&#x60F3;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x5199;&#x5165;&#xFF0C;&#x4F46;&#x5728;&#x4E00;&#x4E9B;&#x5199;&#x64CD;&#x4F5C;&#x5904;&#x7406;&#x5B8C;&#x4E4B;&#x540E;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4F8B;&#x5982;&#x8FDB;&#x7A0B;&#x5D29;&#x6E83;&#xFF0C;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4E2D;&#x65AD;&#xFF0C;&#x78C1;&#x76D8;&#x53D8;&#x6EE1;&#x6216;&#x8005;&#x67D0;&#x79CD;&#x5B8C;&#x6574;&#x6027;&#x7EA6;&#x675F;&#x88AB;&#x8FDD;&#x53CD;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5199;&#x64CD;&#x4F5C;&#x88AB;&#x5206;&#x7EC4;&#x5230;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x8BE5;&#x4E8B;&#x52A1;&#x7531;&#x4E8E;&#x9519;&#x8BEF;&#x800C;&#x4E0D;&#x80FD;&#x5B8C;&#x6210;&#xFF08;&#x63D0;&#x4EA4;&#xFF09;&#xFF0C;&#x5219;&#x8BE5;&#x4E8B;&#x52A1;&#x5C06;&#x88AB;&#x4E2D;&#x6B62;&#xFF0C;&#x5E76;&#x4E14;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x4E22;&#x5F03;&#x6216;&#x64A4;&#x6D88;&#x8BE5;&#x4E8B;&#x52A1;&#x4E2D;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x6240;&#x505A;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x5728;&#x591A;&#x5904;&#x66F4;&#x6539;&#x8FDB;&#x884C;&#x5230;&#x4E00;&#x534A;&#x65F6;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x5F88;&#x96BE;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x66F4;&#x6539;&#x5DF2;&#x7ECF;&#x751F;&#x6548;&#xFF0C;&#x54EA;&#x4E9B;&#x6CA1;&#x6709;&#x751F;&#x6548;&#x3002;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x518D;&#x8BD5;&#x4E00;&#x6B21;&#xFF0C;&#x4F46;&#x5192;&#x7740;&#x8FDB;&#x884C;&#x4E24;&#x6B21;&#x76F8;&#x540C;&#x53D8;&#x66F4;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x91CD;&#x590D;&#x6216;&#x9519;&#x8BEF;&#x7684;&#x6570;&#x636E;&#x3002;&#x539F;&#x5B50;&#x6027;&#x7B80;&#x5316;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x88AB;<strong>&#x4E2D;&#x6B62;&#xFF08;abort&#xFF09;</strong>&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5B83;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x91CD;&#x8BD5;&#x3002;</p>
<p>ACID&#x539F;&#x5B50;&#x6027;&#x7684;&#x5B9A;&#x4E49;&#x7279;&#x5F81;&#x662F;&#xFF1A;<strong>&#x80FD;&#x591F;&#x5728;&#x9519;&#x8BEF;&#x65F6;&#x4E2D;&#x6B62;&#x4E8B;&#x52A1;&#xFF0C;&#x4E22;&#x5F03;&#x8BE5;&#x4E8B;&#x52A1;&#x8FDB;&#x884C;&#x7684;&#x6240;&#x6709;&#x5199;&#x5165;&#x53D8;&#x66F4;&#x7684;&#x80FD;&#x529B;&#x3002;</strong> &#x6216;&#x8BB8; <strong>&#x53EF;&#x4E2D;&#x6B62;&#x6027;&#xFF08;abortability&#xFF09;</strong> &#x662F;&#x66F4;&#x597D;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x4F46;&#x672C;&#x4E66;&#x5C06;&#x7EE7;&#x7EED;&#x4F7F;&#x7528;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x60EF;&#x7528;&#x8BCD;&#x3002;</p>
<h4 id="&#x4E00;&#x81F4;&#x6027;&#xFF08;consistency&#xFF09;">&#x4E00;&#x81F4;&#x6027;&#xFF08;Consistency&#xFF09;</h4>
<p>&#x4E00;&#x81F4;&#x6027;&#x8FD9;&#x4E2A;&#x8BCD;&#x88AB;&#x8D4B;&#x4E88;&#x592A;&#x591A;&#x542B;&#x4E49;&#xFF1A;</p>
<ul>
<li>&#x5728;<a href="ch5.html">&#x7B2C;5&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x526F;&#x672C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x95EE;&#x9898;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch5.html#&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;">&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;</a>&#x201D;&#xFF09;&#x3002;</li>
<li><a href="ch6.html#&#x4E00;&#x81F4;&#x6027;&#x6563;&#x5217;">&#x4E00;&#x81F4;&#x6027;&#x6563;&#x5217;&#xFF08;Consistency Hash&#xFF09;</a>)&#x662F;&#x67D0;&#x4E9B;&#x7CFB;&#x7EDF;&#x7528;&#x4E8E;&#x91CD;&#x65B0;&#x5206;&#x533A;&#x7684;&#x4E00;&#x79CD;&#x5206;&#x533A;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x5728;<a href="ch9.html#CAP&#x5B9A;&#x7406;">CAP&#x5B9A;&#x7406;</a>&#x4E2D;&#xFF0C;&#x4E00;&#x81F4;&#x6027;&#x4E00;&#x8BCD;&#x7528;&#x4E8E;&#x8868;&#x793A;<a href="ch9.html#&#x7EBF;&#x6027;&#x5316;">&#x53EF;&#x7EBF;&#x6027;&#x5316;</a>&#x3002;</li>
<li>&#x5728;ACID&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;<strong>&#x4E00;&#x81F4;&#x6027;</strong>&#x662F;&#x6307;&#x6570;&#x636E;&#x5E93;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7279;&#x5B9A;&#x6982;&#x5FF5;&#x4E2D;&#x5904;&#x4E8E;&#x201C;&#x826F;&#x597D;&#x72B6;&#x6001;&#x201D;&#x3002;</li>
</ul>
<p>&#x5F88;&#x4E0D;&#x5E78;&#xFF0C;&#x8FD9;&#x4E00;&#x4E2A;&#x8BCD;&#x5C31;&#x81F3;&#x5C11;&#x6709;&#x56DB;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
<p>ACID&#x4E00;&#x81F4;&#x6027;&#x7684;&#x6982;&#x5FF5;&#x662F;&#xFF0C;<strong>&#x5BF9;&#x6570;&#x636E;&#x7684;&#x4E00;&#x7EC4;&#x7279;&#x5B9A;&#x7EA6;&#x675F;&#x5FC5;&#x987B;&#x59CB;&#x7EC8;&#x6210;&#x7ACB;</strong>&#x3002;&#x5373;<strong>&#x4E0D;&#x53D8;&#x91CF;&#xFF08;invariants&#xFF09;</strong>&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x4F1A;&#x8BA1;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x8D26;&#x6237;&#x6574;&#x4F53;&#x4E0A;&#x5FC5;&#x987B;&#x501F;&#x8D37;&#x76F8;&#x62B5;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x4E8E;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E9B;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x6709;&#x6548;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E14;&#x5728;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x671F;&#x95F4;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x90FD;&#x4FDD;&#x6301;&#x8FD9;&#x79CD;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#xFF0C;&#x4E0D;&#x53D8;&#x91CF;&#x603B;&#x662F;&#x6EE1;&#x8DB3;&#x7684;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x8FD9;&#x79CD;&#x6982;&#x5FF5;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x89C2;&#x5FF5;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8D1F;&#x8D23;&#x6B63;&#x786E;&#x5B9A;&#x4E49;&#x5B83;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x5E76;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x6027;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x5199;&#x5165;&#x8FDD;&#x53CD;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x810F;&#x6570;&#x636E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x65E0;&#x6CD5;&#x963B;&#x6B62;&#x4F60;&#x3002; &#xFF08;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x4E0D;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x7531;&#x6570;&#x636E;&#x5E93;&#x68C0;&#x67E5;&#xFF0C;&#x4F8B;&#x5982;&#x5916;&#x952E;&#x7EA6;&#x675F;&#x6216;&#x552F;&#x4E00;&#x7EA6;&#x675F;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x5B9A;&#x4E49;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6570;&#x636E;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4EC0;&#x4E48;&#x6837;&#x662F;&#x65E0;&#x6548;&#x7684;&#x3002;&#x2014;&#x2014; &#x6570;&#x636E;&#x5E93;&#x53EA;&#x7BA1;&#x5B58;&#x50A8;&#x3002;&#xFF09;</p>
<p>&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x9694;&#x79BB;&#x6027;&#x548C;&#x6301;&#x4E45;&#x6027;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x800C;&#x4E00;&#x81F4;&#x6027;&#xFF08;&#x5728;ACID&#x610F;&#x4E49;&#x4E0A;&#xFF09;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x5E94;&#x7528;&#x53EF;&#x80FD;&#x4F9D;&#x8D56;&#x6570;&#x636E;&#x5E93;&#x7684;&#x539F;&#x5B50;&#x6027;&#x548C;&#x9694;&#x79BB;&#x5C5E;&#x6027;&#x6765;&#x5B9E;&#x73B0;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x4EC5;&#x53D6;&#x51B3;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B57;&#x6BCD;C&#x4E0D;&#x5C5E;&#x4E8E;ACID<sup><a href="#fn_i" id="reffn_i">i</a></sup>&#x3002;</p>
<blockquote id="fn_i">
<sup>i</sup>. &#x4E54;&#xB7;&#x6D77;&#x52D2;&#x65AF;&#x5766;&#xFF08;Joe Hellerstein&#xFF09;&#x6307;&#x51FA;&#xFF0C;&#x5728;&#x8BBA;H&#xE4;rder&#x4E0E;Reuter&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;&#x201C;ACID&#x4E2D;&#x7684;C&#x201D;&#x662F;&#x88AB;&#x201C;&#x6254;&#x8FDB;&#x53BB;&#x51D1;&#x7F29;&#x5199;&#x5355;&#x8BCD;&#x7684;&#x201D;&#x3010;7&#x3011;&#xFF0C;&#x800C;&#x4E14;&#x90A3;&#x65F6;&#x5019;&#x5927;&#x5BB6;&#x90FD;&#x4E0D;&#x600E;&#x4E48;&#x5728;&#x4E4E;&#x4E00;&#x81F4;&#x6027;&#x3002;<a href="#reffn_i" title="Jump back to footnote [i] in the text."> &#x21A9;</a>
</blockquote>
<h4 id="&#x9694;&#x79BB;&#x6027;&#xFF08;isolation&#xFF09;">&#x9694;&#x79BB;&#x6027;&#xFF08;Isolation&#xFF09;</h4>
<p>&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x4F1A;&#x540C;&#x65F6;&#x88AB;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x8BBF;&#x95EE;&#x3002;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x5404;&#x81EA;&#x8BFB;&#x5199;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x662F;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x8BBF;&#x95EE;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8BB0;&#x5F55;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;<strong>&#x5E76;&#x53D1;</strong>&#x95EE;&#x9898;&#xFF08;<strong>&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF08;race conditions&#xFF09;</strong>&#xFF09;&#x3002;</p>
<p><a href="img/fig7-1.png">&#x56FE;7-1</a>&#x662F;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E24;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x540C;&#x65F6;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x589E;&#x957F;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x3002;&#xFF08;&#x5047;&#x8BBE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6CA1;&#x6709;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#xFF09;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x8BFB;&#x53D6;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x5F53;&#x524D;&#x503C;&#xFF0C;&#x52A0; 1 &#xFF0C;&#x518D;&#x56DE;&#x5199;&#x65B0;&#x503C;&#x3002;<a href="img/fig7-1.png">&#x56FE;7-1</a> &#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x53D1;&#x751F;&#x4E86;&#x4E24;&#x6B21;&#x589E;&#x957F;&#xFF0C;&#x8BA1;&#x6570;&#x5668;&#x5E94;&#x8BE5;&#x4ECE;42&#x589E;&#x81F3;44&#xFF1B;&#x4F46;&#x7531;&#x4E8E;&#x7ADE;&#x6001;&#x6761;&#x4EF6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x589E;&#x81F3; 43 &#x3002;</p>
<p>ACID&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x9694;&#x79BB;&#x6027;&#x610F;&#x5473;&#x7740;&#xFF0C;<strong>&#x540C;&#x65F6;&#x6267;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x662F;&#x76F8;&#x4E92;&#x9694;&#x79BB;&#x7684;</strong>&#xFF1A;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x76F8;&#x4E92;&#x5192;&#x72AF;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x5E93;&#x6559;&#x79D1;&#x4E66;&#x5C06;&#x9694;&#x79BB;&#x6027;&#x5F62;&#x5F0F;&#x5316;&#x4E3A;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;Serializability&#xFF09;</strong>&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x5047;&#x88C5;&#x5B83;&#x662F;&#x552F;&#x4E00;&#x5728;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x3002;&#x6570;&#x636E;&#x5E93;&#x786E;&#x4FDD;&#x5F53;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x7ED3;&#x679C;&#x4E0E;&#x5B83;&#x4EEC;&#x6309;&#x987A;&#x5E8F;&#x8FD0;&#x884C;&#xFF08;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#xFF09;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x662F;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#x7684;&#x3010;10&#x3011;&#x3002;</p>
<p><img src="img/fig7-1.png" alt=""></p>
<p><strong>&#x56FE;7-1 &#x4E24;&#x4E2A;&#x5BA2;&#x6237;&#x4E4B;&#x95F4;&#x7684;&#x7ADE;&#x4E89;&#x72B6;&#x6001;&#x540C;&#x65F6;&#x9012;&#x589E;&#x8BA1;&#x6570;&#x5668;</strong></p>
<p>&#x7136;&#x800C;&#x5B9E;&#x8DF5;&#x4E2D;&#x5F88;&#x5C11;&#x4F1A;&#x4F7F;&#x7528;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x6027;&#x80FD;&#x635F;&#x5931;&#x3002;&#x4E00;&#x4E9B;&#x6D41;&#x884C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5982;Oracle 11g&#xFF0C;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x5728;Oracle&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&#x201C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x201D;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x79CD;&#x53EB;&#x505A;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;snapshot isolation&#xFF09;</strong> &#x7684;&#x529F;&#x80FD;&#xFF0C;<strong>&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x66F4;&#x5F31;&#x7684;&#x4FDD;&#x8BC1;</strong>&#x3010;8,11&#x3011;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="">&#x5F31;&#x9694;&#x79BB;&#x7B49;&#x7EA7;</a>&#x201D;&#x4E2D;&#x7814;&#x7A76;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x548C;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x9694;&#x79BB;&#x3002;</p>
<h4 id="&#x6301;&#x4E45;&#x6027;&#xFF08;durability&#xFF09;">&#x6301;&#x4E45;&#x6027;&#xFF08;Durability&#xFF09;</h4>
<p>&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x7684;&#x76EE;&#x7684;&#x662F;&#xFF0C;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x7684;&#x5730;&#x65B9;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x62C5;&#x5FC3;&#x4E22;&#x5931;&#x3002;<strong>&#x6301;&#x4E45;&#x6027;</strong> &#x662F;&#x4E00;&#x4E2A;&#x627F;&#x8BFA;&#xFF0C;&#x5373;&#x4E00;&#x65E6;&#x4E8B;&#x52A1;&#x6210;&#x529F;&#x5B8C;&#x6210;&#xFF0C;&#x5373;&#x4F7F;&#x53D1;&#x751F;&#x786C;&#x4EF6;&#x6545;&#x969C;&#x6216;&#x6570;&#x636E;&#x5E93;&#x5D29;&#x6E83;&#xFF0C;&#x5199;&#x5165;&#x7684;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x3002;</p>
<p>&#x5728;&#x5355;&#x8282;&#x70B9;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x6301;&#x4E45;&#x6027;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x5DF2;&#x88AB;&#x5199;&#x5165;&#x975E;&#x6613;&#x5931;&#x6027;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#xFF0C;&#x5982;&#x786C;&#x76D8;&#x6216;SSD&#x3002;&#x5B83;&#x901A;&#x5E38;&#x8FD8;&#x5305;&#x62EC;&#x9884;&#x5199;&#x65E5;&#x5FD7;&#x6216;&#x7C7B;&#x4F3C;&#x7684;&#x6587;&#x4EF6;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x8BA9;B&#x6811;&#x66F4;&#x53EF;&#x9760;">&#x8BA9;B&#x6811;&#x66F4;&#x53EF;&#x9760;</a>&#x201D;&#xFF09;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x635F;&#x574F;&#x65F6;&#x8FDB;&#x884C;&#x6062;&#x590D;&#x3002;&#x5728;&#x5E26;&#x590D;&#x5236;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x6301;&#x4E45;&#x6027;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x5DF2;&#x6210;&#x529F;&#x590D;&#x5236;&#x5230;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#x3002;&#x4E3A;&#x4E86;&#x63D0;&#x4F9B;&#x6301;&#x4E45;&#x6027;&#x4FDD;&#x8BC1;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x7B49;&#x5230;&#x8FD9;&#x4E9B;&#x5199;&#x5165;&#x6216;&#x590D;&#x5236;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x62A5;&#x544A;&#x4E8B;&#x52A1;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x3002;</p>
<p>&#x5982;&#x201C;<a href="ch1.html#&#x53EF;&#x9760;&#x6027;">&#x53EF;&#x9760;&#x6027;</a>&#x201D;&#x4E00;&#x8282;&#x6240;&#x8FF0;&#xFF0C;<strong>&#x5B8C;&#x7F8E;&#x7684;&#x6301;&#x4E45;&#x6027;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;</strong> &#xFF1A;&#x5982;&#x679C;&#x6240;&#x6709;&#x786C;&#x76D8;&#x548C;&#x6240;&#x6709;&#x5907;&#x4EFD;&#x540C;&#x65F6;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x90A3;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x5E93;&#x80FD;&#x6551;&#x5F97;&#x4E86;&#x4F60;&#x3002;</p>
<blockquote>
<h4 id="&#x590D;&#x5236;&#x548C;&#x6301;&#x4E45;&#x6027;">&#x590D;&#x5236;&#x548C;&#x6301;&#x4E45;&#x6027;</h4>
<p>&#x5728;&#x5386;&#x53F2;&#x4E0A;&#xFF0C;&#x6301;&#x4E45;&#x6027;&#x610F;&#x5473;&#x7740;&#x5199;&#x5165;&#x5F52;&#x6863;&#x78C1;&#x5E26;&#x3002;&#x540E;&#x6765;&#x5B83;&#x88AB;&#x7406;&#x89E3;&#x4E3A;&#x5199;&#x5165;&#x786C;&#x76D8;&#x6216;SSD&#x3002;&#x6700;&#x8FD1;&#x5B83;&#x5DF2;&#x7ECF;&#x9002;&#x5E94;&#x4E86;&#x201C;&#x590D;&#x5236;&#xFF08;replication&#xFF09;&#x201D;&#x7684;&#x65B0;&#x5185;&#x6DB5;&#x3002;&#x54EA;&#x79CD;&#x5B9E;&#x73B0;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#xFF1F;</p>
<p>&#x771F;&#x76F8;&#x662F;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4F60;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x7136;&#x540E;&#x673A;&#x5668;&#x5B95;&#x673A;&#xFF0C;&#x5373;&#x4F7F;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x4E22;&#x5931;&#xFF0C;&#x5728;&#x4FEE;&#x590D;&#x673A;&#x5668;&#x6216;&#x5C06;&#x78C1;&#x76D8;&#x8F6C;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x4E4B;&#x524D;&#xFF0C;&#x4E5F;&#x662F;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x590D;&#x5236;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x4FDD;&#x6301;&#x53EF;&#x7528;&#x6027;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x76F8;&#x5173;&#x6027;&#x6545;&#x969C;&#xFF08;&#x505C;&#x7535;&#xFF0C;&#x6216;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x8F93;&#x5165;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5D29;&#x6E83;&#x7684;Bug&#xFF09;&#x53EF;&#x80FD;&#x4F1A;&#x4E00;&#x6B21;&#x6027;&#x6467;&#x6BC1;&#x6240;&#x6709;&#x526F;&#x672C;&#xFF08;&#x53C2;&#x9605;&#x300C;<a href="ch1.html#&#x53EF;&#x9760;&#x6027;">&#x53EF;&#x9760;&#x6027;</a>&#x300D;&#xFF09;&#xFF0C;&#x4EFB;&#x4F55;&#x4EC5;&#x5B58;&#x50A8;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x6545;&#x5185;&#x5B58;&#x6570;&#x636E;&#x5E93;&#x4ECD;&#x7136;&#x8981;&#x548C;&#x78C1;&#x76D8;&#x5199;&#x5165;&#x6253;&#x4EA4;&#x9053;&#x3002;</li>
<li>&#x5728;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5F53;&#x4E3B;&#x5E93;&#x4E0D;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x6700;&#x8FD1;&#x7684;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#xFF08;&#x53C2;&#x9605;&#x300C;<a href="ch5.html#&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;">&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;</a>&#x300D;&#xFF09;&#x3002;</li>
<li>&#x5F53;&#x7535;&#x6E90;&#x7A81;&#x7136;&#x65AD;&#x7535;&#x65F6;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x56FA;&#x6001;&#x786C;&#x76D8;&#xFF0C;&#x6709;&#x8BC1;&#x636E;&#x663E;&#x793A;&#x6709;&#x65F6;&#x4F1A;&#x8FDD;&#x53CD;&#x5E94;&#x6709;&#x7684;&#x4FDD;&#x8BC1;&#xFF1A;&#x751A;&#x81F3;fsync&#x4E5F;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3010;12&#x3011;&#x3002;&#x786C;&#x76D8;&#x56FA;&#x4EF6;&#x53EF;&#x80FD;&#x6709;&#x9519;&#x8BEF;&#xFF0C;&#x5C31;&#x50CF;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x8F6F;&#x4EF6;&#x4E00;&#x6837;&#x3010;13,14&#x3011;&#x3002;</li>
<li>&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x548C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x5FAE;&#x5999;&#x4EA4;&#x4E92;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x96BE;&#x4EE5;&#x8FFD;&#x8E2A;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6587;&#x4EF6;&#x5728;&#x5D29;&#x6E83;&#x540E;&#x88AB;&#x635F;&#x574F;&#x3010;15,16&#x3011;&#x3002;</li>
<li>&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x6CA1;&#x6709;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9010;&#x6E10;&#x635F;&#x574F;&#x3010;17&#x3011;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5DF2;&#x635F;&#x574F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x526F;&#x672C;&#x548C;&#x6700;&#x8FD1;&#x7684;&#x5907;&#x4EFD;&#x4E5F;&#x53EF;&#x80FD;&#x635F;&#x574F;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9700;&#x8981;&#x5C1D;&#x8BD5;&#x4ECE;&#x5386;&#x53F2;&#x5907;&#x4EFD;&#x4E2D;&#x6062;&#x590D;&#x6570;&#x636E;&#x3002;</li>
<li>&#x4E00;&#x9879;&#x5173;&#x4E8E;&#x56FA;&#x6001;&#x786C;&#x76D8;&#x7684;&#x7814;&#x7A76;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x524D;&#x56DB;&#x5E74;&#x4E2D;&#xFF0C;30&#xFF05;&#x5230;80&#xFF05;&#x7684;&#x786C;&#x76D8;&#x4F1A;&#x4EA7;&#x751F;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x574F;&#x5757;&#x3010;18&#x3011;&#x3002;&#x76F8;&#x6BD4;&#x56FA;&#x6001;&#x786C;&#x76D8;&#xFF0C;&#x78C1;&#x76D8;&#x7684;&#x574F;&#x9053;&#x7387;&#x8F83;&#x4F4E;&#xFF0C;&#x4F46;&#x5B8C;&#x5168;&#x5931;&#x6548;&#x7684;&#x6982;&#x7387;&#x66F4;&#x9AD8;&#x3002;</li>
<li>&#x5982;&#x679C;SSD&#x65AD;&#x7535;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x51E0;&#x5468;&#x5185;&#x5F00;&#x59CB;&#x4E22;&#x5931;&#x6570;&#x636E;&#xFF0C;&#x5177;&#x4F53;&#x53D6;&#x51B3;&#x4E8E;&#x6E29;&#x5EA6;&#x3010;19&#x3011;&#x3002;</li>
</ul>
<p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7EDD;&#x5BF9;&#x4FDD;&#x8BC1;&#x3002;&#x53EA;&#x6709;&#x5404;&#x79CD;&#x964D;&#x4F4E;&#x98CE;&#x9669;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5305;&#x62EC;&#x5199;&#x5165;&#x78C1;&#x76D8;&#xFF0C;&#x590D;&#x5236;&#x5230;&#x8FDC;&#x7A0B;&#x673A;&#x5668;&#x548C;&#x5907;&#x4EFD;&#x2014;&#x2014;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4E14;&#x5E94;&#x8BE5;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;&#x4E0E;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x6700;&#x597D;&#x62B1;&#x7740;&#x6000;&#x7591;&#x7684;&#x6001;&#x5EA6;&#x63A5;&#x53D7;&#x4EFB;&#x4F55;&#x7406;&#x8BBA;&#x4E0A;&#x7684;&#x201C;&#x4FDD;&#x8BC1;&#x201D;</p>
</blockquote>
<h3 id="&#x5355;&#x5BF9;&#x8C61;&#x548C;&#x591A;&#x5BF9;&#x8C61;&#x64CD;&#x4F5C;">&#x5355;&#x5BF9;&#x8C61;&#x548C;&#x591A;&#x5BF9;&#x8C61;&#x64CD;&#x4F5C;</h3>
<p>&#x56DE;&#x987E;&#x4E00;&#x4E0B;&#xFF0C;&#x5728;ACID&#x4E2D;&#xFF0C;&#x539F;&#x5B50;&#x6027;&#x548C;&#x9694;&#x79BB;&#x6027;&#x63CF;&#x8FF0;&#x4E86;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x540C;&#x4E00;&#x4E8B;&#x52A1;&#x4E2D;&#x6267;&#x884C;&#x591A;&#x6B21;&#x5199;&#x5165;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;</p>
<p><strong><em>&#x539F;&#x5B50;&#x6027;</em></strong></p>
<p>&#x5982;&#x679C;&#x5728;&#x4E00;&#x7CFB;&#x5217;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x4E2D;&#x9014;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x5219;&#x5E94;&#x4E2D;&#x6B62;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E22;&#x5F03;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x7684;&#x6240;&#x6709;&#x5199;&#x5165;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x514D;&#x53BB;&#x4E86;&#x7528;&#x6237;&#x5BF9;&#x90E8;&#x5206;&#x5931;&#x8D25;&#x7684;&#x62C5;&#x5FE7;&#x2014;&#x2014;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x201C;<strong>&#x5B81;&#x4E3A;&#x7389;&#x788E;&#xFF0C;&#x4E0D;&#x4E3A;&#x74E6;&#x5168;&#xFF08;all-or-nothing&#xFF09;</strong>&#x201D;&#x7684;&#x4FDD;&#x8BC1;&#x3002;</p>
<p><strong><em>&#x9694;&#x79BB;&#x6027;</em></strong></p>
<p>&#x540C;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x4E0D;&#x5E94;&#x8BE5;&#x4E92;&#x76F8;&#x5E72;&#x6270;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x5199;&#x5165;&#xFF0C;&#x5219;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8981;&#x4E48;&#x770B;&#x5230;&#x5168;&#x90E8;&#x5199;&#x5165;&#x7ED3;&#x679C;&#xFF0C;&#x8981;&#x4E48;&#x4EC0;&#x4E48;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#xFF0C;&#x4F46;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E9B;&#x5B50;&#x96C6;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x540C;&#x65F6;&#x4FEE;&#x6539;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#xFF08;&#x884C;&#xFF0C;&#x6587;&#x6863;&#xFF0C;&#x8BB0;&#x5F55;&#xFF09;&#x3002;&#x901A;&#x5E38;&#x9700;&#x8981;<strong>&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#xFF08;multi-object transaction&#xFF09;</strong> &#x6765;&#x4FDD;&#x6301;&#x591A;&#x5757;&#x6570;&#x636E;&#x540C;&#x6B65;&#x3002;<a href="img/fig7-2.png">&#x56FE;7-2</a>&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x6765;&#x81EA;&#x7535;&#x90AE;&#x5E94;&#x7528;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6267;&#x884C;&#x4EE5;&#x4E0B;&#x67E5;&#x8BE2;&#x6765;&#x663E;&#x793A;&#x7528;&#x6237;&#x672A;&#x8BFB;&#x90AE;&#x4EF6;&#x6570;&#x91CF;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">SELECT</span> <span class="hljs-keyword">COUNT</span>&#xFF08;*&#xFF09;<span class="hljs-keyword">FROM</span> emails <span class="hljs-keyword">WHERE</span> recipient_id = <span class="hljs-number">2</span> <span class="hljs-keyword">AND</span> unread_flag = <span class="hljs-literal">true</span>
</code></pre>
<p>&#x4F46;&#x5982;&#x679C;&#x90AE;&#x4EF6;&#x592A;&#x591A;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x4E2A;&#x67E5;&#x8BE2;&#x592A;&#x6162;&#xFF0C;&#x5E76;&#x51B3;&#x5B9A;&#x7528;&#x5355;&#x72EC;&#x7684;&#x5B57;&#x6BB5;&#x5B58;&#x50A8;&#x672A;&#x8BFB;&#x90AE;&#x4EF6;&#x7684;&#x6570;&#x91CF;&#xFF08;&#x4E00;&#x79CD;&#x53CD;&#x89C4;&#x8303;&#x5316;&#xFF09;&#x3002;&#x73B0;&#x5728;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x65B0;&#x6D88;&#x606F;&#x5199;&#x5165;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x4E5F;&#x589E;&#x957F;&#x672A;&#x8BFB;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x5DF2;&#x8BFB;&#x65F6;&#xFF0C;&#x4E5F;&#x5FC5;&#x987B;&#x51CF;&#x5C11;&#x672A;&#x8BFB;&#x8BA1;&#x6570;&#x5668;&#x3002;</p>
<p>&#x5728;<a href="img/fig7-2.png">&#x56FE;7-2</a>&#x4E2D;&#xFF0C;&#x7528;&#x6237;2 &#x9047;&#x5230;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF1A;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x91CC;&#x663E;&#x793A;&#x6709;&#x672A;&#x8BFB;&#x6D88;&#x606F;&#xFF0C;&#x4F46;&#x8BA1;&#x6570;&#x5668;&#x663E;&#x793A;&#x4E3A;&#x96F6;&#x672A;&#x8BFB;&#x6D88;&#x606F;&#xFF0C;&#x56E0;&#x4E3A;&#x8BA1;&#x6570;&#x5668;&#x589E;&#x957F;&#x8FD8;&#x6CA1;&#x6709;&#x53D1;&#x751F;<sup><a href="#fn_ii" id="reffn_ii">ii</a></sup>&#x3002;&#x9694;&#x79BB;&#x6027;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x901A;&#x8FC7;&#x786E;&#x4FDD;&#x7528;&#x6237;2 &#x8981;&#x4E48;&#x540C;&#x65F6;&#x770B;&#x5230;&#x65B0;&#x90AE;&#x4EF6;&#x548C;&#x589E;&#x957F;&#x540E;&#x7684;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x8981;&#x4E48;&#x90FD;&#x770B;&#x4E0D;&#x5230;&#x3002;&#x53CD;&#x6B63;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x6267;&#x884C;&#x5230;&#x4E00;&#x534A;&#x7684;&#x4E2D;&#x95F4;&#x7ED3;&#x679C;&#x3002;</p>
<blockquote id="fn_ii">
<sup>ii</sup>. &#x53EF;&#x4EE5;&#x8BF4;&#x90AE;&#x4EF6;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x8BA1;&#x6570;&#x5668;&#x5E76;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x6362;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x770B;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x672A;&#x8BFB;&#x8BA1;&#x6570;&#x5668;&#x6362;&#x6210;&#x5BA2;&#x6237;&#x8D26;&#x6237;&#x4F59;&#x989D;&#xFF0C;&#x628A;&#x90AE;&#x4EF6;&#x6536;&#x53D1;&#x770B;&#x6210;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x3002;<a href="#reffn_ii" title="Jump back to footnote [ii] in the text."> &#x21A9;</a>
</blockquote>
<p><img src="img/fig7-2.png" alt=""></p>
<p><strong>&#x56FE;7-2 &#x8FDD;&#x53CD;&#x9694;&#x79BB;&#x6027;&#xFF1A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x672A;&#x88AB;&#x6267;&#x884C;&#x7684;&#x5199;&#x5165;&#xFF08;&#x201C;&#x810F;&#x8BFB;&#x201D;&#xFF09;&#x3002;</strong></p>
<p><a href="img/fig7-3.png">&#x56FE;7-3</a>&#x8BF4;&#x660E;&#x4E86;&#x5BF9;&#x539F;&#x5B50;&#x6027;&#x7684;&#x9700;&#x6C42;&#xFF1A;&#x5982;&#x679C;&#x5728;&#x4E8B;&#x52A1;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x90AE;&#x7BB1;&#x548C;&#x672A;&#x8BFB;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x53BB;&#x540C;&#x6B65;&#x3002;&#x5728;&#x539F;&#x5B50;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x66F4;&#x65B0;&#x5931;&#x8D25;&#xFF0C;&#x4E8B;&#x52A1;&#x5C06;&#x88AB;&#x4E2D;&#x6B62;&#xFF0C;&#x5E76;&#x4E14;&#x63D2;&#x5165;&#x7684;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5C06;&#x88AB;&#x56DE;&#x6EDA;&#x3002;</p>
<p><img src="img/fig7-3.png" alt=""></p>
<p><strong>&#x56FE;7-3 &#x539F;&#x5B50;&#x6027;&#x786E;&#x4FDD;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;&#x5148;&#x524D;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x90FD;&#x4F1A;&#x88AB;&#x64A4;&#x6D88;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x72B6;&#x6001;&#x4E0D;&#x4E00;&#x81F4;</strong></p>
<p>&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x6765;&#x786E;&#x5B9A;&#x54EA;&#x4E9B;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x3002;&#x5728;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x57FA;&#x4E8E;&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x7684;TCP&#x8FDE;&#x63A5;&#xFF1A;&#x5728;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x8FDE;&#x63A5;&#x4E0A;&#xFF0C;<code>BEGIN TRANSACTION</code> &#x548C; <code>COMMIT</code> &#x8BED;&#x53E5;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x540C;&#x4E00;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x90E8;&#x5206;.<sup><a href="#fn_iii" id="reffn_iii">iii</a></sup></p>
<blockquote id="fn_iii">
<sup>iii</sup>. &#x8FD9;&#x5E76;&#x4E0D;&#x5B8C;&#x7F8E;&#x3002;&#x5982;&#x679C;TCP&#x8FDE;&#x63A5;&#x4E2D;&#x65AD;&#xFF0C;&#x5219;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x4E2D;&#x6B62;&#x3002;&#x5982;&#x679C;&#x4E2D;&#x65AD;&#x53D1;&#x751F;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x63D0;&#x4EA4;&#x4E4B;&#x540E;&#xFF0C;&#x4F46;&#x5728;&#x670D;&#x52A1;&#x5668;&#x786E;&#x8BA4;&#x63D0;&#x4EA4;&#x53D1;&#x751F;&#x4E4B;&#x524D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x4E8B;&#x52A1;&#x662F;&#x5426;&#x5DF2;&#x63D0;&#x4EA4;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x4E8B;&#x52A1;&#x6807;&#x8BC6;&#x7B26;&#x6765;&#x5BF9;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x5206;&#x7EC4;&#xFF0C;&#x8FD9;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x5E76;&#x672A;&#x7ED1;&#x5B9A;&#x5230;&#x7279;&#x5B9A;TCP&#x8FDE;&#x63A5;&#x3002;&#x540E;&#x7EED;&#x518D;&#x201C;<a href="ch12.html#&#x6570;&#x636E;&#x5E93;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x4E89;&#x8BBA;">&#x6570;&#x636E;&#x5E93;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x4E89;&#x8BBA;</a>&#x201D;&#x4E00;&#x8282;&#x5C06;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x3002;<a href="#reffn_iii" title="Jump back to footnote [iii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8BB8;&#x591A;&#x975E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x5E76;&#x6CA1;&#x6709;&#x5C06;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5373;&#x4F7F;&#x5B58;&#x5728;&#x591A;&#x5BF9;&#x8C61;API&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x5728;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x4E2D;&#x66F4;&#x65B0;&#x51E0;&#x4E2A;&#x952E;&#x7684;&#x6570;&#x4E2A;put&#x64CD;&#x4F5C;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x610F;&#x5473;&#x7740;&#x5B83;&#x5177;&#x6709;&#x4E8B;&#x52A1;&#x8BED;&#x4E49;&#xFF1A;&#x8BE5;&#x547D;&#x4EE4;&#x53EF;&#x80FD;&#x5728;&#x4E00;&#x4E9B;&#x952E;&#x4E0A;&#x6210;&#x529F;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x7684;&#x952E;&#x4E0A;&#x5931;&#x8D25;&#xFF0C;&#x4F7F;&#x6570;&#x636E;&#x5E93;&#x5904;&#x4E8E;&#x90E8;&#x5206;&#x66F4;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x3002;</p>
<h4 id="&#x5355;&#x5BF9;&#x8C61;&#x5199;&#x5165;">&#x5355;&#x5BF9;&#x8C61;&#x5199;&#x5165;</h4>
<p>&#x5F53;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x65F6;&#xFF0C;&#x539F;&#x5B50;&#x6027;&#x548C;&#x9694;&#x79BB;&#x4E5F;&#x662F;&#x9002;&#x7528;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x6B63;&#x5728;&#x5411;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x4E00;&#x4E2A; 20 KB&#x7684; JSON&#x6587;&#x6863;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x5728;&#x53D1;&#x9001;&#x7B2C;&#x4E00;&#x4E2A;10 KB&#x4E4B;&#x540E;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x4E2D;&#x65AD;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x662F;&#x5426;&#x5B58;&#x50A8;&#x4E86;&#x4E0D;&#x53EF;&#x89E3;&#x6790;&#x7684;10KB JSON&#x7247;&#x6BB5;&#xFF1F;</li>
<li>&#x5982;&#x679C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x6B63;&#x5728;&#x8986;&#x76D6;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x524D;&#x4E00;&#x4E2A;&#x503C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x7535;&#x6E90;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x662F;&#x5426;&#x6700;&#x7EC8;&#x5C06;&#x65B0;&#x65E7;&#x503C;&#x62FC;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF1F;</li>
<li>&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x5199;&#x5165;&#x8FC7;&#x7A0B;&#x4E2D;&#x8BFB;&#x53D6;&#x8BE5;&#x6587;&#x6863;&#xFF0C;&#x662F;&#x5426;&#x4F1A;&#x770B;&#x5230;&#x90E8;&#x5206;&#x66F4;&#x65B0;&#x7684;&#x503C;&#xFF1F;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x975E;&#x5E38;&#x8BA9;&#x4EBA;&#x5934;&#x5927;&#xFF0C;&#x6545;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x4E00;&#x4E2A;&#x51E0;&#x4E4E;&#x666E;&#x904D;&#x7684;&#x76EE;&#x6807;&#x662F;&#xFF1A;&#x5BF9;&#x5355;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#xFF08;&#x4F8B;&#x5982;&#x952E;&#x503C;&#x5BF9;&#xFF09;&#x4E0A;&#x63D0;&#x4F9B;&#x539F;&#x5B50;&#x6027;&#x548C;&#x9694;&#x79BB;&#x6027;&#x3002;&#x539F;&#x5B50;&#x6027;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x65E5;&#x5FD7;&#x6765;&#x5B9E;&#x73B0;&#x5D29;&#x6E83;&#x6062;&#x590D;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="">&#x4F7F;B&#x6811;&#x53EF;&#x9760;</a>&#x201D;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x9501;&#x6765;&#x5B9E;&#x73B0;&#x9694;&#x79BB;&#xFF08;&#x6BCF;&#x6B21;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#x5BF9;&#x8C61;&#xFF09; &#xFF09;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x4E5F;&#x63D0;&#x4F9B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x81EA;&#x589E;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x50CF; <a href="img/fig7-1.png">&#x56FE;7-1</a> &#x90A3;&#x6837;&#x7684;&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;&#x4E86;&#x3002;&#x540C;&#x6837;&#x6D41;&#x884C;&#x7684;&#x662F; <strong><a href="#&#x6BD4;&#x8F83;&#x5E76;&#x8BBE;&#x7F6E;&#xFF08;CAS&#xFF09;">&#x6BD4;&#x8F83;&#x548C;&#x8BBE;&#x7F6E;&#xFF08;CAS, compare-and-set&#xFF09;</a></strong> &#x64CD;&#x4F5C;&#xFF0C;&#x5F53;&#x503C;&#x6CA1;&#x6709;&#x88AB;&#x5176;&#x4ED6;&#x5E76;&#x53D1;&#x4FEE;&#x6539;&#x8FC7;&#x65F6;&#xFF0C;&#x624D;&#x5141;&#x8BB8;&#x6267;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x5355;&#x5BF9;&#x8C61;&#x64CD;&#x4F5C;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x5728;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5C1D;&#x8BD5;&#x540C;&#x65F6;&#x5199;&#x5165;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x65F6;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;">&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;</a>&#x201D;&#xFF09;&#x3002;&#x4F46;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x901A;&#x5E38;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x4E8B;&#x52A1;&#x3002;CAS&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x5355;&#x4E00;&#x5BF9;&#x8C61;&#x64CD;&#x4F5C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x8F7B;&#x91CF;&#x7EA7;&#x4E8B;&#x52A1;&#x201D;&#xFF0C;&#x751A;&#x81F3;&#x51FA;&#x4E8E;&#x8425;&#x9500;&#x76EE;&#x7684;&#x88AB;&#x79F0;&#x4E3A;&#x201C;ACID&#x201D;&#x3010;20,21,22&#x3011;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x662F;&#x8BEF;&#x5BFC;&#x6027;&#x7684;&#x3002;&#x4E8B;&#x52A1;&#x901A;&#x5E38;&#x88AB;&#x7406;&#x89E3;&#x4E3A;&#xFF0C;<strong>&#x5C06;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x591A;&#x4E2A;&#x64CD;&#x4F5C;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x5355;&#x5143;&#x7684;&#x673A;&#x5236;</strong>&#x3002;<sup><a href="#fn_iv" id="reffn_iv">iv</a></sup></p>
<blockquote id="fn_iv">
<sup>iv</sup>. &#x4E25;&#x683C;&#x5730;&#x8BF4;&#xFF0C;<strong>&#x539F;&#x5B50;&#x81EA;&#x589E;&#xFF08;atomic increment&#xFF09;</strong> &#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x7684;&#x610F;&#x4E49;&#x4E0A;&#x4F7F;&#x7528;&#x4E86;&#x539F;&#x5B50;&#x8FD9;&#x4E2A;&#x8BCD;&#x3002; &#x5728;ACID&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x5E94;&#x8BE5;&#x88AB;&#x79F0;&#x4E3A; <strong>&#x5B64;&#x7ACB;&#xFF08;isolated&#xFF09;</strong> &#x7684;&#x6216;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;serializable&#xFF09;</strong> &#x7684;&#x589E;&#x91CF;&#x3002; &#x4F46;&#x8FD9;&#x5C31;&#x592A;&#x5439;&#x6BDB;&#x6C42;&#x75B5;&#x4E86;&#x3002;<a href="#reffn_iv" title="Jump back to footnote [iv] in the text."> &#x21A9;</a>
</blockquote>
<h4 id="&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#x7684;&#x9700;&#x6C42;">&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#x7684;&#x9700;&#x6C42;</h4>
<p>&#x8BB8;&#x591A;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5DF2;&#x7ECF;&#x653E;&#x5F03;&#x4E86;&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#xFF0C;&#x56E0;&#x4E3A;&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#x5F88;&#x96BE;&#x8DE8;&#x5206;&#x533A;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x9700;&#x8981;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x6216;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x788D;&#x4E8B;&#x3002;&#x4F46;&#x8BF4;&#x5230;&#x5E95;&#xFF0C;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B9E;&#x73B0;&#x4E8B;&#x52A1;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x6839;&#x672C;&#x6027;&#x7684;&#x969C;&#x788D;&#x3002;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a> &#x5C06;&#x8BA8;&#x8BBA;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x9700;&#x8981;&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#xFF1F;<strong>&#x662F;&#x5426;&#x6709;&#x53EF;&#x80FD;&#x53EA;&#x7528;&#x952E;&#x503C;&#x6570;&#x636E;&#x6A21;&#x578B;&#x548C;&#x5355;&#x5BF9;&#x8C61;&#x64CD;&#x4F5C;&#x6765;&#x5B9E;&#x73B0;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF1F;</strong></p>
<p>&#x6709;&#x4E00;&#x4E9B;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x5355;&#x5BF9;&#x8C61;&#x63D2;&#x5165;&#xFF0C;&#x66F4;&#x65B0;&#x548C;&#x5220;&#x9664;&#x662F;&#x8DB3;&#x591F;&#x7684;&#x3002;&#x4F46;&#x662F;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x573A;&#x666F;&#x9700;&#x8981;&#x534F;&#x8C03;&#x5199;&#x5165;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x8868;&#x4E2D;&#x7684;&#x884C;&#x901A;&#x5E38;&#x5177;&#x6709;&#x5BF9;&#x53E6;&#x4E00;&#x4E2A;&#x8868;&#x4E2D;&#x7684;&#x884C;&#x7684;&#x5916;&#x952E;&#x5F15;&#x7528;&#x3002;&#xFF08;&#x7C7B;&#x4F3C;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x56FE;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x6709;&#x7740;&#x5230;&#x5176;&#x4ED6;&#x9876;&#x70B9;&#x7684;&#x8FB9;&#xFF09;&#x3002;&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#x4F7F;&#x4F60;&#x786E;&#x4FE1;&#x8FD9;&#x4E9B;&#x5F15;&#x7528;&#x59CB;&#x7EC8;&#x6709;&#x6548;&#xFF1A;&#x5F53;&#x63D2;&#x5165;&#x51E0;&#x4E2A;&#x76F8;&#x4E92;&#x5F15;&#x7528;&#x7684;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x5916;&#x952E;&#x5FC5;&#x987B;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x6700;&#x65B0;&#x7684;&#xFF0C;&#x4E0D;&#x7136;&#x6570;&#x636E;&#x5C31;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x3002;</li>
<li>&#x5728;&#x6587;&#x6863;&#x6570;&#x636E;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x8D77;&#x66F4;&#x65B0;&#x7684;&#x5B57;&#x6BB5;&#x901A;&#x5E38;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x4E2D;&#xFF0C;&#x8FD9;&#x88AB;&#x89C6;&#x4E3A;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x2014;&#x2014;&#x66F4;&#x65B0;&#x5355;&#x4E2A;&#x6587;&#x6863;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7F3A;&#x4E4F;&#x8FDE;&#x63A5;&#x529F;&#x80FD;&#x7684;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x4F1A;&#x9F13;&#x52B1;&#x975E;&#x89C4;&#x8303;&#x5316;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch2.html#&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x5728;&#x4ECA;&#x65E5;&#x7684;&#x5BF9;&#x6BD4;">&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E0E;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x5728;&#x4ECA;&#x65E5;&#x7684;&#x5BF9;&#x6BD4;</a>&#x201D;&#xFF09;&#x3002;&#x5F53;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x975E;&#x89C4;&#x8303;&#x5316;&#x7684;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x5982; <a href="img/fig7-2.png">&#x56FE;7-2</a> &#x6240;&#x793A;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x6B21;&#x66F4;&#x65B0;&#x591A;&#x4E2A;&#x6587;&#x6863;&#x3002;&#x4E8B;&#x52A1;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x975E;&#x89C4;&#x8303;&#x5316;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x540C;&#x6B65;&#x3002;</li>
<li>&#x5728;&#x5177;&#x6709;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF08;&#x9664;&#x4E86;&#x7EAF;&#x7CB9;&#x7684;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x4EE5;&#x5916;&#x51E0;&#x4E4E;&#x90FD;&#x6709;&#xFF09;&#xFF0C;&#x6BCF;&#x6B21;&#x66F4;&#x6539;&#x503C;&#x65F6;&#x90FD;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x7D22;&#x5F15;&#x3002;&#x4ECE;&#x4E8B;&#x52A1;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x4E9B;&#x7D22;&#x5F15;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5BF9;&#x8C61;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x6027;&#xFF0C;&#x8BB0;&#x5F55;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x5728;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E2D;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x7D22;&#x5F15;&#x7684;&#x66F4;&#x65B0;&#x8FD8;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x73B0;&#x3002;&#x7136;&#x800C;&#xFF0C;<strong>&#x6CA1;&#x6709;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x5C31;&#x8981;&#x590D;&#x6742;&#x5F97;&#x591A;&#xFF0C;&#x7F3A;&#x4E4F;&#x9694;&#x79BB;&#x6027;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x5E76;&#x53D1;&#x95EE;&#x9898;</strong>&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="#&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;">&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x5728;<a href="">&#x7B2C;12&#x7AE0;</a>&#x4E2D;&#x63A2;&#x8BA8;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x3002;</p>
<h4 id="&#x5904;&#x7406;&#x9519;&#x8BEF;&#x548C;&#x4E2D;&#x6B62;">&#x5904;&#x7406;&#x9519;&#x8BEF;&#x548C;&#x4E2D;&#x6B62;</h4>
<p>&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7279;&#x6027;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4E2D;&#x6B62;&#x5E76;&#x5B89;&#x5168;&#x5730;&#x91CD;&#x8BD5;&#x3002; ACID&#x6570;&#x636E;&#x5E93;&#x57FA;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x54F2;&#x5B66;&#xFF1A;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x6709;&#x8FDD;&#x53CD;&#x5176;&#x539F;&#x5B50;&#x6027;&#xFF0C;&#x9694;&#x79BB;&#x6027;&#x6216;&#x6301;&#x4E45;&#x6027;&#x7684;&#x5371;&#x9669;&#xFF0C;&#x5219;&#x5B81;&#x613F;&#x5B8C;&#x5168;&#x653E;&#x5F03;&#x4E8B;&#x52A1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7559;&#x4E0B;&#x534A;&#x6210;&#x54C1;&#x3002;</p>
<p>&#x7136;&#x800C;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x7CFB;&#x7EDF;&#x90FD;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x54F2;&#x5B66;&#x3002;&#x7279;&#x522B;&#x662F;&#x5177;&#x6709;<a href="ch6.html#&#x65E0;&#x4E3B;&#x590D;&#x5236;">&#x65E0;&#x4E3B;&#x590D;&#x5236;</a>&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x201C;&#x5C3D;&#x529B;&#x800C;&#x4E3A;&#x201D;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x5DE5;&#x4F5C;&#x3002;&#x53EF;&#x4EE5;&#x6982;&#x62EC;&#x4E3A;&#x201C;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x505A;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x7684;&#x4E8B;&#xFF0C;&#x8FD0;&#x884C;&#x9047;&#x5230;&#x9519;&#x8BEF;&#x65F6;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x64A4;&#x6D88;&#x5B83;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x7684;&#x4E8B;&#x60C5;&#x201C; &#x2014;&#x2014;&#x6240;&#x4EE5;&#xFF0C;&#x4ECE;&#x9519;&#x8BEF;&#x4E2D;&#x6062;&#x590D;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8D23;&#x4EFB;&#x3002;</p>
<p>&#x9519;&#x8BEF;&#x53D1;&#x751F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#xFF0C;&#x4F46;&#x8BB8;&#x591A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x503E;&#x5411;&#x4E8E;&#x53EA;&#x8003;&#x8651;&#x4E50;&#x89C2;&#x60C5;&#x51B5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x50CF;Rails&#x7684;ActiveRecord&#x548C;Django&#x8FD9;&#x6837;&#x7684;<strong>&#x5BF9;&#x8C61;&#x5173;&#x7CFB;&#x6620;&#x5C04;&#xFF08;ORM, object-relation Mapping&#xFF09;</strong> &#x6846;&#x67B6;&#x4E0D;&#x4F1A;&#x91CD;&#x8BD5;&#x4E2D;&#x65AD;&#x7684;&#x4E8B;&#x52A1;&#x2014;&#x2014; &#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x901A;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E2A;&#x4ECE;&#x5806;&#x6808;&#x5411;&#x4E0A;&#x4F20;&#x64AD;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x6240;&#x4EE5;&#x4EFB;&#x4F55;&#x7528;&#x6237;&#x8F93;&#x5165;&#x90FD;&#x4F1A;&#x88AB;&#x4E22;&#x5F03;&#xFF0C;&#x7528;&#x6237;&#x62FF;&#x5230;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x803B;&#x8FB1;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x4E2D;&#x6B62;&#x7684;&#x91CD;&#x70B9;&#x5C31;&#x662F;&#x5141;&#x8BB8;&#x5B89;&#x5168;&#x7684;&#x91CD;&#x8BD5;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x91CD;&#x8BD5;&#x4E00;&#x4E2A;&#x4E2D;&#x6B62;&#x7684;&#x4E8B;&#x52A1;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x800C;&#x6709;&#x6548;&#x7684;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x673A;&#x5236;&#xFF0C;&#x4F46;&#x5B83;&#x5E76;&#x4E0D;&#x5B8C;&#x7F8E;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x5B9E;&#x9645;&#x4E0A;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x670D;&#x52A1;&#x5668;&#x8BD5;&#x56FE;&#x5411;&#x5BA2;&#x6237;&#x7AEF;&#x786E;&#x8BA4;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#x65F6;&#x7F51;&#x7EDC;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF08;&#x6240;&#x4EE5;&#x5BA2;&#x6237;&#x7AEF;&#x8BA4;&#x4E3A;&#x63D0;&#x4EA4;&#x5931;&#x8D25;&#x4E86;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x91CD;&#x8BD5;&#x4E8B;&#x52A1;&#x4F1A;&#x5BFC;&#x81F4;&#x4E8B;&#x52A1;&#x88AB;&#x6267;&#x884C;&#x4E24;&#x6B21;&#x2014;&#x2014;&#x9664;&#x975E;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x5E94;&#x7528;&#x7EA7;&#x9664;&#x91CD;&#x673A;&#x5236;&#x3002;</li>
<li>&#x5982;&#x679C;&#x9519;&#x8BEF;&#x662F;&#x7531;&#x4E8E;&#x8D1F;&#x8F7D;&#x8FC7;&#x5927;&#x9020;&#x6210;&#x7684;&#xFF0C;&#x5219;&#x91CD;&#x8BD5;&#x4E8B;&#x52A1;&#x5C06;&#x4F7F;&#x95EE;&#x9898;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x597D;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x6B63;&#x53CD;&#x9988;&#x5FAA;&#x73AF;&#xFF0C;&#x53EF;&#x4EE5;&#x9650;&#x5236;&#x91CD;&#x8BD5;&#x6B21;&#x6570;&#xFF0C;&#x4F7F;&#x7528;&#x6307;&#x6570;&#x9000;&#x907F;&#x7B97;&#x6CD5;&#xFF0C;&#x5E76;&#x5355;&#x72EC;&#x5904;&#x7406;&#x4E0E;&#x8FC7;&#x8F7D;&#x76F8;&#x5173;&#x7684;&#x9519;&#x8BEF;&#xFF08;&#x5982;&#x679C;&#x5141;&#x8BB8;&#xFF09;&#x3002;</li>
<li>&#x4EC5;&#x5728;&#x4E34;&#x65F6;&#x6027;&#x9519;&#x8BEF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x4E8E;&#x6B7B;&#x9501;&#xFF0C;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x4E34;&#x65F6;&#x6027;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x548C;&#x6545;&#x969C;&#x5207;&#x6362;&#xFF09;&#x540E;&#x624D;&#x503C;&#x5F97;&#x91CD;&#x8BD5;&#x3002;&#x5728;&#x53D1;&#x751F;&#x6C38;&#x4E45;&#x6027;&#x9519;&#x8BEF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8FDD;&#x53CD;&#x7EA6;&#x675F;&#xFF09;&#x4E4B;&#x540E;&#x91CD;&#x8BD5;&#x662F;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x5916;&#x4E5F;&#x6709;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x5373;&#x4F7F;&#x4E8B;&#x52A1;&#x88AB;&#x4E2D;&#x6B62;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x8FD9;&#x4E9B;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x90A3;&#x4F60;&#x80AF;&#x5B9A;&#x4E0D;&#x5E0C;&#x671B;&#x6BCF;&#x6B21;&#x91CD;&#x8BD5;&#x4E8B;&#x52A1;&#x65F6;&#x90FD;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x786E;&#x4FDD;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x7EDF;&#x4E00;&#x8D77;&#x63D0;&#x4EA4;&#x6216;&#x653E;&#x5F03;&#xFF0C;<strong>&#x4E8C;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#xFF08;2PC, two-phase commit&#xFF09;</strong> &#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#xFF08;&#x201C;<a href="ch9.html#&#x539F;&#x5B50;&#x63D0;&#x4EA4;&#x4E0E;&#x4E8C;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#xFF08;2PC&#xFF09;">&#x539F;&#x5B50;&#x63D0;&#x4EA4;&#x548C;&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#xFF08;2PC&#xFF09;</a>&#x201D;&#x4E2D;&#x5C06;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF09;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x7A0B;&#x5728;&#x91CD;&#x8BD5;&#x4E2D;&#x5931;&#x6548;&#xFF0C;&#x4EFB;&#x4F55;&#x8BD5;&#x56FE;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6570;&#x636E;&#x90FD;&#x5C06;&#x4E22;&#x5931;&#x3002;                                                                                                                                                          </li>
</ul>
<h2 id="&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;">&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;</h2>
<p>&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x4E0D;&#x89E6;&#x53CA;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;<strong>&#x5E76;&#x884C;&#xFF08;parallel&#xFF09;</strong> &#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x4E24;&#x8005;&#x90FD;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x7531;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x4FEE;&#x6539;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x5F53;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x8BD5;&#x56FE;&#x540C;&#x65F6;&#x4FEE;&#x6539;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF08;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF09;&#x624D;&#x4F1A;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x5E76;&#x53D1;BUG&#x5F88;&#x96BE;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x627E;&#x5230;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x53EA;&#x6709;&#x5728;&#x7279;&#x6B8A;&#x65F6;&#x673A;&#x4E0B;&#x624D;&#x4F1A;&#x89E6;&#x53D1;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x65F6;&#x673A;&#x53EF;&#x80FD;&#x5F88;&#x5C11;&#xFF0C;&#x901A;&#x5E38;&#x5F88;&#x96BE;&#x91CD;&#x73B0;<sup><a href="#fn_&#x8BD1;&#x6CE8;i" id="reffn_&#x8BD1;&#x6CE8;i">&#x8BD1;&#x6CE8;i</a></sup>&#x3002;&#x5E76;&#x53D1;&#x6027;&#x4E5F;&#x5F88;&#x96BE;&#x63A8;&#x7406;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x5927;&#x578B;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4F60;&#x4E0D;&#x4E00;&#x5B9A;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x6B63;&#x5728;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5728;&#x4E00;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x5DF2;&#x7ECF;&#x5F88;&#x9EBB;&#x70E6;&#x4E86;&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x4F7F;&#x5F97;&#x5B83;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x90FD;&#x53EF;&#x80FD;&#x968F;&#x65F6;&#x6539;&#x53D8;&#x3002;</p>
<blockquote id="fn_&#x8BD1;&#x6CE8;i">
<sup>&#x8BD1;&#x6CE8;i</sup>. &#x8F76;&#x4E8B;&#xFF1A;&#x5076;&#x7136;&#x51FA;&#x73B0;&#x7684;&#x77AC;&#x65F6;&#x9519;&#x8BEF;&#x6709;&#x65F6;&#x79F0;&#x4E3A;<strong><em>Heisenbug</em></strong>&#xFF0C;&#x800C;&#x786E;&#x5B9A;&#x6027;&#x7684;&#x95EE;&#x9898;&#x5BF9;&#x5E94;&#x5730;&#x79F0;&#x4E3A;<strong><em>Bohrbugs</em></strong><a href="#reffn_&#x8BD1;&#x6CE8;i" title="Jump back to footnote [&#x8BD1;&#x6CE8;i] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E00;&#x76F4;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;<strong>&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#xFF08;transaction isolation&#xFF09;</strong> &#x6765;&#x9690;&#x85CF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x8005;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x3002;&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x8BB2;&#xFF0C;&#x9694;&#x79BB;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5047;&#x88C5;&#x6CA1;&#x6709;&#x5E76;&#x53D1;&#x53D1;&#x751F;&#xFF0C;&#x8BA9;&#x4F60;&#x7684;&#x751F;&#x6D3B;&#x66F4;&#x52A0;&#x8F7B;&#x677E;&#xFF1A;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;serializable&#xFF09;</strong> &#x7684;&#x9694;&#x79BB;&#x7B49;&#x7EA7;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x5E93;&#x4FDD;&#x8BC1;&#x4E8B;&#x52A1;&#x7684;&#x6548;&#x679C;&#x5982;&#x540C;&#x8FDE;&#x7EED;&#x8FD0;&#x884C;&#xFF08;&#x5373;&#x4E00;&#x6B21;&#x4E00;&#x4E2A;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5E76;&#x53D1;&#xFF09;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF1A;&#x9694;&#x79BB;&#x5E76;&#x6CA1;&#x6709;&#x90A3;&#x4E48;&#x7B80;&#x5355;&#x3002;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;</strong> &#x4F1A;&#x6709;&#x6027;&#x80FD;&#x635F;&#x5931;&#xFF0C;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x613F;&#x610F;&#x652F;&#x4ED8;&#x8FD9;&#x4E2A;&#x4EE3;&#x4EF7;&#x3010;8&#x3011;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x8F83;&#x5F31;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x6765;&#x9632;&#x6B62;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E9B;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x5BFC;&#x81F4;&#x5FAE;&#x5999;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x4ECD;&#x7136;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x88AB;&#x4F7F;&#x7528;&#x3010;23&#x3011;&#x3002;</p>
<p>&#x5F31;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x5BFC;&#x81F4;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x9519;&#x8BEF;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x8BBA;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x4EEC;&#x9020;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x8D44;&#x91D1;&#x635F;&#x5931;&#x3010;24,25&#x3011;&#xFF0C;&#x8017;&#x8D39;&#x4E86;&#x8D22;&#x52A1;&#x5BA1;&#x8BA1;&#x4EBA;&#x5458;&#x7684;&#x8C03;&#x67E5;&#x3010;26&#x3011;&#xFF0C;&#x5E76;&#x5BFC;&#x81F4;&#x5BA2;&#x6237;&#x6570;&#x636E;&#x88AB;&#x7834;&#x574F;&#x3010;27&#x3011;&#x3002;&#x5173;&#x4E8E;&#x8FD9;&#x7C7B;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x8BC4;&#x8BBA;&#x662F;&#x201C;&#x5982;&#x679C;&#x4F60;&#x6B63;&#x5728;&#x5904;&#x7406;&#x8D22;&#x52A1;&#x6570;&#x636E;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;ACID&#x6570;&#x636E;&#x5E93;&#xFF01;&#x201D; &#x2014;&#x2014; &#x4F46;&#x662F;&#x8FD9;&#x4E00;&#x70B9;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x3002;&#x5373;&#x4F7F;&#x662F;&#x5F88;&#x591A;&#x6D41;&#x884C;&#x7684;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF08;&#x901A;&#x5E38;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x201C;ACID&#x201D;&#xFF09;&#x4E5F;&#x4F7F;&#x7528;&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x9632;&#x6B62;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x6BD4;&#x8D77;&#x76F2;&#x76EE;&#x5730;&#x4F9D;&#x8D56;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5BF9;&#x5B58;&#x5728;&#x7684;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x7684;&#x79CD;&#x7C7B;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x9632;&#x6B62;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x6709;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#x3002;&#x7136;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x6240;&#x638C;&#x63E1;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x6784;&#x5EFA;&#x53EF;&#x9760;&#x548C;&#x6B63;&#x786E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x51E0;&#x4E2A;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x5F31;&#xFF08;<strong>&#x4E0D;&#x53EF;&#x4E32;&#x884C;&#x5316;&#xFF08;nonserializable&#xFF09;</strong>&#xFF09;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x5E76;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x54EA;&#x79CD;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x53D1;&#x751F;&#xFF0C;&#x4EE5;&#x4FBF;&#x60A8;&#x53EF;&#x4EE5;&#x51B3;&#x5B9A;&#x4EC0;&#x4E48;&#x7EA7;&#x522B;&#x9002;&#x5408;&#x60A8;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x53EF;&#x4E32;&#x884C;&#x6027;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="#&#x53EF;&#x5E8F;&#x5217;&#x5316;">&#x53EF;&#x5E8F;&#x5217;&#x5316;</a>&#x201D;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x5C06;&#x662F;&#x975E;&#x6B63;&#x5F0F;&#x7684;&#xFF0C;&#x4F7F;&#x7528;&#x793A;&#x4F8B;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x4E25;&#x683C;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x5206;&#x6790;&#x5B83;&#x4EEC;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5B66;&#x672F;&#x6587;&#x732E;&#x4E2D;&#x627E;&#x5230;&#x5B83;&#x4EEC;[28,29,30]&#x3002;</p>
<h3 id="&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;">&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</h3>
<p>&#x6700;&#x57FA;&#x672C;&#x7684;&#x4E8B;&#x52A1;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#xFF08;Read Committed&#xFF09;</strong><sup><a href="#fn_v" id="reffn_v">v</a></sup>&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x4E2A;&#x4FDD;&#x8BC1;&#xFF1A;</p>
<ol>
<li>&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x65F6;&#xFF0C;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x5DF2;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#xFF08;&#x6CA1;&#x6709;<strong>&#x810F;&#x8BFB;&#xFF08;dirty reads&#xFF09;</strong>&#xFF09;&#x3002;</li>
<li>&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x53EA;&#x4F1A;&#x8986;&#x76D6;&#x5DF2;&#x7ECF;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF08;&#x6CA1;&#x6709;<strong>&#x810F;&#x5199;&#xFF08;dirty writes&#xFF09;</strong>&#xFF09;&#x3002;</li>
</ol>
<p>&#x6211;&#x4EEC;&#x6765;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E24;&#x4E2A;&#x4FDD;&#x8BC1;&#x3002;</p>
<blockquote id="fn_v">
<sup>v</sup>. &#x67D0;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x652F;&#x6301;&#x751A;&#x81F3;&#x66F4;&#x5F31;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x8BFB;&#x672A;&#x63D0;&#x4EA4;&#xFF08;Read uncommitted&#xFF09;</strong>&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x810F;&#x5199;&#xFF0C;&#x4F46;&#x4E0D;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#x3002;<a href="#reffn_v" title="Jump back to footnote [v] in the text."> &#x21A9;</a>
</blockquote>
<h4 id="&#x6CA1;&#x6709;&#x810F;&#x8BFB;">&#x6CA1;&#x6709;&#x810F;&#x8BFB;</h4>
<p>&#x8BBE;&#x60F3;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x5C06;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F46;&#x4E8B;&#x52A1;&#x8FD8;&#x6CA1;&#x6709;&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x6570;&#x636E;&#x5417;&#xFF1F;&#x5982;&#x679C;&#x662F;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x5C31;&#x53EB;&#x505A;<strong>&#x810F;&#x8BFB;&#xFF08;dirty reads&#xFF09;</strong>&#x3010;2&#x3011;&#x3002;</p>
<p>&#x5728;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x8FD0;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E8B;&#x52A1;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x53EA;&#x6709;&#x5728;&#x8BE5;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x65F6;&#x624D;&#x80FD;&#x88AB;&#x5176;&#x4ED6;&#x4EBA;&#x770B;&#x5230;&#xFF08;&#x7136;&#x540E;&#x6240;&#x6709;&#x7684;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x90FD;&#x4F1A;&#x7ACB;&#x5373;&#x53D8;&#x5F97;&#x53EF;&#x89C1;&#xFF09;&#x3002;&#x5982;<a href="">&#x56FE;7-4</a>&#x6240;&#x793A;&#xFF0C;&#x7528;&#x6237;1 &#x8BBE;&#x7F6E;&#x4E86;<code>x = 3</code>&#xFF0C;&#x4F46;&#x7528;&#x6237;2 &#x7684; <code>get x</code>&#x4ECD;&#x65E7;&#x8FD4;&#x56DE;&#x65E7;&#x503C;2 &#xFF0C;&#x800C;&#x7528;&#x6237;1 &#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x3002;</p>
<p><img src="img/fig7-4.png" alt=""></p>
<p><strong>&#x56FE;7-4 &#x6CA1;&#x6709;&#x810F;&#x8BFB;&#xFF1A;&#x7528;&#x6237;2&#x53EA;&#x6709;&#x5728;&#x7528;&#x6237;1&#x7684;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x540E;&#x624D;&#x80FD;&#x770B;&#x5230;x&#x7684;&#x65B0;&#x503C;&#x3002;</strong></p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#xFF0C;&#x6709;&#x51E0;&#x4E2A;&#x539F;&#x56E0;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x810F;&#x8BFB;&#x53D6;&#x610F;&#x5473;&#x7740;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x4F1A;&#x53EA;&#x770B;&#x5230;&#x4E00;&#x90E8;&#x5206;&#x66F4;&#x65B0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;<a href="img/fig7-2.png">&#x56FE;7-2</a>&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x770B;&#x5230;&#x65B0;&#x7684;&#x672A;&#x8BFB;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x4F46;&#x770B;&#x4E0D;&#x5230;&#x66F4;&#x65B0;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x7684;&#x810F;&#x8BFB;&#x3002;&#x770B;&#x5230;&#x5904;&#x4E8E;&#x90E8;&#x5206;&#x66F4;&#x65B0;&#x72B6;&#x6001;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4F1A;&#x8BA9;&#x7528;&#x6237;&#x611F;&#x5230;&#x56F0;&#x60D1;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x505A;&#x51FA;&#x9519;&#x8BEF;&#x7684;&#x51B3;&#x5B9A;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x4E2D;&#x6B62;&#xFF0C;&#x5219;&#x6240;&#x6709;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x90FD;&#x9700;&#x8981;&#x56DE;&#x6EDA;&#xFF08;&#x5982;<a href="img/fig7-3.png">&#x56FE;7-3</a>&#x6240;&#x793A;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x5141;&#x8BB8;&#x810F;&#x8BFB;&#xFF0C;&#x90A3;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x7A0D;&#x540E;&#x9700;&#x8981;&#x56DE;&#x6EDA;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5373;&#x4ECE;&#x672A;&#x5B9E;&#x9645;&#x63D0;&#x4EA4;&#x7ED9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x6570;&#x636E;&#x3002;&#x60F3;&#x60F3;&#x540E;&#x679C;&#x5C31;&#x8BA9;&#x4EBA;&#x5934;&#x5927;&#x3002;</li>
</ul>
<h4 id="&#x6CA1;&#x6709;&#x810F;&#x5199;">&#x6CA1;&#x6709;&#x810F;&#x5199;</h4>
<p>&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x5C1D;&#x8BD5;&#x66F4;&#x65B0;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x76F8;&#x540C;&#x5BF9;&#x8C61;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF1F;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x5199;&#x5165;&#x7684;&#x987A;&#x5E8F;&#x662F;&#x600E;&#x6837;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x8BA4;&#x4E3A;&#x540E;&#x9762;&#x7684;&#x5199;&#x5165;&#x4F1A;&#x8986;&#x76D6;&#x524D;&#x9762;&#x7684;&#x5199;&#x5165;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5148;&#x524D;&#x7684;&#x5199;&#x5165;&#x662F;&#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x53C8;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x5199;&#x5165;&#x4F1A;&#x8986;&#x76D6;&#x4E00;&#x4E2A;&#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x503C;&#xFF1F;&#x8FD9;&#x88AB;&#x79F0;&#x4F5C;<strong>&#x810F;&#x5199;&#xFF08;dirty write&#xFF09;</strong>&#x3010;28&#x3011;&#x3002;&#x5728;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x9632;&#x6B62;&#x810F;&#x5199;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5EF6;&#x8FDF;&#x7B2C;&#x4E8C;&#x6B21;&#x5199;&#x5165;&#xFF0C;&#x76F4;&#x5230;&#x7B2C;&#x4E00;&#x6B21;&#x5199;&#x5165;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#x4E3A;&#x6B62;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x9632;&#x6B62;&#x810F;&#x5199;&#xFF0C;&#x8FD9;&#x4E2A;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x907F;&#x514D;&#x4E86;&#x4E00;&#x4E9B;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x810F;&#x5199;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651; <a href="img/fig7-5.png">&#x56FE;7-5</a>&#xFF0C;<a href="img/fig7-5.png">&#x56FE;7-5</a> &#x4EE5;&#x4E00;&#x4E2A;&#x4E8C;&#x624B;&#x8F66;&#x9500;&#x552E;&#x7F51;&#x7AD9;&#x4E3A;&#x4F8B;&#xFF0C;Alice&#x548C;Bob&#x4E24;&#x4E2A;&#x4EBA;&#x540C;&#x65F6;&#x8BD5;&#x56FE;&#x8D2D;&#x4E70;&#x540C;&#x4E00;&#x8F86;&#x8F66;&#x3002;&#x8D2D;&#x4E70;&#x6C7D;&#x8F66;&#x9700;&#x8981;&#x4E24;&#x6B21;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#xFF1A;&#x7F51;&#x7AD9;&#x4E0A;&#x7684;&#x5546;&#x54C1;&#x5217;&#x8868;&#x9700;&#x8981;&#x66F4;&#x65B0;&#xFF0C;&#x4EE5;&#x53CD;&#x6620;&#x4E70;&#x5BB6;&#x7684;&#x8D2D;&#x4E70;&#xFF0C;&#x9500;&#x552E;&#x53D1;&#x7968;&#x9700;&#x8981;&#x53D1;&#x9001;&#x7ED9;&#x4E70;&#x5BB6;&#x3002;&#x5728;<a href="img/fig7-5.png">&#x56FE;7-5</a>&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9500;&#x552E;&#x662F;&#x5C5E;&#x4E8E;Bob&#x7684;&#xFF08;&#x56E0;&#x4E3A;&#x4ED6;&#x6210;&#x529F;&#x66F4;&#x65B0;&#x4E86;&#x5546;&#x54C1;&#x5217;&#x8868;&#xFF09;&#xFF0C;&#x4F46;&#x53D1;&#x7968;&#x5374;&#x5BC4;&#x9001;&#x7ED9;&#x4E86;&#x7231;&#x4E3D;&#x4E1D;&#xFF08;&#x56E0;&#x4E3A;&#x5979;&#x6210;&#x529F;&#x66F4;&#x65B0;&#x4E86;&#x53D1;&#x7968;&#x8868;&#xFF09;&#x3002;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x4F1A;&#x963B;&#x6B62;&#x8FD9;&#x6837;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x6545;&#x3002;</li>
<li>&#x4F46;&#x662F;&#xFF0C;&#x63D0;&#x4EA4;&#x8BFB;&#x53D6;&#x5E76;&#x4E0D;&#x80FD;&#x9632;&#x6B62;<a href="">&#x56FE;7-1</a>&#x4E2D;&#x4E24;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x589E;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x7ADE;&#x4E89;&#x72B6;&#x6001;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x5199;&#x5165;&#x53D1;&#x751F;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x540E;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x810F;&#x5199;&#x3002;&#x8FD9;&#x4ECD;&#x7136;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x51FA;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5728;&#x201C;<a href="#&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;">&#x9632;&#x6B62;&#x66F4;&#x65B0;&#x4E22;&#x5931;</a>&#x201D;&#x4E2D;&#x5C06;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x4F7F;&#x8FD9;&#x79CD;&#x8BA1;&#x6570;&#x5668;&#x589E;&#x91CF;&#x5B89;&#x5168;&#x3002;</li>
</ul>
<p><img src="img/fig7-5.png" alt=""></p>
<p><strong>&#x56FE;7-5 &#x5982;&#x679C;&#x5B58;&#x5728;&#x810F;&#x5199;&#xFF0C;&#x6765;&#x81EA;&#x4E0D;&#x540C;&#x4E8B;&#x52A1;&#x7684;&#x51B2;&#x7A81;&#x5199;&#x5165;&#x53EF;&#x80FD;&#x4F1A;&#x6DF7;&#x6DC6;&#x5728;&#x4E00;&#x8D77;</strong></p>
<h4 id="&#x5B9E;&#x73B0;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;">&#x5B9E;&#x73B0;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</h4>
<p><strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6D41;&#x884C;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;&#x8FD9;&#x662F;Oracle 11g&#xFF0C;PostgreSQL&#xFF0C;SQL Server 2012&#xFF0C;MemSQL&#x548C;&#x5176;&#x4ED6;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x3010;8&#x3011;&#x3002;</p>
<p>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x901A;&#x8FC7;&#x4F7F;&#x7528;<strong>&#x884C;&#x9501;&#xFF08;row-level lock&#xFF09;</strong> &#x6765;&#x9632;&#x6B62;&#x810F;&#x5199;&#xFF1A;&#x5F53;&#x4E8B;&#x52A1;&#x60F3;&#x8981;&#x4FEE;&#x6539;&#x7279;&#x5B9A;&#x5BF9;&#x8C61;&#xFF08;&#x884C;&#x6216;&#x6587;&#x6863;&#xFF09;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x83B7;&#x5F97;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x9501;&#x3002;&#x7136;&#x540E;&#x5FC5;&#x987B;&#x6301;&#x6709;&#x8BE5;&#x9501;&#x76F4;&#x5230;&#x4E8B;&#x52A1;&#x88AB;&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#x3002;&#x4E00;&#x6B21;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x6301;&#x6709;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x5BF9;&#x8C61;&#x7684;&#x9501;&#xFF1B;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8981;&#x5199;&#x5165;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x7B49;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x83B7;&#x53D6;&#x8BE5;&#x9501;&#x5E76;&#x7EE7;&#x7EED;&#x3002;&#x8FD9;&#x79CD;&#x9501;&#x5B9A;&#x662F;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x6A21;&#x5F0F;&#xFF08;&#x6216;&#x66F4;&#x5F3A;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF09;&#x7684;&#x6570;&#x636E;&#x5E93;&#x81EA;&#x52A8;&#x5B8C;&#x6210;&#x7684;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#xFF1F;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x9501;&#xFF0C;&#x5E76;&#x8981;&#x6C42;&#x4EFB;&#x4F55;&#x60F3;&#x8981;&#x8BFB;&#x53D6;&#x5BF9;&#x8C61;&#x7684;&#x4E8B;&#x52A1;&#x6765;&#x7B80;&#x5355;&#x5730;&#x83B7;&#x53D6;&#x8BE5;&#x9501;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8BFB;&#x53D6;&#x4E4B;&#x540E;&#x7ACB;&#x5373;&#x518D;&#x6B21;&#x91CA;&#x653E;&#x8BE5;&#x9501;&#x3002;&#x8FD9;&#x80FD;&#x786E;&#x4FDD;&#x4E0D;&#x4F1A;&#x8BFB;&#x53D6;&#x8FDB;&#x884C;&#x65F6;&#xFF0C;&#x5BF9;&#x8C61;&#x4E0D;&#x4F1A;&#x5728;&#x810F;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x6709;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x503C;&#xFF08;&#x56E0;&#x4E3A;&#x5728;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#x9501;&#x4F1A;&#x88AB;&#x5199;&#x5165;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x4E8B;&#x52A1;&#x6301;&#x6709;&#xFF09;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x8981;&#x6C42;&#x8BFB;&#x9501;&#x7684;&#x529E;&#x6CD5;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x6548;&#x679C;&#x5E76;&#x4E0D;&#x597D;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x5199;&#x5165;&#x4E8B;&#x52A1;&#x4F1A;&#x8FEB;&#x4F7F;&#x8BB8;&#x591A;&#x53EA;&#x8BFB;&#x4E8B;&#x52A1;&#x7B49;&#x5230;&#x8FD9;&#x4E2A;&#x6162;&#x5199;&#x5165;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x4F1A;&#x635F;&#x5931;&#x53EA;&#x8BFB;&#x4E8B;&#x52A1;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5229;&#x4E8E;&#x53EF;&#x64CD;&#x4F5C;&#x6027;&#xFF1A;&#x56E0;&#x4E3A;&#x7B49;&#x5F85;&#x9501;&#xFF0C;&#x5E94;&#x7528;&#x67D0;&#x4E2A;&#x90E8;&#x5206;&#x7684;&#x8FDF;&#x7F13;&#x53EF;&#x80FD;&#x7531;&#x4E8E;&#x8FDE;&#x9501;&#x6548;&#x5E94;&#xFF0C;&#x5BFC;&#x81F4;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;<sup><a href="#fn_vi" id="reffn_vi">vi</a></sup>&#x4F7F;&#x7528;<a href="">&#x56FE;7-4</a>&#x7684;&#x65B9;&#x5F0F;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#xFF1A;&#x5BF9;&#x4E8E;&#x5199;&#x5165;&#x7684;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x4F1A;&#x8BB0;&#x4F4F;&#x65E7;&#x7684;&#x5DF2;&#x63D0;&#x4EA4;&#x503C;&#xFF0C;&#x548C;&#x7531;&#x5F53;&#x524D;&#x6301;&#x6709;&#x5199;&#x5165;&#x9501;&#x7684;&#x4E8B;&#x52A1;&#x8BBE;&#x7F6E;&#x7684;&#x65B0;&#x503C;&#x3002;&#x5F53;&#x4E8B;&#x52A1;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x65F6;&#xFF0C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8BFB;&#x53D6;&#x5BF9;&#x8C61;&#x7684;&#x4E8B;&#x52A1;&#x90FD;&#x4F1A;&#x62FF;&#x5230;&#x65E7;&#x503C;&#x3002; &#x53EA;&#x6709;&#x5F53;&#x65B0;&#x503C;&#x63D0;&#x4EA4;&#x540E;&#xFF0C;&#x4E8B;&#x52A1;&#x624D;&#x4F1A;&#x5207;&#x6362;&#x5230;&#x8BFB;&#x53D6;&#x65B0;&#x503C;&#x3002;</p>
<blockquote id="fn_vi">
<sup>vi</sup>. &#x5728;&#x64B0;&#x5199;&#x672C;&#x6587;&#x65F6;&#xFF0C;&#x552F;&#x4E00;&#x5728;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4F7F;&#x7528;&#x8BFB;&#x9501;&#x7684;&#x4E3B;&#x6D41;&#x6570;&#x636E;&#x5E93;&#x662F;&#x4F7F;&#x7528;<code>read_committed_snapshot = off</code>&#x914D;&#x7F6E;&#x7684;IBM DB2&#x548C;Microsoft SQL Server [23,36]&#x3002;<a href="#reffn_vi" title="Jump back to footnote [vi] in the text."> &#x21A9;</a>
</blockquote>
<h3 id="&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;">&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</h3>
<p>&#x5982;&#x679C;&#x53EA;&#x4ECE;&#x8868;&#x9762;&#x4E0A;&#x770B;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4F60;&#x5C31;&#x8BA4;&#x4E3A;&#x5B83;&#x5B8C;&#x6210;&#x4E86;&#x4E8B;&#x52A1;&#x6240;&#x9700;&#x7684;&#x4E00;&#x5207;&#xFF0C;&#x90A3;&#x662F;&#x53EF;&#x4EE5;&#x539F;&#x8C05;&#x7684;&#x3002;&#x5B83;&#x5141;&#x8BB8;<strong>&#x4E2D;&#x6B62;</strong>&#xFF08;&#x539F;&#x5B50;&#x6027;&#x7684;&#x8981;&#x6C42;&#xFF09;&#xFF1B;&#x5B83;&#x9632;&#x6B62;&#x8BFB;&#x53D6;&#x4E0D;&#x5B8C;&#x6574;&#x7684;&#x4E8B;&#x52A1;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x4E14;&#x9632;&#x6B62;&#x5E76;&#x53D1;&#x5199;&#x5165;&#x9020;&#x6210;&#x7684;&#x6DF7;&#x4E71;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x6BD4;&#x8D77;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#x7684;&#x7CFB;&#x7EDF;&#x6765;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x4FDD;&#x8BC1;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5728;&#x4F7F;&#x7528;&#x6B64;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x65F6;&#xFF0C;&#x4ECD;&#x7136;&#x6709;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x5E76;&#x53D1;&#x9519;&#x8BEF;&#x3002;&#x4F8B;&#x5982;<a href="img/fig7-6.png">&#x56FE;7-6</a>&#x8BF4;&#x660E;&#x4E86;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x65F6;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><img src="img/fig7-6.png" alt=""></p>
<p><strong>&#x56FE;7-6 &#x8BFB;&#x53D6;&#x504F;&#x5DEE;&#xFF1A;Alice&#x89C2;&#x5BDF;&#x6570;&#x636E;&#x5E93;&#x5904;&#x4E8E;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;</strong></p>
<p>&#x7231;&#x4E3D;&#x4E1D;&#x5728;&#x94F6;&#x884C;&#x6709;1000&#x7F8E;&#x5143;&#x7684;&#x50A8;&#x84C4;&#xFF0C;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x8D26;&#x6237;&#xFF0C;&#x6BCF;&#x4E2A;500&#x7F8E;&#x5143;&#x3002;&#x73B0;&#x5728;&#x4E00;&#x7B14;&#x4E8B;&#x52A1;&#x4ECE;&#x5979;&#x7684;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x4E2D;&#x8F6C;&#x79FB;&#x4E86;100&#x7F8E;&#x5143;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8D26;&#x6237;&#x3002;&#x5982;&#x679C;&#x5979;&#x5728;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7684;&#x540C;&#x65F6;&#x67E5;&#x770B;&#x5176;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x5217;&#x8868;&#xFF0C;&#x4E0D;&#x5E78;&#x5730;&#x5728;&#x8F6C;&#x8D26;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x524D;&#x770B;&#x5230;&#x6536;&#x6B3E;&#x8D26;&#x6237;&#x4F59;&#x989D;&#xFF08;&#x4F59;&#x989D;&#x4E3A;500&#x7F8E;&#x5143;&#xFF09;&#xFF0C;&#x800C;&#x5728;&#x8F6C;&#x8D26;&#x5B8C;&#x6210;&#x540E;&#x770B;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8F6C;&#x51FA;&#x8D26;&#x6237;&#xFF08;&#x5DF2;&#x7ECF;&#x8F6C;&#x51FA;100&#x7F8E;&#x5143;&#xFF0C;&#x4F59;&#x989D;400&#x7F8E;&#x5143;&#xFF09;&#x3002;&#x5BF9;&#x7231;&#x4E3D;&#x4E1D;&#x6765;&#x8BF4;&#xFF0C;&#x73B0;&#x5728;&#x5979;&#x7684;&#x8D26;&#x6237;&#x4F3C;&#x4E4E;&#x53EA;&#x6709;900&#x7F8E;&#x5143;&#x2014;&#x2014;&#x770B;&#x8D77;&#x6765;100&#x7F8E;&#x5143;&#x5DF2;&#x7ECF;&#x6D88;&#x5931;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF08;nonrepeatable read&#xFF09;</strong>&#x6216;<strong>&#x8BFB;&#x53D6;&#x504F;&#x5DEE;&#xFF08;read skew&#xFF09;</strong>&#xFF1A;&#x5982;&#x679C;Alice&#x5728;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x65F6;&#x518D;&#x6B21;&#x8BFB;&#x53D6;&#x8D26;&#x6237;1&#x7684;&#x4F59;&#x989D;&#xFF0C;&#x5979;&#x5C06;&#x770B;&#x5230;&#x4E0E;&#x5979;&#x4E4B;&#x524D;&#x7684;&#x67E5;&#x8BE2;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x4E0D;&#x540C;&#x7684;&#x503C;&#xFF08;600&#x7F8E;&#x5143;&#xFF09;&#x3002;&#x5728;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x7684;&#x9694;&#x79BB;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;<strong>&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;</strong>&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#xFF1A;Alice&#x770B;&#x5230;&#x7684;&#x5E10;&#x6237;&#x4F59;&#x989D;&#x65F6;&#x786E;&#x5B9E;&#x5728;&#x9605;&#x8BFB;&#x65F6;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x4E86;&#x3002;</p>
<blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x672F;&#x8BED;<strong>&#x504F;&#x5DEE;&#xFF08;skew&#xFF09;</strong> &#x8FD9;&#x4E2A;&#x8BCD;&#x662F;&#x8FC7;&#x8F7D;&#x7684;&#xFF1A;&#x4EE5;&#x524D;&#x4F7F;&#x7528;&#x5B83;&#x662F;&#x56E0;&#x4E3A;&#x70ED;&#x70B9;&#x7684;&#x4E0D;&#x5E73;&#x8861;&#x5DE5;&#x4F5C;&#x91CF;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch6.html#&#x8D1F;&#x8F7D;&#x503E;&#x659C;&#x4E0E;&#x6D88;&#x9664;&#x70ED;&#x70B9;">&#x504F;&#x659C;&#x7684;&#x8D1F;&#x8F7D;&#x503E;&#x659C;&#x4E0E;&#x6D88;&#x9664;&#x70ED;&#x70B9;</a>&#x201D;&#xFF09;&#xFF0C;&#x800C;&#x8FD9;&#x91CC;&#x504F;&#x5DEE;&#x610F;&#x5473;&#x7740;&#x5F02;&#x5E38;&#x7684;&#x65F6;&#x673A;&#x3002;</p>
</blockquote>
<p>&#x5BF9;&#x4E8E;Alice&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x6301;&#x7EED;&#x7684;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x5979;&#x51E0;&#x79D2;&#x949F;&#x540E;&#x5237;&#x65B0;&#x94F6;&#x884C;&#x7F51;&#x7AD9;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5979;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x5E10;&#x6237;&#x4F59;&#x989D;&#x3002;&#x4F46;&#x662F;&#x6709;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E0D;&#x80FD;&#x5BB9;&#x5FCD;&#x8FD9;&#x79CD;&#x6682;&#x65F6;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#xFF1A;</p>
<p><strong><em>&#x5907;&#x4EFD;</em></strong></p>
<p>&#x200B;    &#x8FDB;&#x884C;&#x5907;&#x4EFD;&#x9700;&#x8981;&#x590D;&#x5236;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5BF9;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x800C;&#x8A00;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x6570;&#x5C0F;&#x65F6;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x3002;&#x5907;&#x4EFD;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4ECD;&#x7136;&#x4F1A;&#x63A5;&#x53D7;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x3002;&#x56E0;&#x6B64;&#x5907;&#x4EFD;&#x53EF;&#x80FD;&#x4F1A;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x65E7;&#x7684;&#x90E8;&#x5206;&#x548C;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5982;&#x679C;&#x4ECE;&#x8FD9;&#x6837;&#x7684;&#x5907;&#x4EFD;&#x4E2D;&#x6062;&#x590D;&#xFF0C;&#x90A3;&#x4E48;&#x4E0D;&#x4E00;&#x81F4;&#xFF08;&#x5982;&#x6D88;&#x5931;&#x7684;&#x94B1;&#xFF09;&#x5C31;&#x4F1A;&#x53D8;&#x6210;&#x6C38;&#x4E45;&#x7684;&#x3002;</p>
<p><strong><em>&#x5206;&#x6790;&#x67E5;&#x8BE2;&#x548C;&#x5B8C;&#x6574;&#x6027;&#x68C0;&#x67E5;</em></strong></p>
<p>&#x200B;    &#x6709;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#xFF0C;&#x626B;&#x63CF;&#x5927;&#x90E8;&#x5206;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x67E5;&#x8BE2;&#x5728;&#x5206;&#x6790;&#x4E2D;&#x5F88;&#x5E38;&#x89C1;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x8FD8;&#x662F;&#x5206;&#x6790;&#xFF1F;">&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x6216;&#x5206;&#x6790;&#xFF1F;</a>&#x201D;&#xFF09;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x5B9A;&#x671F;&#x5B8C;&#x6574;&#x6027;&#x68C0;&#x67E5;&#xFF08;&#x5373;&#x76D1;&#x89C6;&#x6570;&#x636E;&#x635F;&#x574F;&#xFF09;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x67E5;&#x8BE2;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x70B9;&#x89C2;&#x5BDF;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x8FD4;&#x56DE;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p><strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;snapshot isolation&#xFF09;</strong>&#x3010;28&#x3011;&#x662F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x60F3;&#x6CD5;&#x662F;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x7684;<strong>&#x4E00;&#x81F4;&#x5FEB;&#x7167;&#xFF08;consistent snapshot&#xFF09;</strong> &#x4E2D;&#x8BFB;&#x53D6;&#x2014;&#x2014;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x63D0;&#x4EA4;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x3002;&#x5373;&#x4F7F;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x968F;&#x540E;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x66F4;&#x6539;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x4E5F;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x8BE5;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x65E7;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x5BF9;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x53EA;&#x8BFB;&#x67E5;&#x8BE2;&#xFF08;&#x5982;&#x5907;&#x4EFD;&#x548C;&#x5206;&#x6790;&#xFF09;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x5982;&#x679C;&#x67E5;&#x8BE2;&#x7684;&#x6570;&#x636E;&#x5728;&#x67E5;&#x8BE2;&#x6267;&#x884C;&#x7684;&#x540C;&#x65F6;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5219;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x67E5;&#x8BE2;&#x7684;&#x542B;&#x4E49;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5728;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#x51BB;&#x7ED3;&#x65F6;&#x7684;&#x4E00;&#x81F4;&#x5FEB;&#x7167;&#xFF0C;&#x7406;&#x89E3;&#x8D77;&#x6765;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x4E86;&#x3002;</p>
<p>&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x662F;&#x4E00;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x529F;&#x80FD;&#xFF1A;PostgreSQL&#xFF0C;&#x4F7F;&#x7528;InnoDB&#x5F15;&#x64CE;&#x7684;MySQL&#xFF0C;Oracle&#xFF0C;SQL Server&#x7B49;&#x90FD;&#x652F;&#x6301;&#x3010;23,31,32&#x3011;&#x3002;</p>
<h4 id="&#x5B9E;&#x73B0;&#x5FEB;&#x7167;&#x9694;&#x79BB;">&#x5B9E;&#x73B0;&#x5FEB;&#x7167;&#x9694;&#x79BB;</h4>
<p>&#x4E0E;&#x8BFB;&#x53D6;&#x63D0;&#x4EA4;&#x7684;&#x9694;&#x79BB;&#x7C7B;&#x4F3C;&#xFF0C;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x5B9E;&#x73B0;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x5199;&#x9501;&#x6765;&#x9632;&#x6B62;&#x810F;&#x5199;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="#&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;">&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</a>&#x201D;&#xFF09;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8FDB;&#x884C;&#x5199;&#x5165;&#x7684;&#x4E8B;&#x52A1;&#x4F1A;&#x963B;&#x6B62;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4FEE;&#x6539;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x4F46;&#x662F;&#x8BFB;&#x53D6;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x9501;&#x5B9A;&#x3002;&#x4ECE;&#x6027;&#x80FD;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x539F;&#x5219;&#x662F;&#xFF1A;<strong>&#x8BFB;&#x4E0D;&#x963B;&#x585E;&#x5199;&#xFF0C;&#x5199;&#x4E0D;&#x963B;&#x585E;&#x8BFB;</strong>&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x6570;&#x636E;&#x5E93;&#x5728;&#x5904;&#x7406;&#x4E00;&#x81F4;&#x6027;&#x5FEB;&#x7167;&#x4E0A;&#x7684;&#x957F;&#x65F6;&#x95F4;&#x67E5;&#x8BE2;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5730;&#x540C;&#x65F6;&#x5904;&#x7406;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x3002;&#x4E14;&#x4E24;&#x8005;&#x95F4;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x9501;&#x5B9A;&#x4E89;&#x7528;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x4E86;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x7528;&#x4E8E;&#x9632;&#x6B62;<a href="">&#x56FE;7-4</a>&#x4E2D;&#x7684;&#x810F;&#x8BFB;&#x7684;&#x673A;&#x5236;&#x7684;&#x4E00;&#x822C;&#x5316;&#x3002;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x53EF;&#x80FD;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x63D0;&#x4EA4;&#x7248;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x5404;&#x79CD;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x770B;&#x5230;&#x6570;&#x636E;&#x5E93;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x72B6;&#x6001;&#x3002;&#x56E0;&#x4E3A;&#x5B83;&#x5E76;&#x6392;&#x7EF4;&#x62A4;&#x7740;&#x591A;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x591A;&#x7248;&#x672C;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#xFF08;MVCC, multi-version concurrentcy control&#xFF09;</strong>&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x9700;&#x8981;&#x63D0;&#x4F9B;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x800C;&#x4E0D;&#x63D0;&#x4F9B;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#xFF0C;&#x90A3;&#x4E48;&#x4FDD;&#x7559;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4E24;&#x4E2A;&#x7248;&#x672C;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#xFF1A;&#x63D0;&#x4EA4;&#x7684;&#x7248;&#x672C;&#x548C;&#x88AB;&#x8986;&#x76D6;&#x4F46;&#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x7248;&#x672C;&#x3002;&#x652F;&#x6301;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x901A;&#x5E38;&#x4E5F;&#x4F7F;&#x7528;MVCC&#x6765;&#x5B9E;&#x73B0;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;&#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;&#x65B9;&#x6CD5;&#x662F;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x4E3A;&#x6BCF;&#x4E2A;&#x67E5;&#x8BE2;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x5FEB;&#x7167;&#xFF0C;&#x800C;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x5BF9;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x5FEB;&#x7167;&#x3002;</p>
<p><a href="">&#x56FE;7-7</a>&#x8BF4;&#x660E;&#x4E86;&#x5982;&#x4F55;&#x5728;PostgreSQL&#x4E2D;&#x5B9E;&#x73B0;&#x57FA;&#x4E8E;MVCC&#x7684;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x3010;31&#x3011;&#xFF08;&#x5176;&#x4ED6;&#x5B9E;&#x73B0;&#x7C7B;&#x4F3C;&#xFF09;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x5B83;&#x88AB;&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#xFF0C;&#x6C38;&#x8FDC;&#x589E;&#x957F;<sup><a href="#fn_vii" id="reffn_vii">vii</a></sup>&#x7684;&#x4E8B;&#x52A1;ID&#xFF08;<code>txid</code>&#xFF09;&#x3002;&#x6BCF;&#x5F53;&#x4E8B;&#x52A1;&#x5411;&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x5B83;&#x6240;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4F1A;&#x88AB;&#x6807;&#x8BB0;&#x4E0A;&#x5199;&#x5165;&#x8005;&#x7684;&#x4E8B;&#x52A1;ID&#x3002;</p>
<blockquote id="fn_vii">
<sup>vii</sup>. &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4E8B;&#x52A1;ID&#x662F;32&#x4F4D;&#x6574;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x7EA6;&#x4F1A;&#x5728;40&#x4EBF;&#x6B21;&#x4E8B;&#x52A1;&#x4E4B;&#x540E;&#x6EA2;&#x51FA;&#x3002; PostgreSQL&#x7684;Vacuum&#x8FC7;&#x7A0B;&#x4F1A;&#x6E05;&#x7406;&#x8001;&#x65E7;&#x7684;&#x4E8B;&#x52A1;ID&#xFF0C;&#x786E;&#x4FDD;&#x4E8B;&#x52A1;ID&#x6EA2;&#x51FA;&#xFF08;&#x56DE;&#x5377;&#xFF09;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x6570;&#x636E;&#x3002;<a href="#reffn_vii" title="Jump back to footnote [vii] in the text."> &#x21A9;</a>
</blockquote>
<p><img src="img/fig7-7.png" alt=""></p>
<p><strong>&#x56FE;7-7 &#x4F7F;&#x7528;&#x591A;&#x7248;&#x672C;&#x5BF9;&#x8C61;&#x5B9E;&#x73B0;&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong></p>
<p>&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x90FD;&#x6709;&#x4E00;&#x4E2A; <code>created_by</code> &#x5B57;&#x6BB5;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5C06;&#x8BE5;&#x884C;&#x63D2;&#x5165;&#x5230;&#x8868;&#x4E2D;&#x7684;&#x7684;&#x4E8B;&#x52A1;ID&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6BCF;&#x884C;&#x90FD;&#x6709;&#x4E00;&#x4E2A; <code>deleted_by</code> &#x5B57;&#x6BB5;&#xFF0C;&#x6700;&#x521D;&#x662F;&#x7A7A;&#x7684;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x4E8B;&#x52A1;&#x5220;&#x9664;&#x4E86;&#x4E00;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x884C;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x672A;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5220;&#x9664;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&#x5C06; <code>deleted_by</code> &#x5B57;&#x6BB5;&#x8BBE;&#x7F6E;&#x4E3A;&#x8BF7;&#x6C42;&#x5220;&#x9664;&#x7684;&#x4E8B;&#x52A1;&#x7684;ID&#x6765;&#x6807;&#x8BB0;&#x4E3A;&#x5220;&#x9664;&#x3002;&#x5728;&#x7A0D;&#x540E;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5F53;&#x786E;&#x5B9A;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x518D;&#x8BBF;&#x95EE;&#x5DF2;&#x5220;&#x9664;&#x7684;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x8FC7;&#x7A0B;&#x4F1A;&#x5C06;&#x6240;&#x6709;&#x5E26;&#x6709;&#x5220;&#x9664;&#x6807;&#x8BB0;&#x7684;&#x884C;&#x79FB;&#x9664;&#xFF0C;&#x5E76;&#x91CA;&#x653E;&#x5176;&#x7A7A;&#x95F4;&#x3002;<sup><a href="#fn_&#x8BD1;&#x6CE8;ii" id="reffn_&#x8BD1;&#x6CE8;ii">&#x8BD1;&#x6CE8;ii</a></sup></p>
<blockquote id="fn_&#x8BD1;&#x6CE8;ii">
<sup>&#x8BD1;&#x6CE8;ii</sup>. &#x5728;PostgreSQL&#x4E2D;&#xFF0C;<code>created_by</code> &#x7684;&#x5B9E;&#x9645;&#x540D;&#x79F0;&#x4E3A;<code>xmin</code>&#xFF0C;<code>deleted_by</code> &#x7684;&#x5B9E;&#x9645;&#x540D;&#x79F0;&#x4E3A;<code>xmax</code><a href="#reffn_&#x8BD1;&#x6CE8;ii" title="Jump back to footnote [&#x8BD1;&#x6CE8;ii] in the text."> &#x21A9;</a>
</blockquote>
<p><code>UPDATE</code> &#x64CD;&#x4F5C;&#x5728;&#x5185;&#x90E8;&#x7FFB;&#x8BD1;&#x4E3A; <code>DELETE</code> &#x548C; <code>INSERT</code> &#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;<a href="">&#x56FE;7-7</a>&#x4E2D;&#xFF0C;&#x4E8B;&#x52A1;13 &#x4ECE;&#x8D26;&#x6237;2 &#x4E2D;&#x6263;&#x9664;100&#x7F8E;&#x5143;&#xFF0C;&#x5C06;&#x4F59;&#x989D;&#x4ECE;500&#x7F8E;&#x5143;&#x6539;&#x4E3A;400&#x7F8E;&#x5143;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x5305;&#x542B;&#x4E24;&#x6761;&#x8D26;&#x6237;2 &#x7684;&#x8BB0;&#x5F55;&#xFF1A;&#x4F59;&#x989D;&#x4E3A; $500 &#x7684;&#x884C;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;<strong>&#x88AB;&#x4E8B;&#x52A1;13&#x5220;&#x9664;</strong>&#xFF0C;&#x4F59;&#x989D;&#x4E3A; $400 &#x7684;&#x884C;<strong>&#x7531;&#x4E8B;&#x52A1;13&#x521B;&#x5EFA;</strong>&#x3002;</p>
<h4 id="&#x89C2;&#x5BDF;&#x4E00;&#x81F4;&#x6027;&#x5FEB;&#x7167;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x89C4;&#x5219;">&#x89C2;&#x5BDF;&#x4E00;&#x81F4;&#x6027;&#x5FEB;&#x7167;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x89C4;&#x5219;</h4>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;ID&#x7528;&#x4E8E;&#x51B3;&#x5B9A;&#x5B83;&#x53EF;&#x4EE5;&#x770B;&#x89C1;&#x54EA;&#x4E9B;&#x5BF9;&#x8C61;&#xFF0C;&#x770B;&#x4E0D;&#x89C1;&#x54EA;&#x4E9B;&#x5BF9;&#x8C61;&#x3002;&#x901A;&#x8FC7;&#x4ED4;&#x7EC6;&#x5B9A;&#x4E49;&#x53EF;&#x89C1;&#x6027;&#x89C4;&#x5219;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x5411;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5448;&#x73B0;&#x4E00;&#x81F4;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5FEB;&#x7167;&#x3002;&#x5DE5;&#x4F5C;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x5728;&#x6BCF;&#x6B21;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5217;&#x51FA;&#x5F53;&#x65F6;&#x6240;&#x6709;&#x5176;&#x4ED6;&#xFF08;&#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x6216;&#x5C1A;&#x672A;&#x4E2D;&#x6B62;&#xFF09;&#x7684;&#x4E8B;&#x52A1;&#x6E05;&#x5355;&#xFF0C;&#x5373;&#x4F7F;&#x4E4B;&#x540E;&#x63D0;&#x4EA4;&#x4E86;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x5DF2;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x4E5F;&#x90FD;&#x4F1A;&#x88AB;&#x5FFD;&#x7565;&#x3002;</li>
<li>&#x88AB;&#x4E2D;&#x6B62;&#x4E8B;&#x52A1;&#x6240;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x90FD;&#x5C06;&#x88AB;&#x5FFD;&#x7565;&#x3002;</li>
<li>&#x7531;&#x5177;&#x6709;&#x8F83;&#x665A;&#x4E8B;&#x52A1;ID&#xFF08;&#x5373;&#xFF0C;&#x5728;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x4E4B;&#x540E;&#x5F00;&#x59CB;&#x7684;&#xFF09;&#x7684;&#x4E8B;&#x52A1;&#x6240;&#x505A;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x90FD;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x800C;&#x4E0D;&#x7BA1;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x3002;</li>
<li>&#x6240;&#x6709;&#x5176;&#x4ED6;&#x5199;&#x5165;&#xFF0C;&#x5BF9;&#x5E94;&#x7528;&#x90FD;&#x662F;&#x53EF;&#x89C1;&#x7684;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x9002;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x548C;&#x5220;&#x9664;&#x5BF9;&#x8C61;&#x3002;&#x5728;<a href="">&#x56FE;7-7</a>&#x4E2D;&#xFF0C;&#x5F53;&#x4E8B;&#x52A1;12 &#x4ECE;&#x8D26;&#x6237;2 &#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x770B;&#x5230; $500 &#x7684;&#x4F59;&#x989D;&#xFF0C;&#x56E0;&#x4E3A; $500 &#x4F59;&#x989D;&#x7684;&#x5220;&#x9664;&#x662F;&#x7531;&#x4E8B;&#x52A1;13 &#x5B8C;&#x6210;&#x7684;&#xFF08;&#x6839;&#x636E;&#x89C4;&#x5219;3&#xFF0C;&#x4E8B;&#x52A1;12 &#x770B;&#x4E0D;&#x5230;&#x4E8B;&#x52A1;13 &#x6267;&#x884C;&#x7684;&#x5220;&#x9664;&#xFF09;&#xFF0C;&#x4E14;400&#x7F8E;&#x5143;&#x8BB0;&#x5F55;&#x7684;&#x521B;&#x5EFA;&#x4E5F;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#xFF08;&#x6309;&#x7167;&#x76F8;&#x540C;&#x7684;&#x89C4;&#x5219;&#xFF09;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x90FD;&#x6210;&#x7ACB;&#xFF0C;&#x5219;&#x53EF;&#x89C1;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF1A;</p>
<ul>
<li>&#x8BFB;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x521B;&#x5EFA;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x3002;</li>
<li>&#x5BF9;&#x8C61;&#x672A;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x5220;&#x9664;&#xFF0C;&#x6216;&#x5982;&#x679C;&#x88AB;&#x6807;&#x8BB0;&#x4E3A;&#x5220;&#x9664;&#xFF0C;&#x8BF7;&#x6C42;&#x5220;&#x9664;&#x7684;&#x4E8B;&#x52A1;&#x5728;&#x8BFB;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x3002;</li>
</ul>
<p>&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x4F1A;&#x957F;&#x65F6;&#x95F4;&#x4F7F;&#x7528;&#x5FEB;&#x7167;&#xFF0C;&#x5E76;&#x7EE7;&#x7EED;&#x8BFB;&#x53D6;&#xFF08;&#x4ECE;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF09;&#x65E9;&#x5DF2;&#x88AB;&#x8986;&#x76D6;&#x6216;&#x5220;&#x9664;&#x7684;&#x503C;&#x3002;&#x7531;&#x4E8E;&#x4ECE;&#x6765;&#x4E0D;&#x539F;&#x5730;&#x66F4;&#x65B0;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x6BCF;&#x6B21;&#x503C;&#x6539;&#x53D8;&#x65F6;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x5728;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x5FEB;&#x7167;&#x7684;&#x540C;&#x65F6;&#x53EA;&#x4EA7;&#x751F;&#x5F88;&#x5C0F;&#x7684;&#x989D;&#x5916;&#x5F00;&#x9500;&#x3002;</p>
<h4 id="&#x7D22;&#x5F15;&#x548C;&#x5FEB;&#x7167;&#x9694;&#x79BB;">&#x7D22;&#x5F15;&#x548C;&#x5FEB;&#x7167;&#x9694;&#x79BB;</h4>
<p>&#x7D22;&#x5F15;&#x5982;&#x4F55;&#x5728;&#x591A;&#x7248;&#x672C;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5DE5;&#x4F5C;&#xFF1F;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x4F7F;&#x7D22;&#x5F15;&#x7B80;&#x5355;&#x5730;&#x6307;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x6240;&#x6709;&#x7248;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x7D22;&#x5F15;&#x67E5;&#x8BE2;&#x6765;&#x8FC7;&#x6EE4;&#x6389;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#x7248;&#x672C;&#x3002;&#x5F53;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5220;&#x9664;&#x4EFB;&#x4F55;&#x4E8B;&#x52A1;&#x4E0D;&#x518D;&#x53EF;&#x89C1;&#x7684;&#x65E7;&#x5BF9;&#x8C61;&#x7248;&#x672C;&#x65F6;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x7D22;&#x5F15;&#x6761;&#x76EE;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x5220;&#x9664;&#x3002;</p>
<p>&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x8BB8;&#x591A;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x51B3;&#x5B9A;&#x4E86;&#x591A;&#x7248;&#x672C;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x4E00;&#x5BF9;&#x8C61;&#x7684;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x53EF;&#x4EE5;&#x653E;&#x5165;&#x540C;&#x4E00;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#xFF0C;PostgreSQL&#x7684;&#x4F18;&#x5316;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x66F4;&#x65B0;&#x7D22;&#x5F15;&#x3010;31&#x3011;&#x3002;</p>
<p>&#x5728;CouchDB&#xFF0C;Datomic&#x548C;LMDB&#x4E2D;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x867D;&#x7136;&#x5B83;&#x4EEC;&#x4E5F;&#x4F7F;&#x7528;<a href="ch2.html#B&#x6811;">B&#x6811;</a>&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x79CD;<strong>&#x4EC5;&#x8FFD;&#x52A0;/&#x5199;&#x65F6;&#x62F7;&#x8D1D;&#xFF08;append-only/copy-on-write&#xFF09;</strong> &#x7684;&#x53D8;&#x4F53;&#xFF0C;&#x5B83;&#x4EEC;&#x5728;&#x66F4;&#x65B0;&#x65F6;&#x4E0D;&#x8986;&#x76D6;&#x6811;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x800C;&#x4E3A;&#x6BCF;&#x4E2A;&#x4FEE;&#x6539;&#x9875;&#x9762;&#x521B;&#x5EFA;&#x4E00;&#x4EFD;&#x526F;&#x672C;&#x3002;&#x4ECE;&#x7236;&#x9875;&#x9762;&#x76F4;&#x5230;&#x6811;&#x6839;&#x90FD;&#x4F1A;&#x7EA7;&#x8054;&#x66F4;&#x65B0;&#xFF0C;&#x4EE5;&#x6307;&#x5411;&#x5B83;&#x4EEC;&#x5B50;&#x9875;&#x9762;&#x7684;&#x65B0;&#x7248;&#x672C;&#x3002;&#x4EFB;&#x4F55;&#x4E0D;&#x53D7;&#x5199;&#x5165;&#x5F71;&#x54CD;&#x7684;&#x9875;&#x9762;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x590D;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3010;33,34,35&#x3011;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x4EC5;&#x8FFD;&#x52A0;&#x7684;B&#x6811;&#xFF0C;&#x6BCF;&#x4E2A;&#x5199;&#x5165;&#x4E8B;&#x52A1;&#xFF08;&#x6216;&#x4E00;&#x6279;&#x4E8B;&#x52A1;&#xFF09;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x9897;&#x65B0;&#x7684;B&#x6811;&#xFF0C;&#x5F53;&#x521B;&#x5EFA;&#x65F6;&#xFF0C;&#x4ECE;&#x8BE5;&#x7279;&#x5B9A;&#x6811;&#x6839;&#x751F;&#x957F;&#x7684;&#x6811;&#x5C31;&#x662F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x6027;&#x5FEB;&#x7167;&#x3002;&#x6CA1;&#x5FC5;&#x8981;&#x6839;&#x636E;&#x4E8B;&#x52A1;ID&#x8FC7;&#x6EE4;&#x6389;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x540E;&#x7EED;&#x5199;&#x5165;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x73B0;&#x6709;&#x7684;B&#x6811;&#xFF1B;&#x5B83;&#x4EEC;&#x53EA;&#x80FD;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6811;&#x6839;&#x3002;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E5F;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x538B;&#x7F29;&#x548C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x540E;&#x53F0;&#x8FDB;&#x7A0B;&#x3002;</p>
<h4 id="&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x4E0E;&#x547D;&#x540D;&#x6DF7;&#x6DC6;">&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x4E0E;&#x547D;&#x540D;&#x6DF7;&#x6DC6;</h4>
<p>&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x7279;&#x522B;&#x5BF9;&#x4E8E;&#x53EA;&#x8BFB;&#x4E8B;&#x52A1;&#x800C;&#x8A00;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x73B0;&#x4E86;&#x5B83;&#xFF0C;&#x5374;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x540D;&#x5B57;&#x6765;&#x79F0;&#x547C;&#x3002;&#x5728;Oracle&#x4E2D;&#x79F0;&#x4E3A;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;Serializable&#xFF09;</strong>&#x7684;&#xFF0C;&#x5728;PostgreSQL&#x548C;MySQL&#x4E2D;&#x79F0;&#x4E3A;<strong>&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF08;repeatable read&#xFF09;</strong>&#x3010;23&#x3011;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x547D;&#x540D;&#x6DF7;&#x6DC6;&#x7684;&#x539F;&#x56E0;&#x662F;SQL&#x6807;&#x51C6;&#x6CA1;&#x6709;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x56E0;&#x4E3A;&#x6807;&#x51C6;&#x662F;&#x57FA;&#x4E8E;System R 1975&#x5E74;&#x5B9A;&#x4E49;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3010;2&#x3011;&#xFF0C;&#x90A3;&#x65F6;&#x5019;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x5C1A;&#x672A;&#x53D1;&#x660E;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;<strong>&#x53EF;&#x91CD;&#x590D;&#x8BFB;</strong>&#xFF0C;&#x8868;&#x9762;&#x4E0A;&#x770B;&#x8D77;&#x6765;&#x4E0E;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x5F88;&#x76F8;&#x4F3C;&#x3002; PostgreSQL&#x548C;MySQL&#x79F0;&#x5176;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x7EA7;&#x522B;&#x4E3A;<strong>&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF08;repeatable read&#xFF09;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x6837;&#x7B26;&#x5408;&#x6807;&#x51C6;&#x8981;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x58F0;&#x79F0;&#x81EA;&#x5DF1;&#x201C;&#x6807;&#x51C6;&#x517C;&#x5BB9;&#x201D;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;SQL&#x6807;&#x51C6;&#x5BF9;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x6709;&#x7F3A;&#x9677;&#x7684;&#x2014;&#x2014;&#x6A21;&#x7CCA;&#xFF0C;&#x4E0D;&#x7CBE;&#x786E;&#xFF0C;&#x5E76;&#x4E0D;&#x50CF;&#x6807;&#x51C6;&#x5E94;&#x6709;&#x7684;&#x6837;&#x5B50;&#x72EC;&#x7ACB;&#x4E8E;&#x5B9E;&#x73B0;&#x3010;28&#x3011;&#x3002;&#x6709;&#x51E0;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x73B0;&#x4E86;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5B9E;&#x9645;&#x63D0;&#x4F9B;&#x7684;&#x4FDD;&#x8BC1;&#x5B58;&#x5728;&#x5F88;&#x5927;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5C3D;&#x7BA1;&#x8868;&#x9762;&#x4E0A;&#x662F;&#x6807;&#x51C6;&#x5316;&#x7684;&#x3010;23&#x3011;&#x3002;&#x5728;&#x7814;&#x7A76;&#x6587;&#x732E;&#x3010;29,30&#x3011;&#x4E2D;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x7684;&#x6B63;&#x5F0F;&#x5B9A;&#x4E49;&#xFF0C;&#x4F46;&#x5927;&#x591A;&#x6570;&#x7684;&#x5B9E;&#x73B0;&#x5E76;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E2A;&#x6B63;&#x5F0F;&#x5B9A;&#x4E49;&#x3002;&#x6700;&#x540E;&#xFF0C;IBM DB2&#x4F7F;&#x7528;&#x201C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x201D;&#x6765;&#x5F15;&#x7528;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x3010;8&#x3011;&#x3002;</p>
<p>&#x7ED3;&#x679C;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x771F;&#x6B63;&#x77E5;&#x9053;<strong>&#x53EF;&#x91CD;&#x590D;&#x8BFB;</strong>&#x7684;&#x610F;&#x601D;&#x3002;</p>
<h3 id="&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;">&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;</h3>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x7684;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x548C;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x7EA7;&#x522B;&#xFF0C;&#x4E3B;&#x8981;&#x4FDD;&#x8BC1;&#x4E86;<strong>&#x53EA;&#x8BFB;&#x4E8B;&#x52A1;&#x5728;&#x5E76;&#x53D1;&#x5199;&#x5165;&#x65F6;</strong>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4EC0;&#x4E48;&#x3002;&#x5374;&#x5FFD;&#x7565;&#x4E86;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x5199;&#x5165;&#x7684;&#x95EE;&#x9898;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x53EA;&#x8BA8;&#x8BBA;&#x4E86;<a href="#&#x810F;&#x5199;">&#x810F;&#x5199;</a>&#xFF0C;&#x4E00;&#x79CD;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x5199;-&#x5199;&#x51B2;&#x7A81;&#x662F;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x5E76;&#x53D1;&#x7684;&#x5199;&#x5165;&#x4E8B;&#x52A1;&#x4E4B;&#x95F4;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x51E0;&#x79CD;&#x6709;&#x8DA3;&#x7684;&#x51B2;&#x7A81;&#x3002;&#x5176;&#x4E2D;&#x6700;&#x7740;&#x540D;&#x7684;&#x662F;<strong>&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF08;lost update&#xFF09;</strong> &#x95EE;&#x9898;&#xFF0C;&#x5982;<a href="">&#x56FE;7-1</a>&#x6240;&#x793A;&#xFF0C;&#x4EE5;&#x4E24;&#x4E2A;&#x5E76;&#x53D1;&#x8BA1;&#x6570;&#x5668;&#x589E;&#x91CF;&#x4E3A;&#x4F8B;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8BFB;&#x53D6;&#x4E00;&#x4E9B;&#x503C;&#xFF0C;&#x4FEE;&#x6539;&#x5B83;&#x5E76;&#x5199;&#x56DE;&#x4FEE;&#x6539;&#x7684;&#x503C;&#xFF08;&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x5219;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7684;&#x4FEE;&#x6539;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#xFF0C;&#x56E0;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x5199;&#x5165;&#x7684;&#x5185;&#x5BB9;&#x5E76;&#x6CA1;&#x6709;&#x5305;&#x62EC;&#x7B2C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x4FEE;&#x6539;&#xFF08;&#x6709;&#x65F6;&#x4F1A;&#x8BF4;&#x540E;&#x9762;&#x5199;&#x5165;<strong>&#x72E0;&#x63CD;&#xFF08;clobber&#xFF09;</strong> &#x4E86;&#x524D;&#x9762;&#x7684;&#x5199;&#x5165;&#xFF09;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x53D1;&#x751F;&#x5728;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x589E;&#x52A0;&#x8BA1;&#x6570;&#x5668;&#x6216;&#x66F4;&#x65B0;&#x8D26;&#x6237;&#x4F59;&#x989D;&#xFF08;&#x9700;&#x8981;&#x8BFB;&#x53D6;&#x5F53;&#x524D;&#x503C;&#xFF0C;&#x8BA1;&#x7B97;&#x65B0;&#x503C;&#x5E76;&#x5199;&#x56DE;&#x66F4;&#x65B0;&#x540E;&#x7684;&#x503C;&#xFF09;</li>
<li>&#x5728;&#x590D;&#x6742;&#x503C;&#x4E2D;&#x8FDB;&#x884C;&#x672C;&#x5730;&#x4FEE;&#x6539;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x5143;&#x7D20;&#x6DFB;&#x52A0;&#x5230;JSON&#x6587;&#x6863;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5217;&#x8868;&#xFF08;&#x9700;&#x8981;&#x89E3;&#x6790;&#x6587;&#x6863;&#xFF0C;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x5E76;&#x5199;&#x56DE;&#x4FEE;&#x6539;&#x7684;&#x6587;&#x6863;&#xFF09;</li>
<li>&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x7F16;&#x8F91;wiki&#x9875;&#x9762;&#xFF0C;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x901A;&#x8FC7;&#x5C06;&#x6574;&#x4E2A;&#x9875;&#x9762;&#x5185;&#x5BB9;&#x53D1;&#x9001;&#x5230;&#x670D;&#x52A1;&#x5668;&#x6765;&#x4FDD;&#x5B58;&#x5176;&#x66F4;&#x6539;&#xFF0C;&#x8986;&#x5199;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5F53;&#x524D;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x666E;&#x904D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6240;&#x4EE5;&#x5DF2;&#x7ECF;&#x5F00;&#x53D1;&#x4E86;&#x5404;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<h4 id="&#x539F;&#x5B50;&#x5199;">&#x539F;&#x5B50;&#x5199;</h4>
<p>&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x539F;&#x5B50;&#x66F4;&#x65B0;&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x6D88;&#x9664;&#x4E86;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x6267;&#x884C;&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;&#x7684;&#x9700;&#x8981;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x6765;&#x8868;&#x8FBE;&#xFF0C;&#x90A3;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x6700;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x6307;&#x4EE4;&#x5728;&#x5927;&#x591A;&#x6570;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x662F;&#x5E76;&#x53D1;&#x5B89;&#x5168;&#x7684;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">UPDATE</span> counters <span class="hljs-keyword">SET</span> <span class="hljs-keyword">value</span> = <span class="hljs-keyword">value</span> + <span class="hljs-number">1</span> <span class="hljs-keyword">WHERE</span> <span class="hljs-keyword">key</span> = <span class="hljs-string">&apos;foo&apos;</span>;
</code></pre>
<p>&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x50CF;MongoDB&#x8FD9;&#x6837;&#x7684;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;JSON&#x6587;&#x6863;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x8FDB;&#x884C;&#x672C;&#x5730;&#x4FEE;&#x6539;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;Redis&#x63D0;&#x4F9B;&#x4E86;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x5982;&#x4F18;&#x5148;&#x7EA7;&#x961F;&#x5217;&#xFF09;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x8868;&#x8FBE;&#xFF0C;&#x4F8B;&#x5982;&#x7EF4;&#x57FA;&#x9875;&#x9762;&#x7684;&#x66F4;&#x65B0;&#x6D89;&#x53CA;&#x5230;&#x4EFB;&#x610F;&#x6587;&#x672C;&#x7F16;&#x8F91;<sup><a href="#fn_viii" id="reffn_viii">viii</a></sup>&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x662F;&#x6700;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<blockquote id="fn_viii">
<sup>viii</sup>. &#x5C06;&#x6587;&#x672C;&#x6587;&#x6863;&#x7684;&#x7F16;&#x8F91;&#x8868;&#x793A;&#x4E3A;&#x539F;&#x5B50;&#x7684;&#x53D8;&#x5316;&#x6D41;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x3002;&#x53C2;&#x9605;&#x201C;<a href="ch5.html#&#x9898;&#x5916;&#x8BDD;&#xFF1A;&#x81EA;&#x52A8;&#x51B2;&#x7A81;&#x89E3;&#x51B3;">&#x81EA;&#x52A8;&#x51B2;&#x7A81;&#x89E3;&#x51B3;</a>&#x201D;&#x3002;<a href="#reffn_viii" title="Jump back to footnote [viii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x5728;&#x8BFB;&#x53D6;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x83B7;&#x53D6;&#x5176;&#x4E0A;&#x7684;&#x6392;&#x5B83;&#x9501;&#x6765;&#x5B9E;&#x73B0;&#x3002;&#x4EE5;&#x4FBF;&#x66F4;&#x65B0;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x5B83;&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x6709;&#x65F6;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6E38;&#x6807;&#x7A33;&#x5B9A;&#x6027;&#xFF08;cursor stability&#xFF09;</strong>&#x3010;36,37&#x3011;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5F3A;&#x5236;&#x6240;&#x6709;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x5728;&#x5355;&#x4E00;&#x7EBF;&#x7A0B;&#x4E0A;&#x6267;&#x884C;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;ORM&#x6846;&#x67B6;&#x5F88;&#x5BB9;&#x6613;&#x610F;&#x5916;&#x5730;&#x6267;&#x884C;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x3010;38&#x3011;&#x3002;&#x5982;&#x679C;&#x4F60;&#x77E5;&#x9053;&#x81EA;&#x5DF1;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x90A3;&#x5F53;&#x7136;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5B83;&#x7ECF;&#x5E38;&#x4EA7;&#x751F;&#x90A3;&#x79CD;&#x5F88;&#x96BE;&#x6D4B;&#x51FA;&#x6765;&#x7684;&#x5FAE;&#x5999;Bug&#x3002;</p>
<h4 id="&#x663E;&#x5F0F;&#x9501;&#x5B9A;">&#x663E;&#x5F0F;&#x9501;&#x5B9A;</h4>
<p>&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5185;&#x7F6E;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x5FC5;&#x8981;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x663E;&#x5F0F;&#x5730;&#x9501;&#x5B9A;&#x5C06;&#x8981;&#x66F4;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x7136;&#x540E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;&#xFF0C;&#x5982;&#x679C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x5C1D;&#x8BD5;&#x540C;&#x65F6;&#x8BFB;&#x53D6;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x5F3A;&#x5236;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;<strong>&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;</strong>&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x591A;&#x4EBA;&#x6E38;&#x620F;&#xFF0C;&#x5176;&#x4E2D;&#x51E0;&#x4E2A;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x79FB;&#x52A8;&#x76F8;&#x540C;&#x7684;&#x68CB;&#x5B50;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD8;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x73A9;&#x5BB6;&#x7684;&#x79FB;&#x52A8;&#x7B26;&#x5408;&#x6E38;&#x620F;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x6D89;&#x53CA;&#x5230;&#x4E00;&#x4E9B;&#x4E0D;&#x80FD;&#x5408;&#x7406;&#x5730;&#x7528;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x5B9E;&#x73B0;&#x7684;&#x903B;&#x8F91;&#x3002;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9501;&#x6765;&#x9632;&#x6B62;&#x4E24;&#x540D;&#x73A9;&#x5BB6;&#x540C;&#x65F6;&#x79FB;&#x52A8;&#x76F8;&#x540C;&#x7684;&#x68CB;&#x5B50;&#xFF0C;&#x5982;&#x4F8B;7-1&#x6240;&#x793A;&#x3002;</p>
<p><strong>&#x4F8B;7-1 &#x663E;&#x5F0F;&#x9501;&#x5B9A;&#x884C;&#x4EE5;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;</strong></p>
<pre><code class="lang-plsql">BEGIN TRANSACTION;
SELECT * FROM figures
    WHERE name = &apos;robot&apos; AND game_id = 222
FOR UPDATE;

-- &#x68C0;&#x67E5;&#x73A9;&#x5BB6;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x5426;&#x6709;&#x6548;&#xFF0C;&#x7136;&#x540E;&#x66F4;&#x65B0;&#x5148;&#x524D;SELECT&#x8FD4;&#x56DE;&#x68CB;&#x5B50;&#x7684;&#x4F4D;&#x7F6E;&#x3002;
UPDATE figures SET position = &apos;c4&apos; WHERE id = 1234;
COMMIT;
</code></pre>
<ul>
<li><code>FOR UPDATE</code>&#x5B50;&#x53E5;&#x544A;&#x8BC9;&#x6570;&#x636E;&#x5E93;&#x5E94;&#x8BE5;&#x5BF9;&#x8BE5;&#x67E5;&#x8BE2;&#x8FD4;&#x56DE;&#x7684;&#x6240;&#x6709;&#x884C;&#x52A0;&#x9501;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4F46;&#x8981;&#x505A;&#x5BF9;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4ED4;&#x7EC6;&#x8003;&#x8651;&#x5E94;&#x7528;&#x903B;&#x8F91;&#x3002;&#x5FD8;&#x8BB0;&#x5728;&#x4EE3;&#x7801;&#x67D0;&#x5904;&#x52A0;&#x9501;&#x5F88;&#x5BB9;&#x6613;&#x5F15;&#x5165;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x3002;</p>
<h4 id="&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x4E22;&#x5931;&#x7684;&#x66F4;&#x65B0;">&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x4E22;&#x5931;&#x7684;&#x66F4;&#x65B0;</h4>
<p>&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x548C;&#x9501;&#x662F;&#x901A;&#x8FC7;&#x5F3A;&#x5236;<strong>&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;</strong>&#x6309;&#x987A;&#x5E8F;&#x53D1;&#x751F;&#xFF0C;&#x6765;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5141;&#x8BB8;&#x5B83;&#x4EEC;&#x5E76;&#x884C;&#x6267;&#x884C;&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x5668;&#x68C0;&#x6D4B;&#x5230;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF0C;&#x5219;&#x4E2D;&#x6B62;&#x4E8B;&#x52A1;&#x5E76;&#x5F3A;&#x5236;&#x5B83;&#x4EEC;&#x91CD;&#x8BD5;&#x5176;<strong>&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;</strong>&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x7ED3;&#x5408;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x9AD8;&#x6548;&#x5730;&#x6267;&#x884C;&#x6B64;&#x68C0;&#x67E5;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;PostgreSQL&#x7684;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;Oracle&#x7684;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x548C;SQL Server&#x7684;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x5230;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF0C;&#x5E76;&#x4E2D;&#x6B62;&#x60F9;&#x9EBB;&#x70E6;&#x7684;&#x4E8B;&#x52A1;&#x3002;&#x4F46;&#x662F;&#xFF0C;MySQL/InnoDB&#x7684;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x5E76;&#x4E0D;&#x4F1A;&#x68C0;&#x6D4B;<strong>&#x4E22;&#x5931;&#x66F4;&#x65B0;</strong>&#x3010;23&#x3011;&#x3002;&#x4E00;&#x4E9B;&#x4F5C;&#x8005;&#x3010;28,30&#x3011;&#x8BA4;&#x4E3A;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x80FD;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x624D;&#x79F0;&#x5F97;&#x4E0A;&#x662F;&#x63D0;&#x4F9B;&#x4E86;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x5B9A;&#x4E49;&#x4E0B;&#xFF0C;MySQL&#x4E0B;&#x4E0D;&#x63D0;&#x4F9B;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x3002;</p>
<p>&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x68C0;&#x6D4B;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x7279;&#x6B8A;&#x7684;&#x6570;&#x636E;&#x5E93;&#x529F;&#x80FD;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5FD8;&#x8BB0;&#x4F7F;&#x7528;&#x9501;&#x6216;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x5F15;&#x5165;&#x9519;&#x8BEF;&#xFF1B;&#x4F46;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x7684;&#x68C0;&#x6D4B;&#x662F;&#x81EA;&#x52A8;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;</p>
<h4 id="&#x6BD4;&#x8F83;&#x5E76;&#x8BBE;&#x7F6E;&#xFF08;cas&#xFF09;">&#x6BD4;&#x8F83;&#x5E76;&#x8BBE;&#x7F6E;&#xFF08;CAS&#xFF09;</h4>
<p>&#x5728;&#x4E0D;&#x63D0;&#x4F9B;&#x4E8B;&#x52A1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x6709;&#x65F6;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x79CD;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#xFF1A;<strong>&#x6BD4;&#x8F83;&#x5E76;&#x8BBE;&#x7F6E;&#xFF08;CAS, Compare And Set&#xFF09;</strong>&#xFF08;&#x5148;&#x524D;&#x5728;&#x201C;<a href="">&#x5355;&#x5BF9;&#x8C61;&#x5199;&#x5165;</a>&#x201D;&#x4E2D;&#x63D0;&#x5230;&#xFF09;&#x3002;&#x6B64;&#x64CD;&#x4F5C;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF1A;&#x53EA;&#x6709;&#x5F53;&#x524D;&#x503C;&#x4ECE;&#x4E0A;&#x6B21;&#x8BFB;&#x53D6;&#x65F6;&#x4E00;&#x76F4;&#x672A;&#x6539;&#x53D8;&#xFF0C;&#x624D;&#x5141;&#x8BB8;&#x66F4;&#x65B0;&#x53D1;&#x751F;&#x3002;&#x5982;&#x679C;&#x5F53;&#x524D;&#x503C;&#x4E0E;&#x5148;&#x524D;&#x8BFB;&#x53D6;&#x7684;&#x503C;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x66F4;&#x65B0;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x4E14;&#x5FC5;&#x987B;&#x91CD;&#x8BD5;&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x66F4;&#x65B0;&#x540C;&#x4E00;&#x4E2A;wiki&#x9875;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x7528;&#x6237;&#x5F00;&#x59CB;&#x7F16;&#x8F91;&#x9875;&#x9762;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x624D;&#x4F1A;&#x53D1;&#x751F;&#x66F4;&#x65B0;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-comment">-- &#x6839;&#x636E;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B9E;&#x73B0;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x5B89;&#x5168;</span>
<span class="hljs-keyword">UPDATE</span> wiki_pages <span class="hljs-keyword">SET</span> <span class="hljs-keyword">content</span> = <span class="hljs-string">&apos;&#x65B0;&#x5185;&#x5BB9;&apos;</span>
  <span class="hljs-keyword">WHERE</span> <span class="hljs-keyword">id</span> = <span class="hljs-number">1234</span> <span class="hljs-keyword">AND</span> <span class="hljs-keyword">content</span> = <span class="hljs-string">&apos;&#x65E7;&#x5185;&#x5BB9;&apos;</span>;
</code></pre>
<p>&#x5982;&#x679C;&#x5185;&#x5BB9;&#x5DF2;&#x7ECF;&#x66F4;&#x6539;&#x5E76;&#x4E14;&#x4E0D;&#x518D;&#x4E0E;&#x201C;&#x65E7;&#x5185;&#x5BB9;&#x201D;&#x76F8;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x6B64;&#x66F4;&#x65B0;&#x5C06;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x66F4;&#x65B0;&#x662F;&#x5426;&#x751F;&#x6548;&#xFF0C;&#x5FC5;&#x8981;&#x65F6;&#x91CD;&#x8BD5;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x5141;&#x8BB8;<code>WHERE</code>&#x5B50;&#x53E5;&#x4ECE;&#x65E7;&#x5FEB;&#x7167;&#x4E2D;&#x8BFB;&#x53D6;&#xFF0C;&#x5219;&#x6B64;&#x8BED;&#x53E5;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF0C;&#x56E0;&#x4E3A;&#x5373;&#x4F7F;&#x53D1;&#x751F;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF0C;<code>WHERE</code>&#x6761;&#x4EF6;&#x4E5F;&#x53EF;&#x80FD;&#x4E3A;&#x771F;&#x3002;&#x5728;&#x4F9D;&#x8D56;&#x6570;&#x636E;&#x5E93;&#x7684;CAS&#x64CD;&#x4F5C;&#x524D;&#x8981;&#x68C0;&#x67E5;&#x5176;&#x662F;&#x5426;&#x5B89;&#x5168;&#x3002;</p>
<h4 id="&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x548C;&#x590D;&#x5236;">&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x548C;&#x590D;&#x5236;</h4>
<p>&#x5728;&#x590D;&#x5236;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF08;&#x53C2;&#x89C1;<a href="ch5.html">&#x7B2C;5&#x7AE0;</a>&#xFF09;&#xFF0C;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x7684;&#x66F4;&#x65B0;&#x9700;&#x8981;&#x8003;&#x8651;&#x53E6;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#xFF1A;&#x7531;&#x4E8E;&#x5728;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x5B58;&#x5728;&#x6570;&#x636E;&#x526F;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x88AB;&#x5E76;&#x53D1;&#x5730;&#x4FEE;&#x6539;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x91C7;&#x53D6;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x6B65;&#x9AA4;&#x6765;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x9501;&#x548C;CAS&#x64CD;&#x4F5C;&#x5047;&#x5B9A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6700;&#x65B0;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#x3002;&#x4F46;&#x662F;&#x591A;&#x4E3B;&#x6216;&#x65E0;&#x4E3B;&#x590D;&#x5236;&#x7684;&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x5199;&#x5165;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x5230;&#x526F;&#x672C;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x6700;&#x65B0;&#x6570;&#x636E;&#x7684;&#x526F;&#x672C;&#x3002;&#x6240;&#x4EE5;&#x57FA;&#x4E8E;&#x9501;&#x6216;CAS&#x64CD;&#x4F5C;&#x7684;&#x6280;&#x672F;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002; &#xFF08;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="ch9.html#&#x7EBF;&#x6027;&#x5316;">&#x7EBF;&#x6027;&#x5316;</a>&#x201D;&#x4E2D;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#xFF09;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x201C;<a href="ch5.html#&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;">&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;</a>&#x201D;&#x4E00;&#x8282;&#x6240;&#x8FF0;&#xFF0C;&#x8FD9;&#x79CD;&#x590D;&#x5236;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x65B9;&#x6CD5;&#x662F;&#x5141;&#x8BB8;&#x5E76;&#x53D1;&#x5199;&#x5165;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x51B2;&#x7A81;&#x7248;&#x672C;&#x7684;&#x503C;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x5144;&#x5F1F;&#xFF09;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x6216;&#x7279;&#x6B8A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5728;&#x4E8B;&#x5B9E;&#x53D1;&#x751F;&#x4E4B;&#x540E;&#x89E3;&#x51B3;&#x548C;&#x5408;&#x5E76;&#x8FD9;&#x4E9B;&#x7248;&#x672C;&#x3002;</p>
<p>&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x5728;&#x590D;&#x5236;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x5F88;&#x597D;&#x5730;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C24;&#x5176;&#x5F53;&#x5B83;&#x4EEC;&#x5177;&#x6709;&#x53EF;&#x4EA4;&#x6362;&#x6027;&#x65F6;&#xFF08;&#x5373;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x526F;&#x672C;&#x4E0A;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x5E94;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x4E14;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF09;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x9012;&#x589E;&#x8BA1;&#x6570;&#x5668;&#x6216;&#x5411;&#x96C6;&#x5408;&#x6DFB;&#x52A0;&#x5143;&#x7D20;&#x662F;&#x53EF;&#x4EA4;&#x6362;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x662F;Riak 2.0&#x6570;&#x636E;&#x7C7B;&#x578B;&#x80CC;&#x540E;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x590D;&#x5236;&#x526F;&#x672C;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x3002;&#x5F53;&#x4E0D;&#x540C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x540C;&#x65F6;&#x66F4;&#x65B0;&#x4E00;&#x4E2A;&#x503C;&#x65F6;&#xFF0C;Riak&#x81EA;&#x52A8;&#x5C06;&#x66F4;&#x65B0;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x514D;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x3010;39&#x3011;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;LWW&#xFF09;&#x7684;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x5F88;&#x5BB9;&#x6613;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF0C;&#x5982;&#x201C;<a href="ch5.html#&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;&#x4E22;&#x5F03;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF09;">&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;&#x4E22;&#x5F03;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF09;</a>&#x201D;&#x4E2D;&#x6240;&#x8FF0;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;LWW&#x662F;&#x8BB8;&#x591A;&#x590D;&#x5236;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x9ED8;&#x8BA4;&#x65B9;&#x6848;&#x3002;</p>
<h4 id="&#x5199;&#x5165;&#x504F;&#x5DEE;&#x4E0E;&#x5E7B;&#x8BFB;">&#x5199;&#x5165;&#x504F;&#x5DEE;&#x4E0E;&#x5E7B;&#x8BFB;</h4>
<p>&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;<strong>&#x810F;&#x5199;</strong>&#x548C;<strong>&#x4E22;&#x5931;&#x66F4;&#x65B0;</strong>&#xFF0C;&#x5F53;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x5730;&#x5C1D;&#x8BD5;&#x5199;&#x5165;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x4E24;&#x79CD;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x6570;&#x636E;&#x635F;&#x574F;&#xFF0C;&#x8FD9;&#x4E9B;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x9700;&#x8981;&#x88AB;&#x963B;&#x6B62;&#x2014;&#x2014;&#x65E2;&#x53EF;&#x4EE5;&#x7531;&#x6570;&#x636E;&#x5E93;&#x81EA;&#x52A8;&#x6267;&#x884C;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9501;&#x548C;&#x539F;&#x5B50;&#x5199;&#x64CD;&#x4F5C;&#x8FD9;&#x7C7B;&#x624B;&#x52A8;&#x5B89;&#x5168;&#x63AA;&#x65BD;&#x6765;&#x9632;&#x6B62;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5E76;&#x53D1;&#x5199;&#x5165;&#x95F4;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x66F4;&#x5FAE;&#x5999;&#x7684;&#x51B2;&#x7A81;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x4F60;&#x6B63;&#x5728;&#x4E3A;&#x533B;&#x9662;&#x5199;&#x4E00;&#x4E2A;&#x533B;&#x751F;&#x8F6E;&#x73ED;&#x7BA1;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x533B;&#x9662;&#x901A;&#x5E38;&#x4F1A;&#x540C;&#x65F6;&#x8981;&#x6C42;&#x51E0;&#x4F4D;&#x533B;&#x751F;&#x5F85;&#x547D;&#xFF0C;&#x4F46;&#x5E95;&#x7EBF;&#x662F;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4F4D;&#x533B;&#x751F;&#x5728;&#x5F85;&#x547D;&#x3002;&#x533B;&#x751F;&#x53EF;&#x4EE5;&#x653E;&#x5F03;&#x4ED6;&#x4EEC;&#x7684;&#x73ED;&#x6B21;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x751F;&#x75C5;&#x4E86;&#xFF09;&#xFF0C;&#x53EA;&#x8981;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x4E2A;&#x540C;&#x4E8B;&#x5728;&#x8FD9;&#x4E00;&#x73ED;&#x4E2D;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#x3010;40,41&#x3011;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;Alice&#x548C;Bob&#x662F;&#x4E24;&#x4F4D;&#x503C;&#x73ED;&#x533B;&#x751F;&#x3002;&#x4E24;&#x4EBA;&#x90FD;&#x611F;&#x5230;&#x4E0D;&#x9002;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x90FD;&#x51B3;&#x5B9A;&#x8BF7;&#x5047;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x6070;&#x597D;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x4E0B;&#x73ED;&#x3002;<a href="img/fig7-8.png">&#x56FE;7-8</a>&#x8BF4;&#x660E;&#x4E86;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p><img src="img/fig7-8.png" alt=""></p>
<p><strong>&#x56FE;7-8 &#x5199;&#x5165;&#x504F;&#x5DEE;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x7684;&#x793A;&#x4F8B;</strong></p>
<p>&#x5728;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6709;&#x4E24;&#x4E2A;&#x6216;&#x4EE5;&#x4E0A;&#x7684;&#x533B;&#x751F;&#x6B63;&#x5728;&#x503C;&#x73ED;&#xFF1B;&#x5982;&#x679C;&#x662F;&#x7684;&#x8BDD;&#xFF0C;&#x5B83;&#x5C31;&#x5047;&#x5B9A;&#x4E00;&#x540D;&#x533B;&#x751F;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x4F11;&#x73ED;&#x3002;&#x7531;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF0C;&#x4E24;&#x6B21;&#x68C0;&#x67E5;&#x90FD;&#x8FD4;&#x56DE; 2 &#xFF0C;&#x6240;&#x4EE5;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x3002;Alice&#x66F4;&#x65B0;&#x81EA;&#x5DF1;&#x7684;&#x8BB0;&#x5F55;&#x4F11;&#x73ED;&#x4E86;&#xFF0C;&#x800C;Bob&#x4E5F;&#x505A;&#x4E86;&#x4E00;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x6210;&#x529F;&#x63D0;&#x4EA4;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x6CA1;&#x6709;&#x533B;&#x751F;&#x503C;&#x73ED;&#x4E86;&#x3002;&#x8FDD;&#x53CD;&#x4E86;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x540D;&#x533B;&#x751F;&#x5728;&#x503C;&#x73ED;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<h4 id="&#x5199;&#x504F;&#x5DEE;&#x7684;&#x7279;&#x5F81;">&#x5199;&#x504F;&#x5DEE;&#x7684;&#x7279;&#x5F81;</h4>
<p>&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x79F0;&#x4E3A;<strong>&#x5199;&#x504F;&#x5DEE;</strong>&#x3010;28&#x3011;&#x3002;&#x5B83;&#x65E2;&#x4E0D;&#x662F;<strong>&#x810F;&#x5199;</strong>&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;<strong>&#x4E22;&#x5931;&#x66F4;&#x65B0;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x6B63;&#x5728;&#x66F4;&#x65B0;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF08;Alice&#x548C;Bob&#x5404;&#x81EA;&#x7684;&#x5F85;&#x547D;&#x8BB0;&#x5F55;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#x53D1;&#x751F;&#x7684;&#x51B2;&#x7A81;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x660E;&#x663E;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x663E;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x5730;&#x8FD0;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x7B2C;&#x4E8C;&#x4E2A;&#x533B;&#x751F;&#x5C31;&#x4E0D;&#x80FD;&#x6B47;&#x73ED;&#x4E86;&#x3002;&#x5F02;&#x5E38;&#x884C;&#x4E3A;&#x53EA;&#x6709;&#x5728;&#x4E8B;&#x52A1;&#x5E76;&#x53D1;&#x8FDB;&#x884C;&#x65F6;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x3002;</p>
<p>&#x53EF;&#x4EE5;&#x5C06;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x89C6;&#x4E3A;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x822C;&#x5316;&#x3002;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x66F4;&#x65B0;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x5BF9;&#x8C61;&#xFF08;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x66F4;&#x65B0;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x3002;&#x5728;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x66F4;&#x65B0;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x810F;&#x5199;&#x6216;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF08;&#x53D6;&#x51B3;&#x4E8E;&#x65F6;&#x673A;&#xFF09;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x770B;&#x5230;&#xFF0C;&#x6709;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x7684;&#x66F4;&#x65B0;&#x3002;&#x968F;&#x7740;&#x5199;&#x504F;&#x5DEE;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9009;&#x62E9;&#x66F4;&#x53D7;&#x9650;&#x5236;&#xFF1A;</p>
<ul>
<li>&#x7531;&#x4E8E;&#x6D89;&#x53CA;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5355;&#x5BF9;&#x8C61;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x3002;</li>
<li>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x5BF9;&#x6B64;&#x5E76;&#x6CA1;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x5728;PostgreSQL&#x7684;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;MySQL/InnoDB&#x7684;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF0C;Oracle&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x6216;SQL Server&#x7684;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E2D;&#xFF0C;&#x90FD;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x3010;23&#x3011;&#x3002;&#x81EA;&#x52A8;&#x9632;&#x6B62;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x9700;&#x8981;&#x771F;&#x6B63;&#x7684;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x201C;<a href="#&#x53EF;&#x5E8F;&#x5217;&#x5316;">&#x53EF;&#x5E8F;&#x5217;&#x5316;</a>&#x201D;&#xFF09;&#x3002;</li>
<li>&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x5E93;&#x5141;&#x8BB8;&#x914D;&#x7F6E;&#x7EA6;&#x675F;&#xFF0C;&#x7136;&#x540E;&#x7531;&#x6570;&#x636E;&#x5E93;&#x5F3A;&#x5236;&#x6267;&#x884C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x552F;&#x4E00;&#x6027;&#xFF0C;&#x5916;&#x952E;&#x7EA6;&#x675F;&#x6216;&#x7279;&#x5B9A;&#x503C;&#x9650;&#x5236;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x6307;&#x5B9A;&#x81F3;&#x5C11;&#x6709;&#x4E00;&#x540D;&#x533B;&#x751F;&#x5FC5;&#x987B;&#x5728;&#x7EBF;&#xFF0C;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6D89;&#x53CA;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x7EA6;&#x675F;&#x3002;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x6CA1;&#x6709;&#x5185;&#x7F6E;&#x5BF9;&#x8FD9;&#x79CD;&#x7EA6;&#x675F;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x89E6;&#x53D1;&#x5668;&#xFF0C;&#x6216;&#x8005;&#x7269;&#x5316;&#x89C6;&#x56FE;&#x6765;&#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3010;42&#x3011;&#x3002;</li>
<li>&#x5982;&#x679C;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x5219;&#x6B64;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6B21;&#x4F18;&#x9009;&#x9879;&#x53EF;&#x80FD;&#x662F;&#x663E;&#x5F0F;&#x9501;&#x5B9A;&#x4E8B;&#x52A1;&#x6240;&#x4F9D;&#x8D56;&#x7684;&#x884C;&#x3002;&#x5728;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5199;&#x4E0B;&#x5982;&#x4E0B;&#x7684;&#x4EE3;&#x7801;&#xFF1A;</li>
</ul>
<pre><code class="lang-sql"><span class="hljs-keyword">BEGIN</span> <span class="hljs-keyword">TRANSACTION</span>;
<span class="hljs-keyword">SELECT</span> * <span class="hljs-keyword">FROM</span> doctors
  <span class="hljs-keyword">WHERE</span> on_call = <span class="hljs-literal">TRUE</span> 
  <span class="hljs-keyword">AND</span> shift_id = <span class="hljs-number">1234</span> <span class="hljs-keyword">FOR</span> <span class="hljs-keyword">UPDATE</span>;

<span class="hljs-keyword">UPDATE</span> doctors
  <span class="hljs-keyword">SET</span> on_call = <span class="hljs-literal">FALSE</span>
  <span class="hljs-keyword">WHERE</span> <span class="hljs-keyword">name</span> = <span class="hljs-string">&apos;Alice&apos;</span> 
  <span class="hljs-keyword">AND</span> shift_id = <span class="hljs-number">1234</span>;

<span class="hljs-keyword">COMMIT</span>;
</code></pre>
<ul>
<li>&#x548C;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#xFF0C;<code>FOR UPDATE</code>&#x544A;&#x8BC9;&#x6570;&#x636E;&#x5E93;&#x9501;&#x5B9A;&#x8FD4;&#x56DE;&#x7684;&#x6240;&#x6709;&#x884C;&#x7528;&#x4E8E;&#x66F4;&#x65B0;&#x3002;</li>
</ul>
<h4 id="&#x5199;&#x504F;&#x5DEE;&#x7684;&#x66F4;&#x591A;&#x4F8B;&#x5B50;">&#x5199;&#x504F;&#x5DEE;&#x7684;&#x66F4;&#x591A;&#x4F8B;&#x5B50;</h4>
<p>&#x5199;&#x504F;&#x5DEE;&#x4E4D;&#x770B;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x6DF1;&#x5965;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x66F4;&#x591A;&#x53EF;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p><strong><em>&#x4F1A;&#x8BAE;&#x5BA4;&#x9884;&#x8BA2;&#x7CFB;&#x7EDF;</em></strong></p>
<p>&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x5F3A;&#x5236;&#x6267;&#x884C;&#xFF0C;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x5728;&#x4E24;&#x4E2A;&#x4F1A;&#x8BAE;&#x5BA4;&#x9884;&#x8BA2;&#x3010;43&#x3011;&#x3002;&#x5F53;&#x6709;&#x4EBA;&#x60F3;&#x8981;&#x9884;&#x8BA2;&#x65F6;&#xFF0C;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x5B58;&#x5728;&#x76F8;&#x4E92;&#x51B2;&#x7A81;&#x7684;&#x9884;&#x8BA2;&#xFF08;&#x5373;&#x9884;&#x8BA2;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x91CD;&#x53E0;&#x7684;&#x540C;&#x4E00;&#x623F;&#x95F4;&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x627E;&#x5230;&#xFF0C;&#x5219;&#x521B;&#x5EFA;&#x4F1A;&#x8BAE;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x793A;&#x4F8B;7-2&#xFF09;<sup><a href="#fn_ix" id="reffn_ix">ix</a></sup>&#x3002;</p>
<blockquote id="fn_ix">
<sup>ix</sup>. &#x5728;PostgreSQL&#x4E2D;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8303;&#x56F4;&#x7C7B;&#x578B;&#x4F18;&#x96C5;&#x5730;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x5728;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5E76;&#x672A;&#x5F97;&#x5230;&#x5E7F;&#x6CDB;&#x652F;&#x6301;&#x3002;<a href="#reffn_ix" title="Jump back to footnote [ix] in the text."> &#x21A9;</a>
</blockquote>
<p><strong>&#x4F8B;7-2 &#x4F1A;&#x8BAE;&#x5BA4;&#x9884;&#x8BA2;&#x7CFB;&#x7EDF;&#x8BD5;&#x56FE;&#x907F;&#x514D;&#x91CD;&#x590D;&#x9884;&#x8BA2;&#xFF08;&#x5728;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x4E0B;&#x4E0D;&#x5B89;&#x5168;&#xFF09;</strong></p>
<pre><code class="lang-sql"><span class="hljs-keyword">BEGIN</span> <span class="hljs-keyword">TRANSACTION</span>;

<span class="hljs-comment">-- &#x68C0;&#x67E5;&#x6240;&#x6709;&#x73B0;&#x5B58;&#x7684;&#x4E0E;12:00~13:00&#x91CD;&#x53E0;&#x7684;&#x9884;&#x5B9A;</span>
<span class="hljs-keyword">SELECT</span> <span class="hljs-keyword">COUNT</span>(*) <span class="hljs-keyword">FROM</span> bookings
<span class="hljs-keyword">WHERE</span> room_id = <span class="hljs-number">123</span> <span class="hljs-keyword">AND</span> 
    end_time &gt; <span class="hljs-string">&apos;2015-01-01 12:00&apos;</span> <span class="hljs-keyword">AND</span> start_time &lt; <span class="hljs-string">&apos;2015-01-01 13:00&apos;</span>;

<span class="hljs-comment">-- &#x5982;&#x679C;&#x4E4B;&#x524D;&#x7684;&#x67E5;&#x8BE2;&#x8FD4;&#x56DE;0</span>
<span class="hljs-keyword">INSERT</span> <span class="hljs-keyword">INTO</span> bookings(room_id, start_time, end_time, user_id)
  <span class="hljs-keyword">VALUES</span> (<span class="hljs-number">123</span>, <span class="hljs-string">&apos;2015-01-01 12:00&apos;</span>, <span class="hljs-string">&apos;2015-01-01 13:00&apos;</span>, <span class="hljs-number">666</span>);

<span class="hljs-keyword">COMMIT</span>;
</code></pre>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x5E76;&#x4E0D;&#x80FD;&#x9632;&#x6B62;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x540C;&#x65F6;&#x63D2;&#x5165;&#x51B2;&#x7A81;&#x7684;&#x4F1A;&#x8BAE;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x4E0D;&#x4F1A;&#x9047;&#x5230;&#x8C03;&#x5EA6;&#x51B2;&#x7A81;&#xFF0C;&#x4F60;&#x53C8;&#x9700;&#x8981;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E86;&#x3002;</p>
<p><strong><em>&#x591A;&#x4EBA;&#x6E38;&#x620F;</em></strong></p>
<p>&#x5728;<a href="">&#x4F8B;7-1</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x9501;&#x6765;&#x9632;&#x6B62;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x786E;&#x4FDD;&#x4E24;&#x4E2A;&#x73A9;&#x5BB6;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x79FB;&#x52A8;&#x540C;&#x4E00;&#x4E2A;&#x68CB;&#x5B50;&#xFF09;&#x3002;&#x4F46;&#x662F;&#x9501;&#x5B9A;&#x5E76;&#x4E0D;&#x59A8;&#x788D;&#x73A9;&#x5BB6;&#x5C06;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x68CB;&#x5B50;&#x79FB;&#x52A8;&#x5230;&#x68CB;&#x76D8;&#x4E0A;&#x7684;&#x76F8;&#x540C;&#x4F4D;&#x7F6E;&#xFF0C;&#x6216;&#x8005;&#x91C7;&#x53D6;&#x5176;&#x4ED6;&#x8FDD;&#x53CD;&#x6E38;&#x620F;&#x89C4;&#x5219;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x6309;&#x7167;&#x60A8;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x89C4;&#x5219;&#x7C7B;&#x578B;&#xFF0C;&#x4E5F;&#x8BB8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x7EA6;&#x675F;&#xFF0C;&#x5426;&#x5219;&#x60A8;&#x5F88;&#x5BB9;&#x6613;&#x53D1;&#x751F;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x3002;</p>
<p><strong><em>&#x62A2;&#x6CE8;&#x7528;&#x6237;&#x540D;</em></strong></p>
<p>&#x5728;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x62E5;&#x6709;&#x552F;&#x4E00;&#x7528;&#x6237;&#x540D;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#xFF0C;&#x4E24;&#x4E2A;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x5C1D;&#x8BD5;&#x540C;&#x65F6;&#x521B;&#x5EFA;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7528;&#x6237;&#x540D;&#x7684;&#x5E10;&#x6237;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x4E8B;&#x52A1;&#x68C0;&#x67E5;&#x540D;&#x79F0;&#x662F;&#x5426;&#x88AB;&#x62A2;&#x5360;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5219;&#x4F7F;&#x7528;&#x8BE5;&#x540D;&#x79F0;&#x521B;&#x5EFA;&#x8D26;&#x6237;&#x3002;&#x4F46;&#x662F;&#x50CF;&#x5728;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x90A3;&#x6837;&#xFF0C;&#x5728;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x4E0B;&#x8FD9;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x552F;&#x4E00;&#x7EA6;&#x675F;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF08;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E8B;&#x52A1;&#x5728;&#x63D0;&#x4EA4;&#x65F6;&#x4F1A;&#x56E0;&#x4E3A;&#x8FDD;&#x53CD;&#x7528;&#x6237;&#x540D;&#x552F;&#x4E00;&#x7EA6;&#x675F;&#x800C;&#x88AB;&#x4E2D;&#x6B62;&#xFF09;&#x3002;</p>
<p><strong><em>&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x5F00;&#x652F;</em></strong></p>
<p>&#x5141;&#x8BB8;&#x7528;&#x6237;&#x82B1;&#x94B1;&#x6216;&#x79EF;&#x5206;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x7528;&#x6237;&#x7684;&#x652F;&#x4ED8;&#x6570;&#x989D;&#x4E0D;&#x8D85;&#x8FC7;&#x5176;&#x4F59;&#x989D;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x7528;&#x6237;&#x7684;&#x5E10;&#x6237;&#x4E2D;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x8BD5;&#x63A2;&#x6027;&#x7684;&#x6D88;&#x8D39;&#x9879;&#x76EE;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5217;&#x51FA;&#x5E10;&#x6237;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x9879;&#x76EE;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x603B;&#x548C;&#x662F;&#x5426;&#x4E3A;&#x6B63;&#x503C;&#x3010;44&#x3011;&#x3002;&#x6709;&#x4E86;&#x5199;&#x5165;&#x504F;&#x5DEE;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x4E24;&#x4E2A;&#x652F;&#x51FA;&#x9879;&#x76EE;&#x540C;&#x65F6;&#x63D2;&#x5165;&#xFF0C;&#x4E00;&#x8D77;&#x5BFC;&#x81F4;&#x4F59;&#x989D;&#x53D8;&#x4E3A;&#x8D1F;&#x503C;&#xFF0C;&#x4F46;&#x8FD9;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x4E0D;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x3002;</p>
<h4 id="&#x5BFC;&#x81F4;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x7684;&#x5E7B;&#x8BFB;">&#x5BFC;&#x81F4;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x7684;&#x5E7B;&#x8BFB;</h4>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x90FD;&#x9075;&#x5FAA;&#x7C7B;&#x4F3C;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;</p>
<ol>
<li><p>&#x4E00;&#x4E2A;<code>SELECT</code>&#x67E5;&#x8BE2;&#x627E;&#x51FA;&#x7B26;&#x5408;&#x6761;&#x4EF6;&#x7684;&#x884C;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x7B26;&#x5408;&#x4E00;&#x4E9B;&#x8981;&#x6C42;&#x3002;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;&#x81F3;&#x5C11;&#x6709;&#x4E24;&#x540D;&#x533B;&#x751F;&#x5728;&#x503C;&#x73ED;&#xFF1B;&#x4E0D;&#x5B58;&#x5728;&#x5BF9;&#x8BE5;&#x4F1A;&#x8BAE;&#x5BA4;&#x540C;&#x4E00;&#x65F6;&#x6BB5;&#x7684;&#x9884;&#x5B9A;&#xFF1B;&#x68CB;&#x76D8;&#x4E0A;&#x7684;&#x4F4D;&#x7F6E;&#x6CA1;&#x6709;&#x88AB;&#x5176;&#x4ED6;&#x68CB;&#x5B50;&#x5360;&#x636E;&#xFF1B;&#x7528;&#x6237;&#x540D;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x62A2;&#x6CE8;&#xFF1B;&#x8D26;&#x6237;&#x91CC;&#x8FD8;&#x6709;&#x8DB3;&#x591F;&#x4F59;&#x989D;&#xFF09;</p>
</li>
<li><p>&#x6309;&#x7167;&#x7B2C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x7EE7;&#x7EED;&#x3002;&#xFF08;&#x53EF;&#x80FD;&#x4F1A;&#x7EE7;&#x7EED;&#x64CD;&#x4F5C;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4E2D;&#x6B62;&#x5E76;&#x62A5;&#x9519;&#xFF09;</p>
</li>
<li><p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x51B3;&#x5B9A;&#x7EE7;&#x7EED;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x6267;&#x884C;&#x5199;&#x5165;&#xFF08;&#x63D2;&#x5165;&#x3001;&#x66F4;&#x65B0;&#x6216;&#x5220;&#x9664;&#xFF09;&#xFF0C;&#x5E76;&#x63D0;&#x4EA4;&#x4E8B;&#x52A1;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x5199;&#x5165;&#x7684;&#x6548;&#x679C;&#x6539;&#x53D8;&#x4E86;&#x6B65;&#x9AA4;2 &#x4E2D;&#x7684;&#x5148;&#x51B3;&#x6761;&#x4EF6;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x63D0;&#x4EA4;&#x5199;&#x5165;&#x540E;&#xFF0C;&#x91CD;&#x590D;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x6B65;&#x9AA4;1 &#x7684;SELECT&#x67E5;&#x8BE2;&#xFF0C;&#x5C06;&#x4F1A;&#x5F97;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x56E0;&#x4E3A;&#x5199;&#x5165;&#x6539;&#x53D8;&#x7B26;&#x5408;&#x641C;&#x7D22;&#x6761;&#x4EF6;&#x7684;&#x884C;&#x96C6;&#xFF08;&#x73B0;&#x5728;&#x5C11;&#x4E86;&#x4E00;&#x4E2A;&#x533B;&#x751F;&#x503C;&#x73ED;&#xFF0C;&#x90A3;&#x65F6;&#x5019;&#x7684;&#x4F1A;&#x8BAE;&#x5BA4;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x88AB;&#x9884;&#x8BA2;&#x4E86;&#xFF0C;&#x68CB;&#x76D8;&#x4E0A;&#x7684;&#x8FD9;&#x4E2A;&#x4F4D;&#x7F6E;&#x5DF2;&#x7ECF;&#x88AB;&#x5360;&#x636E;&#x4E86;&#xFF0C;&#x7528;&#x6237;&#x540D;&#x5DF2;&#x7ECF;&#x88AB;&#x62A2;&#x6CE8;&#xFF0C;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x4E0D;&#x591F;&#x4E86;&#xFF09;&#x3002;</p>
</li>
</ol>
<p>&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x53EF;&#x80FD;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x53D1;&#x751F;&#x3002;&#x4F8B;&#x5982;&#x53EF;&#x4EE5;&#x9996;&#x5148;&#x8FDB;&#x884C;&#x5199;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;SELECT&#x67E5;&#x8BE2;&#xFF0C;&#x6700;&#x540E;&#x6839;&#x636E;&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#x51B3;&#x5B9A;&#x662F;&#x653E;&#x5F03;&#x8FD8;&#x662F;&#x63D0;&#x4EA4;&#x3002;</p>
<p>&#x5728;&#x533B;&#x751F;&#x503C;&#x73ED;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5728;&#x6B65;&#x9AA4;3&#x4E2D;&#x4FEE;&#x6539;&#x7684;&#x884C;&#xFF0C;&#x662F;&#x6B65;&#x9AA4;1&#x4E2D;&#x8FD4;&#x56DE;&#x7684;&#x884C;&#x4E4B;&#x4E00;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9501;&#x5B9A;&#x6B65;&#x9AA4;1 &#x4E2D;&#x7684;&#x884C;&#xFF08;<code>SELECT FOR UPDATE</code>&#xFF09;&#x6765;&#x4F7F;&#x4E8B;&#x52A1;&#x5B89;&#x5168;&#x5E76;&#x907F;&#x514D;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x3002;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x56DB;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF1A;&#x5B83;&#x4EEC;&#x68C0;&#x67E5;&#x662F;&#x5426;<strong>&#x4E0D;&#x5B58;&#x5728;</strong>&#x67D0;&#x4E9B;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x884C;&#xFF0C;&#x5199;&#x5165;&#x4F1A;<strong>&#x6DFB;&#x52A0;</strong>&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x76F8;&#x540C;&#x6761;&#x4EF6;&#x7684;&#x884C;&#x3002;&#x5982;&#x679C;&#x6B65;&#x9AA4;1&#x4E2D;&#x7684;&#x67E5;&#x8BE2;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x4EFB;&#x4F55;&#x884C;&#xFF0C;&#x5219;<code>SELECT FOR UPDATE</code>&#x9501;&#x4E0D;&#x4E86;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x6548;&#x5E94;&#xFF1A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x5199;&#x5165;&#x6539;&#x53D8;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x641C;&#x7D22;&#x67E5;&#x8BE2;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x5E7B;&#x8BFB;</strong>&#x3010;3&#x3011;&#x3002;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x907F;&#x514D;&#x4E86;&#x53EA;&#x8BFB;&#x67E5;&#x8BE2;&#x4E2D;&#x5E7B;&#x8BFB;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x50CF;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x4F8B;&#x5B50;&#x90A3;&#x6837;&#x7684;&#x8BFB;&#x5199;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x5E7B;&#x8BFB;&#x4F1A;&#x5BFC;&#x81F4;&#x7279;&#x522B;&#x68D8;&#x624B;&#x7684;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x60C5;&#x51B5;&#x3002;</p>
<h4 id="&#x7269;&#x5316;&#x51B2;&#x7A81;">&#x7269;&#x5316;&#x51B2;&#x7A81;</h4>
<p>&#x5982;&#x679C;&#x5E7B;&#x8BFB;&#x7684;&#x95EE;&#x9898;&#x662F;&#x6CA1;&#x6709;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x52A0;&#x9501;&#xFF0C;&#x4E5F;&#x8BB8;&#x53EF;&#x4EE5;&#x4EBA;&#x4E3A;&#x5730;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x9501;&#x5BF9;&#x8C61;&#xFF1F;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x4F1A;&#x8BAE;&#x5BA4;&#x9884;&#x8BA2;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x65F6;&#x95F4;&#x69FD;&#x548C;&#x623F;&#x95F4;&#x7684;&#x8868;&#x3002;&#x6B64;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x5BF9;&#x5E94;&#x4E8E;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x6BB5;&#xFF08;&#x4F8B;&#x5982;15&#x5206;&#x949F;&#xFF09;&#x7684;&#x7279;&#x5B9A;&#x623F;&#x95F4;&#x3002;&#x53EF;&#x4EE5;&#x63D0;&#x524D;&#x63D2;&#x5165;&#x623F;&#x95F4;&#x548C;&#x65F6;&#x95F4;&#x7684;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7EC4;&#x5408;&#x884C;&#xFF08;&#x4F8B;&#x5982;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x516D;&#x4E2A;&#x6708;&#xFF09;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8981;&#x521B;&#x5EFA;&#x9884;&#x8BA2;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x9501;&#x5B9A;&#xFF08;<code>SELECT FOR UPDATE</code>&#xFF09;&#x8868;&#x4E2D;&#x4E0E;&#x6240;&#x9700;&#x623F;&#x95F4;&#x548C;&#x65F6;&#x95F4;&#x6BB5;&#x5BF9;&#x5E94;&#x7684;&#x884C;&#x3002;&#x5728;&#x83B7;&#x5F97;&#x9501;&#x5B9A;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x91CD;&#x53E0;&#x7684;&#x9884;&#x8BA2;&#x5E76;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x63D2;&#x5165;&#x65B0;&#x7684;&#x9884;&#x8BA2;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8868;&#x5E76;&#x4E0D;&#x662F;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x9884;&#x8BA2;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x2014;&#x2014;&#x5B83;&#x5B8C;&#x5168;&#x5C31;&#x662F;&#x4E00;&#x7EC4;&#x9501;&#xFF0C;&#x7528;&#x4E8E;&#x9632;&#x6B62;&#x540C;&#x65F6;&#x4FEE;&#x6539;&#x540C;&#x4E00;&#x623F;&#x95F4;&#x548C;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x5185;&#x7684;&#x9884;&#x8BA2;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x7269;&#x5316;&#x51B2;&#x7A81;&#xFF08;materializing conflicts&#xFF09;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C06;&#x5E7B;&#x8BFB;&#x53D8;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4E00;&#x7EC4;&#x5177;&#x4F53;&#x884C;&#x4E0A;&#x7684;&#x9501;&#x51B2;&#x7A81;&#x3010;11&#x3011;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5F04;&#x6E05;&#x695A;&#x5982;&#x4F55;&#x7269;&#x5316;&#x51B2;&#x7A81;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#xFF0C;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF0C;&#x800C;&#x8BA9;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x673A;&#x5236;&#x6CC4;&#x6F0F;&#x5230;&#x5E94;&#x7528;&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x5F88;&#x4E11;&#x964B;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x51FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x529E;&#x6CD5;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x7269;&#x5316;&#x51B2;&#x7A81;&#x5E94;&#x88AB;&#x89C6;&#x4E3A;&#x6700;&#x540E;&#x7684;&#x624B;&#x6BB5;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x3002;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;Serializable&#xFF09;</strong> &#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x662F;&#x66F4;&#x53EF;&#x53D6;&#x7684;&#x3002;</p>
<h2 id="&#x53EF;&#x5E8F;&#x5217;&#x5316;">&#x53EF;&#x5E8F;&#x5217;&#x5316;</h2>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x51E0;&#x4E2A;&#x6613;&#x4E8E;&#x51FA;&#x73B0;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x7684;&#x4E8B;&#x52A1;&#x4F8B;&#x5B50;&#x3002;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x548C;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x7EA7;&#x522B;&#x4F1A;&#x963B;&#x6B62;&#x67D0;&#x4E9B;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x963B;&#x6B62;&#x53E6;&#x4E00;&#x4E9B;&#x3002;&#x6211;&#x4EEC;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x7279;&#x522B;&#x68D8;&#x624B;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;<strong>&#x5199;&#x5165;&#x504F;&#x5DEE;</strong>&#x548C;<strong>&#x5E7B;&#x8BFB;</strong>&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x60B2;&#x7684;&#x60C5;&#x51B5;&#xFF1A;</p>
<ul>
<li>&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B9E;&#x73B0;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x201C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x201D;&#x7684;&#x542B;&#x4E49;&#x5929;&#x5DEE;&#x5730;&#x522B;&#xFF09;&#x3002;</li>
<li>&#x5149;&#x68C0;&#x67E5;&#x5E94;&#x7528;&#x4EE3;&#x7801;&#x5F88;&#x96BE;&#x5224;&#x65AD;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x8FD0;&#x884C;&#x662F;&#x5426;&#x5B89;&#x5168;&#x3002; &#x7279;&#x522B;&#x662F;&#x5728;&#x5927;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x5E76;&#x53D1;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x3002;</li>
<li>&#x6CA1;&#x6709;&#x68C0;&#x6D4B;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x7684;&#x597D;&#x5DE5;&#x5177;&#x3002;&#x539F;&#x5219;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x9759;&#x6001;&#x5206;&#x6790;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x5E2E;&#x52A9;&#x3010;26&#x3011;&#xFF0C;&#x4F46;&#x7814;&#x7A76;&#x4E2D;&#x7684;&#x6280;&#x672F;&#x8FD8;&#x6CA1;&#x6CD5;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x3002;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x7684;&#x6D4B;&#x8BD5;&#x662F;&#x5F88;&#x96BE;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x662F;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x7684; &#x2014;&#x2014; &#x53EA;&#x6709;&#x5728;&#x5012;&#x9709;&#x7684;&#x65F6;&#x673A;&#x4E0B;&#x624D;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x65B0;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#x5C31;&#x4E00;&#x76F4;&#x662F;&#x8FD9;&#x6837;&#x4E86;&#xFF0C;&#x5F53;&#x65F6;&#x9996;&#x5148;&#x5F15;&#x5165;&#x4E86;&#x8F83;&#x5F31;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3010;2&#x3011;&#x3002;&#x4E00;&#x76F4;&#x4EE5;&#x6765;&#xFF0C;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x7684;&#x7B54;&#x6848;&#x90FD;&#x5F88;&#x7B80;&#x5355;&#xFF1A;&#x4F7F;&#x7528;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;serializable&#xFF09;</strong> &#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF01;</p>
<p><strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;Serializability&#xFF09;</strong>&#x9694;&#x79BB;&#x901A;&#x5E38;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6700;&#x5F3A;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;&#x5B83;&#x4FDD;&#x8BC1;&#x5373;&#x4F7F;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x6267;&#x884C;&#xFF0C;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x679C;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x5B83;&#x4EEC;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5E76;&#x53D1;&#x6027;&#xFF0C;&#x8FDE;&#x7EED;&#x6328;&#x4E2A;&#x6267;&#x884C;&#x4E00;&#x6837;&#x3002;&#x56E0;&#x6B64;&#x6570;&#x636E;&#x5E93;&#x4FDD;&#x8BC1;&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x5728;&#x5355;&#x72EC;&#x8FD0;&#x884C;&#x65F6;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x5219;&#x5B83;&#x4EEC;&#x5728;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#x65F6;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x6B63;&#x786E; &#x2014;&#x2014; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x9632;&#x6B62;<strong>&#x6240;&#x6709;</strong>&#x53EF;&#x80FD;&#x7684;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x4F46;&#x5982;&#x679C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x6BD4;&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x7684;&#x70C2;&#x644A;&#x5B50;&#x8981;&#x597D;&#x5F97;&#x591A;&#xFF0C;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x6CA1;&#x6709;&#x4EBA;&#x89C1;&#x4EBA;&#x7231;&#xFF1F;&#x4E3A;&#x4E86;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x770B;&#x770B;&#x5B9E;&#x73B0;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x9009;&#x9879;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x6267;&#x884C;&#x3002;&#x76EE;&#x524D;&#x5927;&#x591A;&#x6570;&#x63D0;&#x4F9B;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x6570;&#x636E;&#x5E93;&#x90FD;&#x4F7F;&#x7528;&#x4E86;&#x4E09;&#x79CD;&#x6280;&#x672F;&#x4E4B;&#x4E00;&#xFF0C;&#x672C;&#x7AE0;&#x7684;&#x5269;&#x4F59;&#x90E8;&#x5206;&#x5C06;&#x4F1A;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x3002;</p>
<ul>
<li>&#x5B57;&#x9762;&#x610F;&#x4E49;&#x4E0A;&#x5730;&#x4E32;&#x884C;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x771F;&#x7684;&#x4E32;&#x884C;&#x6267;&#x884C;">&#x771F;&#x7684;&#x4E32;&#x884C;&#x6267;&#x884C;</a>&#x201D;&#xFF09;</li>
<li><strong>&#x4E24;&#x76F8;&#x9501;&#x5B9A;&#xFF08;2PL, two-phase locking&#xFF09;</strong>&#xFF0C;&#x51E0;&#x5341;&#x5E74;&#x6765;&#x552F;&#x4E00;&#x53EF;&#x884C;&#x7684;&#x9009;&#x62E9;&#x3002;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;2PL&#xFF09;">&#x4E24;&#x76F8;&#x9501;&#x5B9A;&#xFF08;2PL&#xFF09;</a>&#x201D;&#xFF09;</li>
<li>&#x4E50;&#x89C2;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x6280;&#x672F;&#xFF0C;&#x4F8B;&#x5982;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;serializable snapshot isolation&#xFF09;</strong>&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x5E8F;&#x5217;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;SSI&#xFF09;">&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;SSI&#xFF09;</a>&#x201D;</li>
</ul>
<p>&#x73B0;&#x5728;&#x5C06;&#x4E3B;&#x8981;&#x5728;&#x5355;&#x8282;&#x70B9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x80CC;&#x666F;&#x4E0B;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#xFF1B;&#x5728;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x5982;&#x4F55;&#x5C06;&#x5B83;&#x4EEC;&#x63A8;&#x5E7F;&#x5230;&#x6D89;&#x53CA;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x4E8B;&#x52A1;&#x3002;</p>
<h4 id="&#x771F;&#x7684;&#x4E32;&#x884C;&#x6267;&#x884C;">&#x771F;&#x7684;&#x4E32;&#x884C;&#x6267;&#x884C;</h4>
<p>&#x907F;&#x514D;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x8981;&#x5E76;&#x53D1;&#xFF1A;&#x5728;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0A;&#x6309;&#x987A;&#x5E8F;&#x4E00;&#x6B21;&#x53EA;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x5C31;&#x5B8C;&#x5168;&#x7ED5;&#x5F00;&#x4E86;&#x68C0;&#x6D4B;/&#x9632;&#x6B62;&#x4E8B;&#x52A1;&#x95F4;&#x51B2;&#x7A81;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7531;&#x6B64;&#x4EA7;&#x751F;&#x7684;&#x9694;&#x79BB;&#xFF0C;&#x6B63;&#x662F;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5B9A;&#x4E49;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x4E3B;&#x610F;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x5E93;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x53EA;&#x662F;&#x5728;2007&#x5E74;&#x5DE6;&#x53F3;&#x624D;&#x51B3;&#x5B9A;&#xFF0C;&#x5355;&#x7EBF;&#x7A0B;&#x5FAA;&#x73AF;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3010;45&#x3011;&#x3002;&#x5982;&#x679C;&#x591A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x5728;&#x8FC7;&#x53BB;&#x7684;30&#x5E74;&#x4E2D;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x6027;&#x80FD;&#x7684;&#x5173;&#x952E;&#x6240;&#x5728;&#xFF0C;&#x90A3;&#x4E48;&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#x6539;&#x53D8;&#x81F4;&#x4F7F;&#x5355;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x53D8;&#x4E3A;&#x53EF;&#x80FD;&#x5462;&#xFF1F;</p>
<p>&#x4E24;&#x4E2A;&#x8FDB;&#x5C55;&#x5F15;&#x53D1;&#x4E86;&#x8FD9;&#x4E2A;&#x53CD;&#x601D;&#xFF1A;</p>
<ul>
<li>RAM&#x8DB3;&#x591F;&#x4FBF;&#x5B9C;&#x4E86;&#xFF0C;&#x8BB8;&#x591A;&#x573A;&#x666F;&#x73B0;&#x5728;&#x90FD;&#x53EF;&#x4EE5;&#x5C06;&#x5B8C;&#x6574;&#x7684;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x96C6;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5B58;&#x50A8;&#x4E00;&#x5207;">&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5B58;&#x50A8;&#x4E00;&#x5207;</a>&#x201D;&#xFF09;&#x3002;&#x5F53;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x8981;&#x6BD4;&#x7B49;&#x5F85;&#x6570;&#x636E;&#x4ECE;&#x78C1;&#x76D8;&#x52A0;&#x8F7D;&#x65F6;&#x5FEB;&#x5F97;&#x591A;&#x3002;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x610F;&#x8BC6;&#x5230;OLTP&#x4E8B;&#x52A1;&#x901A;&#x5E38;&#x5F88;&#x77ED;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x8FDB;&#x884C;&#x5C11;&#x91CF;&#x7684;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch3.html#&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x8FD8;&#x662F;&#x5206;&#x6790;&#xFF1F;">&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x6216;&#x5206;&#x6790;&#xFF1F;</a>&#x201D;&#xFF09;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x5206;&#x6790;&#x67E5;&#x8BE2;&#x901A;&#x5E38;&#x662F;&#x53EA;&#x8BFB;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E32;&#x884C;&#x6267;&#x884C;&#x5FAA;&#x73AF;&#x4E4B;&#x5916;&#x7684;&#x4E00;&#x81F4;&#x5FEB;&#x7167;&#xFF08;&#x4F7F;&#x7528;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF09;&#x4E0A;&#x8FD0;&#x884C;&#x3002;</li>
</ul>
<p>&#x4E32;&#x884C;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#x7684;&#x65B9;&#x6CD5;&#x5728;VoltDB/H-Store&#xFF0C;Redis&#x548C;Datomic&#x4E2D;&#x5B9E;&#x73B0;&#x3010;46,47,48&#x3011;&#x3002;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x5355;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x7CFB;&#x7EDF;&#x6709;&#x65F6;&#x53EF;&#x4EE5;&#x6BD4;&#x652F;&#x6301;&#x5E76;&#x53D1;&#x7684;&#x7CFB;&#x7EDF;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x9501;&#x7684;&#x534F;&#x8C03;&#x5F00;&#x9500;&#x3002;&#x4F46;&#x662F;&#x5176;&#x541E;&#x5410;&#x91CF;&#x4EC5;&#x9650;&#x4E8E;&#x5355;&#x4E2A;CPU&#x6838;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;&#x4E3A;&#x4E86;&#x5145;&#x5206;&#x5229;&#x7528;&#x5355;&#x4E00;&#x7EBF;&#x7A0B;&#xFF0C;&#x9700;&#x8981;&#x4E0E;&#x4F20;&#x7EDF;&#x5F62;&#x5F0F;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x6784;&#x7684;&#x4E8B;&#x52A1;&#x3002;</p>
<h4 id="&#x5728;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C01;&#x88C5;&#x4E8B;&#x52A1;">&#x5728;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C01;&#x88C5;&#x4E8B;&#x52A1;</h4>
<p>&#x200B;    &#x5728;&#x6570;&#x636E;&#x5E93;&#x7684;&#x65E9;&#x671F;&#x9636;&#x6BB5;&#xFF0C;&#x610F;&#x56FE;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x6574;&#x4E2A;&#x7528;&#x6237;&#x6D3B;&#x52A8;&#x6D41;&#x7A0B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x9884;&#x8BA2;&#x673A;&#x7968;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x9636;&#x6BB5;&#x7684;&#x8FC7;&#x7A0B;&#xFF08;&#x641C;&#x7D22;&#x8DEF;&#x7EBF;&#xFF0C;&#x7968;&#x4EF7;&#x548C;&#x53EF;&#x7528;&#x5EA7;&#x4F4D;&#xFF0C;&#x51B3;&#x5B9A;&#x884C;&#x7A0B;&#xFF0C;&#x5728;&#x6BCF;&#x6BB5;&#x884C;&#x7A0B;&#x7684;&#x822A;&#x73ED;&#x4E0A;&#x8BA2;&#x5EA7;&#xFF0C;&#x8F93;&#x5165;&#x4E58;&#x5BA2;&#x4FE1;&#x606F;&#xFF0C;&#x4ED8;&#x6B3E;&#xFF09;&#x3002;&#x6570;&#x636E;&#x5E93;&#x8BBE;&#x8BA1;&#x8005;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x539F;&#x5B50;&#x5316;&#x5730;&#x6267;&#x884C;&#x3002;</p>
<p>&#x200B;    &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4EBA;&#x7C7B;&#x505A;&#x51FA;&#x51B3;&#x5B9A;&#x548C;&#x56DE;&#x5E94;&#x7684;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x7F13;&#x6162;&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x6765;&#x81EA;&#x7528;&#x6237;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5219;&#x6570;&#x636E;&#x5E93;&#x9700;&#x8981;&#x652F;&#x6301;&#x6F5C;&#x5728;&#x7684;&#x5927;&#x91CF;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#xFF0C;&#x5176;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x662F;&#x7A7A;&#x95F2;&#x7684;&#x3002;&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x80FD;&#x9AD8;&#x6548;&#x5B8C;&#x6210;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;OLTP&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x907F;&#x514D;&#x5728;&#x4E8B;&#x52A1;&#x4E2D;&#x7B49;&#x5F85;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x7528;&#x6237;&#x8F93;&#x5165;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x4FDD;&#x6301;&#x4E8B;&#x52A1;&#x7684;&#x7B80;&#x77ED;&#x3002;&#x5728;Web&#x4E0A;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E8B;&#x52A1;&#x5728;&#x540C;&#x4E00;&#x4E2A;HTTP&#x8BF7;&#x6C42;&#x4E2D;&#x88AB;&#x63D0;&#x4EA4;&#x2014;&#x2014;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E0D;&#x4F1A;&#x8DE8;&#x8D8A;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;&#x4E00;&#x4E2A;&#x65B0;&#x7684;HTTP&#x8BF7;&#x6C42;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E8B;&#x52A1;&#x3002;</p>
<p>&#x200B;    &#x5373;&#x4F7F;&#x4EBA;&#x7C7B;&#x5DF2;&#x7ECF;&#x627E;&#x5230;&#x4E86;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#xFF0C;&#x4E8B;&#x52A1;&#x4ECD;&#x7136;&#x4EE5;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x5BA2;&#x6237;&#x7AEF;/&#x670D;&#x52A1;&#x5668;&#x98CE;&#x683C;&#x6267;&#x884C;&#xFF0C;&#x4E00;&#x6B21;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#xFF0C;&#x8BFB;&#x53D6;&#x7ED3;&#x679C;&#xFF0C;&#x53EF;&#x80FD;&#x6839;&#x636E;&#x7B2C;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x53E6;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x67E5;&#x8BE2;&#x548C;&#x7ED3;&#x679C;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#xFF08;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#xFF09;&#x548C;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x5728;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF09;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x53D1;&#x9001;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8FD9;&#x79CD;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x4E8B;&#x52A1;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x8017;&#x8D39;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5141;&#x8BB8;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x5904;&#x7406;&#xFF0C;&#x4E14;&#x4E00;&#x6B21;&#x53EA;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x541E;&#x5410;&#x91CF;&#x5C06;&#x4F1A;&#x975E;&#x5E38;&#x7CDF;&#x7CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x5927;&#x90E8;&#x5206;&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x82B1;&#x8D39;&#x5728;&#x7B49;&#x5F85;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D1;&#x51FA;&#x5F53;&#x524D;&#x4E8B;&#x52A1;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x67E5;&#x8BE2;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x5408;&#x7406;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x9700;&#x8981;&#x540C;&#x65F6;&#x5904;&#x7406;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x3002;</p>
<p>&#x200B;    &#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x5177;&#x6709;&#x5355;&#x7EBF;&#x7A0B;&#x4E32;&#x884C;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7684;&#x7CFB;&#x7EDF;&#x4E0D;&#x5141;&#x8BB8;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x591A;&#x8BED;&#x53E5;&#x4E8B;&#x52A1;&#x3002;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x63D0;&#x524D;&#x5C06;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x4EE3;&#x7801;&#x4F5C;&#x4E3A;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x63D0;&#x4EA4;&#x7ED9;&#x6570;&#x636E;&#x5E93;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x5982;<a href="img/fig7-9.png">&#x56FE;7-9</a> &#x6240;&#x793A;&#x3002;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5219;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x5FEB;&#x5730;&#x6267;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x7B49;&#x5F85;&#x4EFB;&#x4F55;&#x7F51;&#x7EDC;&#x6216;&#x78C1;&#x76D8;I/O&#x3002;</p>
<p><img src="img/fig7-9.png" alt=""></p>
<p><strong>&#x56FE;7-9 &#x4EA4;&#x4E92;&#x5F0F;&#x4E8B;&#x52A1;&#x548C;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#xFF08;&#x4F7F;&#x7528;&#x56FE;7-8&#x7684;&#x793A;&#x4F8B;&#x4E8B;&#x52A1;&#xFF09;</strong></p>
<h4 id="&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;">&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x7684;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;</h4>
<p>&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x5728;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x81EA;1999&#x5E74;&#x4EE5;&#x6765;&#x5B83;&#x4EEC;&#x4E00;&#x76F4;&#x662F;SQL&#x6807;&#x51C6;&#xFF08;SQL/PSM&#xFF09;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x51FA;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x540D;&#x58F0;&#x6709;&#x70B9;&#x4E0D;&#x592A;&#x597D;&#xFF1A;</p>
<ul>
<li>&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5382;&#x5546;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x8BED;&#x8A00;&#xFF08;Oracle&#x6709;PL/SQL&#xFF0C;SQL Server&#x6709;T-SQL&#xFF0C;PostgreSQL&#x6709;PL/pgSQL&#x7B49;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x8BED;&#x8A00;&#x5E76;&#x6CA1;&#x6709;&#x8DDF;&#x4E0A;&#x901A;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x6240;&#x4EE5;&#x4ECE;&#x4ECA;&#x5929;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x5F53;&#x4E11;&#x964B;&#x548C;&#x9648;&#x65E7;&#xFF0C;&#x800C;&#x4E14;&#x7F3A;&#x4E4F;&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x80FD;&#x627E;&#x5230;&#x7684;&#x5E93;&#x7684;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x3002;</li>
<li>&#x4E0E;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x76F8;&#xFF0C;&#x6BD4;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x7BA1;&#x7406;&#x56F0;&#x96BE;&#xFF0C;&#x8C03;&#x8BD5;&#x56F0;&#x96BE;&#xFF0C;&#x7248;&#x672C;&#x63A7;&#x5236;&#x548C;&#x90E8;&#x7F72;&#x8D77;&#x6765;&#x4E5F;&#x66F4;&#x4E3A;&#x5C34;&#x5C2C;&#xFF0C;&#x66F4;&#x96BE;&#x6D4B;&#x8BD5;&#xFF0C;&#x66F4;&#x96BE;&#x548C;&#x7528;&#x4E8E;&#x76D1;&#x63A7;&#x7684;&#x6307;&#x6807;&#x6536;&#x96C6;&#x7CFB;&#x7EDF;&#x76F8;&#x96C6;&#x6210;&#x3002;</li>
<li>&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x6BD4;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x5BF9;&#x6027;&#x80FD;&#x654F;&#x611F;&#x7684;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x4F8B;&#x901A;&#x5E38;&#x7531;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x5171;&#x4EAB;&#x3002;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x4E00;&#x4E2A;&#x5199;&#x5F97;&#x4E0D;&#x597D;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5360;&#x7528;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x6216;CPU&#x65F6;&#x95F4;&#xFF09;&#x4F1A;&#x6BD4;&#x5728;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x9020;&#x6210;&#x66F4;&#x591A;&#x7684;&#x9EBB;&#x70E6;&#x3002;</li>
</ul>
<p>&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x514B;&#x670D;&#x7684;&#x3002;&#x73B0;&#x4EE3;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x5B9E;&#x73B0;&#x653E;&#x5F03;&#x4E86;PL/SQL&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x901A;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF1A;VoltDB&#x4F7F;&#x7528;Java&#x6216;Groovy&#xFF0C;Datomic&#x4F7F;&#x7528;Java&#x6216;Clojure&#xFF0C;&#x800C;Redis&#x4F7F;&#x7528;Lua&#x3002;</p>
<p><strong>&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E0E;&#x5185;&#x5B58;&#x5B58;&#x50A8;</strong>&#xFF0C;&#x4F7F;&#x5F97;&#x5728;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0A;&#x6267;&#x884C;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x53D8;&#x5F97;&#x53EF;&#x884C;&#x3002;&#x7531;&#x4E8E;&#x4E0D;&#x9700;&#x8981;&#x7B49;&#x5F85;I/O&#xFF0C;&#x4E14;&#x907F;&#x514D;&#x4E86;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x673A;&#x5236;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x5355;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0A;&#x5B9E;&#x73B0;&#x76F8;&#x5F53;&#x597D;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>VoltDB&#x8FD8;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x590D;&#x5236;&#xFF1A;&#x4F46;&#x4E0D;&#x662F;&#x5C06;&#x4E8B;&#x52A1;&#x7684;&#x5199;&#x5165;&#x7ED3;&#x679C;&#x4ECE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x590D;&#x5236;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x6267;&#x884C;&#x76F8;&#x540C;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x6B64;VoltDB&#x8981;&#x6C42;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x662F;<strong>&#x786E;&#x5B9A;&#x6027;&#x7684;</strong>&#xFF08;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF09;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5F53;&#x524D;&#x7684;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x95F4;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x7279;&#x6B8A;&#x7684;&#x786E;&#x5B9A;&#x6027;API&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<h4 id="&#x5206;&#x533A;">&#x5206;&#x533A;</h4>
<p>&#x987A;&#x5E8F;&#x6267;&#x884C;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x4F7F;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x7B80;&#x5355;&#x591A;&#x4E86;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E8B;&#x52A1;&#x541E;&#x5410;&#x91CF;&#x88AB;&#x9650;&#x5236;&#x4E3A;&#x5355;&#x673A;&#x5355;&#x6838;&#x7684;&#x901F;&#x5EA6;&#x3002;&#x53EA;&#x8BFB;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x5728;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x5BF9;&#x4E8E;&#x5199;&#x5165;&#x541E;&#x5410;&#x91CF;&#x8F83;&#x9AD8;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5355;&#x7EBF;&#x7A0B;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x5668;&#x53EF;&#x80FD;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x4E25;&#x91CD;&#x7684;&#x74F6;&#x9888;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4F38;&#x7F29;&#x81F3;&#x591A;&#x4E2A;CPU&#x6838;&#x5FC3;&#x548C;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF08;&#x53C2;&#x89C1;<a href="ch6.html">&#x7B2C;6&#x7AE0;</a>&#xFF09;&#xFF0C;&#x5728;VoltDB&#x4E2D;&#x652F;&#x6301;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x5BF9;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x5206;&#x533A;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5355;&#x4E2A;&#x5206;&#x533A;&#x4E2D;&#x8BFB;&#x5199;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x5C31;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x81EA;&#x5DF1;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x7EBF;&#x7A0B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x53EF;&#x4EE5;&#x4E3A;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x6307;&#x6D3E;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;CPU&#x6838;&#xFF0C;&#x4E8B;&#x52A1;&#x541E;&#x5410;&#x91CF;&#x5C31;&#x53EF;&#x4EE5;&#x4E0E;CPU&#x6838;&#x6570;&#x4FDD;&#x6301;&#x7EBF;&#x6027;&#x4F38;&#x7F29;&#x3010;47&#x3011;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x591A;&#x4E2A;&#x5206;&#x533A;&#x7684;&#x4EFB;&#x4F55;&#x4E8B;&#x52A1;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x5728;&#x89E6;&#x53CA;&#x7684;&#x6240;&#x6709;&#x5206;&#x533A;&#x4E4B;&#x95F4;&#x534F;&#x8C03;&#x4E8B;&#x52A1;&#x3002;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x8DE8;&#x8D8A;&#x6240;&#x6709;&#x5206;&#x533A;&#x9501;&#x5B9A;&#x6267;&#x884C;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x4E32;&#x884C;&#x6027;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8DE8;&#x5206;&#x533A;&#x4E8B;&#x52A1;&#x5177;&#x6709;&#x989D;&#x5916;&#x7684;&#x534F;&#x8C03;&#x5F00;&#x9500;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x6BD4;&#x5355;&#x5206;&#x533A;&#x4E8B;&#x52A1;&#x6162;&#x5F97;&#x591A;&#x3002; VoltDB&#x62A5;&#x544A;&#x7684;&#x541E;&#x5410;&#x91CF;&#x5927;&#x7EA6;&#x662F;&#x6BCF;&#x79D2;1000&#x4E2A;&#x8DE8;&#x5206;&#x533A;&#x5199;&#x5165;&#xFF0C;&#x6BD4;&#x5355;&#x5206;&#x533A;&#x541E;&#x5410;&#x91CF;&#x4F4E;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x673A;&#x5668;&#x6765;&#x589E;&#x52A0;&#x3010;49&#x3011;&#x3002;</p>
<p>&#x4E8B;&#x52A1;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x662F;&#x5212;&#x5206;&#x81F3;&#x5355;&#x4E2A;&#x5206;&#x533A;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x6570;&#x636E;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x7B80;&#x5355;&#x7684;&#x952E;&#x503C;&#x6570;&#x636E;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5730;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x4F46;&#x662F;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x8DE8;&#x5206;&#x533A;&#x534F;&#x8C03;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch6.html#&#x5206;&#x7247;&#x4E0E;&#x6B21;&#x7EA7;&#x7D22;&#x5F15;">&#x5206;&#x7247;&#x4E0E;&#x6B21;&#x7EA7;&#x7D22;&#x5F15;</a>&#x201D;&#xFF09;&#x3002;</p>
<h4 id="&#x4E32;&#x884C;&#x6267;&#x884C;&#x5C0F;&#x7ED3;">&#x4E32;&#x884C;&#x6267;&#x884C;&#x5C0F;&#x7ED3;</h4>
<p>&#x5728;&#x7279;&#x5B9A;&#x7EA6;&#x675F;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x771F;&#x7684;&#x4E32;&#x884C;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#xFF0C;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7B49;&#x7EA7;&#x7684;&#x53EF;&#x884C;&#x529E;&#x6CD5;&#x3002;</p>
<ul>
<li>&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x90FD;&#x5FC5;&#x987B;&#x5C0F;&#x800C;&#x5FEB;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x7F13;&#x6162;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x5C31;&#x4F1A;&#x62D6;&#x6162;&#x6240;&#x6709;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x3002;</li>
<li>&#x4EC5;&#x9650;&#x4E8E;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x96C6;&#x53EF;&#x4EE5;&#x653E;&#x5165;&#x5185;&#x5B58;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5F88;&#x5C11;&#x8BBF;&#x95EE;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x79FB;&#x52A8;&#x5230;&#x78C1;&#x76D8;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x9700;&#x8981;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x4E8B;&#x52A1;&#x4E2D;&#x8BBF;&#x95EE;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6162;<sup><a href="#fn_x" id="reffn_x">x</a></sup>&#x3002;</li>
<li>&#x5199;&#x5165;&#x541E;&#x5410;&#x91CF;&#x5FC5;&#x987B;&#x4F4E;&#x5230;&#x80FD;&#x5728;&#x5355;&#x4E2A;CPU&#x6838;&#x4E0A;&#x5904;&#x7406;&#xFF0C;&#x5982;&#x82E5;&#x4E0D;&#x7136;&#xFF0C;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x80FD;&#x5212;&#x5206;&#x81F3;&#x5355;&#x4E2A;&#x5206;&#x533A;&#xFF0C;&#x4E14;&#x4E0D;&#x9700;&#x8981;&#x8DE8;&#x5206;&#x533A;&#x534F;&#x8C03;&#x3002;</li>
<li>&#x8DE8;&#x5206;&#x533A;&#x4E8B;&#x52A1;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x4F7F;&#x7528;&#x7A0B;&#x5EA6;&#x6709;&#x5F88;&#x5927;&#x7684;&#x9650;&#x5236;&#x3002;</li>
</ul>
<blockquote id="fn_x">
<sup>x</sup>. &#x5982;&#x679C;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x4E0D;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x662F;&#x4E2D;&#x6B62;&#x4E8B;&#x52A1;&#xFF0C;&#x5F02;&#x6B65;&#x5730;&#x5C06;&#x6570;&#x636E;&#x63D0;&#x53D6;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x540C;&#x65F6;&#x7EE7;&#x7EED;&#x5904;&#x7406;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6570;&#x636E;&#x52A0;&#x8F7D;&#x5B8C;&#x6BD5;&#x65F6;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x4E8B;&#x52A1;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x53CD;&#x7F13;&#x5B58;&#xFF08;anti-caching&#xFF09;</strong>&#xFF0C;&#x6B63;&#x5982;&#x524D;&#x9762;&#x5728;&#x7B2C;88&#x9875;&#x201C;&#x5C06;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x4FDD;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x201D;&#x4E2D;&#x6240;&#x8FF0;&#x3002;<a href="#reffn_x" title="Jump back to footnote [x] in the text."> &#x21A9;</a>
</blockquote>
<h3 id="&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;2pl&#xFF09;">&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;2PL&#xFF09;</h3>
<p>&#x5927;&#x7EA6;30&#x5E74;&#x6765;&#xFF0C;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x7B97;&#x6CD5;&#xFF1A;<strong>&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;2PL&#xFF0C;two-phase locking&#xFF09;</strong> <sup><a href="#fn_xi" id="reffn_xi">xi</a></sup></p>
<blockquote id="fn_xi">
<sup>xi</sup>. &#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x4E25;&#x683C;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;SS2PL, strict two-phase locking&#xFF09;</strong>&#xFF0C;&#x4EE5;&#x4FBF;&#x548C;&#x5176;&#x4ED6;2PL&#x53D8;&#x4F53;&#x533A;&#x5206;&#x3002;<a href="#reffn_xi" title="Jump back to footnote [xi] in the text."> &#x21A9;</a>
</blockquote>
<blockquote>
<h4 id="2pl&#x4E0D;&#x662F;2pc">2PL&#x4E0D;&#x662F;2PC</h4>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x867D;&#x7136;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;2PL&#xFF09;&#x542C;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#xFF08;2PC&#xFF09;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7B2C;9&#x7AE0;&#x8BA8;&#x8BBA;2PC&#x3002;</p>
</blockquote>
<p>&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x9501;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x9632;&#x6B62;&#x810F;&#x5199;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="&#x6CA1;&#x6709;&#x810F;&#x5199;">&#x6CA1;&#x6709;&#x810F;&#x5199;</a>&#x201D;&#x4E00;&#x8282;&#xFF09;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x5C1D;&#x8BD5;&#x5199;&#x5165;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x9501;&#x53EF;&#x786E;&#x4FDD;&#x7B2C;&#x4E8C;&#x4E2A;&#x5199;&#x5165;&#x5FC5;&#x987B;&#x7B49;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x5199;&#x5165;&#x5B8C;&#x6210;&#x4E8B;&#x52A1;&#xFF08;&#x4E2D;&#x6B62;&#x6216;&#x63D0;&#x4EA4;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x3002;</p>
<p>&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x5B9A;&#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x4F7F;&#x9501;&#x7684;&#x8981;&#x6C42;&#x66F4;&#x5F3A;&#x3002;&#x53EA;&#x8981;&#x6CA1;&#x6709;&#x5199;&#x5165;&#xFF0C;&#x5C31;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x8BFB;&#x53D6;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;&#x4F46;&#x5BF9;&#x8C61;&#x53EA;&#x8981;&#x6709;&#x5199;&#x5165;&#xFF08;&#x4FEE;&#x6539;&#x6216;&#x5220;&#x9664;&#xFF09;&#xFF0C;&#x5C31;&#x9700;&#x8981;<strong>&#x72EC;&#x5360;&#x8BBF;&#x95EE;&#xFF08;exclusive access&#xFF09;</strong> &#x6743;&#x9650;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;A&#x8BFB;&#x53D6;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x4E8B;&#x52A1;B&#x60F3;&#x8981;&#x5199;&#x5165;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;B&#x5FC5;&#x987B;&#x7B49;&#x5230;A&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x3002; &#xFF08;&#x8FD9;&#x786E;&#x4FDD;B&#x4E0D;&#x80FD;&#x5728;A&#x5E95;&#x4E0B;&#x610F;&#x5916;&#x5730;&#x6539;&#x53D8;&#x5BF9;&#x8C61;&#x3002;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;A&#x5199;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x4E8B;&#x52A1;B&#x60F3;&#x8981;&#x8BFB;&#x53D6;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;B&#x5FC5;&#x987B;&#x7B49;&#x5230;A&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x3002; &#xFF08;&#x50CF;<a href="">&#x56FE;7-1</a>&#x90A3;&#x6837;&#x8BFB;&#x53D6;&#x65E7;&#x7248;&#x672C;&#x7684;&#x5BF9;&#x8C61;&#x5728;2PL&#x4E0B;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x3002;&#xFF09;</li>
</ul>
<p>&#x5728;2PL&#x4E2D;&#xFF0C;&#x5199;&#x5165;&#x4E0D;&#x4EC5;&#x4F1A;&#x963B;&#x585E;&#x5176;&#x4ED6;&#x5199;&#x5165;&#xFF0C;&#x4E5F;&#x4F1A;&#x963B;&#x585E;&#x8BFB;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x4F7F;&#x5F97;<strong>&#x8BFB;&#x4E0D;&#x963B;&#x585E;&#x5199;&#xFF0C;&#x5199;&#x4E5F;&#x4E0D;&#x963B;&#x585E;&#x8BFB;</strong>&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x5B9E;&#x73B0;&#x5FEB;&#x7167;&#x9694;&#x79BB;">&#x5B9E;&#x73B0;&#x5FEB;&#x7167;&#x9694;&#x79BB;</a>&#x201D;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;2PL&#x548C;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x952E;&#x533A;&#x522B;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x56E0;&#x4E3A;2PL&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x65E9;&#x5148;&#x8BA8;&#x8BBA;&#x7684;&#x6240;&#x6709;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF0C;&#x5305;&#x62EC;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#x548C;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x3002;</p>
<h4 id="&#x5B9E;&#x73B0;&#x4E24;&#x9636;&#x6BB5;&#x9501;">&#x5B9E;&#x73B0;&#x4E24;&#x9636;&#x6BB5;&#x9501;</h4>
<p>2PL&#x7528;&#x4E8E;MySQL&#xFF08;InnoDB&#xFF09;&#x548C;SQL Server&#x4E2D;&#x7684;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x4EE5;&#x53CA;DB2&#x4E2D;&#x7684;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3010;23,36&#x3011;&#x3002;</p>
<p>&#x8BFB;&#x4E0E;&#x5199;&#x7684;&#x963B;&#x585E;&#x662F;&#x901A;&#x8FC7;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x6DFB;&#x52A0;&#x9501;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x9501;&#x53EF;&#x4EE5;&#x5904;&#x4E8E;<strong>&#x5171;&#x4EAB;&#x6A21;&#x5F0F;&#xFF08;shared mode&#xFF09;</strong>&#x6216;<strong>&#x72EC;&#x5360;&#x6A21;&#x5F0F;&#xFF08;exclusive mode&#xFF09;</strong>&#x3002;&#x9501;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x82E5;&#x4E8B;&#x52A1;&#x8981;&#x8BFB;&#x53D6;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x987B;&#x5148;&#x4EE5;&#x5171;&#x4EAB;&#x6A21;&#x5F0F;&#x83B7;&#x53D6;&#x9501;&#x3002;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x6301;&#x6709;&#x5171;&#x4EAB;&#x9501;&#x3002;&#x4F46;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x5728;&#x5BF9;&#x8C61;&#x4E0A;&#x6301;&#x6709;&#x6392;&#x5B83;&#x9501;&#xFF0C;&#x5219;&#x8FD9;&#x4E9B;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x3002;</li>
<li>&#x82E5;&#x4E8B;&#x52A1;&#x8981;&#x5199;&#x5165;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x4EE5;&#x72EC;&#x5360;&#x6A21;&#x5F0F;&#x83B7;&#x53D6;&#x8BE5;&#x9501;&#x3002;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x6301;&#x6709;&#x9501;&#xFF08;&#x65E0;&#x8BBA;&#x662F;&#x5171;&#x4EAB;&#x6A21;&#x5F0F;&#x8FD8;&#x662F;&#x72EC;&#x5360;&#x6A21;&#x5F0F;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x5BF9;&#x8C61;&#x4E0A;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x9501;&#xFF0C;&#x8BE5;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x5148;&#x8BFB;&#x53D6;&#x518D;&#x5199;&#x5165;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x5C06;&#x5176;&#x5171;&#x4EAB;&#x9501;&#x5347;&#x7EA7;&#x4E3A;&#x72EC;&#x5360;&#x9501;&#x3002;&#x5347;&#x7EA7;&#x9501;&#x7684;&#x5DE5;&#x4F5C;&#x4E0E;&#x76F4;&#x63A5;&#x83B7;&#x5F97;&#x6392;&#x4ED6;&#x9501;&#x76F8;&#x540C;&#x3002;</li>
<li>&#x4E8B;&#x52A1;&#x83B7;&#x5F97;&#x9501;&#x4E4B;&#x540E;&#xFF0C;&#x5FC5;&#x987B;&#x7EE7;&#x7EED;&#x6301;&#x6709;&#x9501;&#x76F4;&#x5230;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#xFF08;&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#xFF09;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x201C;&#x4E24;&#x9636;&#x6BB5;&#x201D;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x7684;&#x6765;&#x6E90;&#xFF1A;&#x7B2C;&#x4E00;&#x9636;&#x6BB5;&#xFF08;&#x5F53;&#x4E8B;&#x52A1;&#x6B63;&#x5728;&#x6267;&#x884C;&#x65F6;&#xFF09;&#x83B7;&#x53D6;&#x9501;&#xFF0C;&#x7B2C;&#x4E8C;&#x9636;&#x6BB5;&#xFF08;&#x5728;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x65F6;&#xFF09;&#x91CA;&#x653E;&#x6240;&#x6709;&#x7684;&#x9501;&#x3002;</li>
</ul>
<p>&#x7531;&#x4E8E;&#x4F7F;&#x7528;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#x7684;&#x9501;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#xFF1A;&#x4E8B;&#x52A1;A&#x7B49;&#x5F85;&#x4E8B;&#x52A1;B&#x91CA;&#x653E;&#x5B83;&#x7684;&#x9501;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EB;&#x505A;<strong>&#x6B7B;&#x9501;&#xFF08;Deadlock&#xFF09;</strong>&#x3002;&#x6570;&#x636E;&#x5E93;&#x4F1A;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x4E8B;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x6B7B;&#x9501;&#xFF0C;&#x5E76;&#x4E2D;&#x6B62;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x4EE5;&#x4FBF;&#x53E6;&#x4E00;&#x4E2A;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x88AB;&#x4E2D;&#x6B62;&#x7684;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x91CD;&#x8BD5;&#x3002;</p>
<h4 id="&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x7684;&#x6027;&#x80FD;">&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x7684;&#x6027;&#x80FD;</h4>
<p>&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x7684;&#x5DE8;&#x5927;&#x7F3A;&#x70B9;&#xFF0C;&#x4EE5;&#x53CA;70&#x5E74;&#x4EE3;&#x4EE5;&#x6765;&#x6CA1;&#x6709;&#x88AB;&#x6240;&#x6709;&#x4EBA;&#x4F7F;&#x7528;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x662F;&#x5176;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x3002;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x4E0B;&#x7684;&#x4E8B;&#x52A1;&#x541E;&#x5410;&#x91CF;&#x4E0E;&#x67E5;&#x8BE2;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x8981;&#x6BD4;&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E0B;&#x8981;&#x5DEE;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x7531;&#x4E8E;&#x83B7;&#x53D6;&#x548C;&#x91CA;&#x653E;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x9501;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x4F46;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7531;&#x4E8E;&#x5E76;&#x53D1;&#x6027;&#x7684;&#x964D;&#x4F4E;&#x3002;&#x6309;&#x7167;&#x8BBE;&#x8BA1;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x8BD5;&#x56FE;&#x505A;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x53E6;&#x4E00;&#x4E2A;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x4F20;&#x7EDF;&#x7684;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x9650;&#x5236;&#x4E8B;&#x52A1;&#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x4E3A;&#x7B49;&#x5F85;&#x4EBA;&#x7C7B;&#x8F93;&#x5165;&#x7684;&#x4EA4;&#x4E92;&#x5F0F;&#x5E94;&#x7528;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x65F6;&#xFF0C;&#x7B49;&#x5F85;&#x7684;&#x65F6;&#x957F;&#x5E76;&#x6CA1;&#x6709;&#x9650;&#x5236;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x4FDD;&#x8BC1;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x52A1;&#x90FD;&#x5F88;&#x77ED;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x60F3;&#x8981;&#x8BBF;&#x95EE;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x4F1A;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x961F;&#x5217;&#xFF0C;&#x6240;&#x4EE5;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x51E0;&#x4E2A;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x8FD0;&#x884C;2PL&#x7684;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x76F8;&#x5F53;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x4E2D;&#x5B58;&#x5728;&#x4E89;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x9AD8;&#x767E;&#x5206;&#x4F4D;&#x70B9;&#x5904;&#x7684;&#x54CD;&#x5E94;&#x4F1A;&#x975E;&#x5E38;&#x7684;&#x6162;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch1.html#&#x63CF;&#x8FF0;&#x6027;&#x80FD;">&#x63CF;&#x8FF0;&#x6027;&#x80FD;</a>&#x201D;&#xFF09;&#x3002;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7F13;&#x6162;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x8BBF;&#x95EE;&#x5927;&#x91CF;&#x6570;&#x636E;&#x5E76;&#x83B7;&#x53D6;&#x8BB8;&#x591A;&#x9501;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x5C31;&#x80FD;&#x628A;&#x7CFB;&#x7EDF;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x62D6;&#x6162;&#xFF0C;&#x751A;&#x81F3;&#x8FEB;&#x4F7F;&#x7CFB;&#x7EDF;&#x505C;&#x673A;&#x3002;&#x5F53;&#x9700;&#x8981;&#x7A33;&#x5065;&#x7684;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x4E0D;&#x7A33;&#x5B9A;&#x6027;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x9501;&#x5B9E;&#x73B0;&#x7684;&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x6B7B;&#x9501;&#xFF0C;&#x4F46;&#x5728;&#x57FA;&#x4E8E;2PL&#x5B9E;&#x73B0;&#x7684;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7E41;&#x7684;&#x591A;&#xFF08;&#x53D6;&#x51B3;&#x4E8E;&#x4E8B;&#x52A1;&#x7684;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#xFF09;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF1A;&#x5F53;&#x4E8B;&#x52A1;&#x7531;&#x4E8E;&#x6B7B;&#x9501;&#x800C;&#x88AB;&#x4E2D;&#x6B62;&#x5E76;&#x88AB;&#x91CD;&#x8BD5;&#x65F6;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4ECE;&#x5934;&#x91CD;&#x505A;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x6B7B;&#x9501;&#x5F88;&#x9891;&#x7E41;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x5DE8;&#x5927;&#x7684;&#x6D6A;&#x8D39;&#x3002;</p>
<h4 id="&#x8C13;&#x8BCD;&#x9501;">&#x8C13;&#x8BCD;&#x9501;</h4>
<p>&#x5728;&#x524D;&#x9762;&#x5173;&#x4E8E;&#x9501;&#x7684;&#x63CF;&#x8FF0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x63A9;&#x76D6;&#x4E86;&#x4E00;&#x4E2A;&#x5FAE;&#x5999;&#x800C;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5728;&#x201C;<a href="#&#x5BFC;&#x81F4;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x7684;&#x5E7B;&#x8BFB;">&#x5BFC;&#x81F4;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x7684;&#x5E7B;&#x8BFB;</a>&#x201D;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;<strong>&#x5E7B;&#x8BFB;&#xFF08;phantoms&#xFF09;</strong>&#x7684;&#x95EE;&#x9898;&#x3002;&#x5373;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6539;&#x53D8;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x641C;&#x7D22;&#x67E5;&#x8BE2;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5177;&#x6709;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x9632;&#x6B62;<strong>&#x5E7B;&#x8BFB;</strong>&#x3002;</p>
<p>&#x5728;&#x4F1A;&#x8BAE;&#x5BA4;&#x9884;&#x8BA2;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#x5185;&#x641C;&#x7D22;&#x4E86;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x7684;&#x73B0;&#x6709;&#x9884;&#x8BA2;&#xFF08;&#x89C1;<a href="">&#x4F8B;7-2</a>&#xFF09;&#xFF0C;&#x5219;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x63D2;&#x5165;&#x6216;&#x66F4;&#x65B0;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x7A97;&#x53E3;&#x4E0E;&#x540C;&#x4E00;&#x623F;&#x95F4;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x9884;&#x8BA2; &#xFF08;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x63D2;&#x5165;&#x5176;&#x4ED6;&#x623F;&#x95F4;&#x7684;&#x9884;&#x8BA2;&#xFF0C;&#x6216;&#x5728;&#x4E0D;&#x5F71;&#x54CD;&#x53E6;&#x4E00;&#x4E2A;&#x9884;&#x5B9A;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x9884;&#x5B9A;&#x540C;&#x4E00;&#x623F;&#x95F4;&#x7684;&#x5176;&#x4ED6;&#x65F6;&#x95F4;&#x6BB5;&#xFF09;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF1F;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;<strong>&#x8C13;&#x8BCD;&#x9501;&#xFF08;predicate lock&#xFF09;</strong>&#x3010;3&#x3011;&#x3002;&#x5B83;&#x7C7B;&#x4F3C;&#x4E8E;&#x524D;&#x9762;&#x63CF;&#x8FF0;&#x7684;&#x5171;&#x4EAB;/&#x6392;&#x5B83;&#x9501;&#xFF0C;&#x4F46;&#x4E0D;&#x5C5E;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8868;&#x4E2D;&#x7684;&#x4E00;&#x884C;&#xFF09;&#xFF0C;&#x5B83;&#x5C5E;&#x4E8E;&#x6240;&#x6709;&#x7B26;&#x5408;&#x67D0;&#x4E9B;&#x641C;&#x7D22;&#x6761;&#x4EF6;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">SELECT</span> * <span class="hljs-keyword">FROM</span> bookings
<span class="hljs-keyword">WHERE</span> room_id = <span class="hljs-number">123</span> <span class="hljs-keyword">AND</span>
      end_time &gt; <span class="hljs-string">&apos;2018-01-01 12:00&apos;</span> <span class="hljs-keyword">AND</span> 
      start_time &lt; <span class="hljs-string">&apos;2018-01-01 13:00&apos;</span>;
</code></pre>
<p>&#x8C13;&#x8BCD;&#x9501;&#x9650;&#x5236;&#x8BBF;&#x95EE;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;A&#x60F3;&#x8981;&#x8BFB;&#x53D6;&#x5339;&#x914D;&#x67D0;&#x4E9B;&#x6761;&#x4EF6;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x8FD9;&#x4E2A; <code>SELECT</code> &#x67E5;&#x8BE2;&#x4E2D;&#x90A3;&#x6837;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x83B7;&#x53D6;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x4E0A;&#x7684;<strong>&#x5171;&#x4EAB;&#x8C13;&#x8BCD;&#x9501;&#xFF08;shared-mode predicate lock&#xFF09;</strong>&#x3002;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;B&#x6301;&#x6709;&#x4EFB;&#x4F55;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E00;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x5BF9;&#x8C61;&#x7684;&#x6392;&#x5B83;&#x9501;&#xFF0C;&#x90A3;&#x4E48;A&#x5FC5;&#x987B;&#x7B49;&#x5230;B&#x91CA;&#x653E;&#x5B83;&#x7684;&#x9501;&#x4E4B;&#x540E;&#x624D;&#x5141;&#x8BB8;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E8B;&#x52A1;A&#x60F3;&#x8981;&#x63D2;&#x5165;&#xFF0C;&#x66F4;&#x65B0;&#x6216;&#x5220;&#x9664;&#x4EFB;&#x4F55;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x68C0;&#x67E5;&#x65E7;&#x503C;&#x6216;&#x65B0;&#x503C;&#x662F;&#x5426;&#x4E0E;&#x4EFB;&#x4F55;&#x73B0;&#x6709;&#x7684;&#x8C13;&#x8BCD;&#x9501;&#x5339;&#x914D;&#x3002;&#x5982;&#x679C;&#x4E8B;&#x52A1;B&#x6301;&#x6709;&#x5339;&#x914D;&#x7684;&#x8C13;&#x8BCD;&#x9501;&#xFF0C;&#x90A3;&#x4E48;A&#x5FC5;&#x987B;&#x7B49;&#x5230;B&#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#x540E;&#x624D;&#x80FD;&#x7EE7;&#x7EED;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x91CC;&#x7684;&#x5173;&#x952E;&#x601D;&#x60F3;&#x662F;&#xFF0C;&#x8C13;&#x8BCD;&#x9501;&#x751A;&#x81F3;&#x9002;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5C1A;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x5C06;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x6DFB;&#x52A0;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x5E7B;&#x8C61;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x5305;&#x542B;&#x8C13;&#x8BCD;&#x9501;&#xFF0C;&#x5219;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x963B;&#x6B62;&#x6240;&#x6709;&#x5F62;&#x5F0F;&#x7684;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x548C;&#x5176;&#x4ED6;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x9694;&#x79BB;&#x5B9E;&#x73B0;&#x4E86;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x3002;</p>
<h4 id="&#x7D22;&#x5F15;&#x8303;&#x56F4;&#x9501;">&#x7D22;&#x5F15;&#x8303;&#x56F4;&#x9501;</h4>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#x8C13;&#x8BCD;&#x9501;&#x6027;&#x80FD;&#x4E0D;&#x4F73;&#xFF1A;<strong>&#x5982;&#x679C;&#x6D3B;&#x8DC3;&#x4E8B;&#x52A1;&#x6301;&#x6709;&#x5F88;&#x591A;&#x9501;&#xFF0C;&#x68C0;&#x67E5;&#x5339;&#x914D;&#x7684;&#x9501;&#x4F1A;&#x975E;&#x5E38;&#x8017;&#x65F6;&#x3002;</strong>&#x56E0;&#x6B64;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4F7F;&#x7528;2PL&#x7684;&#x6570;&#x636E;&#x5E93;&#x5B9E;&#x9645;&#x4E0A;&#x5B9E;&#x73B0;&#x4E86;&#x7D22;&#x5F15;&#x8303;&#x56F4;&#x9501;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x95F4;&#x9699;&#x9501;&#xFF08;next-key locking&#xFF09;</strong>&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x7684;&#x8FD1;&#x4F3C;&#x7248;&#x8C13;&#x8BCD;&#x9501;&#x3010;41,50&#x3011;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x4F7F;&#x8C13;&#x8BCD;&#x5339;&#x914D;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x96C6;&#x5408;&#x6765;&#x7B80;&#x5316;&#x8C13;&#x8BCD;&#x9501;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5728;&#x4E2D;&#x5348;&#x548C;&#x4E0B;&#x5348;1&#x70B9;&#x4E4B;&#x95F4;&#x9884;&#x8BA2;123&#x53F7;&#x623F;&#x95F4;&#x7684;&#x8C13;&#x8BCD;&#x9501;&#xFF0C;&#x5219;&#x9501;&#x5B9A;123&#x53F7;&#x623F;&#x95F4;&#x7684;&#x6240;&#x6709;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x6216;&#x8005;&#x9501;&#x5B9A;12:00~13:00&#x65F6;&#x95F4;&#x6BB5;&#x7684;&#x6240;&#x6709;&#x623F;&#x95F4;&#xFF08;&#x4E0D;&#x53EA;&#x662F;123&#x53F7;&#x623F;&#x95F4;&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x7684;&#x8FD1;&#x4F3C;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x6EE1;&#x8DB3;&#x539F;&#x59CB;&#x8C13;&#x8BCD;&#x7684;&#x5199;&#x5165;&#x4E5F;&#x4E00;&#x5B9A;&#x4F1A;&#x6EE1;&#x8DB3;&#x8FD9;&#x79CD;&#x66F4;&#x677E;&#x6563;&#x7684;&#x8FD1;&#x4F3C;&#x3002;</p>
<p>&#x5728;&#x623F;&#x95F4;&#x9884;&#x8BA2;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x5728;<code>room_id</code>&#x5217;&#x4E0A;&#x6709;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;&#x5E76;&#x4E14;/&#x6216;&#x8005;&#x5728;<code>start_time</code> &#x548C; <code>end_time</code>&#x4E0A;&#x6709;&#x7D22;&#x5F15;&#xFF08;&#x5426;&#x5219;&#x524D;&#x9762;&#x7684;&#x67E5;&#x8BE2;&#x5728;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x7684;&#x901F;&#x5EA6;&#x4F1A;&#x975E;&#x5E38;&#x6162;&#xFF09;&#xFF1A;</p>
<ul>
<li>&#x5047;&#x8BBE;&#x60A8;&#x7684;&#x7D22;&#x5F15;&#x4F4D;&#x4E8E;<code>room_id</code>&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x6B64;&#x7D22;&#x5F15;&#x67E5;&#x627E;123&#x53F7;&#x623F;&#x95F4;&#x7684;&#x73B0;&#x6709;&#x9884;&#x8BA2;&#x3002;&#x73B0;&#x5728;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5171;&#x4EAB;&#x9501;&#x9644;&#x52A0;&#x5230;&#x8FD9;&#x4E2A;&#x7D22;&#x5F15;&#x9879;&#x4E0A;&#xFF0C;&#x6307;&#x793A;&#x4E8B;&#x52A1;&#x5DF2;&#x641C;&#x7D22;123&#x53F7;&#x623F;&#x95F4;&#x7528;&#x4E8E;&#x9884;&#x8BA2;&#x3002;</li>
<li>&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x65F6;&#x95F4;&#x7684;&#x7D22;&#x5F15;&#x6765;&#x67E5;&#x627E;&#x73B0;&#x6709;&#x9884;&#x8BA2;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x53EF;&#x4EE5;&#x5C06;&#x5171;&#x4EAB;&#x9501;&#x9644;&#x52A0;&#x5230;&#x8BE5;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x503C;&#xFF0C;&#x6307;&#x793A;&#x4E8B;&#x52A1;&#x5DF2;&#x7ECF;&#x5C06;12:00~13:00&#x65F6;&#x95F4;&#x6BB5;&#x6807;&#x8BB0;&#x4E3A;&#x7528;&#x4E8E;&#x9884;&#x5B9A;&#x3002;</li>
</ul>
<p>&#x65E0;&#x8BBA;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x641C;&#x7D22;&#x6761;&#x4EF6;&#x7684;&#x8FD1;&#x4F3C;&#x503C;&#x90FD;&#x9644;&#x52A0;&#x5230;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E0A;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5982;&#x679C;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x60F3;&#x8981;&#x63D2;&#x5165;&#xFF0C;&#x66F4;&#x65B0;&#x6216;&#x5220;&#x9664;&#x540C;&#x4E00;&#x4E2A;&#x623F;&#x95F4;&#x548C;/&#x6216;&#x91CD;&#x53E0;&#x65F6;&#x95F4;&#x6BB5;&#x7684;&#x9884;&#x8BA2;&#xFF0C;&#x5219;&#x5B83;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x66F4;&#x65B0;&#x7D22;&#x5F15;&#x7684;&#x76F8;&#x540C;&#x90E8;&#x5206;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B83;&#x4F1A;&#x9047;&#x5230;&#x5171;&#x4EAB;&#x9501;&#xFF0C;&#x5B83;&#x5C06;&#x88AB;&#x8FEB;&#x7B49;&#x5230;&#x9501;&#x88AB;&#x91CA;&#x653E;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x80FD;&#x591F;&#x6709;&#x6548;&#x9632;&#x6B62;&#x5E7B;&#x8BFB;&#x548C;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x3002;&#x7D22;&#x5F15;&#x8303;&#x56F4;&#x9501;&#x5E76;&#x4E0D;&#x50CF;&#x8C13;&#x8BCD;&#x9501;&#x90A3;&#x6837;&#x7CBE;&#x786E;&#xFF08;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x9501;&#x5B9A;&#x66F4;&#x5927;&#x8303;&#x56F4;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7EF4;&#x6301;&#x53EF;&#x4E32;&#x884C;&#x5316;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x8303;&#x56F4;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x5F00;&#x9500;&#x8F83;&#x4F4E;&#xFF0C;&#x6240;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6298;&#x8877;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x53EF;&#x4EE5;&#x6302;&#x8F7D;&#x95F4;&#x9699;&#x9501;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x9000;&#x5316;&#x5230;&#x4F7F;&#x7528;&#x6574;&#x4E2A;&#x8868;&#x4E0A;&#x7684;&#x5171;&#x4EAB;&#x9501;&#x3002;&#x8FD9;&#x5BF9;&#x6027;&#x80FD;&#x4E0D;&#x5229;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x963B;&#x6B62;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x5199;&#x5165;&#x8868;&#x683C;&#xFF0C;&#x4F46;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x7684;&#x56DE;&#x9000;&#x4F4D;&#x7F6E;&#x3002;</p>
<h3 id="&#x5E8F;&#x5217;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;ssi&#xFF09;">&#x5E8F;&#x5217;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;SSI&#xFF09;</h3>
<p>&#x672C;&#x7AE0;&#x63CF;&#x7ED8;&#x4E86;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x7684;&#x9EEF;&#x6DE1;&#x753B;&#x9762;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x4E86;&#x6027;&#x80FD;&#x4E0D;&#x597D;&#xFF08;2PL&#xFF09;&#x6216;&#x8005;&#x4F38;&#x7F29;&#x6027;&#x4E0D;&#x597D;&#xFF08;&#x4E32;&#x884C;&#x6267;&#x884C;&#xFF09;&#x7684;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x6027;&#x80FD;&#x826F;&#x597D;&#x7684;&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x4F46;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x5404;&#x79CD;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#xFF08;&#x4E22;&#x5931;&#x66F4;&#x65B0;&#xFF0C;&#x5199;&#x5165;&#x504F;&#x5DEE;&#xFF0C;&#x5E7B;&#x8BFB;&#x7B49;&#xFF09;&#x3002;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x548C;&#x9AD8;&#x6027;&#x80FD;&#x662F;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x76F8;&#x4E92;&#x77DB;&#x76FE;&#x7684;&#x5417;&#xFF1F;</p>
<p>&#x4E5F;&#x8BB8;&#x4E0D;&#x662F;&#xFF1A;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;SSI, serializable snapshot isolation&#xFF09;</strong> &#x7684;&#x7B97;&#x6CD5;&#x662F;&#x975E;&#x5E38;&#x6709;&#x524D;&#x9014;&#x7684;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x5B8C;&#x6574;&#x7684;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x4F46;&#x4E0E;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x76F8;&#x6BD4;&#x53EA;&#x6709;&#x53EA;&#x6709;&#x5F88;&#x5C0F;&#x7684;&#x6027;&#x80FD;&#x635F;&#x5931;&#x3002; SSI&#x662F;&#x76F8;&#x5F53;&#x65B0;&#x7684;&#xFF1A;&#x5B83;&#x5728;2008&#x5E74;&#x9996;&#x6B21;&#x88AB;&#x63CF;&#x8FF0;&#x3010;40&#x3011;&#xFF0C;&#x5E76;&#x4E14;&#x662F;Michael Cahill&#x7684;&#x535A;&#x58EB;&#x8BBA;&#x6587;&#x3010;51&#x3011;&#x7684;&#x4E3B;&#x9898;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#xFF0C;SSI&#x65E2;&#x7528;&#x4E8E;&#x5355;&#x8282;&#x70B9;&#x6570;&#x636E;&#x5E93;&#xFF08;PostgreSQL9.1 &#x4EE5;&#x540E;&#x7684;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF09;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#xFF08;FoundationDB&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x7B97;&#x6CD5;&#xFF09;&#x3002;&#x7531;&#x4E8E;SSI&#x4E0E;&#x5176;&#x4ED6;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x673A;&#x5236;&#x76F8;&#x6BD4;&#x8FD8;&#x5F88;&#x5E74;&#x8F7B;&#xFF0C;&#x8FD8;&#x5904;&#x4E8E;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x8868;&#x73B0;&#x7684;&#x9636;&#x6BB5;&#x3002;&#x4F46;&#x5B83;&#x6709;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x8DB3;&#x591F;&#x5FEB;&#x800C;&#x5728;&#x672A;&#x6765;&#x6210;&#x4E3A;&#x65B0;&#x7684;&#x9ED8;&#x8BA4;&#x9009;&#x9879;&#x3002;</p>
<h4 id="&#x60B2;&#x89C2;&#x4E0E;&#x4E50;&#x89C2;&#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;">&#x60B2;&#x89C2;&#x4E0E;&#x4E50;&#x89C2;&#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;</h4>
<p>&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x662F;&#x4E00;&#x79CD;&#x6240;&#x8C13;&#x7684;<strong>&#x60B2;&#x89C2;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x673A;&#x5236;&#xFF08;pessimistic&#xFF09;</strong> &#xFF1A;&#x5B83;&#x662F;&#x57FA;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x539F;&#x5219;&#xFF1A;&#x5982;&#x679C;&#x6709;&#x4E8B;&#x60C5;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#xFF08;&#x5982;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6240;&#x6301;&#x6709;&#x7684;&#x9501;&#x6240;&#x8868;&#x793A;&#x7684;&#xFF09;&#xFF0C;&#x6700;&#x597D;&#x7B49;&#x5230;&#x60C5;&#x51B5;&#x5B89;&#x5168;&#x540E;&#x518D;&#x505A;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x5C31;&#x50CF;&#x4E92;&#x65A5;&#xFF0C;&#x7528;&#x4E8E;&#x4FDD;&#x62A4;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#xFF0C;&#x4E32;&#x884C;&#x6267;&#x884C;&#x53EF;&#x4EE5;&#x79F0;&#x4E3A;&#x60B2;&#x89C2;&#x5230;&#x4E86;&#x6781;&#x81F4;&#xFF1A;&#x5728;&#x4E8B;&#x52A1;&#x6301;&#x7EED;&#x671F;&#x95F4;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x5BF9;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x6216;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x533A;&#xFF09;&#x5177;&#x6709;&#x6392;&#x5B83;&#x9501;&#xFF0C;&#x4F5C;&#x4E3A;&#x5BF9;&#x60B2;&#x89C2;&#x7684;&#x8865;&#x507F;&#xFF0C;&#x6211;&#x4EEC;&#x8BA9;&#x6BCF;&#x7B14;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x5F97;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x9700;&#x8981;&#x77ED;&#x65F6;&#x95F4;&#x6301;&#x6709;&#x201C;&#x9501;&#x201D;&#x3002;</p>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;<strong>&#x5E8F;&#x5217;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x662F;&#x4E00;&#x79CD;<strong>&#x4E50;&#x89C2;&#xFF08;optimistic&#xFF09;</strong> &#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x6280;&#x672F;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E50;&#x89C2;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#x6F5C;&#x5728;&#x7684;&#x5371;&#x9669;&#x4E5F;&#x4E0D;&#x963B;&#x6B62;&#x4E8B;&#x52A1;&#xFF0C;&#x800C;&#x662F;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#xFF0C;&#x5E0C;&#x671B;&#x4E00;&#x5207;&#x90FD;&#x4F1A;&#x597D;&#x8D77;&#x6765;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x60F3;&#x8981;&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#x53D1;&#x751F;&#xFF08;&#x5373;&#x9694;&#x79BB;&#x662F;&#x5426;&#x88AB;&#x8FDD;&#x53CD;&#xFF09;&#xFF1B;&#x5982;&#x679C;&#x662F;&#x7684;&#x8BDD;&#xFF0C;&#x4E8B;&#x52A1;&#x5C06;&#x88AB;&#x4E2D;&#x6B62;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x91CD;&#x8BD5;&#x3002;&#x53EA;&#x6709;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x4E8B;&#x52A1;&#x624D;&#x88AB;&#x5141;&#x8BB8;&#x63D0;&#x4EA4;&#x3002;</p>
<p>&#x4E50;&#x89C2;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x662F;&#x4E00;&#x4E2A;&#x53E4;&#x8001;&#x7684;&#x60F3;&#x6CD5;&#x3010;52&#x3011;&#xFF0C;&#x5176;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;&#x5DF2;&#x7ECF;&#x4E89;&#x8BBA;&#x4E86;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x3010;53&#x3011;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;&#x5F88;&#x591A;<strong>&#x4E89;&#x7528;&#xFF08;contention&#xFF09;</strong>&#xFF08;&#x5F88;&#x591A;&#x4E8B;&#x52A1;&#x8BD5;&#x56FE;&#x8BBF;&#x95EE;&#x76F8;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF09;&#xFF0C;&#x5219;&#x8868;&#x73B0;&#x4E0D;&#x4F73;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x4E2D;&#x6B62;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x63A5;&#x8FD1;&#x6700;&#x5927;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x6765;&#x81EA;&#x91CD;&#x8BD5;&#x4E8B;&#x52A1;&#x7684;&#x989D;&#x5916;&#x8D1F;&#x8F7D;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x6027;&#x80FD;&#x53D8;&#x5DEE;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5907;&#x7528;&#x5BB9;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x4E8B;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x4E89;&#x7528;&#x4E0D;&#x662F;&#x592A;&#x9AD8;&#xFF0C;&#x4E50;&#x89C2;&#x7684;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x6280;&#x672F;&#x5F80;&#x5F80;&#x6BD4;&#x60B2;&#x89C2;&#x7684;&#x8981;&#x597D;&#x3002;&#x53EF;&#x4EA4;&#x6362;&#x7684;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4E89;&#x7528;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x8981;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x7528;&#x589E;&#x91CF;&#x7684;&#x987A;&#x5E8F;&#xFF08;&#x53EA;&#x8981;&#x8BA1;&#x6570;&#x5668;&#x4E0D;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#x8BFB;&#x53D6;&#xFF09;&#x5C31;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x5E76;&#x53D1;&#x589E;&#x91CF;&#x53EF;&#x4EE5;&#x5168;&#x90E8;&#x5E94;&#x7528;&#x4E14;&#x65E0;&#x9700;&#x51B2;&#x7A81;&#x3002;</p>
<p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;SSI&#x57FA;&#x4E8E;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x2014;&#x2014;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8BFB;&#x53D6;&#x90FD;&#x662F;&#x6765;&#x81EA;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x5FEB;&#x7167;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;">&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x53D6;</a>&#x201D;&#xFF09;&#x3002;&#x4E0E;&#x65E9;&#x671F;&#x7684;&#x4E50;&#x89C2;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#x6280;&#x672F;&#x76F8;&#x6BD4;&#x8FD9;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x533A;&#x522B;&#x3002;&#x5728;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;SSI&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#x6765;&#x68C0;&#x6D4B;&#x5199;&#x5165;&#x4E4B;&#x95F4;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x51B2;&#x7A81;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x8981;&#x4E2D;&#x6B62;&#x54EA;&#x4E9B;&#x4E8B;&#x52A1;&#x3002;</p>
<h4 id="&#x57FA;&#x4E8E;&#x8FC7;&#x65F6;&#x524D;&#x63D0;&#x7684;&#x51B3;&#x7B56;">&#x57FA;&#x4E8E;&#x8FC7;&#x65F6;&#x524D;&#x63D0;&#x7684;&#x51B3;&#x7B56;</h4>
<p>&#x5148;&#x524D;&#x8BA8;&#x8BBA;&#x4E86;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x4E2D;&#x7684;&#x5199;&#x5165;&#x504F;&#x5DEE;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x5199;&#x5165;&#x504F;&#x5DEE;&#x4E0E;&#x5E7B;&#x8BFB;">&#x5199;&#x5165;&#x504F;&#x5DEE;&#x548C;&#x5E7B;&#x50CF;</a>&#x201D;&#xFF09;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x5230;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x6A21;&#x5F0F;&#xFF1A;&#x4E8B;&#x52A1;&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x53D6;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x68C0;&#x67E5;&#x67E5;&#x8BE2;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x5B83;&#x770B;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x51B3;&#x5B9A;&#x91C7;&#x53D6;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#xFF08;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x539F;&#x59CB;&#x67E5;&#x8BE2;&#x7684;&#x7ED3;&#x679C;&#x5728;&#x4E8B;&#x52A1;&#x63D0;&#x4EA4;&#x65F6;&#x53EF;&#x80FD;&#x4E0D;&#x518D;&#x662F;&#x6700;&#x65B0;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x88AB;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4E8B;&#x52A1;&#x57FA;&#x4E8E;&#x4E00;&#x4E2A;<strong>&#x524D;&#x63D0;&#xFF08;premise&#xFF09;</strong> &#x91C7;&#x53D6;&#x884C;&#x52A8;&#xFF08;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x65F6;&#x5019;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x201C;&#x76EE;&#x524D;&#x6709;&#x4E24;&#x540D;&#x533B;&#x751F;&#x6B63;&#x5728;&#x503C;&#x73ED;&#x201D;&#xFF09;&#x3002;&#x4E4B;&#x540E;&#x5F53;&#x4E8B;&#x52A1;&#x8981;&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x539F;&#x59CB;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x6539;&#x53D8;&#x2014;&#x2014;&#x524D;&#x63D0;&#x53EF;&#x80FD;&#x4E0D;&#x518D;&#x6210;&#x7ACB;&#x3002;</p>
<p>&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x65F6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x201C;&#x5F53;&#x524D;&#x6709;&#x591A;&#x5C11;&#x533B;&#x751F;&#x6B63;&#x5728;&#x503C;&#x73ED;&#xFF1F;&#x201D;&#xFF09;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x4E0D;&#x77E5;&#x9053;&#x5E94;&#x7528;&#x903B;&#x8F91;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8BE5;&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4E3A;&#x4E86;&#x5B89;&#x5168;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x9700;&#x8981;&#x5047;&#x8BBE;&#x4EFB;&#x4F55;&#x5BF9;&#x8BE5;&#x7ED3;&#x679C;&#x96C6;&#x7684;&#x53D8;&#x66F4;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x8BE5;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x5199;&#x5165;&#x53D8;&#x5F97;&#x65E0;&#x6548;&#x3002; &#x6362;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x4E8B;&#x52A1;&#x4E2D;&#x7684;&#x67E5;&#x8BE2;&#x4E0E;&#x5199;&#x5165;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x56E0;&#x679C;&#x4F9D;&#x8D56;&#x3002;&#x4E3A;&#x4E86;&#x63D0;&#x4F9B;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x52A1;&#x5728;&#x8FC7;&#x65F6;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5FC5;&#x987B;&#x80FD;&#x68C0;&#x6D4B;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4E2D;&#x6B62;&#x4E8B;&#x52A1;&#x3002;</p>
<p>&#x6570;&#x636E;&#x5E93;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x6539;&#x53D8;&#xFF1F;&#x6709;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x8003;&#x8651;&#xFF1A;</p>
<ul>
<li>&#x68C0;&#x6D4B;&#x5BF9;&#x65E7;MVCC&#x5BF9;&#x8C61;&#x7248;&#x672C;&#x7684;&#x8BFB;&#x53D6;&#xFF08;&#x8BFB;&#x4E4B;&#x524D;&#x5B58;&#x5728;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x5199;&#x5165;&#xFF09;</li>
<li>&#x68C0;&#x6D4B;&#x5F71;&#x54CD;&#x5148;&#x524D;&#x8BFB;&#x53D6;&#x7684;&#x5199;&#x5165;&#xFF08;&#x8BFB;&#x4E4B;&#x540E;&#x53D1;&#x751F;&#x5199;&#x5165;&#xFF09;</li>
</ul>
<h4 id="&#x68C0;&#x6D4B;&#x65E7;mvcc&#x8BFB;&#x53D6;">&#x68C0;&#x6D4B;&#x65E7;MVCC&#x8BFB;&#x53D6;</h4>
<p>&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x901A;&#x5E38;&#x662F;&#x901A;&#x8FC7;&#x591A;&#x7248;&#x672C;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#xFF08;MVCC&#xFF1B;&#x89C1;<a href="">&#x56FE;7-10</a>&#xFF09;&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4ECE;MVCC&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x81F4;&#x5FEB;&#x7167;&#x8BFB;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x5FFD;&#x7565;&#x53D6;&#x5FEB;&#x7167;&#x65F6;&#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x6240;&#x505A;&#x7684;&#x5199;&#x5165;&#x3002;&#x5728;<a href="">&#x56FE;7-10</a>&#x4E2D;&#xFF0C;&#x4E8B;&#x52A1;43 &#x8BA4;&#x4E3A;Alice&#x7684; <code>on_call = true</code> &#xFF0C;&#x56E0;&#x4E3A;&#x4E8B;&#x52A1;42&#xFF08;&#x4FEE;&#x6539;Alice&#x7684;&#x5F85;&#x547D;&#x72B6;&#x6001;&#xFF09;&#x672A;&#x88AB;&#x63D0;&#x4EA4;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x4E8B;&#x52A1;43&#x60F3;&#x8981;&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x4E8B;&#x52A1;42 &#x5DF2;&#x7ECF;&#x63D0;&#x4EA4;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x8BFB;&#x4E00;&#x81F4;&#x6027;&#x5FEB;&#x7167;&#x65F6;&#x88AB;&#x5FFD;&#x7565;&#x7684;&#x5199;&#x5165;&#x5DF2;&#x7ECF;&#x751F;&#x6548;&#xFF0C;&#x4E8B;&#x52A1;43 &#x7684;&#x524D;&#x63D0;&#x4E0D;&#x518D;&#x4E3A;&#x771F;&#x3002;</p>
<p><img src="img/fig7-10.png" alt=""></p>
<p><strong>&#x56FE;7-10 &#x68C0;&#x6D4B;&#x4E8B;&#x52A1;&#x4F55;&#x65F6;&#x4ECE;MVCC&#x5FEB;&#x7167;&#x8BFB;&#x53D6;&#x8FC7;&#x65F6;&#x7684;&#x503C;</strong></p>
<p>&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x9700;&#x8981;&#x8DDF;&#x8E2A;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7531;&#x4E8E;MVCC&#x53EF;&#x89C1;&#x6027;&#x89C4;&#x5219;&#x800C;&#x5FFD;&#x7565;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x5199;&#x5165;&#x3002;&#x5F53;&#x4E8B;&#x52A1;&#x60F3;&#x8981;&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6709;&#x4EFB;&#x4F55;&#x88AB;&#x5FFD;&#x7565;&#x7684;&#x5199;&#x5165;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x88AB;&#x63D0;&#x4EA4;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x4E8B;&#x52A1;&#x5FC5;&#x987B;&#x4E2D;&#x6B62;&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x7B49;&#x5230;&#x63D0;&#x4EA4;&#xFF1F;&#x5F53;&#x68C0;&#x6D4B;&#x5230;&#x9648;&#x65E7;&#x7684;&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7ACB;&#x5373;&#x4E2D;&#x6B62;&#x4E8B;&#x52A1;43 &#xFF1F;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4E8B;&#x52A1;43 &#x662F;&#x53EA;&#x8BFB;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x4E2D;&#x6B62;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x7684;&#x98CE;&#x9669;&#x3002;&#x5F53;&#x4E8B;&#x52A1;43 &#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x8FD8;&#x4E0D;&#x77E5;&#x9053;&#x4E8B;&#x52A1;&#x662F;&#x5426;&#x8981;&#x7A0D;&#x540E;&#x6267;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E8B;&#x52A1;42 &#x53EF;&#x80FD;&#x5728;&#x4E8B;&#x52A1;43 &#x88AB;&#x63D0;&#x4EA4;&#x7684;&#x65F6;&#x5019;&#x4E2D;&#x6B62;&#x6216;&#x8005;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x672A;&#x88AB;&#x63D0;&#x4EA4;&#xFF0C;&#x56E0;&#x6B64;&#x8BFB;&#x53D6;&#x53EF;&#x80FD;&#x7EC8;&#x7A76;&#x4E0D;&#x662F;&#x9648;&#x65E7;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4E2D;&#x6B62;&#xFF0C;SSI &#x4FDD;&#x7559;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x5BF9;&#x4ECE;&#x4E00;&#x81F4;&#x5FEB;&#x7167;&#x4E2D;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x8BFB;&#x53D6;&#x7684;&#x652F;&#x6301;&#x3002;</p>
<h4 id="&#x68C0;&#x6D4B;&#x5F71;&#x54CD;&#x4E4B;&#x524D;&#x8BFB;&#x53D6;&#x7684;&#x5199;&#x5165;">&#x68C0;&#x6D4B;&#x5F71;&#x54CD;&#x4E4B;&#x524D;&#x8BFB;&#x53D6;&#x7684;&#x5199;&#x5165;</h4>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5728;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x4E4B;&#x540E;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5982;<a href="img/fig7-11.png">&#x56FE;7-11</a>&#x6240;&#x793A;&#x3002;</p>
<p><img src="img/fig7-11.png" alt=""></p>
<p><strong>&#x56FE;7-11 &#x5728;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x4E2D;&#xFF0C;&#x68C0;&#x6D4B;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4F55;&#x65F6;&#x4FEE;&#x6539;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x8BFB;&#x53D6;&#x3002;</strong></p>
<p>&#x5728;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;<a href="">&#x7D22;&#x5F15;&#x8303;&#x56F4;&#x9501;</a>&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="">&#x7D22;&#x5F15;&#x8303;&#x56F4;&#x9501;</a>&#x201D;&#xFF09;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x6570;&#x636E;&#x5E93;&#x9501;&#x5B9A;&#x4E0E;&#x67D0;&#x4E2A;&#x641C;&#x7D22;&#x67E5;&#x8BE2;&#x5339;&#x914D;&#x7684;&#x6240;&#x6709;&#x884C;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#xFF0C;&#x4F8B;&#x5982; <code>WHERE shift_id = 1234</code>&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x9664;&#x4E86;SSI&#x9501;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x3002;</p>
<p>&#x5728;<a href="">&#x56FE;7-11</a>&#x4E2D;&#xFF0C;&#x4E8B;&#x52A1;42 &#x548C;43 &#x90FD;&#x5728;&#x73ED;&#x6B21;1234 &#x67E5;&#x627E;&#x503C;&#x73ED;&#x533B;&#x751F;&#x3002;&#x5982;&#x679C;&#x5728;<code>shift_id</code>&#x4E0A;&#x6709;&#x7D22;&#x5F15;&#xFF0C;&#x5219;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x9879;1234 &#x6765;&#x8BB0;&#x5F55;&#x4E8B;&#x52A1;42 &#x548C;43 &#x8BFB;&#x53D6;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x7684;&#x4E8B;&#x5B9E;&#x3002; &#xFF08;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x7D22;&#x5F15;&#xFF0C;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x5728;&#x8868;&#x7EA7;&#x522B;&#x8FDB;&#x884C;&#x8DDF;&#x8E2A;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x4FE1;&#x606F;&#x53EA;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF1A;&#x5728;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#xFF08;&#x63D0;&#x4EA4;&#x6216;&#x4E2D;&#x6B62;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x7684;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5C31;&#x53EF;&#x4EE5;&#x5FD8;&#x8BB0;&#x5B83;&#x8BFB;&#x53D6;&#x7684;&#x6570;&#x636E;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x4E8B;&#x52A1;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x5728;&#x7D22;&#x5F15;&#x4E2D;&#x67E5;&#x627E;&#x6700;&#x8FD1;&#x66FE;&#x8BFB;&#x53D6;&#x53D7;&#x5F71;&#x54CD;&#x6570;&#x636E;&#x7684;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7C7B;&#x4F3C;&#x4E8E;&#x5728;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x952E;&#x8303;&#x56F4;&#x4E0A;&#x83B7;&#x53D6;&#x5199;&#x9501;&#xFF0C;&#x4F46;&#x9501;&#x5E76;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x4E8B;&#x52A1;&#x6307;&#x5BFC;&#x5176;&#x4ED6;&#x8BFB;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x662F;&#x50CF;&#x8B66;&#x6212;&#x7EBF;&#x4E00;&#x6837;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x4E8B;&#x52A1;&#xFF1A;&#x4F60;&#x4EEC;&#x8BFB;&#x8FC7;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x6700;&#x65B0;&#x7684;&#x5566;&#x3002;</p>
<p>&#x5728;<a href="">&#x56FE;7-11</a>&#x4E2D;&#xFF0C;&#x4E8B;&#x52A1;43 &#x901A;&#x77E5;&#x4E8B;&#x52A1;42 &#x5176;&#x5148;&#x524D;&#x8BFB;&#x5DF2;&#x8FC7;&#x65F6;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x4E8B;&#x52A1;42&#x9996;&#x5148;&#x63D0;&#x4EA4;&#x5E76;&#x6210;&#x529F;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E8B;&#x52A1;43 &#x7684;&#x5199;&#x5F71;&#x54CD;&#x4E86;42 &#xFF0C;&#x4F46;&#x56E0;&#x4E3A;&#x4E8B;&#x52A1;43 &#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#xFF0C;&#x6240;&#x4EE5;&#x5199;&#x5165;&#x5C1A;&#x672A;&#x751F;&#x6548;&#x3002;&#x7136;&#x800C;&#x5F53;&#x4E8B;&#x52A1;43 &#x60F3;&#x8981;&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x6765;&#x81EA;&#x4E8B;&#x52A1;42 &#x7684;&#x51B2;&#x7A81;&#x5199;&#x5165;&#x5DF2;&#x7ECF;&#x88AB;&#x63D0;&#x4EA4;&#xFF0C;&#x6240;&#x4EE5;&#x4E8B;&#x52A1;43 &#x5FC5;&#x987B;&#x4E2D;&#x6B62;&#x3002;</p>
<h4 id="&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x6027;&#x80FD;">&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x6027;&#x80FD;</h4>
<p>&#x4E0E;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;&#x8BB8;&#x591A;&#x5DE5;&#x7A0B;&#x7EC6;&#x8282;&#x4F1A;&#x5F71;&#x54CD;&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x9645;&#x8868;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x6743;&#x8861;&#x662F;&#x8DDF;&#x8E2A;&#x4E8B;&#x52A1;&#x7684;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x7684;<strong>&#x7C92;&#x5EA6;&#xFF08;granularity&#xFF09;</strong>&#x3002;&#x5982;&#x679C;&#x6570;&#x636E;&#x5E93;&#x8BE6;&#x7EC6;&#x5730;&#x8DDF;&#x8E2A;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x6D3B;&#x52A8;&#xFF08;&#x7EC6;&#x7C92;&#x5EA6;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x5730;&#x786E;&#x5B9A;&#x54EA;&#x4E9B;&#x4E8B;&#x52A1;&#x9700;&#x8981;&#x4E2D;&#x6B62;&#xFF0C;&#x4F46;&#x662F;&#x7C3F;&#x8BB0;&#x5F00;&#x9500;&#x53EF;&#x80FD;&#x53D8;&#x5F97;&#x5F88;&#x663E;&#x8457;&#x3002;&#x7B80;&#x7565;&#x7684;&#x8DDF;&#x8E2A;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF08;&#x7C97;&#x7C92;&#x5EA6;&#xFF09;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x591A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4E8B;&#x52A1;&#x4E2D;&#x6B62;&#x3002;</p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8986;&#x76D6;&#x7684;&#x4FE1;&#x606F;&#xFF1A;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x6709;&#x65F6;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x6267;&#x884C;&#x7ED3;&#x679C;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x90FD;&#x662F;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x3002; PostgreSQL&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x6765;&#x51CF;&#x5C11;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4E2D;&#x6B62;&#x6B21;&#x6570;&#x3010;11,41&#x3011;&#x3002;</p>
<p>&#x4E0E;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x76F8;&#x6BD4;&#xFF0C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x6700;&#x5927;&#x4F18;&#x70B9;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E0D;&#x9700;&#x8981;&#x963B;&#x585E;&#x7B49;&#x5F85;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x6240;&#x6301;&#x6709;&#x7684;&#x9501;&#x3002;&#x5C31;&#x50CF;&#x5728;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x4E0B;&#x4E00;&#x6837;&#xFF0C;&#x5199;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x8BFB;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x4F7F;&#x5F97;&#x67E5;&#x8BE2;&#x5EF6;&#x8FDF;&#x66F4;&#x53EF;&#x9884;&#x6D4B;&#xFF0C;&#x53D8;&#x91CF;&#x66F4;&#x5C11;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x53EA;&#x8BFB;&#x67E5;&#x8BE2;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5728;&#x4E00;&#x81F4;&#x7684;&#x5FEB;&#x7167;&#x4E0A;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x9501;&#x5B9A;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x8BFB;&#x53D6;&#x7E41;&#x91CD;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x975E;&#x5E38;&#x6709;&#x5438;&#x5F15;&#x529B;&#x3002;</p>
<p>&#x4E0E;&#x4E32;&#x884C;&#x6267;&#x884C;&#x76F8;&#x6BD4;&#xFF0C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x5E76;&#x4E0D;&#x5C40;&#x9650;&#x4E8E;&#x5355;&#x4E2A;CPU&#x6838;&#x7684;&#x541E;&#x5410;&#x91CF;&#xFF1A;FoundationDB&#x5C06;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x51B2;&#x7A81;&#x5206;&#x5E03;&#x5728;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x5141;&#x8BB8;&#x6269;&#x5C55;&#x5230;&#x5F88;&#x9AD8;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;&#x5373;&#x4F7F;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x8DE8;&#x591A;&#x53F0;&#x673A;&#x5668;&#x8FDB;&#x884C;&#x5206;&#x533A;&#xFF0C;&#x4E8B;&#x52A1;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x4FDD;&#x8BC1;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7B49;&#x7EA7;&#x7684;&#x540C;&#x65F6;&#x8BFB;&#x5199;&#x591A;&#x4E2A;&#x5206;&#x533A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3010;54&#x3011;&#x3002;</p>
<p>&#x4E2D;&#x6B62;&#x7387;&#x663E;&#x8457;&#x5F71;&#x54CD;SSI&#x7684;&#x6574;&#x4F53;&#x8868;&#x73B0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x957F;&#x65F6;&#x95F4;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x6570;&#x636E;&#x7684;&#x4E8B;&#x52A1;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x51B2;&#x7A81;&#x5E76;&#x4E2D;&#x6B62;&#xFF0C;&#x56E0;&#x6B64;SSI&#x8981;&#x6C42;&#x540C;&#x65F6;&#x8BFB;&#x5199;&#x7684;&#x4E8B;&#x52A1;&#x5C3D;&#x91CF;&#x77ED;&#xFF08;&#x53EA;&#x8BFB;&#x957F;&#x4E8B;&#x52A1;&#x53EF;&#x80FD;&#x6CA1;&#x95EE;&#x9898;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x6162;&#x4E8B;&#x52A1;&#xFF0C;SSI&#x53EF;&#x80FD;&#x6BD4;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x6216;&#x4E32;&#x884C;&#x6267;&#x884C;&#x66F4;&#x4E0D;&#x654F;&#x611F;&#x3002;</p>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x4E8B;&#x52A1;&#x662F;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5C42;&#xFF0C;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5047;&#x88C5;&#x67D0;&#x4E9B;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#x548C;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x6545;&#x969C;&#x4E0D;&#x5B58;&#x5728;&#x3002;&#x5404;&#x5F0F;&#x5404;&#x6837;&#x7684;&#x9519;&#x8BEF;&#x88AB;&#x7B80;&#x5316;&#x4E3A;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x60C5;&#x51B5;&#xFF1A;<strong>&#x4E8B;&#x52A1;&#x4E2D;&#x6B62;&#xFF08;transaction abort&#xFF09;</strong>&#xFF0C;&#x800C;&#x5E94;&#x7528;&#x9700;&#x8981;&#x7684;&#x4EC5;&#x4EC5;&#x662F;&#x91CD;&#x8BD5;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x4ECB;&#x7ECD;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x4E8B;&#x52A1;&#x6709;&#x52A9;&#x4E8E;&#x9632;&#x6B62;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x53D1;&#x751F;&#x3002;&#x5E76;&#x975E;&#x6240;&#x6709;&#x5E94;&#x7528;&#x90FD;&#x6613;&#x53D7;&#x6B64;&#x7C7B;&#x95EE;&#x9898;&#x5F71;&#x54CD;&#xFF1A;&#x5177;&#x6709;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x7684;&#x5E94;&#x7528;&#xFF08;&#x4F8B;&#x5982;&#x6BCF;&#x6B21;&#x8BFB;&#x5199;&#x5355;&#x6761;&#x8BB0;&#x5F55;&#xFF09;&#x53EF;&#x80FD;&#x65E0;&#x9700;&#x4E8B;&#x52A1;&#x7BA1;&#x7406;&#x3002;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#xFF0C;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x6F5C;&#x5728;&#x9519;&#x8BEF;&#x60C5;&#x666F;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#xFF0C;&#x5404;&#x79CD;&#x9519;&#x8BEF;&#x60C5;&#x51B5;&#xFF08;&#x8FDB;&#x7A0B;&#x5D29;&#x6E83;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#xFF0C;&#x505C;&#x7535;&#xFF0C;&#x78C1;&#x76D8;&#x5DF2;&#x6EE1;&#xFF0C;&#x610F;&#x5916;&#x5E76;&#x53D1;&#x7B49;&#xFF09;&#x610F;&#x5473;&#x7740;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x4EE5;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x53D8;&#x5F97;&#x4E0D;&#x4E00;&#x81F4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x975E;&#x89C4;&#x8303;&#x5316;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5F88;&#x5BB9;&#x6613;&#x4E0E;&#x6E90;&#x6570;&#x636E;&#x4E0D;&#x540C;&#x6B65;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x63A8;&#x65AD;&#x590D;&#x6742;&#x7684;&#x4EA4;&#x4E92;&#x8BBF;&#x95EE;&#x53EF;&#x80FD;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x9020;&#x6210;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x6DF1;&#x5165;&#x8BA8;&#x8BBA;&#x4E86;<strong>&#x5E76;&#x53D1;&#x63A7;&#x5236;</strong>&#x7684;&#x8BDD;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x51E0;&#x4E2A;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#xFF0C;&#x7279;&#x522B;&#x662F;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#xFF0C;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#xFF08;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF09;&#x548C;<strong>&#x53EF;&#x5E8F;&#x5217;&#x5316;</strong>&#x3002;&#x5E76;&#x901A;&#x8FC7;&#x7814;&#x7A76;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x7684;&#x5404;&#x79CD;&#x4F8B;&#x5B50;&#xFF0C;&#x6765;&#x63CF;&#x8FF0;&#x8FD9;&#x4E9B;&#x9694;&#x79BB;&#x7B49;&#x7EA7;&#xFF1A;</p>
<p><strong><em>&#x810F;&#x8BFB;</em></strong></p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x8BFB;&#x53D6;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x5199;&#x5165;&#x3002;<strong>&#x8BFB;&#x5DF2;&#x63D0;&#x4EA4;</strong>&#x6216;&#x66F4;&#x5F3A;&#x7684;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x810F;&#x8BFB;&#x3002;</p>
<p><strong><em>&#x810F;&#x5199;</em></strong></p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x8986;&#x76D6;&#x5199;&#x5165;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5C1A;&#x672A;&#x63D0;&#x4EA4;&#x7684;&#x5199;&#x5165;&#x3002;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x4E8B;&#x52A1;&#x5B9E;&#x73B0;&#x90FD;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x810F;&#x5199;&#x3002;</p>
<p><strong><em>&#x8BFB;&#x53D6;&#x504F;&#x5DEE;&#xFF08;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#xFF09;</em></strong></p>
<p>&#x200B;    &#x5728;&#x540C;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x4F1A;&#x770B;&#x89C1;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E0D;&#x540C;&#x72B6;&#x6001;&#x3002;<strong>&#x5FEB;&#x7167;&#x9694;&#x79BB;</strong>&#x7ECF;&#x5E38;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4E8B;&#x52A1;&#x4ECE;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x5FEB;&#x7167;&#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x3002;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x901A;&#x5E38;&#x4F7F;&#x7528;<strong>&#x591A;&#x7248;&#x672C;&#x5E76;&#x53D1;&#x63A7;&#x5236;&#xFF08;MVCC&#xFF09;</strong> &#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p><strong><em>&#x66F4;&#x65B0;&#x4E22;&#x5931;</em></strong></p>
<p>&#x200B;    &#x4E24;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x540C;&#x65F6;&#x6267;&#x884C;<strong>&#x8BFB;&#x53D6;-&#x4FEE;&#x6539;-&#x5199;&#x5165;&#x5E8F;&#x5217;</strong>&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x5728;&#x6CA1;&#x6709;&#x5408;&#x5E76;&#x53E6;&#x4E00;&#x4E2A;&#x5199;&#x5165;&#x53D8;&#x66F4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x76F4;&#x63A5;&#x8986;&#x76D6;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5199;&#x64CD;&#x4F5C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x6240;&#x4EE5;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4E22;&#x5931;&#x3002;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x7684;&#x4E00;&#x4E9B;&#x5B9E;&#x73B0;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E9B;&#x5B9E;&#x73B0;&#x5219;&#x9700;&#x8981;&#x624B;&#x52A8;&#x9501;&#x5B9A;&#xFF08;<code>SELECT FOR UPDATE</code>&#xFF09;&#x3002;</p>
<p><strong><em>&#x5199;&#x504F;&#x5DEE;</em></strong></p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#xFF0C;&#x6839;&#x636E;&#x5B83;&#x6240;&#x770B;&#x5230;&#x7684;&#x503C;&#x4F5C;&#x51FA;&#x51B3;&#x5B9A;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x51B3;&#x5B9A;&#x5199;&#x5165;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5199;&#x5165;&#x65F6;&#xFF0C;&#x8BE5;&#x51B3;&#x5B9A;&#x7684;&#x524D;&#x63D0;&#x4E0D;&#x518D;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x3002;&#x53EA;&#x6709;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x9694;&#x79BB;&#x624D;&#x80FD;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x3002;</p>
<p><strong><em>&#x5E7B;&#x8BFB;</em></strong></p>
<p>&#x200B;    &#x4E8B;&#x52A1;&#x8BFB;&#x53D6;&#x7B26;&#x5408;&#x67D0;&#x4E9B;&#x641C;&#x7D22;&#x6761;&#x4EF6;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x8FDB;&#x884C;&#x5199;&#x5165;&#xFF0C;&#x5F71;&#x54CD;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x3002;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x76F4;&#x63A5;&#x7684;&#x5E7B;&#x50CF;&#x8BFB;&#x53D6;&#xFF0C;&#x4F46;&#x662F;&#x5199;&#x5165;&#x504F;&#x5DEE;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x7684;&#x5E7B;&#x8BFB;&#x9700;&#x8981;&#x7279;&#x6B8A;&#x5904;&#x7406;&#xFF0C;&#x4F8B;&#x5982;&#x7D22;&#x5F15;&#x8303;&#x56F4;&#x9501;&#x5B9A;&#x3002;</p>
<p>&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x6B64;&#x5916;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x624B;&#x52A8;&#x5904;&#x7406;&#x5269;&#x4F59;&#x90A3;&#x4E9B;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x663E;&#x5F0F;&#x9501;&#x5B9A;&#xFF09;&#x3002;&#x53EA;&#x6709;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x9694;&#x79BB;&#x624D;&#x80FD;&#x9632;&#x8303;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x5B9E;&#x73B0;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x4E8B;&#x52A1;&#x7684;&#x4E09;&#x79CD;&#x4E0D;&#x540C;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p><strong><em>&#x5B57;&#x9762;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x4E32;&#x884C;&#x6267;&#x884C;</em></strong></p>
<p>&#x200B;    &#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x5E76;&#x4E14;&#x4E8B;&#x52A1;&#x541E;&#x5410;&#x91CF;&#x8DB3;&#x591F;&#x4F4E;&#xFF0C;&#x8DB3;&#x4EE5;&#x5728;&#x5355;&#x4E2A;CPU&#x6838;&#x4E0A;&#x5904;&#x7406;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x800C;&#x6709;&#x6548;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p><strong><em>&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;</em></strong></p>
<p>&#x200B;    &#x6570;&#x5341;&#x5E74;&#x6765;&#xFF0C;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#x4E00;&#x76F4;&#x662F;&#x5B9E;&#x73B0;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x6807;&#x51C6;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x51FA;&#x4E8E;&#x6027;&#x80FD;&#x95EE;&#x9898;&#x7684;&#x8003;&#x8651;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p><strong><em>&#x53EF;&#x4E32;&#x884C;&#x5316;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF08;SSI&#xFF09;</em></strong></p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x65B0;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x5148;&#x524D;&#x65B9;&#x6CD5;&#x7684;&#x5927;&#x90E8;&#x5206;&#x7F3A;&#x70B9;&#x3002;&#x5B83;&#x4F7F;&#x7528;&#x4E50;&#x89C2;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5141;&#x8BB8;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x800C;&#x65E0;&#x9700;&#x963B;&#x585E;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;&#x60F3;&#x8981;&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#xFF0C;&#x5982;&#x679C;&#x6267;&#x884C;&#x4E0D;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF0C;&#x4E8B;&#x52A1;&#x5C31;&#x4F1A;&#x88AB;&#x4E2D;&#x6B62;&#x3002;</p>
<p>&#x200B;    &#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6B63;&#x5982;&#x5728;&#x8BA8;&#x8BBA;&#x4E2D;&#xFF0C;&#x65E0;&#x8BBA;&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x5982;&#x201C;<strong><a href="#&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#x7684;&#x9700;&#x6C42;">&#x591A;&#x5BF9;&#x8C61;&#x4E8B;&#x52A1;&#x7684;&#x9700;&#x6C42;</a></strong>&#x201D;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#xFF0C;&#x4E8B;&#x52A1;&#x90FD;&#x662F;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;&#x5E93;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x200B;    &#x672C;&#x7AE0;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x5355;&#x673A;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x63A2;&#x8BA8;&#x4E86;&#x5404;&#x79CD;&#x6982;&#x5FF5;&#x4E0E;&#x60F3;&#x6CD5;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x4E8B;&#x52A1;&#xFF0C;&#x5219;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x65B0;&#x7684;&#x56F0;&#x96BE;&#x6311;&#x6218;&#xFF0C;&#x5C06;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E24;&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;">&#x53C2;&#x8003;&#x6587;&#x732E;</h2>
<ol>
<li>Donald D. Chamberlin, Morton M. Astrahan, Michael W. Blasgen, et al.: &#x201C;<a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.84.348&amp;rep=rep1&amp;type=pdf" target="_blank">A History and Evaluation of System R</a>,&#x201D; <em>Communications of the ACM</em>, volume 24, number 10, pages 632&#x2013;646, October 1981.
<a href="http://dx.doi.org/10.1145/358769.358784" target="_blank">doi:10.1145/358769.358784</a></li>
<li>Jim N. Gray, Raymond A. Lorie, Gianfranco R. Putzolu, and Irving L. Traiger: &#x201C;<a href="http://citeseer.ist.psu.edu/viewdoc/download?doi=10.1.1.92.8248&amp;rep=rep1&amp;type=pdf" target="_blank">Granularity of Locks and Degrees of Consistency in a Shared Data Base</a>,&#x201D; in <em>Modelling in Data Base Management Systems: Proceedings of the IFIP Working Conference on Modelling in Data Base Management Systems</em>, edited by G. M. Nijssen, pages 364&#x2013;394, Elsevier/North Holland Publishing, 1976. Also in <em>Readings in Database Systems</em>, 4th edition, edited by Joseph M. Hellerstein and Michael Stonebraker, MIT Press, 2005. ISBN: 978-0-262-69314-1</li>
<li>Kapali P. Eswaran, Jim N. Gray, Raymond A. Lorie, and Irving L. Traiger: &#x201C;<a href="http://research.microsoft.com/en-us/um/people/gray/papers/On%20the%20Notions%20of%20Consistency%20and%20Predicate%20Locks%20in%20a%20Database%20System%20CACM.pdf" target="_blank">The Notions of Consistency and Predicate Locks in a Database System</a>,&#x201D; <em>Communications of the ACM</em>, volume 19, number 11, pages 624&#x2013;633, November 1976.</li>
<li>&#x201C;<a href="http://web.archive.org/web/20150320053809/https://foundationdb.com/acid-claims" target="_blank">ACID Transactions Are Incredibly Helpful</a>,&#x201D; FoundationDB, LLC, 2013.</li>
<li>John D. Cook: &#x201C;<a href="http://www.johndcook.com/blog/2009/07/06/brewer-cap-theorem-base/" target="_blank">ACID Versus BASE for Database Transactions</a>,&#x201D; <em>johndcook.com</em>, July 6, 2009.</li>
<li>Gavin Clarke: &#x201C;<a href="http://www.theregister.co.uk/2012/11/22/foundationdb_fear_of_cap_theorem/" target="_blank">NoSQL&apos;s CAP Theorem Busters: We Don&apos;t Drop ACID</a>,&#x201D; <em>theregister.co.uk</em>, November 22, 2012.</li>
<li>Theo H&#xE4;rder and Andreas Reuter: &#x201C;<a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.87.2812&amp;rep=rep1&amp;type=pdf" target="_blank">Principles of Transaction-Oriented Database Recovery</a>,&#x201D; <em>ACM Computing Surveys</em>, volume 15, number 4, pages 287&#x2013;317, December 1983. <a href="http://dx.doi.org/10.1145/289.291" target="_blank">doi:10.1145/289.291</a></li>
<li>Peter Bailis, Alan Fekete, Ali Ghodsi, et al.: &#x201C;<a href="http://www.bailis.org/papers/hat-hotos2013.pdf" target="_blank">HAT, not CAP: Towards Highly Available Transactions</a>,&#x201D;
at <em>14th USENIX Workshop on Hot Topics in Operating Systems</em> (HotOS), May 2013.</li>
<li>Armando Fox, Steven D. Gribble, Yatin Chawathe, et al.: &#x201C;<a href="http://www.cs.berkeley.edu/~brewer/cs262b/TACC.pdf" target="_blank">Cluster-Based Scalable Network Services</a>,&#x201D; at
<em>16th ACM Symposium on Operating Systems Principles</em> (SOSP), October 1997.</li>
<li>Philip A. Bernstein, Vassos Hadzilacos, and Nathan Goodman: <a href="http://research.microsoft.com/en-us/people/philbe/ccontrol.aspx" target="_blank"><em>Concurrency Control and Recovery in Database Systems</em></a>. Addison-Wesley, 1987. ISBN: 978-0-201-10715-9, available online at <em>research.microsoft.com</em>.</li>
<li>Alan Fekete, Dimitrios Liarokapis, Elizabeth O&apos;Neil, et al.: &#x201C;<a href="https://www.cse.iitb.ac.in/infolab/Data/Courses/CS632/2009/Papers/p492-fekete.pdf" target="_blank">Making Snapshot Isolation Serializable</a>,&#x201D; <em>ACM Transactions on Database Systems</em>, volume 30, number 2, pages 492&#x2013;528, June 2005.
<a href="http://dx.doi.org/10.1145/1071610.1071615" target="_blank">doi:10.1145/1071610.1071615</a></li>
<li>Mai Zheng, Joseph Tucek, Feng Qin, and Mark Lillibridge:  &#x201C;<a href="https://www.usenix.org/system/files/conference/fast13/fast13-final80.pdf" target="_blank">Understanding the Robustness of SSDs Under Power Fault</a>,&#x201D; at <em>11th USENIX Conference on File and Storage Technologies</em> (FAST), February 2013.</li>
<li>Laurie Denness:  &#x201C;<a href="https://laur.ie/blog/2015/06/ssds-a-gift-and-a-curse/" target="_blank">SSDs: A Gift and a Curse</a>,&#x201D;  <em>laur.ie</em>, June 2, 2015.</li>
<li>Adam Surak:  &#x201C;<a href="https://blog.algolia.com/when-solid-state-drives-are-not-that-solid/" target="_blank">When Solid State Drives Are Not That Solid</a>,&#x201D; <em>blog.algolia.com</em>, June 15, 2015.</li>
<li>Thanumalayan Sankaranarayana Pillai, Vijay Chidambaram,  Ramnatthan Alagappan, et al.: &#x201C;<a href="http://research.cs.wisc.edu/wind/Publications/alice-osdi14.pdf" target="_blank">All   File Systems Are Not Created Equal: On the Complexity of Crafting Crash-Consistent Applications</a>,&#x201D;  at <em>11th USENIX Symposium on Operating Systems Design and Implementation</em> (OSDI),
  October 2014.</li>
<li>Chris Siebenmann:  &#x201C;<a href="https://utcc.utoronto.ca/~cks/space/blog/unix/FileSyncProblem" target="_blank">Unix&apos;s File Durability  Problem</a>,&#x201D; <em>utcc.utoronto.ca</em>, April 14, 2016.</li>
<li>Lakshmi N. Bairavasundaram, Garth R.  Goodson, Bianca Schroeder, et al.:  &#x201C;<a href="http://research.cs.wisc.edu/adsl/Publications/corruption-fast08.pdf" target="_blank">An Analysis of Data   Corruption in the Storage Stack</a>,&#x201D; at <em>6th USENIX Conference on File and Storage Technologies</em> (FAST), February 2008.</li>
<li>Bianca Schroeder, Raghav Lagisetty, and Arif Merchant:  &#x201C;<a href="https://www.usenix.org/conference/fast16/technical-sessions/presentation/schroeder" target="_blank">Flash   Reliability in Production: The Expected and the Unexpected</a>,&#x201D; at <em>14th USENIX Conference on  File and Storage Technologies</em> (FAST), February 2016.</li>
<li>Don Allison:  &#x201C;<a href="https://blog.korelogic.com/blog/2015/03/24" target="_blank">SSD Storage &#x2013; Ignorance of Technology Is No Excuse</a>,&#x201D; <em>blog.korelogic.com</em>, March 24, 2015.</li>
<li>Dave Scherer: &#x201C;<a href="http://web.archive.org/web/20150526065247/http://blog.foundationdb.com/those-are-not-transactions-cassandra-2-0" target="_blank">Those Are Not Transactions (Cassandra 2.0)</a>,&#x201D; <em>blog.foundationdb.com</em>, September 6, 2013.</li>
<li>Kyle Kingsbury: &#x201C;<a href="http://aphyr.com/posts/294-call-me-maybe-cassandra/" target="_blank">Call Me Maybe: Cassandra</a>,&#x201D; <em>aphyr.com</em>, September 24, 2013.</li>
<li>&#x201C;<a href="http://www.aerospike.com/docs/architecture/assets/AerospikeACIDSupport.pdf" target="_blank">ACID Support in Aerospike</a>,&#x201D; Aerospike, Inc., June 2014.</li>
<li>Martin Kleppmann: &#x201C;<a href="http://martin.kleppmann.com/2014/11/25/hermitage-testing-the-i-in-acid.html" target="_blank">Hermitage: Testing the &apos;I&apos; in ACID</a>,&#x201D; <em>martin.kleppmann.com</em>, November 25, 2014.</li>
<li>Tristan D&apos;Agosta: &#x201C;<a href="https://bitcointalk.org/index.php?topic=499580" target="_blank">BTC Stolen from Poloniex</a>,&#x201D; <em>bitcointalk.org</em>, March 4, 2014.</li>
<li>bitcointhief2: &#x201C;<a href="http://www.reddit.com/r/Bitcoin/comments/1wtbiu/how_i_stole_roughly_100_btc_from_an_exchange_and/" target="_blank">How I Stole Roughly 100 BTC from an Exchange and How I Could Have Stolen More!</a>,&#x201D; <em>reddit.com</em>, February 2, 2014.</li>
<li>Sudhir Jorwekar, Alan Fekete, Krithi Ramamritham, and S. Sudarshan: &#x201C;<a href="http://www.vldb.org/conf/2007/papers/industrial/p1263-jorwekar.pdf" target="_blank">Automating the Detection of Snapshot Isolation Anomalies</a>,&#x201D; at <em>33rd International Conference on Very Large Data Bases</em> (VLDB), September 2007.</li>
<li>Michael Melanson: &#x201C;<a href="http://www.michaelmelanson.net/2014/03/20/transactions/" target="_blank">Transactions: The Limits of Isolation</a>,&#x201D; <em>michaelmelanson.net</em>, March 20, 2014.</li>
<li>Hal Berenson, Philip A. Bernstein, Jim N. Gray, et al.: &#x201C;<a href="http://research.microsoft.com/pubs/69541/tr-95-51.pdf" target="_blank">A Critique of ANSI SQL Isolation Levels</a>,&#x201D;
at <em>ACM International Conference on Management of Data</em> (SIGMOD), May 1995.</li>
<li>Atul Adya: &#x201C;<a href="http://pmg.csail.mit.edu/papers/adya-phd.pdf" target="_blank">Weak Consistency: A Generalized Theory and Optimistic Implementations for Distributed Transactions</a>,&#x201D; PhD Thesis, Massachusetts Institute of Technology, March 1999.</li>
<li>Peter Bailis, Aaron Davidson, Alan Fekete, et al.: &#x201C;<a href="http://arxiv.org/pdf/1302.0309.pdf" target="_blank">Highly Available Transactions: Virtues and Limitations (Extended Version)</a>,&#x201D; at <em>40th International Conference on Very Large Data Bases</em> (VLDB), September 2014.</li>
<li>Bruce Momjian: &#x201C;<a href="http://momjian.us/main/presentations/internals.html#mvcc" target="_blank">MVCC Unmasked</a>,&#x201D; <em>momjian.us</em>, July 2014.</li>
<li>Annamalai Gurusami: &#x201C;<a href="https://blogs.oracle.com/mysqlinnodb/entry/repeatable_read_isolation_level_in" target="_blank">Repeatable Read Isolation Level in InnoDB &#x2013; How Consistent Read View Works</a>,&#x201D; <em>blogs.oracle.com</em>, January 15, 2013.</li>
<li>Nikita Prokopov: &#x201C;<a href="http://tonsky.me/blog/unofficial-guide-to-datomic-internals/" target="_blank">Unofficial Guide to Datomic Internals</a>,&#x201D; <em>tonsky.me</em>, May 6, 2014.</li>
<li>Baron Schwartz: &#x201C;<a href="http://www.xaprb.com/blog/2013/12/28/immutability-mvcc-and-garbage-collection/" target="_blank">Immutability, MVCC, and Garbage Collection</a>,&#x201D; <em>xaprb.com</em>, December 28, 2013.</li>
<li>J. Chris Anderson, Jan Lehnardt, and Noah Slater: <em>CouchDB: The Definitive Guide</em>. O&apos;Reilly Media, 2010.
ISBN: 978-0-596-15589-6 Rikdeb Mukherjee: &#x201C;<a href="http://mframes.blogspot.co.uk/2013/07/isolation-in-cursor.html" target="_blank">Isolation in DB2 (Repeatable Read, Read Stability, Cursor Stability, Uncommitted Read) with Examples</a>,&#x201D; <em>mframes.blogspot.co.uk</em>, July 4, 2013.</li>
<li>Steve Hilker: &#x201C;<a href="http://www.toadworld.com/platforms/ibmdb2/w/wiki/6661.cursor-stability-cs.aspx" target="_blank">Cursor Stability (CS) &#x2013; IBM DB2 Community</a>,&#x201D; <em>toadworld.com</em>, March 14, 2013.</li>
<li>Nate Wiger: &#x201C;<a href="http://www.nateware.com/an-atomic-rant.html" target="_blank">An Atomic Rant</a>,&#x201D; <em>nateware.com</em>, February 18, 2010.</li>
<li>Joel Jacobson: &#x201C;<a href="http://blog.joeljacobson.com/riak-2-0-data-types/" target="_blank">Riak 2.0: Data Types</a>,&#x201D; <em>blog.joeljacobson.com</em>, March 23, 2014.</li>
<li>Michael J. Cahill, Uwe R&#xF6;hm, and Alan Fekete: &#x201C;<a href="http://www.cs.nyu.edu/courses/fall12/CSCI-GA.2434-001/p729-cahill.pdf" target="_blank">Serializable Isolation for Snapshot Databases</a>,&#x201D; at <em>ACM International Conference on Management of Data</em> (SIGMOD), June 2008. <a href="http://dx.doi.org/10.1145/1376616.1376690" target="_blank">doi:10.1145/1376616.1376690</a></li>
<li>Dan R. K. Ports and Kevin Grittner: &#x201C;<a href="http://drkp.net/papers/ssi-vldb12.pdf" target="_blank">Serializable Snapshot Isolation in PostgreSQL</a>,&#x201D; at <em>38th International Conference on Very Large Databases</em> (VLDB), August 2012.</li>
<li>Tony Andrews:   &#x201C;<a href="http://tonyandrews.blogspot.co.uk/2004/10/enforcing-complex-constraints-in.html" target="_blank">Enforcing Complex Constraints in Oracle</a>,&#x201D; <em>tonyandrews.blogspot.co.uk</em>, October 15, 2004.</li>
<li>Douglas B. Terry, Marvin M. Theimer, Karin Petersen, et al.:  &#x201C;<a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.141.7889&amp;rep=rep1&amp;type=pdf" target="_blank">Managing   Update Conflicts in Bayou, a Weakly Connected Replicated Storage System</a>,&#x201D; at <em>15th ACM Symposium on Operating Systems Principles</em> (SOSP), December 1995.  <a href="http://dx.doi.org/10.1145/224056.224070" target="_blank">doi:10.1145/224056.224070</a></li>
<li>Gary Fredericks:  &#x201C;<a href="https://github.com/gfredericks/pg-serializability-bug" target="_blank">Postgres Serializability Bug</a>,&#x201D; <em>github.com</em>, September 2015.</li>
<li>Michael Stonebraker, Samuel Madden, Daniel J. Abadi, et al.: &#x201C;<a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.137.3697&amp;rep=rep1&amp;type=pdf" target="_blank">The End of an Architectural Era (It&#x2019;s Time for a Complete Rewrite)</a>,&#x201D; at <em>33rd International Conference on Very Large Data Bases</em> (VLDB), September 2007.</li>
<li>John Hugg: &#x201C;<a href="https://www.youtube.com/watch?v=hD5M4a1UVz8" target="_blank">H-Store/VoltDB Architecture vs. CEP Systems and Newer Streaming Architectures</a>,&#x201D; at <em>Data @Scale Boston</em>, November 2014.</li>
<li>Robert Kallman, Hideaki Kimura, Jonathan Natkins, et al.: &#x201C;<a href="http://www.vldb.org/pvldb/1/1454211.pdf" target="_blank">H-Store: A High-Performance, Distributed Main Memory Transaction Processing System</a>,&#x201D; <em>Proceedings of the VLDB Endowment</em>, volume 1, number 2, pages 1496&#x2013;1499, August 2008.</li>
<li>Rich Hickey: &#x201C;<a href="http://www.infoq.com/articles/Architecture-Datomic" target="_blank">The Architecture of Datomic</a>,&#x201D; <em>infoq.com</em>, November 2, 2012.</li>
<li>John Hugg: &#x201C;<a href="http://voltdb.com/blog/debunking-myths-about-voltdb-memory-database" target="_blank">Debunking Myths About the VoltDB In-Memory Database</a>,&#x201D; <em>voltdb.com</em>, May 12, 2014.</li>
<li>Joseph M. Hellerstein, Michael Stonebraker, and James Hamilton: &#x201C;<a href="http://db.cs.berkeley.edu/papers/fntdb07-architecture.pdf" target="_blank">Architecture of a Database System</a>,&#x201D;
<em>Foundations and Trends in Databases</em>, volume 1, number 2, pages 141&#x2013;259, November 2007.
<a href="http://dx.doi.org/10.1561/1900000002" target="_blank">doi:10.1561/1900000002</a></li>
<li>Michael J. Cahill: &#x201C;<a href="http://cahill.net.au/wp-content/uploads/2010/02/cahill-thesis.pdf" target="_blank">Serializable Isolation for Snapshot Databases</a>,&#x201D; PhD Thesis, University of Sydney, July 2009.</li>
<li>D. Z. Badal: &#x201C;<a href="http://ieeexplore.ieee.org/abstract/document/762563/" target="_blank">Correctness of Concurrency Control and Implications in Distributed Databases</a>,&#x201D; at <em>3rd International IEEE Computer Software and Applications Conference</em> (COMPSAC), November 1979.</li>
<li>Rakesh Agrawal, Michael J. Carey, and Miron Livny: &#x201C;<a href="http://www.eecs.berkeley.edu/~brewer/cs262/ConcControl.pdf" target="_blank">Concurrency Control Performance Modeling: Alternatives and Implications</a>,&#x201D; <em>ACM Transactions on Database Systems</em> (TODS), volume 12, number 4, pages 609&#x2013;654, December 1987. <a href="http://dx.doi.org/10.1145/32204.32220" target="_blank">doi:10.1145/32204.32220</a></li>
<li>Dave Rosenthal: &#x201C;<a href="http://web.archive.org/web/20150427041746/http://blog.foundationdb.com/databases-at-14.4mhz" target="_blank">Databases at 14.4MHz</a>,&#x201D; <em>blog.foundationdb.com</em>, December 10, 2014.</li>
</ol>
<hr>
<table>
<thead>
<tr>
<th>&#x4E0A;&#x4E00;&#x7AE0;</th>
<th>&#x76EE;&#x5F55;</th>
<th>&#x4E0B;&#x4E00;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><a href="ch6.html">&#x7B2C;&#x516D;&#x7AE0;&#xFF1A;&#x5206;&#x533A;</a></td>
<td><a href="./">&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;</a></td>
<td><a href="ch8.html">&#x7B2C;&#x516B;&#x7AE0;&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x9EBB;&#x70E6;</a></td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch6.html" class="navigation navigation-prev " aria-label="Previous page: 第六章：分区">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch8.html" class="navigation navigation-next " aria-label="Next page: 第八章：分布式系统的麻烦">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第七章：事务","level":"1.4.3","depth":2,"next":{"title":"第八章：分布式系统的麻烦","level":"1.4.4","depth":2,"path":"ch8.md","ref":"ch8.md","articles":[]},"previous":{"title":"第六章：分区","level":"1.4.2","depth":2,"path":"ch6.md","ref":"ch6.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing","mathjax-pro","livereload"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/ddia"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"livereload":{},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch7.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-21T05:58:49.715Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

