
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第八章：分布式系统的麻烦 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch9.html" />
    
    
    <link rel="prev" href="ch7.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第八章：分布式系统的麻烦</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x516B;&#x7AE0;&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x9EBB;&#x70E6;">&#x7B2C;&#x516B;&#x7AE0;&#xFF1A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x9EBB;&#x70E6;</h1>
<p><img src="img/ch8.png" alt=""></p>
<blockquote>
<p>&#x9082;&#x9005;&#x76F8;&#x9047;</p>
<p>&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;</p>
<p>&#x5B58;&#x4E4B;&#x4E3A;&#x543E;</p>
<p>&#x65E0;&#x98DF;&#x6211;&#x6570;</p>
<p>&#x200B;                &#x2014;&#x2014; Kyle Kingsbury, Carly Rae Jepsen &#x300A;&#x7F51;&#x7EDC;&#x5206;&#x533A;&#x7684;&#x5371;&#x5BB3;&#x300B;&#xFF08;2013&#x5E74;&#xFF09;</p>
</blockquote>
<hr>
<p>[TOC]</p>
<p>&#x200B;    &#x6700;&#x8FD1;&#x51E0;&#x7AE0;&#x4E2D;&#x53CD;&#x590D;&#x51FA;&#x73B0;&#x7684;&#x4E3B;&#x9898;&#x662F;&#xFF0C;&#x7CFB;&#x7EDF;&#x5982;&#x4F55;&#x5904;&#x7406;&#x9519;&#x8BEF;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;<strong>&#x526F;&#x672C;&#x6545;&#x969C;&#x5207;&#x6362;</strong>&#xFF08;&#x201C;<a href="#ch5.md#&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;">&#x5904;&#x7406;&#x8282;&#x70B9;&#x4E2D;&#x65AD;</a>&#x201D;&#xFF09;&#xFF0C;<strong>&#x590D;&#x5236;&#x5EF6;&#x8FDF;</strong>&#xFF08;&#x201C;<a href="ch6.html#&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;">&#x590D;&#x5236;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;</a>&#x201D;&#xFF09;&#x548C;&#x4E8B;&#x52A1;&#x63A7;&#x5236;&#xFF08;&#x201C;<a href="ch7.html#&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;">&#x5F31;&#x9694;&#x79BB;&#x7EA7;&#x522B;</a>&#x201D;&#xFF09;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x53EF;&#x80FD;&#x5728;&#x5B9E;&#x9645;&#x7CFB;&#x7EDF;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x5404;&#x79CD;&#x8FB9;&#x7F18;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x66F4;&#x597D;&#x5730;&#x5904;&#x7406;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8C08;&#x4E86;&#x5F88;&#x591A;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x4E4B;&#x524D;&#x51E0;&#x7AE0;&#x4ECD;&#x7136;&#x8FC7;&#x4E8E;&#x4E50;&#x89C2;&#x3002;&#x73B0;&#x5B9E;&#x66F4;&#x52A0;&#x9ED1;&#x6697;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C06;&#x60B2;&#x89C2;&#x4E3B;&#x4E49;&#x6700;&#x5927;&#x5316;&#xFF0C;&#x5047;&#x8BBE;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x7684;&#x4E1C;&#x897F;<strong>&#x90FD;&#x4F1A;</strong>&#x51FA;&#x9519;<sup><a href="#fn_i" id="reffn_i">i</a></sup>&#x3002;&#xFF08;&#x7ECF;&#x9A8C;&#x4E30;&#x5BCC;&#x7684;&#x7CFB;&#x7EDF;&#x8FD0;&#x7EF4;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x5982;&#x679C;&#x4F60;&#x95EE;&#x5F97;&#x597D;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x4E00;&#x8FB9;&#x6CBB;&#x7597;&#x5FC3;&#x7406;&#x521B;&#x4F24;&#x4E00;&#x8FB9;&#x544A;&#x8BC9;&#x4F60;&#x4E00;&#x4E9B;&#x53EF;&#x6015;&#x7684;&#x6545;&#x4E8B;&#xFF09;</p>
<blockquote id="fn_i">
<sup>i</sup>. &#x9664;&#x4E86;&#x4E00;&#x4E2A;&#x4F8B;&#x5916;&#xFF1A;&#x6211;&#x4EEC;&#x5C06;&#x5047;&#x5B9A;&#x6545;&#x969C;&#x662F;&#x975E;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x7684;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;">&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;</a>&#x201D;&#xFF09;&#x3002;<a href="#reffn_i" title="Jump back to footnote [i] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0E;&#x5728;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7F16;&#x5199;&#x8F6F;&#x4EF6;&#x6709;&#x7740;&#x6839;&#x672C;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x65B0;&#x9896;&#x548C;&#x523A;&#x6FC0;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4F7F;&#x4E8B;&#x60C5;&#x51FA;&#x9519;&#x3010;1,2&#x3011;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E86;&#x89E3;&#x5B9E;&#x8DF5;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7406;&#x89E3;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x4F9D;&#x8D56;&#xFF0C;&#x548C;&#x4E0D;&#x53EF;&#x4EE5;&#x4F9D;&#x8D56;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x200B;    &#x6700;&#x540E;&#xFF0C;&#x4F5C;&#x4E3A;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x6784;&#x5EFA;&#x80FD;&#x591F;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x7684;&#x7CFB;&#x7EDF;&#xFF08;&#x5373;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x671F;&#x671B;&#x7684;&#x4FDD;&#x8BC1;&#xFF09;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E00;&#x5207;&#x90FD;&#x51FA;&#x9519;&#x4E86;&#x3002; &#x5728;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x770B;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x63D0;&#x4F9B;&#x8FD9;&#x79CD;&#x4FDD;&#x8BC1;&#x7684;&#x7B97;&#x6CD5;&#x7684;&#x4F8B;&#x5B50;&#x3002; &#x4F46;&#x9996;&#x5148;&#xFF0C;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4E86;&#x89E3;&#x6211;&#x4EEC;&#x9762;&#x4E34;&#x7684;&#x6311;&#x6218;&#x3002;</p>
<p>&#x200B;    &#x672C;&#x7AE0;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x8FDB;&#x884C;&#x5F7B;&#x5E95;&#x7684;&#x60B2;&#x89C2;&#x548C;&#x6CAE;&#x4E27;&#x7684;&#x603B;&#x7ED3;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x7F51;&#x7EDC;&#x7684;&#x95EE;&#x9898;&#xFF08;&#x201C;<a href="#&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7EDC;">&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7684;&#x7F51;&#x7EDC;</a>&#x201D;&#xFF09;; &#x65F6;&#x949F;&#x548C;&#x65F6;&#x5E8F;&#x95EE;&#x9898;&#xFF08;&#x201C;<a href="#&#x4E0D;&#x53EF;&#x9760;&#x65F6;&#x949F;">&#x4E0D;&#x53EF;&#x9760;&#x65F6;&#x949F;</a>&#x201D;&#xFF09;; &#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7684;&#x7A0B;&#x5EA6;&#x3002; &#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x540E;&#x679C;&#x90FD;&#x662F;&#x56F0;&#x60D1;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x601D;&#x8003;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x63A8;&#x7406;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#xFF08;&#x201C;<a href="#&#x77E5;&#x8BC6;&#xFF0C;&#x771F;&#x76F8;&#x548C;&#x8C0E;&#x8A00;">&#x77E5;&#x8BC6;&#xFF0C;&#x771F;&#x76F8;&#x548C;&#x8C0E;&#x8A00;</a>&#x201D;&#xFF09;&#x3002;</p>
<h2 id="&#x6545;&#x969C;&#x4E0E;&#x90E8;&#x5206;&#x5931;&#x6548;">&#x6545;&#x969C;&#x4E0E;&#x90E8;&#x5206;&#x5931;&#x6548;</h2>
<p>&#x200B;    &#x5F53;&#x4F60;&#x5728;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x5B83;&#x901A;&#x5E38;&#x4F1A;&#x4EE5;&#x4E00;&#x79CD;&#x76F8;&#x5F53;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#xFF1A;&#x65E0;&#x8BBA;&#x662F;&#x5DE5;&#x4F5C;&#x8FD8;&#x662F;&#x4E0D;&#x5DE5;&#x4F5C;&#x3002;&#x5145;&#x6EE1;&#x9519;&#x8BEF;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x80FD;&#x4F1A;&#x8BA9;&#x4EBA;&#x89C9;&#x5F97;&#x7535;&#x8111;&#x6709;&#x65F6;&#x5019;&#x662F;&#x201C;&#x7CDF;&#x7CD5;&#x7684;&#x4E00;&#x5929;&#x201D;&#xFF08;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x901A;&#x5E38;&#x662F;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x7684;&#x95EE;&#x9898;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x4E3B;&#x8981;&#x662F;&#x8F6F;&#x4EF6;&#x5199;&#x5F97;&#x4E0D;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x200B;    &#x5355;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7684;&#x8F6F;&#x4EF6;&#x6CA1;&#x6709;&#x6839;&#x672C;&#x6027;&#x7684;&#x4E0D;&#x53EF;&#x9760;&#x539F;&#x56E0;&#xFF1A;&#x5F53;&#x786C;&#x4EF6;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x603B;&#x662F;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x8FD9;&#x662F;&#x786E;&#x5B9A;&#x6027;&#x7684;&#xFF09;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;&#x786C;&#x4EF6;&#x95EE;&#x9898;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5185;&#x5B58;&#x635F;&#x574F;&#x6216;&#x8FDE;&#x63A5;&#x5668;&#x677E;&#x52A8;&#xFF09;&#xFF0C;&#x5176;&#x540E;&#x679C;&#x901A;&#x5E38;&#x662F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x6545;&#x969C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5185;&#x6838;&#x6050;&#x614C;&#xFF0C;&#x201C;&#x84DD;&#x5C4F;&#x6B7B;&#x673A;&#x201D;&#xFF0C;&#x542F;&#x52A8;&#x5931;&#x8D25;&#xFF09;&#x3002;&#x88C5;&#x6709;&#x826F;&#x597D;&#x8F6F;&#x4EF6;&#x7684;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x5E38;&#x8981;&#x4E48;&#x529F;&#x80FD;&#x5B8C;&#x597D;&#xFF0C;&#x8981;&#x4E48;&#x5B8C;&#x5168;&#x5931;&#x6548;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECB;&#x4E8E;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x614E;&#x91CD;&#x7684;&#x9009;&#x62E9;&#xFF1A;&#x5982;&#x679C;&#x53D1;&#x751F;&#x5185;&#x90E8;&#x9519;&#x8BEF;&#xFF0C;&#x6211;&#x4EEC;&#x5B81;&#x613F;&#x7535;&#x8111;&#x5B8C;&#x5168;&#x5D29;&#x6E83;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x56E0;&#x4E3A;&#x9519;&#x8BEF;&#x7684;&#x7ED3;&#x679C;&#x5F88;&#x96BE;&#x5904;&#x7406;&#x3002;&#x56E0;&#x4E3A;&#x8BA1;&#x7B97;&#x673A;&#x9690;&#x85CF;&#x4E86;&#x6A21;&#x7CCA;&#x4E0D;&#x6E05;&#x7684;&#x7269;&#x7406;&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x5448;&#x73B0;&#x51FA;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x4EE5;&#x6570;&#x5B66;&#x4E00;&#x6837;&#x7684;&#x5B8C;&#x7F8E;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x4F5C;&#x3002; CPU&#x6307;&#x4EE4;&#x603B;&#x662F;&#x505A;&#x540C;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#xFF1B;&#x5982;&#x679C;&#x60A8;&#x5C06;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x5199;&#x5165;&#x5185;&#x5B58;&#x6216;&#x78C1;&#x76D8;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5C06;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x88AB;&#x968F;&#x673A;&#x7834;&#x574F;&#x3002;&#x4ECE;&#x7B2C;&#x4E00;&#x53F0;&#x6570;&#x5B57;&#x8BA1;&#x7B97;&#x673A;&#x5F00;&#x59CB;&#xFF0C;<em>&#x59CB;&#x7EC8;&#x6B63;&#x786E;&#x5730;&#x8BA1;&#x7B97;</em>&#x8FD9;&#x4E2A;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x8D2F;&#x7A7F;&#x59CB;&#x7EC8;&#x3010;3&#x3011;&#x3002;</p>
<p>&#x200B;    &#x5F53;&#x4F60;&#x7F16;&#x5199;&#x8FD0;&#x884C;&#x5728;&#x591A;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7684;&#x8F6F;&#x4EF6;&#x65F6;&#xFF0C;&#x60C5;&#x51B5;&#x6709;&#x672C;&#x8D28;&#x4E0A;&#x7684;&#x533A;&#x522B;&#x3002;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x518D;&#x5904;&#x4E8E;&#x7406;&#x60F3;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x522B;&#x65E0;&#x9009;&#x62E9;&#xFF0C;&#x53EA;&#x80FD;&#x9762;&#x5BF9;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x6DF7;&#x4E71;&#x73B0;&#x5B9E;&#x3002;&#x800C;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3010;4&#x3011;&#xFF0C;&#x5982;&#x4E0B;&#x9762;&#x7684;&#x8F76;&#x4E8B;&#x6240;&#x8FF0;&#xFF1A;</p>
<blockquote>
<p>&#x200B;    &#x5728;&#x6211;&#x6709;&#x9650;&#x7684;&#x7ECF;&#x9A8C;&#x4E2D;&#xFF0C;&#x6211;&#x5DF2;&#x7ECF;&#x548C;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x6253;&#x8FC7;&#x4EA4;&#x9053;&#xFF1A;&#x5355;&#x4E2A;<strong>&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF08;DC&#xFF09;</strong>&#x4E2D;&#x957F;&#x671F;&#x5B58;&#x5728;&#x7684;&#x7F51;&#x7EDC;&#x5206;&#x533A;&#xFF0C;&#x914D;&#x7535;&#x5355;&#x5143;PDU&#x6545;&#x969C;&#xFF0C;&#x4EA4;&#x6362;&#x673A;&#x6545;&#x969C;&#xFF0C;&#x6574;&#x4E2A;&#x673A;&#x67B6;&#x7684;&#x610F;&#x5916;&#x91CD;&#x542F;&#xFF0C;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E3B;&#x5E72;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#xFF0C;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x7535;&#x6E90;&#x6545;&#x969C;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x4F4E;&#x8840;&#x7CD6;&#x7684;&#x53F8;&#x673A;&#x628A;&#x4ED6;&#x7684;&#x798F;&#x7279;&#x76AE;&#x5361;&#x649E;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;HVAC&#xFF08;&#x52A0;&#x70ED;&#xFF0C;&#x901A;&#x98CE;&#x548C;&#x7A7A;&#x8C03;&#xFF09;&#x7CFB;&#x7EDF;&#x4E0A;&#x3002;&#x800C;&#x4E14;&#x6211;&#x751A;&#x81F3;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x8FD0;&#x7EF4;&#x3002;</p>
<p>&#x2014;&#x2014;&#x67EF;&#x8FBE;&#x9ED1;&#x5C14;</p>
</blockquote>
<p>&#x200B;    &#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5C3D;&#x7BA1;&#x7CFB;&#x7EDF;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x6B63;&#x5E38;&#xFF0C;&#x4F46;&#x7CFB;&#x7EDF;&#x7684;&#x67D0;&#x4E9B;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x4F1A;&#x4EE5;&#x67D0;&#x79CD;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x65B9;&#x5F0F;&#x88AB;&#x7834;&#x574F;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x90E8;&#x5206;&#x5931;&#x6548;&#xFF08;partial failure&#xFF09;</strong>&#x3002;&#x96BE;&#x70B9;&#x5728;&#x4E8E;&#x90E8;&#x5206;&#x5931;&#x6548;&#x662F;<strong>&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x7684;&#xFF08;nonderterministic&#xFF09;</strong>&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x8BD5;&#x56FE;&#x505A;&#x4EFB;&#x4F55;&#x6D89;&#x53CA;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x548C;&#x7F51;&#x7EDC;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5B83;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x5DE5;&#x4F5C;&#xFF0C;&#x6709;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x5931;&#x8D25;&#x3002;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5C06;&#x8981;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x4F60;&#x751A;&#x81F3;&#x4E0D;&#x77E5;&#x9053;&#x662F;&#x5426;&#x6210;&#x529F;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6D88;&#x606F;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x64AD;&#x7684;&#x65F6;&#x95F4;&#x4E5F;&#x662F;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#xFF01;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x548C;&#x90E8;&#x5206;&#x5931;&#x6548;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x4F7F;&#x5F97;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x96BE;&#x4EE5;&#x5DE5;&#x4F5C;&#x3010;5&#x3011;&#x3002;</p>
<h3 id="&#x4E91;&#x8BA1;&#x7B97;&#x4E0E;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;">&#x4E91;&#x8BA1;&#x7B97;&#x4E0E;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;</h3>
<p>&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x5927;&#x578B;&#x8BA1;&#x7B97;&#x7CFB;&#x7EDF;&#x6709;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x54F2;&#x5B66;&#xFF1A;</p>
<ul>
<li>&#x89C4;&#x6A21;&#x7684;&#x4E00;&#x7AEF;&#x662F;&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;&#xFF08;HPC&#xFF09;&#x9886;&#x57DF;&#x3002;&#x5177;&#x6709;&#x6570;&#x5343;&#x4E2A;CPU&#x7684;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x4EFB;&#x52A1;&#xFF0C;&#x5982;&#x5929;&#x6C14;&#x9884;&#x62A5;&#x6216;&#x5206;&#x5B50;&#x52A8;&#x529B;&#x5B66;&#xFF08;&#x6A21;&#x62DF;&#x539F;&#x5B50;&#x548C;&#x5206;&#x5B50;&#x7684;&#x8FD0;&#x52A8;&#xFF09;&#x3002;</li>
<li>&#x53E6;&#x4E00;&#x4E2A;&#x6781;&#x7AEF;&#x662F;<strong>&#x4E91;&#x8BA1;&#x7B97;&#xFF08;cloud computing&#xFF09;</strong>&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x5B9A;&#x4E49;&#x7684;&#x6982;&#x5FF5;&#x3010;6&#x3011;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x4E0E;&#x591A;&#x79DF;&#x6237;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x8FDE;&#x63A5;IP&#x7F51;&#x7EDC;&#x7684;&#x5546;&#x54C1;&#x8BA1;&#x7B97;&#x673A;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x4EE5;&#x592A;&#x7F51;&#xFF09;&#xFF0C;&#x5F39;&#x6027;/&#x6309;&#x9700;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x4EE5;&#x53CA;&#x8BA1;&#x91CF;&#x8BA1;&#x8D39;&#x7B49;&#x76F8;&#x5173;&#x8054;&#x3002;</li>
<li>&#x4F20;&#x7EDF;&#x4F01;&#x4E1A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4F4D;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x6781;&#x7AEF;&#x4E4B;&#x95F4;&#x3002;</li>
</ul>
<p>&#x4E0D;&#x540C;&#x7684;&#x54F2;&#x5B66;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x7684;&#x6545;&#x969C;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x5728;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#xFF0C;&#x4F5C;&#x4E1A;&#x901A;&#x5E38;&#x4F1A;&#x4E0D;&#x65F6;&#x5730;&#x4F1A;&#x5C06;&#x8BA1;&#x7B97;&#x7684;&#x72B6;&#x6001;&#x5B58;&#x76D8;&#x5230;&#x6301;&#x4E45;&#x5B58;&#x50A8;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x901A;&#x5E38;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x7B80;&#x5355;&#x5730;&#x505C;&#x6B62;&#x6574;&#x4E2A;&#x96C6;&#x7FA4;&#x7684;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x3002;&#x6545;&#x969C;&#x8282;&#x70B9;&#x4FEE;&#x590D;&#x540E;&#xFF0C;&#x8BA1;&#x7B97;&#x4ECE;&#x4E0A;&#x4E00;&#x4E2A;&#x68C0;&#x67E5;&#x70B9;&#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x3010;7,8&#x3011;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x5355;&#x8282;&#x70B9;&#x8BA1;&#x7B97;&#x673A;&#x800C;&#x4E0D;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF1A;&#x901A;&#x8FC7;&#x8BA9;&#x90E8;&#x5206;&#x5931;&#x8D25;&#x5347;&#x7EA7;&#x4E3A;&#x5B8C;&#x5168;&#x5931;&#x8D25;&#x6765;&#x5904;&#x7406;&#x90E8;&#x5206;&#x5931;&#x8D25;&#x2014;&#x2014;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x7684;&#x4EFB;&#x4F55;&#x90E8;&#x5206;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x53EA;&#x662F;&#x8BA9;&#x6240;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x5D29;&#x6E83;&#xFF08;&#x5C31;&#x50CF;&#x5355;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x5185;&#x6838;&#x6050;&#x614C;&#x4E00;&#x6837;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x5B9E;&#x73B0;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x4E0E;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x770B;&#x8D77;&#x6765;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;</p>
<ul>
<li><p>&#x8BB8;&#x591A;&#x4E0E;&#x4E92;&#x8054;&#x7F51;&#x6709;&#x5173;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;<strong>&#x5728;&#x7EBF;&#xFF08;online&#xFF09;</strong>&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x80FD;&#x591F;&#x968F;&#x65F6;&#x4EE5;&#x4F4E;&#x5EF6;&#x8FDF;&#x670D;&#x52A1;&#x7528;&#x6237;&#x3002;&#x4F7F;&#x670D;&#x52A1;&#x4E0D;&#x53EF;&#x7528;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x505C;&#x6B62;&#x7FA4;&#x96C6;&#x4EE5;&#x8FDB;&#x884C;&#x4FEE;&#x590D;&#xFF09;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x50CF;&#x5929;&#x6C14;&#x6A21;&#x62DF;&#x8FD9;&#x6837;&#x7684;&#x79BB;&#x7EBF;&#xFF08;&#x6279;&#x5904;&#x7406;&#xFF09;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x505C;&#x6B62;&#x5E76;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#xFF0C;&#x5F71;&#x54CD;&#x76F8;&#x5F53;&#x5C0F;&#x3002;</p>
</li>
<li><p>&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x5E38;&#x7531;&#x4E13;&#x7528;&#x786C;&#x4EF6;&#x6784;&#x5EFA;&#x800C;&#x6210;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x76F8;&#x5F53;&#x53EF;&#x9760;&#xFF0C;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x548C;<strong>&#x8FDC;&#x7A0B;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#xFF08;RDMA&#xFF09;</strong>&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4E91;&#x670D;&#x52A1;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x662F;&#x7531;&#x5546;&#x54C1;&#x673A;&#x5668;&#x6784;&#x5EFA;&#x800C;&#x6210;&#x7684;&#xFF0C;&#x7531;&#x4E8E;&#x89C4;&#x6A21;&#x7ECF;&#x6D4E;&#xFF0C;&#x53EF;&#x4EE5;&#x4EE5;&#x8F83;&#x4F4E;&#x7684;&#x6210;&#x672C;&#x63D0;&#x4F9B;&#x76F8;&#x540C;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x800C;&#x4E14;&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x7684;&#x6545;&#x969C;&#x7387;&#x3002;</p>
</li>
<li><p>&#x5927;&#x578B;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x901A;&#x5E38;&#x57FA;&#x4E8E;IP&#x548C;&#x4EE5;&#x592A;&#x7F51;&#xFF0C;&#x4EE5;&#x95ED;&#x5408;&#x62D3;&#x6251;&#x6392;&#x5217;&#xFF0C;&#x4EE5;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7684;&#x4E8C;&#x7B49;&#x5206;&#x5E26;&#x5BBD;&#x3010;9&#x3011;&#x3002;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4E13;&#x95E8;&#x7684;&#x7F51;&#x7EDC;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#xFF0C;&#x4F8B;&#x5982;&#x591A;&#x7EF4;&#x7F51;&#x683C;&#x548C;&#x73AF;&#x9762; &#x3010;10&#x3011;&#xFF0C;&#x8FD9;&#x4E3A;&#x5177;&#x6709;&#x5DF2;&#x77E5;&#x901A;&#x4FE1;&#x6A21;&#x5F0F;&#x7684;HPC&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
</li>
<li><p>&#x7CFB;&#x7EDF;&#x8D8A;&#x5927;&#xFF0C;&#x5176;&#x7EC4;&#x4EF6;&#x4E4B;&#x4E00;&#x5C31;&#x8D8A;&#x6709;&#x53EF;&#x80FD;&#x574F;&#x6389;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x574F;&#x6389;&#x7684;&#x4E1C;&#x897F;&#x5F97;&#x5230;&#x4FEE;&#x590D;&#xFF0C;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x53C8;&#x574F;&#x6389;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x6709;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6709;&#x7406;&#x7531;&#x8BA4;&#x4E3A;&#x603B;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x662F;&#x574F;&#x6389;&#x7684;&#x3010;7&#x3011;&#x3002;&#x5F53;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x7B56;&#x7565;&#x7531;&#x7B80;&#x5355;&#x7684;&#x653E;&#x5F03;&#x7EC4;&#x6210;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x6700;&#x7EC8;&#x4F1A;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x4ECE;&#x9519;&#x8BEF;&#x4E2D;&#x6062;&#x590D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x505A;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x4F5C;&#x3010;8&#x3011;&#x3002;</p>
</li>
<li><p>&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x53D1;&#x751F;&#x6545;&#x969C;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x6574;&#x4F53;&#x5DE5;&#x4F5C;&#x72B6;&#x6001;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5BF9;&#x4E8E;&#x64CD;&#x4F5C;&#x548C;&#x7EF4;&#x62A4;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x6EDA;&#x52A8;&#x5347;&#x7EA7;&#xFF08;&#x53C2;&#x9605;<a href="ch4.html">&#x7B2C;4&#x7AE0;</a>&#xFF09;&#xFF0C;&#x4E00;&#x6B21;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x800C;&#x670D;&#x52A1;&#x7EE7;&#x7EED;&#x670D;&#x52A1;&#x7528;&#x6237;&#x4E0D;&#x4E2D;&#x65AD;&#x3002;&#x5728;&#x4E91;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x53F0;&#x865A;&#x62DF;&#x673A;&#x8FD0;&#x884C;&#x4E0D;&#x4F73;&#xFF0C;&#x53EF;&#x4EE5;&#x6740;&#x6B7B;&#x5B83;&#x5E76;&#x8BF7;&#x6C42;&#x4E00;&#x53F0;&#x65B0;&#x7684;&#x865A;&#x62DF;&#x673A;&#xFF08;&#x5E0C;&#x671B;&#x65B0;&#x7684;&#x865A;&#x62DF;&#x673A;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF09;&#x3002;</p>
</li>
<li><p>&#x5728;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x5206;&#x6563;&#x7684;&#x90E8;&#x7F72;&#x4E2D;&#xFF08;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x5728;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x4E0A;&#x63A5;&#x8FD1;&#x7528;&#x6237;&#x4EE5;&#x51CF;&#x5C11;&#x8BBF;&#x95EE;&#x5EF6;&#x8FDF;&#xFF09;&#xFF0C;&#x901A;&#x4FE1;&#x5F88;&#x53EF;&#x80FD;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x8FDB;&#x884C;&#xFF0C;&#x4E0E;&#x672C;&#x5730;&#x7F51;&#x7EDC;&#x76F8;&#x6BD4;&#xFF0C;&#x901A;&#x4FE1;&#x901F;&#x5EA6;&#x7F13;&#x6162;&#x4E14;&#x4E0D;&#x53EF;&#x9760;&#x3002;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x5E38;&#x5047;&#x8BBE;&#x5B83;&#x4EEC;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x9760;&#x8FD1;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
</li>
</ul>
<p>&#x5982;&#x679C;&#x8981;&#x4F7F;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x63A5;&#x53D7;&#x90E8;&#x5206;&#x6545;&#x969C;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5E76;&#x5728;&#x8F6F;&#x4EF6;&#x4E2D;&#x5EFA;&#x7ACB;&#x5BB9;&#x9519;&#x673A;&#x5236;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4ECE;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7EC4;&#x4EF6;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x7CFB;&#x7EDF;&#x3002; &#xFF08;&#x6B63;&#x5982;&#x201C;<a href="ch1.html#&#x53EF;&#x9760;&#x6027;">&#x53EF;&#x9760;&#x6027;</a>&#x201D;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6CA1;&#x6709;&#x5B8C;&#x7F8E;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7406;&#x89E3;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9E;&#x9645;&#x627F;&#x8BFA;&#x7684;&#x9650;&#x5236;&#x3002;&#xFF09;</p>
<p>&#x200B;    &#x5373;&#x4F7F;&#x5728;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x8282;&#x70B9;&#x7684;&#x5C0F;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8003;&#x8651;&#x90E8;&#x5206;&#x6545;&#x969C;&#x4E5F;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x5C0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5927;&#x90E8;&#x5206;&#x7EC4;&#x4EF6;&#x5728;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x90FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FDF;&#x65E9;&#x4F1A;&#x6709;&#x4E00;&#x90E8;&#x5206;&#x7CFB;&#x7EDF;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x8F6F;&#x4EF6;&#x5FC5;&#x987B;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5904;&#x7406;&#x3002;&#x6545;&#x969C;&#x5904;&#x7406;&#x5FC5;&#x987B;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4E14;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#x7684;&#x8FD0;&#x7EF4;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5728;&#x53D1;&#x751F;&#x6545;&#x969C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F6F;&#x4EF6;&#x53EF;&#x80FD;&#x4F1A;&#x8868;&#x73B0;&#x51FA;&#x600E;&#x6837;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x200B;    &#x7B80;&#x5355;&#x5730;&#x5047;&#x8BBE;&#x7F3A;&#x9677;&#x5F88;&#x7F55;&#x89C1;&#xFF0C;&#x53EA;&#x662F;&#x5E0C;&#x671B;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x6700;&#x597D;&#x7684;&#x72B6;&#x51B5;&#x662F;&#x4E0D;&#x660E;&#x667A;&#x7684;&#x3002;&#x8003;&#x8651;&#x4E00;&#x7CFB;&#x5217;&#x53EF;&#x80FD;&#x7684;&#x9519;&#x8BEF;&#xFF08;&#x751A;&#x81F3;&#x662F;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x7684;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x5E76;&#x5728;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x4E2D;&#x4EBA;&#x4E3A;&#x5730;&#x521B;&#x5EFA;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x6765;&#x67E5;&#x770B;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6000;&#x7591;&#xFF0C;&#x60B2;&#x89C2;&#x548C;&#x504F;&#x6267;&#x72C2;&#x662F;&#x503C;&#x5F97;&#x7684;&#x3002;</p>
<blockquote>
<h4 id="&#x4ECE;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7EC4;&#x4EF6;&#x6784;&#x5EFA;&#x53EF;&#x9760;&#x7684;&#x7CFB;&#x7EDF;">&#x4ECE;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7EC4;&#x4EF6;&#x6784;&#x5EFA;&#x53EF;&#x9760;&#x7684;&#x7CFB;&#x7EDF;</h4>
<p>&#x60A8;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053;&#x8FD9;&#x662F;&#x5426;&#x6709;&#x610F;&#x4E49;&#x2014;&#x2014;&#x76F4;&#x89C2;&#x5730;&#x770B;&#x6765;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EA;&#x80FD;&#x50CF;&#x5176;&#x6700;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7EC4;&#x4EF6;&#xFF08;&#x6700;&#x8584;&#x5F31;&#x7684;&#x73AF;&#x8282;&#xFF09;&#x4E00;&#x6837;&#x53EF;&#x9760;&#x3002;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#xFF1A;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4ECE;&#x4E0D;&#x592A;&#x53EF;&#x9760;&#x7684;&#x6F5C;&#x5728;&#x57FA;&#x7840;&#x6784;&#x5EFA;&#x66F4;&#x53EF;&#x9760;&#x7684;&#x7CFB;&#x7EDF;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x9886;&#x57DF;&#x7684;&#x4E00;&#x4E2A;&#x53E4;&#x8001;&#x601D;&#x60F3;&#x3010;11&#x3011;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x7EA0;&#x9519;&#x7801;&#x5141;&#x8BB8;&#x6570;&#x5B57;&#x6570;&#x636E;&#x5728;&#x901A;&#x4FE1;&#x4FE1;&#x9053;&#x4E0A;&#x51C6;&#x786E;&#x4F20;&#x8F93;&#xFF0C;&#x5076;&#x5C14;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x9519;&#x8BEF;&#xFF0C;&#x4F8B;&#x5982;&#x7531;&#x4E8E;&#x65E0;&#x7EBF;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x65E0;&#x7EBF;&#x7535;&#x5E72;&#x6270;&#x3010;12&#x3011;&#x3002;</li>
<li><strong>&#x4E92;&#x8054;&#x7F51;&#x534F;&#x8BAE;&#xFF08;Internet Protocol, IP&#xFF09;</strong>&#x4E0D;&#x53EF;&#x9760;&#xFF1A;&#x53EF;&#x80FD;&#x4E22;&#x5F03;&#xFF0C;&#x5EF6;&#x8FDF;&#xFF0C;&#x590D;&#x5236;&#x6216;&#x91CD;&#x6392;&#x6570;&#x636E;&#x5305;&#x3002; &#x4F20;&#x8F93;&#x63A7;&#x5236;&#x534F;&#x8BAE;&#xFF08;Transmission Control Protocol, TCP&#xFF09;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x534F;&#x8BAE;&#xFF08;IP&#xFF09;&#x4E4B;&#x4E0A;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x53EF;&#x9760;&#x7684;&#x4F20;&#x8F93;&#x5C42;&#xFF1A;&#x5B83;&#x786E;&#x4FDD;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x5305;&#x88AB;&#x91CD;&#x65B0;&#x4F20;&#x8F93;&#xFF0C;&#x6D88;&#x9664;&#x91CD;&#x590D;&#xFF0C;&#x5E76;&#x4E14;&#x6570;&#x636E;&#x5305;&#x88AB;&#x91CD;&#x65B0;&#x7EC4;&#x88C5;&#x6210;&#x5B83;&#x4EEC;&#x88AB;&#x53D1;&#x9001;&#x7684;&#x987A;&#x5E8F;&#x3002;</li>
</ul>
<p>&#x867D;&#x7136;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x6BD4;&#x5B83;&#x7684;&#x5E95;&#x5C42;&#x90E8;&#x5206;&#x66F4;&#x53EF;&#x9760;&#xFF0C;&#x4F46;&#x5B83;&#x7684;&#x53EF;&#x9760;&#x6027;&#x603B;&#x662F;&#x6709;&#x9650;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7EA0;&#x9519;&#x7801;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5C11;&#x91CF;&#x7684;&#x5355;&#x6BD4;&#x7279;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x7684;&#x4FE1;&#x53F7;&#x88AB;&#x5E72;&#x6270;&#x6240;&#x6DF9;&#x6CA1;&#xFF0C;&#x90A3;&#x4E48;&#x901A;&#x8FC7;&#x4FE1;&#x9053;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x591A;&#x5C11;&#x6570;&#x636E;&#xFF0C;&#x662F;&#x6709;&#x6839;&#x672C;&#x6027;&#x7684;&#x9650;&#x5236;&#x7684;&#x3010;13&#x3011;&#x3002; TCP&#x53EF;&#x4EE5;&#x9690;&#x85CF;&#x6570;&#x636E;&#x5305;&#x7684;&#x4E22;&#x5931;&#xFF0C;&#x91CD;&#x590D;&#x548C;&#x91CD;&#x65B0;&#x6392;&#x5E8F;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4E0D;&#x80FD;&#x795E;&#x5947;&#x5730;&#x6D88;&#x9664;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5EF6;&#x8FDF;&#x3002;</p>
<p>&#x867D;&#x7136;&#x66F4;&#x53EF;&#x9760;&#x7684;&#x9AD8;&#x7EA7;&#x7CFB;&#x7EDF;&#x5E76;&#x4E0D;&#x5B8C;&#x7F8E;&#xFF0C;&#x4F46;&#x5B83;&#x4ECD;&#x7136;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5904;&#x7406;&#x4E86;&#x4E00;&#x4E9B;&#x68D8;&#x624B;&#x7684;&#x4F4E;&#x7EA7;&#x9519;&#x8BEF;&#xFF0C;&#x6240;&#x4EE5;&#x5176;&#x4F59;&#x7684;&#x9519;&#x8BEF;&#x901A;&#x5E38;&#x66F4;&#x5BB9;&#x6613;&#x63A8;&#x7406;&#x548C;&#x5904;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="ch12.html#&#x6570;&#x636E;&#x5E93;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x4E89;&#x8BBA;">&#x6570;&#x636E;&#x5E93;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x4E89;&#x8BBA;</a>&#x201D;&#x4E2D;&#x8FDB;&#x4E00;&#x6B65;&#x63A2;&#x8BA8;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<h2 id="&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7F51;&#x7EDC;">&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7F51;&#x7EDC;</h2>
<p>&#x200B;    &#x6B63;&#x5982;&#x5728;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7684;&#x4ECB;&#x7ECD;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x5173;&#x6CE8;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x662F;&#x65E0;&#x5171;&#x4EAB;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684;&#x4E00;&#x5806;&#x673A;&#x5668;&#x3002;&#x7F51;&#x7EDC;&#x662F;&#x8FD9;&#x4E9B;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x901A;&#x4FE1;&#x7684;&#x552F;&#x4E00;&#x9014;&#x5F84;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5185;&#x5B58;&#x548C;&#x78C1;&#x76D8;&#xFF0C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x7684;&#x5185;&#x5B58;&#x6216;&#x78C1;&#x76D8;&#xFF08;&#x9664;&#x4E86;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#xFF09;&#x3002;</p>
<p>&#x200B;    <strong>&#x65E0;&#x5171;&#x4EAB;</strong>&#x5E76;&#x4E0D;&#x662F;&#x6784;&#x5EFA;&#x7CFB;&#x7EDF;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x5F0F;&#xFF0C;&#x4F46;&#x5B83;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x6784;&#x5EFA;&#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x539F;&#x56E0;&#x5982;&#x4E0B;&#xFF1A;&#x76F8;&#x5BF9;&#x4FBF;&#x5B9C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x7279;&#x6B8A;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5546;&#x54C1;&#x5316;&#x7684;&#x4E91;&#x8BA1;&#x7B97;&#x670D;&#x52A1;&#xFF0C;&#x901A;&#x8FC7;&#x8DE8;&#x591A;&#x4E2A;&#x5730;&#x7406;&#x5206;&#x5E03;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x8FDB;&#x884C;&#x5197;&#x4F59;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x9AD8;&#x53EF;&#x9760;&#x6027;&#x3002;</p>
<p>&#x200B;    &#x4E92;&#x8054;&#x7F51;&#x548C;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x4EE5;&#x592A;&#x7F51;&#xFF09;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x5185;&#x90E8;&#x7F51;&#x7EDC;&#x90FD;&#x662F;<strong>&#x5F02;&#x6B65;&#x5206;&#x7EC4;&#x7F51;&#x7EDC;&#xFF08;asynchronous packet networks&#xFF09;</strong>&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#xFF08;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x7F51;&#x7EDC;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5B83;&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x5230;&#x8FBE;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5426;&#x5230;&#x8FBE;&#x3002;&#x5982;&#x679C;&#x60A8;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x5E76;&#x671F;&#x5F85;&#x54CD;&#x5E94;&#xFF0C;&#x5219;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x9519;&#xFF08;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x5982;<a href="img/fig8-1.png">&#x56FE;8-1</a>&#x6240;&#x793A;&#xFF09;&#xFF1A;</p>
<ol>
<li>&#x8BF7;&#x6C42;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x4E22;&#x5931;&#xFF08;&#x53EF;&#x80FD;&#x6709;&#x4EBA;&#x62D4;&#x6389;&#x4E86;&#x7F51;&#x7EBF;&#xFF09;&#x3002;</li>
<li>&#x8BF7;&#x6C42;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x6392;&#x961F;&#xFF0C;&#x7A0D;&#x540E;&#x5C06;&#x4EA4;&#x4ED8;&#xFF08;&#x4E5F;&#x8BB8;&#x7F51;&#x7EDC;&#x6216;&#x6536;&#x4EF6;&#x4EBA;&#x8D85;&#x8F7D;&#xFF09;&#x3002;</li>
<li>&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5931;&#x6548;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x5D29;&#x6E83;&#x6216;&#x5173;&#x673A;&#xFF09;&#x3002;</li>
<li>&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x6682;&#x65F6;&#x505C;&#x6B62;&#x4E86;&#x54CD;&#x5E94;&#xFF08;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6682;&#x505C;&#xFF1B;&#x53C2;&#x9605;&#x201C;<a href="#&#x6682;&#x505C;&#x8FDB;&#x7A0B;">&#x6682;&#x505C;&#x8FDB;&#x7A0B;</a>&#x201D;&#xFF09;&#xFF0C;&#x4F46;&#x7A0D;&#x540E;&#x4F1A;&#x518D;&#x6B21;&#x54CD;&#x5E94;&#x3002;</li>
<li>&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#x4E86;&#x8BF7;&#x6C42;&#xFF0C;&#x4F46;&#x662F;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x54CD;&#x5E94;&#x5DF2;&#x7ECF;&#x4E22;&#x5931;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#xFF09;&#x3002;</li>
<li>&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#x4E86;&#x8BF7;&#x6C42;&#xFF0C;&#x4F46;&#x662F;&#x54CD;&#x5E94;&#x5DF2;&#x7ECF;&#x88AB;&#x5EF6;&#x8FDF;&#xFF0C;&#x5E76;&#x4E14;&#x7A0D;&#x540E;&#x5C06;&#x88AB;&#x4F20;&#x9012;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x7F51;&#x7EDC;&#x6216;&#x8005;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x673A;&#x5668;&#x8FC7;&#x8F7D;&#xFF09;&#x3002;</li>
</ol>
<p><img src="img/fig8-1.png" alt=""></p>
<p><strong>&#x56FE;8-1 &#x5982;&#x679C;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x5E76;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x54CD;&#x5E94;&#xFF0C;&#x5219;&#x65E0;&#x6CD5;&#x533A;&#x5206;&#xFF08;a&#xFF09;&#x8BF7;&#x6C42;&#x662F;&#x5426;&#x4E22;&#x5931;&#xFF0C;&#xFF08;b&#xFF09;&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x662F;&#x5426;&#x5173;&#x95ED;&#xFF0C;&#x6216;&#xFF08;c&#xFF09;&#x54CD;&#x5E94;&#x662F;&#x5426;&#x4E22;&#x5931;&#x3002;</strong></p>
<p>&#x200B;    &#x53D1;&#x9001;&#x8005;&#x751A;&#x81F3;&#x4E0D;&#x80FD;&#x5206;&#x8FA8;&#x6570;&#x636E;&#x5305;&#x662F;&#x5426;&#x88AB;&#x53D1;&#x9001;&#xFF1A;&#x552F;&#x4E00;&#x7684;&#x9009;&#x62E9;&#x662F;&#x8BA9;&#x63A5;&#x6536;&#x8005;&#x53D1;&#x9001;&#x54CD;&#x5E94;&#x6D88;&#x606F;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x6216;&#x5EF6;&#x8FDF;&#x3002;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5728;&#x5F02;&#x6B65;&#x7F51;&#x7EDC;&#x4E2D;&#x96BE;&#x4EE5;&#x533A;&#x5206;&#xFF1A;&#x60A8;&#x6240;&#x62E5;&#x6709;&#x7684;&#x552F;&#x4E00;&#x4FE1;&#x606F;&#x662F;&#xFF0C;&#x60A8;&#x5C1A;&#x672A;&#x6536;&#x5230;&#x54CD;&#x5E94;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x54CD;&#x5E94;&#xFF0C;&#x5219;&#x65E0;&#x6CD5;&#x8BF4;&#x660E;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x200B;    &#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x901A;&#x5E38;&#x65B9;&#x6CD5;&#x662F;<strong>&#x8D85;&#x65F6;&#xFF08;Timeout&#xFF09;</strong>&#xFF1A;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x653E;&#x5F03;&#x7B49;&#x5F85;&#xFF0C;&#x5E76;&#x4E14;&#x8BA4;&#x4E3A;&#x54CD;&#x5E94;&#x4E0D;&#x4F1A;&#x5230;&#x8FBE;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x53D1;&#x751F;&#x8D85;&#x65F6;&#x65F6;&#xFF0C;&#x4F60;&#x4ECD;&#x7136;&#x4E0D;&#x77E5;&#x9053;&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x662F;&#x5426;&#x6536;&#x5230;&#x4E86;&#x8BF7;&#x6C42;&#xFF08;&#x5982;&#x679C;&#x8BF7;&#x6C42;&#x4ECD;&#x7136;&#x5728;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x6392;&#x961F;&#xFF0C;&#x90A3;&#x4E48;&#x5373;&#x4F7F;&#x53D1;&#x4EF6;&#x4EBA;&#x5DF2;&#x7ECF;&#x653E;&#x5F03;&#x4E86;&#x8BE5;&#x8BF7;&#x6C42;&#xFF0C;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x4F1A;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x7ED9;&#x6536;&#x4EF6;&#x4EBA;&#xFF09;&#x3002;</p>
<h3 id="&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x7F51;&#x7EDC;&#x6545;&#x969C;">&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x7F51;&#x7EDC;&#x6545;&#x969C;</h3>
<p>&#x200B;    &#x6211;&#x4EEC;&#x51E0;&#x5341;&#x5E74;&#x6765;&#x4E00;&#x76F4;&#x5728;&#x5EFA;&#x8BBE;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x2014;&#x2014;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x627E;&#x51FA;&#x4E86;&#x4F7F;&#x7F51;&#x7EDC;&#x53D8;&#x5F97;&#x53EF;&#x9760;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x4F3C;&#x4E4E;&#x8FD8;&#x6CA1;&#x6709;&#x6210;&#x529F;&#x3002;</p>
<p>&#x200B;    &#x6709;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x7684;&#x7814;&#x7A76;&#x548C;&#x5927;&#x91CF;&#x7684;&#x8F76;&#x4E8B;&#x8BC1;&#x636E;&#x8868;&#x660E;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x50CF;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x8FD0;&#x8425;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x90A3;&#x6837;&#x7684;&#x53D7;&#x63A7;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x4E5F;&#x53EF;&#x80FD;&#x51FA;&#x4E4E;&#x610F;&#x6599;&#x5730;&#x666E;&#x904D;&#x3002;&#x5728;&#x4E00;&#x5BB6;&#x4E2D;&#x578B;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x8FDB;&#x884C;&#x7684;&#x4E00;&#x9879;&#x7814;&#x7A76;&#x53D1;&#x73B0;&#xFF0C;&#x6BCF;&#x4E2A;&#x6708;&#x5927;&#x7EA6;&#x6709;12&#x4E2A;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#xFF0C;&#x5176;&#x4E2D;&#x4E00;&#x534A;&#x65AD;&#x5F00;&#x4E00;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x4E00;&#x534A;&#x65AD;&#x5F00;&#x6574;&#x4E2A;&#x673A;&#x67B6;&#x3010;15&#x3011;&#x3002;&#x53E6;&#x4E00;&#x9879;&#x7814;&#x7A76;&#x6D4B;&#x91CF;&#x4E86;&#x67B6;&#x9876;&#x5F0F;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x6C47;&#x805A;&#x4EA4;&#x6362;&#x673A;&#x548C;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x7B49;&#x7EC4;&#x4EF6;&#x7684;&#x6545;&#x969C;&#x7387;&#x3010;16&#x3011;&#x3002;&#x5B83;&#x53D1;&#x73B0;&#x6DFB;&#x52A0;&#x5197;&#x4F59;&#x7F51;&#x7EDC;&#x8BBE;&#x5907;&#x4E0D;&#x4F1A;&#x50CF;&#x60A8;&#x6240;&#x5E0C;&#x671B;&#x7684;&#x90A3;&#x6837;&#x51CF;&#x5C11;&#x6545;&#x969C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x80FD;&#x9632;&#x8303;&#x4EBA;&#x4E3A;&#x9519;&#x8BEF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x9519;&#x8BEF;&#x914D;&#x7F6E;&#x7684;&#x4EA4;&#x6362;&#x673A;&#xFF09;&#xFF0C;&#x8FD9;&#x662F;&#x9020;&#x6210;&#x4E2D;&#x65AD;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x200B;    &#x8BF8;&#x5982;EC2&#x4E4B;&#x7C7B;&#x7684;&#x516C;&#x6709;&#x4E91;&#x670D;&#x52A1;&#x56E0;&#x9891;&#x7E41;&#x7684;&#x6682;&#x6001;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x800C;&#x81ED;&#x540D;&#x662D;&#x7740;&#x3010;14&#x3011;&#xFF0C;&#x7BA1;&#x7406;&#x826F;&#x597D;&#x7684;&#x79C1;&#x6709;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x53EF;&#x80FD;&#x662F;&#x66F4;&#x7A33;&#x5B9A;&#x7684;&#x73AF;&#x5883;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x4E0D;&#x53D7;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x7684;&#x56F0;&#x6270;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x4EA4;&#x6362;&#x673A;&#x8F6F;&#x4EF6;&#x5347;&#x7EA7;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x53D1;&#x7F51;&#x7EDC;&#x62D3;&#x6251;&#x91CD;&#x6784;&#xFF0C;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x53EF;&#x80FD;&#x4F1A;&#x5EF6;&#x8FDF;&#x8D85;&#x8FC7;&#x4E00;&#x5206;&#x949F;&#x3010;17&#x3011;&#x3002;&#x9CA8;&#x9C7C;&#x53EF;&#x80FD;&#x54AC;&#x4F4F;&#x6D77;&#x5E95;&#x7535;&#x7F06;&#x5E76;&#x635F;&#x574F;&#x5B83;&#x4EEC; &#x3010;18&#x3011;&#x3002;&#x5176;&#x4ED6;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x6545;&#x969C;&#x5305;&#x62EC;&#x7F51;&#x7EDC;&#x63A5;&#x53E3;&#x6709;&#x65F6;&#x4F1A;&#x4E22;&#x5F03;&#x6240;&#x6709;&#x5165;&#x7AD9;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4F46;&#x662F;&#x6210;&#x529F;&#x53D1;&#x9001;&#x51FA;&#x7AD9;&#x6570;&#x636E;&#x5305; &#x3010;19&#x3011;&#xFF1A;&#x4EC5;&#x4EC5;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x94FE;&#x63A5;&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x4E0A;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5B83;&#x4E5F;&#x5728;&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x5411;&#x5DE5;&#x4F5C;&#x3002;</p>
<blockquote>
<h4 id="&#x7F51;&#x7EDC;&#x5206;&#x533A;">&#x7F51;&#x7EDC;&#x5206;&#x533A;</h4>
<p>&#x200B;    &#x5F53;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x800C;&#x88AB;&#x5207;&#x65AD;&#x65F6;&#xFF0C;&#x6709;&#x65F6;&#x79F0;&#x4E3A;<strong>&#x7F51;&#x7EDC;&#x5206;&#x533A;&#xFF08;network partition&#xFF09;</strong>&#x6216;<strong>&#x7F51;&#x7EDC;&#x65AD;&#x88C2;&#xFF08;netsplit&#xFF09;</strong>&#x3002;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x575A;&#x6301;&#x4F7F;&#x7528;&#x66F4;&#x4E00;&#x822C;&#x7684;&#x672F;&#x8BED;<strong>&#x7F51;&#x7EDC;&#x6545;&#x969C;&#xFF08;network fault&#xFF09;</strong>&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x4E0E;<a href="ch6.html">&#x7B2C;6&#x7AE0;</a>&#x8BA8;&#x8BBA;&#x7684;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x533A;&#xFF08;&#x5206;&#x7247;&#xFF09;&#x76F8;&#x6DF7;&#x6DC6;&#x3002;</p>
</blockquote>
<p>&#x200B;    &#x5373;&#x4F7F;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x5728;&#x4F60;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x975E;&#x5E38;&#x7F55;&#x89C1;&#xFF0C;&#x6545;&#x969C;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4F60;&#x7684;&#x8F6F;&#x4EF6;&#x9700;&#x8981;&#x80FD;&#x591F;&#x5904;&#x7406;&#x5B83;&#x4EEC;&#x3002;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x662F;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x7684;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x4E0E;&#x6D4B;&#x8BD5;&#xFF0C;&#x6B66;&#x65AD;&#x5730;&#x8BB2;&#xFF0C;&#x5404;&#x79CD;&#x9519;&#x8BEF;&#x53EF;&#x80FD;&#x90FD;&#x4F1A;&#x53D1;&#x751F;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5373;&#x4F7F;&#x7F51;&#x7EDC;&#x6062;&#x590D;&#x3010;20&#x3011;&#xFF0C;&#x96C6;&#x7FA4;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;<strong>&#x6B7B;&#x9501;</strong>&#xFF0C;&#x6C38;&#x4E45;&#x65E0;&#x6CD5;&#x4E3A;&#x8BF7;&#x6C42;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4F1A;&#x5220;&#x9664;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x3010;21&#x3011;&#x3002;&#x5982;&#x679C;&#x8F6F;&#x4EF6;&#x88AB;&#x7F6E;&#x4E8E;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x505A;&#x51FA;&#x51FA;&#x4E4E;&#x610F;&#x6599;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x200B;    &#x5904;&#x7406;&#x7F51;&#x7EDC;&#x6545;&#x969C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5BB9;&#x5FCD;&#x5B83;&#x4EEC;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x5E38;&#x662F;&#x76F8;&#x5F53;&#x53EF;&#x9760;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x662F;&#x5F53;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x9047;&#x5230;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x7B80;&#x5355;&#x5730;&#x5411;&#x7528;&#x6237;&#x663E;&#x793A;&#x4E00;&#x6761;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x77E5;&#x9053;&#x60A8;&#x7684;&#x8F6F;&#x4EF6;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x4ECE;&#x4E2D;&#x6062;&#x590D;&#x3002;&#x6709;&#x610F;&#x8BC6;&#x5730;&#x89E6;&#x53D1;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x5E76;&#x6D4B;&#x8BD5;&#x7CFB;&#x7EDF;&#x54CD;&#x5E94;&#xFF08;&#x8FD9;&#x662F;Chaos Monkey&#x80CC;&#x540E;&#x7684;&#x60F3;&#x6CD5;&#xFF1B;&#x53C2;&#x9605;&#x201C;<a href="ch1.html#&#x53EF;&#x9760;&#x6027;">&#x53EF;&#x9760;&#x6027;</a>&#x201D;&#xFF09;&#x3002;</p>
<h3 id="&#x68C0;&#x6D4B;&#x6545;&#x969C;">&#x68C0;&#x6D4B;&#x6545;&#x969C;</h3>
<p>&#x8BB8;&#x591A;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x6545;&#x969C;&#x8282;&#x70B9;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;&#x9700;&#x8981;&#x505C;&#x6B62;&#x5411;&#x5DF2;&#x6B7B;&#x4EA1;&#x7684;&#x8282;&#x70B9;&#x8F6C;&#x53D1;&#x8BF7;&#x6C42;&#xFF08;&#x5373;&#x4ECE;<strong>&#x79FB;&#x51FA;&#x8F6E;&#x8BE2;&#x5217;&#x8868;&#xFF08;out of rotation&#xFF09;</strong>&#xFF09;&#x3002;</li>
<li>&#x5728;&#x5355;&#x4E3B;&#x590D;&#x5236;&#x529F;&#x80FD;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x4E3B;&#x5E93;&#x5931;&#x6548;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5C06;&#x4ECE;&#x5E93;&#x4E4B;&#x4E00;&#x5347;&#x7EA7;&#x4E3A;&#x65B0;&#x4E3B;&#x5E93;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch5.html#&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;">&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;</a>&#x201D;&#xFF09;&#x3002;</li>
</ul>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x7F51;&#x7EDC;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x4F7F;&#x5F97;&#x5F88;&#x96BE;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x662F;&#x5426;&#x5DE5;&#x4F5C;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x6536;&#x5230;&#x4E00;&#x4E9B;&#x53CD;&#x9988;&#x4FE1;&#x606F;&#xFF0C;&#x660E;&#x786E;&#x544A;&#x8BC9;&#x60A8;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x6CA1;&#x6709;&#x6210;&#x529F;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x5230;&#x8FBE;&#x8FD0;&#x884C;&#x8282;&#x70B9;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x8FDB;&#x7A0B;&#x6B63;&#x5728;&#x4FA6;&#x542C;&#x76EE;&#x6807;&#x7AEF;&#x53E3;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x56E0;&#x4E3A;&#x8FDB;&#x7A0B;&#x5D29;&#x6E83;&#xFF09;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5C06;&#x901A;&#x8FC7;&#x53D1;&#x9001;FIN&#x6216;RST&#x6765;&#x5173;&#x95ED;&#x5E76;&#x91CD;&#x7528;TCP&#x8FDE;&#x63A5;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x8282;&#x70B9;&#x5728;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x65F6;&#x53D1;&#x751F;&#x5D29;&#x6E83;&#xFF0C;&#x5219;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x5B9E;&#x9645;&#x5904;&#x7406;&#x4E86;&#x591A;&#x5C11;&#x6570;&#x636E;&#x3010;22&#x3011;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8282;&#x70B9;&#x8FDB;&#x7A0B;&#x5D29;&#x6E83;&#xFF08;&#x6216;&#x88AB;&#x7BA1;&#x7406;&#x5458;&#x6740;&#x6B7B;&#xFF09;&#xFF0C;&#x4F46;&#x8282;&#x70B9;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4ECD;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x5219;&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x6709;&#x5173;&#x8BE5;&#x5D29;&#x6E83;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x4FBF;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x63A5;&#x7BA1;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7B49;&#x5F85;&#x8D85;&#x65F6;&#x5230;&#x671F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;HBase&#x505A;&#x8FD9;&#x4E2A;&#x3010;23&#x3011;&#x3002;</li>
<li>&#x5982;&#x679C;&#x60A8;&#x6709;&#x6743;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;&#x7684;&#x7BA1;&#x7406;&#x754C;&#x9762;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x67E5;&#x8BE2;&#x5B83;&#x4EEC;&#x4EE5;&#x68C0;&#x6D4B;&#x786C;&#x4EF6;&#x7EA7;&#x522B;&#x7684;&#x94FE;&#x8DEF;&#x6545;&#x969C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8FDC;&#x7A0B;&#x673A;&#x5668;&#x662F;&#x5426;&#x5173;&#x95ED;&#x7535;&#x6E90;&#xFF09;&#x3002;&#x5982;&#x679C;&#x60A8;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x8FDE;&#x63A5;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x60A8;&#x5904;&#x4E8E;&#x5171;&#x4EAB;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x800C;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x6216;&#x8005;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x800C;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7BA1;&#x7406;&#x754C;&#x9762;&#xFF0C;&#x5219;&#x6392;&#x9664;&#x6B64;&#x9009;&#x9879;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8DEF;&#x7531;&#x5668;&#x786E;&#x8BA4;&#x60A8;&#x5C1D;&#x8BD5;&#x8FDE;&#x63A5;&#x7684;IP&#x5730;&#x5740;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;ICMP&#x76EE;&#x6807;&#x4E0D;&#x53EF;&#x8FBE;&#x6570;&#x636E;&#x5305;&#x56DE;&#x590D;&#x60A8;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#x4E0D;&#x5177;&#x5907;&#x795E;&#x5947;&#x7684;&#x6545;&#x969C;&#x68C0;&#x6D4B;&#x80FD;&#x529B;&#x2014;&#x2014;&#x5B83;&#x53D7;&#x5230;&#x4E0E;&#x7F51;&#x7EDC;&#x5176;&#x4ED6;&#x53C2;&#x4E0E;&#x8005;&#x76F8;&#x540C;&#x7684;&#x9650;&#x5236;&#x3002;</li>
</ul>
<p>&#x5173;&#x4E8E;&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x5173;&#x95ED;&#x7684;&#x5FEB;&#x901F;&#x53CD;&#x9988;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x80FD;&#x6307;&#x671B;&#x5B83;&#x3002;&#x5373;&#x4F7F;TCP&#x786E;&#x8BA4;&#x5DF2;&#x7ECF;&#x4F20;&#x9001;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x5904;&#x7406;&#x4E4B;&#x524D;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5D29;&#x6E83;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x662F;&#x6210;&#x529F;&#x7684;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x7684;&#x79EF;&#x6781;&#x54CD;&#x5E94;&#x3010;24&#x3011;&#x3002;</p>
<p>&#x200B;    &#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x51FA;&#x4E86;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5806;&#x6808;&#x7684;&#x67D0;&#x4E2A;&#x5C42;&#x6B21;&#x4E0A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x54CD;&#x5E94;&#xFF0C;&#x4F46;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5047;&#x8BBE;&#x4F60;&#x6839;&#x672C;&#x5C31;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x4EFB;&#x4F55;&#x56DE;&#x5E94;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x91CD;&#x8BD5;&#x51E0;&#x6B21;&#xFF08;TCP&#x91CD;&#x8BD5;&#x662F;&#x900F;&#x660E;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x60A8;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x522B;&#x91CD;&#x8BD5;&#xFF09;&#xFF0C;&#x7B49;&#x5F85;&#x8D85;&#x65F6;&#x8FC7;&#x671F;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x5728;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x54CD;&#x5E94;&#xFF0C;&#x5219;&#x6700;&#x7EC8;&#x58F0;&#x660E;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x6B7B;&#x4EA1;&#x3002;</p>
<h3 id="&#x8D85;&#x65F6;&#x4E0E;&#x65E0;&#x7A77;&#x7684;&#x5EF6;&#x8FDF;">&#x8D85;&#x65F6;&#x4E0E;&#x65E0;&#x7A77;&#x7684;&#x5EF6;&#x8FDF;</h3>
<p>&#x200B;    &#x5982;&#x679C;&#x8D85;&#x65F6;&#x662F;&#x68C0;&#x6D4B;&#x6545;&#x969C;&#x7684;&#x552F;&#x4E00;&#x53EF;&#x9760;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x8D85;&#x65F6;&#x5E94;&#x8BE5;&#x7B49;&#x5F85;&#x591A;&#x4E45;&#xFF1F;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#x6CA1;&#x6709;&#x7B80;&#x5355;&#x7684;&#x7B54;&#x6848;&#x3002;</p>
<p>&#x200B;    &#x957F;&#x65F6;&#x95F4;&#x7684;&#x8D85;&#x65F6;&#x610F;&#x5473;&#x7740;&#x957F;&#x65F6;&#x95F4;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x88AB;&#x5BA3;&#x544A;&#x6B7B;&#x4EA1;&#xFF08;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4E0D;&#x5F97;&#x4E0D;&#x7B49;&#x5F85;&#xFF0C;&#x6216;&#x8005;&#x770B;&#x5230;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#xFF09;&#x3002;&#x77ED;&#x6682;&#x7684;&#x8D85;&#x65F6;&#x53EF;&#x4EE5;&#x66F4;&#x5FEB;&#x5730;&#x68C0;&#x6D4B;&#x5230;&#x6545;&#x969C;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x53EA;&#x662F;&#x7ECF;&#x5386;&#x4E86;&#x6682;&#x65F6;&#x7684;&#x51CF;&#x901F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x4E8E;&#x8282;&#x70B9;&#x6216;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x8D1F;&#x8F7D;&#x5CF0;&#x503C;&#xFF09;&#x800C;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x5730;&#x5BA3;&#x5E03;&#x8282;&#x70B9;&#x5931;&#x6548;&#x7684;&#x98CE;&#x9669;&#x66F4;&#x9AD8;&#x3002;</p>
<p>&#x200B;    &#x8FC7;&#x65E9;&#x5730;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x6B7B;&#x4E86;&#x662F;&#x6709;&#x95EE;&#x9898;&#x7684;&#xFF1A;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x6D3B;&#x7740;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6B63;&#x5728;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x52A8;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x53D1;&#x9001;&#x4E00;&#x5C01;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF09;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x63A5;&#x7BA1;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x53EF;&#x80FD;&#x4F1A;&#x6700;&#x7EC8;&#x6267;&#x884C;&#x4E24;&#x6B21;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="#&#x77E5;&#x8BC6;&#xFF0C;&#x771F;&#x76F8;&#x548C;&#x8C0E;&#x8A00;">&#x77E5;&#x8BC6;&#xFF0C;&#x771F;&#x76F8;&#x548C;&#x8C0E;&#x8A00;</a>&#x201D;&#x4EE5;&#x53CA;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x548C;<a href="ch11.html">&#x7B2C;11&#x7AE0;</a>&#x4E2D;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x200B;    &#x5F53;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x88AB;&#x5BA3;&#x544A;&#x6B7B;&#x4EA1;&#x65F6;&#xFF0C;&#x5B83;&#x7684;&#x804C;&#x8D23;&#x9700;&#x8981;&#x8F6C;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x4F1A;&#x7ED9;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x548C;&#x7F51;&#x7EDC;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x8D1F;&#x62C5;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x5904;&#x4E8E;&#x9AD8;&#x8D1F;&#x8377;&#x72B6;&#x6001;&#xFF0C;&#x5219;&#x8FC7;&#x65E9;&#x5BA3;&#x544A;&#x8282;&#x70B9;&#x6B7B;&#x4EA1;&#x4F1A;&#x4F7F;&#x95EE;&#x9898;&#x66F4;&#x4E25;&#x91CD;&#x3002;&#x5C24;&#x5176;&#x662F;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#xFF0C;&#x8282;&#x70B9;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x6B7B;&#x4EA1;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x4E8E;&#x8FC7;&#x8F7D;&#x5BFC;&#x81F4;&#x54CD;&#x5E94;&#x7F13;&#x6162;&#xFF1B;&#x5C06;&#x5176;&#x8D1F;&#x8F7D;&#x8F6C;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;<strong>&#x7EA7;&#x8054;&#x5931;&#x6548;&#xFF08;cascading failure&#xFF09;</strong>&#xFF08;&#x5728;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x5BA3;&#x544A;&#x5BF9;&#x65B9;&#x6B7B;&#x4EA1;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x505C;&#x6B62;&#x5DE5;&#x4F5C;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x8BBE;&#x60F3;&#x4E00;&#x4E2A;&#x865A;&#x6784;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x5305;&#x7684;&#x6700;&#x5927;&#x5EF6;&#x8FDF;&#x2014;&#x2014;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x8981;&#x4E48;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x4F20;&#x9001;&#xFF0C;&#x8981;&#x4E48;&#x4E22;&#x5931;&#xFF0C;&#x4F46;&#x662F;&#x4F20;&#x9012;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6BD4;$d$&#x66F4;&#x957F;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5047;&#x8BBE;&#x4F60;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x975E;&#x6545;&#x969C;&#x8282;&#x70B9;&#x603B;&#x662F;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;$r$&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x6BCF;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x8BF7;&#x6C42;&#x5728;$2d + r$&#x65F6;&#x95F4;&#x5185;&#x90FD;&#x80FD;&#x6536;&#x5230;&#x54CD;&#x5E94;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5728;&#x6B64;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x54CD;&#x5E94;&#xFF0C;&#x5219;&#x77E5;&#x9053;&#x7F51;&#x7EDC;&#x6216;&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x4E0D;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x662F;&#x6210;&#x7ACB;&#x7684;&#xFF0C;$2d + r$ &#x4F1A;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x8D85;&#x65F6;&#x8BBE;&#x7F6E;&#x3002;</p>
<p>&#x200B;    &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x90FD;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x4FDD;&#x8BC1;&#xFF1A;&#x5F02;&#x6B65;&#x7F51;&#x7EDC;&#x5177;&#x6709;&#x65E0;&#x9650;&#x7684;&#x5EF6;&#x8FDF;&#xFF08;&#x5373;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x5730;&#x4F20;&#x9001;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4F46;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x6CA1;&#x6709;&#x4E0A;&#x9650;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5927;&#x591A;&#x6570;&#x670D;&#x52A1;&#x5668;&#x5B9E;&#x73B0;&#x5E76;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x6700;&#x5927;&#x65F6;&#x95F4;&#x5185;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="#&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;">&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;</a>&#x201D;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x6545;&#x969C;&#x68C0;&#x6D4B;&#xFF0C;&#x7CFB;&#x7EDF;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x5FEB;&#x901F;&#x8FD0;&#x884C;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x7684;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5F88;&#x77ED;&#xFF0C;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x77AC;&#x65F6;&#x5C16;&#x5CF0;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7CFB;&#x7EDF;&#x5931;&#x8861;&#x3002;</p>
<h4 id="&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x548C;&#x6392;&#x961F;">&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x548C;&#x6392;&#x961F;</h4>
<p>&#x200B;    &#x5728;&#x9A7E;&#x9A76;&#x6C7D;&#x8F66;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x4EA4;&#x901A;&#x62E5;&#x5835;&#xFF0C;&#x9053;&#x8DEF;&#x4EA4;&#x901A;&#x7F51;&#x7EDC;&#x7684;&#x901A;&#x884C;&#x65F6;&#x95F4;&#x5F80;&#x5F80;&#x4E0D;&#x5C3D;&#x76F8;&#x540C;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4E0A;&#x6570;&#x636E;&#x5305;&#x5EF6;&#x8FDF;&#x7684;&#x53EF;&#x53D8;&#x6027;&#x901A;&#x5E38;&#x662F;&#x7531;&#x4E8E;&#x6392;&#x961F;&#x3010;25&#x3011;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x540C;&#x65F6;&#x5C1D;&#x8BD5;&#x5C06;&#x6570;&#x636E;&#x5305;&#x53D1;&#x9001;&#x5230;&#x540C;&#x4E00;&#x76EE;&#x7684;&#x5730;&#xFF0C;&#x5219;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;&#x5FC5;&#x987B;&#x5C06;&#x5B83;&#x4EEC;&#x6392;&#x961F;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x9010;&#x4E2A;&#x9001;&#x5165;&#x76EE;&#x6807;&#x7F51;&#x7EDC;&#x94FE;&#x8DEF;&#xFF08;&#x5982;<a href="img/fig8-2.png">&#x56FE;8-2</a>&#x6240;&#x793A;&#xFF09;&#x3002;&#x5728;&#x7E41;&#x5FD9;&#x7684;&#x7F51;&#x7EDC;&#x94FE;&#x8DEF;&#x4E0A;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x63D2;&#x69FD;&#xFF08;&#x8FD9;&#x79F0;&#x4E3A;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#xFF09;&#x3002;&#x5982;&#x679C;&#x4F20;&#x5165;&#x7684;&#x6570;&#x636E;&#x592A;&#x591A;&#xFF0C;&#x4EA4;&#x6362;&#x673A;&#x961F;&#x5217;&#x586B;&#x6EE1;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x5C06;&#x88AB;&#x4E22;&#x5F03;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x6570;&#x636E;&#x5305; - &#x5373;&#x4F7F;&#x7F51;&#x7EDC;&#x8FD0;&#x884C;&#x826F;&#x597D;&#x3002;</li>
<li>&#x5F53;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x76EE;&#x6807;&#x673A;&#x5668;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;CPU&#x5185;&#x6838;&#x5F53;&#x524D;&#x90FD;&#x5904;&#x4E8E;&#x7E41;&#x5FD9;&#x72B6;&#x6001;&#xFF0C;&#x5219;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#x7684;&#x4F20;&#x5165;&#x8BF7;&#x6C42;&#x5C06;&#x88AB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6392;&#x961F;&#xFF0C;&#x76F4;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x51C6;&#x5907;&#x597D;&#x5904;&#x7406;&#x5B83;&#x4E3A;&#x6B62;&#x3002;&#x6839;&#x636E;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x8D1F;&#x8F7D;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E00;&#x6BB5;&#x4EFB;&#x610F;&#x7684;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x5728;&#x865A;&#x62DF;&#x5316;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7ECF;&#x5E38;&#x6682;&#x505C;&#x51E0;&#x5341;&#x6BEB;&#x79D2;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x4F7F;&#x7528;CPU&#x5185;&#x6838;&#x3002;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#xFF0C;&#x865A;&#x62DF;&#x673A;&#x4E0D;&#x80FD;&#x4ECE;&#x7F51;&#x7EDC;&#x4E2D;&#x6D88;&#x8017;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x4F20;&#x5165;&#x7684;&#x6570;&#x636E;&#x88AB;&#x865A;&#x62DF;&#x673A;&#x76D1;&#x89C6;&#x5668; &#x3010;26&#x3011;&#x6392;&#x961F;&#xFF08;&#x7F13;&#x51B2;&#xFF09;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x589E;&#x52A0;&#x4E86;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x7684;&#x53EF;&#x53D8;&#x6027;&#x3002;</li>
<li>TCP&#x6267;&#x884C;<strong>&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF08;flow control&#xFF09;</strong>&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x62E5;&#x585E;&#x907F;&#x514D;&#xFF08;congestion avoidance&#xFF09;</strong>&#x6216;<strong>&#x80CC;&#x538B;&#xFF08;backpressure&#xFF09;</strong>&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x8282;&#x70B9;&#x9650;&#x5236;&#x81EA;&#x5DF1;&#x7684;&#x53D1;&#x9001;&#x901F;&#x7387;&#x4EE5;&#x907F;&#x514D;&#x7F51;&#x7EDC;&#x94FE;&#x8DEF;&#x6216;&#x63A5;&#x6536;&#x8282;&#x70B9;&#x8FC7;&#x8F7D;&#x3010;27&#x3011;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x6570;&#x636E;&#x751A;&#x81F3;&#x8FDB;&#x5165;&#x7F51;&#x7EDC;&#x4E4B;&#x524D;&#xFF0C;&#x5728;&#x53D1;&#x9001;&#x8005;&#x5904;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x989D;&#x5916;&#x7684;&#x6392;&#x961F;&#x3002;</li>
</ul>
<p><img src="img/fig8-2.png" alt=""></p>
<p><strong>&#x56FE;8-2 &#x5982;&#x679C;&#x6709;&#x591A;&#x53F0;&#x673A;&#x5668;&#x5C06;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x53D1;&#x9001;&#x5230;&#x540C;&#x4E00;&#x76EE;&#x7684;&#x5730;&#xFF0C;&#x5219;&#x5176;&#x4EA4;&#x6362;&#x673A;&#x961F;&#x5217;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x586B;&#x6EE1;&#x3002;&#x5728;&#x8FD9;&#x91CC;&#xFF0C;&#x7AEF;&#x53E3;1,2&#x548C;4&#x90FD;&#x8BD5;&#x56FE;&#x53D1;&#x9001;&#x6570;&#x636E;&#x5305;&#x5230;&#x7AEF;&#x53E3;3</strong></p>
<p>&#x200B;    &#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;TCP&#x5728;&#x67D0;&#x4E2A;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5185;&#x6CA1;&#x6709;&#x88AB;&#x786E;&#x8BA4;&#xFF08;&#x8FD9;&#x662F;&#x6839;&#x636E;&#x89C2;&#x5BDF;&#x7684;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;&#x8BA1;&#x7B97;&#x7684;&#xFF09;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x6570;&#x636E;&#x5305;&#x4E22;&#x5931;&#xFF0C;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x5305;&#x5C06;&#x81EA;&#x52A8;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x3002;&#x5C3D;&#x7BA1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x6570;&#x636E;&#x5305;&#x4E22;&#x5931;&#x548C;&#x91CD;&#x65B0;&#x4F20;&#x8F93;&#xFF0C;&#x4F46;&#x5B83;&#x770B;&#x5230;&#x4E86;&#x5EF6;&#x8FDF;&#xFF08;&#x7B49;&#x5F85;&#x8D85;&#x65F6;&#x5230;&#x671F;&#xFF0C;&#x7136;&#x540E;&#x7B49;&#x5F85;&#x91CD;&#x65B0;&#x4F20;&#x8F93;&#x7684;&#x6570;&#x636E;&#x5305;&#x5F97;&#x5230;&#x786E;&#x8BA4;&#xFF09;&#x3002;</p>
<blockquote>
<h3 id="tcp&#x4E0E;udp">TCP&#x4E0E;UDP</h3>
<p>&#x200B;    &#x4E00;&#x4E9B;&#x5BF9;&#x5EF6;&#x8FDF;&#x654F;&#x611F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF08;&#x5982;&#x89C6;&#x9891;&#x4F1A;&#x8BAE;&#x548C;IP&#x8BED;&#x97F3;&#xFF08;VoIP&#xFF09;&#xFF09;&#x4F7F;&#x7528;UDP&#x800C;&#x4E0D;&#x662F;TCP&#x3002;&#x8FD9;&#x662F;&#x5728;&#x53EF;&#x9760;&#x6027;&#x548C;&#x548C;&#x5EF6;&#x8FDF;&#x53EF;&#x53D8;&#x6027;&#x4E4B;&#x95F4;&#x7684;&#x6298;&#x8877;&#xFF1A;&#x7531;&#x4E8E;UDP&#x4E0D;&#x6267;&#x884C;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x5E76;&#x4E14;&#x4E0D;&#x91CD;&#x4F20;&#x4E22;&#x5931;&#x7684;&#x5206;&#x7EC4;&#xFF0C;&#x6240;&#x4EE5;&#x907F;&#x514D;&#x4E86;&#x53EF;&#x53D8;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x7684;&#x4E00;&#x4E9B;&#x539F;&#x56E0;&#xFF08;&#x5C3D;&#x7BA1;&#x5B83;&#x4ECD;&#x7136;&#x6613;&#x53D7;&#x5207;&#x6362;&#x961F;&#x5217;&#x548C;&#x8C03;&#x5EA6;&#x5EF6;&#x8FDF;&#x7684;&#x5F71;&#x54CD;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x5EF6;&#x8FDF;&#x6570;&#x636E;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;UDP&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;VoIP&#x7535;&#x8BDD;&#x547C;&#x53EB;&#x4E2D;&#xFF0C;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x5E76;&#x5728;&#x626C;&#x58F0;&#x5668;&#x4E0A;&#x64AD;&#x653E;&#x6570;&#x636E;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x91CD;&#x53D1;&#x6570;&#x636E;&#x5305;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x2014;&#x2014;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x9759;&#x97F3;&#x586B;&#x5145;&#x4E22;&#x5931;&#x6570;&#x636E;&#x5305;&#x7684;&#x65F6;&#x9699;&#xFF08;&#x5BFC;&#x81F4;&#x58F0;&#x97F3;&#x77ED;&#x6682;&#x4E2D;&#x65AD;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6570;&#x636E;&#x6D41;&#x4E2D;&#x7EE7;&#x7EED;&#x3002;&#x91CD;&#x8BD5;&#x53D1;&#x751F;&#x5728;&#x4EBA;&#x7C7B;&#x5C42;&#x3002; &#xFF08;&#x201C;&#x4F60;&#x80FD;&#x518D;&#x8BF4;&#x4E00;&#x904D;&#x5417;&#xFF1F;&#x58F0;&#x97F3;&#x521A;&#x521A;&#x65AD;&#x4E86;&#x4E00;&#x4F1A;&#x513F;&#x3002;&#x201C;&#xFF09;</p>
</blockquote>
<p>&#x200B;    &#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x90FD;&#x4F1A;&#x9020;&#x6210;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x7684;&#x53D8;&#x5316;&#x3002;&#x5F53;&#x7CFB;&#x7EDF;&#x63A5;&#x8FD1;&#x5176;&#x6700;&#x5927;&#x5BB9;&#x91CF;&#x65F6;&#xFF0C;&#x6392;&#x961F;&#x5EF6;&#x8FDF;&#x7684;&#x8303;&#x56F4;&#x7279;&#x522B;&#x5E7F;&#x6CDB;&#xFF1A;</p>
<p>&#x200B;    &#x62E5;&#x6709;&#x8DB3;&#x591F;&#x5907;&#x7528;&#x5BB9;&#x91CF;&#x7684;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x6392;&#x7A7A;&#x961F;&#x5217;&#xFF0C;&#x800C;&#x5728;&#x9AD8;&#x5229;&#x7528;&#x7387;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x80FD;&#x79EF;&#x7D2F;&#x5F88;&#x957F;&#x7684;&#x961F;&#x5217;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x516C;&#x5171;&#x4E91;&#x548C;&#x591A;&#x79DF;&#x6237;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E2D;&#xFF0C;&#x8D44;&#x6E90;&#x88AB;&#x8BB8;&#x591A;&#x5BA2;&#x6237;&#x5171;&#x4EAB;&#xFF1A;&#x7F51;&#x7EDC;&#x94FE;&#x63A5;&#x548C;&#x4EA4;&#x6362;&#x673A;&#xFF0C;&#x751A;&#x81F3;&#x6BCF;&#x4E2A;&#x673A;&#x5668;&#x7684;&#x7F51;&#x5361;&#x548C;CPU&#xFF08;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x65F6;&#xFF09;&#x3002;&#x6279;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#xFF08;&#x5982;MapReduce&#xFF09;&#xFF08;&#x53C2;&#x9605;<a href="ch10.html">&#x7B2C;10&#x7AE0;</a>&#xFF09;&#x53EF;&#x80FD;&#x5F88;&#x5BB9;&#x6613;&#x4F7F;&#x7F51;&#x7EDC;&#x94FE;&#x63A5;&#x9971;&#x548C;&#x3002;&#x7531;&#x4E8E;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x6216;&#x4E86;&#x89E3;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x5BF9;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x7684;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C;&#x9644;&#x8FD1;&#x7684;&#x67D0;&#x4E2A;&#x4EBA;&#xFF08;&#x5608;&#x6742;&#x7684;&#x90BB;&#x5C45;&#xFF09;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x5927;&#x91CF;&#x8D44;&#x6E90;&#xFF0C;&#x5219;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x5267;&#x70C8;&#x6296;&#x52A8;&#x3010;28,29&#x3011;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8FD9;&#x79CD;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x60A8;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x5B9E;&#x9A8C;&#x65B9;&#x5F0F;&#x9009;&#x62E9;&#x8D85;&#x65F6;&#xFF1A;&#x6D4B;&#x91CF;&#x5EF6;&#x957F;&#x7684;&#x7F51;&#x7EDC;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;&#x548C;&#x591A;&#x53F0;&#x673A;&#x5668;&#x7684;&#x5206;&#x5E03;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x5EF6;&#x8FDF;&#x7684;&#x9884;&#x671F;&#x53EF;&#x53D8;&#x6027;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;<strong>&#x6545;&#x969C;&#x68C0;&#x6D4B;&#x5EF6;&#x8FDF;</strong>&#x4E0E;<strong>&#x8FC7;&#x65E9;&#x8D85;&#x65F6;&#x98CE;&#x9669;</strong>&#x4E4B;&#x95F4;&#x7684;&#x9002;&#x5F53;&#x6298;&#x8877;&#x3002;</p>
<p>&#x200B;    &#x66F4;&#x597D;&#x7684;&#x4E00;&#x79CD;&#x505A;&#x6CD5;&#x662F;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x914D;&#x7F6E;&#x7684;&#x5E38;&#x91CF;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x662F;&#x8FDE;&#x7EED;&#x6D4B;&#x91CF;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x53CA;&#x5176;&#x53D8;&#x5316;&#xFF08;&#x6296;&#x52A8;&#xFF09;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x5206;&#x5E03;&#x81EA;&#x52A8;&#x8C03;&#x6574;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Phi Accrual&#x6545;&#x969C;&#x68C0;&#x6D4B;&#x5668;&#x3010;30&#x3011;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x8BE5;&#x68C0;&#x6D4B;&#x5668;&#x5728;&#x4F8B;&#x5982;Akka&#x548C;Cassandra &#x3010;31&#x3011;&#x4E2D;&#x4F7F;&#x7528;&#x3002; TCP&#x8D85;&#x65F6;&#x91CD;&#x4F20;&#x673A;&#x5236;&#x4E5F;&#x540C;&#x6837;&#x8D77;&#x4F5C;&#x7528;&#x3010;27&#x3011;&#x3002;</p>
<h3 id="&#x540C;&#x6B65;&#x7F51;&#x7EDC;-vs-&#x5F02;&#x6B65;&#x7F51;&#x7EDC;">&#x540C;&#x6B65;&#x7F51;&#x7EDC; vs &#x5F02;&#x6B65;&#x7F51;&#x7EDC;</h3>
<p>&#x200B;    &#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F9D;&#x9760;&#x7F51;&#x7EDC;&#x6765;&#x4F20;&#x9012;&#x4E00;&#x4E9B;<strong>&#x6700;&#x5927;&#x5EF6;&#x8FDF;&#x56FA;&#x5B9A;</strong>&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E22;&#x5F03;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x7B80;&#x5355;&#x5F97;&#x591A;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5728;&#x786C;&#x4EF6;&#x5C42;&#x9762;&#x4E0A;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F7F;&#x7F51;&#x7EDC;&#x53EF;&#x9760;&#xFF0C;&#x4F7F;&#x8F6F;&#x4EF6;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x5462;&#xFF1F;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x4E0E;&#x975E;&#x5E38;&#x53EF;&#x9760;&#x7684;&#x4F20;&#x7EDF;&#x56FA;&#x5B9A;&#x7535;&#x8BDD;&#x7F51;&#x7EDC;&#xFF08;&#x975E;&#x8702;&#x7A9D;&#xFF0C;&#x975E;VoIP&#xFF09;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x662F;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#xFF1A;&#x5EF6;&#x8FDF;&#x97F3;&#x9891;&#x5E27;&#x548C;&#x6389;&#x8BDD;&#x662F;&#x975E;&#x5E38;&#x7F55;&#x89C1;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x7535;&#x8BDD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x5F88;&#x4F4E;&#x7684;&#x7AEF;&#x5230;&#x7AEF;&#x5EF6;&#x8FDF;&#xFF0C;&#x4EE5;&#x53CA;&#x8DB3;&#x591F;&#x7684;&#x5E26;&#x5BBD;&#x6765;&#x4F20;&#x8F93;&#x4F60;&#x58F0;&#x97F3;&#x7684;&#x97F3;&#x9891;&#x91C7;&#x6837;&#x6570;&#x636E;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x4E2D;&#x6709;&#x7C7B;&#x4F3C;&#x7684;&#x53EF;&#x9760;&#x6027;&#x548C;&#x53EF;&#x9884;&#x6D4B;&#x6027;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x5417;&#xFF1F;</p>
<p>&#x200B;    &#x5F53;&#x60A8;&#x901A;&#x8FC7;&#x7535;&#x8BDD;&#x7F51;&#x7EDC;&#x62E8;&#x6253;&#x7535;&#x8BDD;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7535;&#x8DEF;&#xFF1A;&#x5728;&#x4E24;&#x4E2A;&#x547C;&#x53EB;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x6574;&#x4E2A;&#x8DEF;&#x7EBF;&#x4E0A;&#x4E3A;&#x547C;&#x53EB;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x6709;&#x4FDD;&#x8BC1;&#x7684;&#x5E26;&#x5BBD;&#x91CF;&#x3002;&#x8FD9;&#x4E2A;&#x7535;&#x8DEF;&#x4F1A;&#x4FDD;&#x6301;&#x81F3;&#x901A;&#x8BDD;&#x7ED3;&#x675F;&#x3010;32&#x3011;&#x3002;&#x4F8B;&#x5982;&#xFF0C;ISDN&#x7F51;&#x7EDC;&#x4EE5;&#x6BCF;&#x79D2;4000&#x5E27;&#x7684;&#x56FA;&#x5B9A;&#x901F;&#x7387;&#x8FD0;&#x884C;&#x3002;&#x547C;&#x53EB;&#x5EFA;&#x7ACB;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x5E27;&#x5185;&#xFF08;&#x6BCF;&#x4E2A;&#x65B9;&#x5411;&#xFF09;&#x5206;&#x914D;16&#x4F4D;&#x7A7A;&#x95F4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x901A;&#x8BDD;&#x671F;&#x95F4;&#xFF0C;&#x6BCF;&#x4E00;&#x65B9;&#x90FD;&#x4FDD;&#x8BC1;&#x80FD;&#x591F;&#x6BCF;250&#x5FAE;&#x79D2;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x7CBE;&#x786E;&#x7684;16&#x4F4D;&#x97F3;&#x9891;&#x6570;&#x636E;&#x3010;33,34&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x7F51;&#x7EDC;&#x662F;&#x540C;&#x6B65;&#x7684;&#xFF1A;&#x5373;&#x4F7F;&#x6570;&#x636E;&#x7ECF;&#x8FC7;&#x591A;&#x4E2A;&#x8DEF;&#x7531;&#x5668;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x6392;&#x961F;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x4E3A;&#x547C;&#x53EB;&#x7684;16&#x4F4D;&#x7A7A;&#x95F4;&#x5DF2;&#x7ECF;&#x5728;&#x7F51;&#x7EDC;&#x7684;&#x4E0B;&#x4E00;&#x8DF3;&#x4E2D;&#x4FDD;&#x7559;&#x4E86;&#x4E0B;&#x6765;&#x3002;&#x800C;&#x4E14;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x6392;&#x961F;&#xFF0C;&#x7F51;&#x7EDC;&#x7684;&#x6700;&#x5927;&#x7AEF;&#x5230;&#x7AEF;&#x5EF6;&#x8FDF;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x6709;&#x9650;&#x5EF6;&#x8FDF;&#xFF08;bounded delay&#xFF09;</strong>&#x3002;</p>
<h4 id="&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x53EF;&#x9884;&#x6D4B;&#x5417;&#xFF1F;">&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x7B80;&#x5355;&#x5730;&#x4F7F;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x53EF;&#x9884;&#x6D4B;&#x5417;&#xFF1F;</h4>
<p>&#x200B;    &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x7535;&#x8BDD;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x7535;&#x8DEF;&#x4E0E;TCP&#x8FDE;&#x63A5;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF1A;&#x7535;&#x8DEF;&#x662F;&#x56FA;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x9884;&#x7559;&#x5E26;&#x5BBD;&#xFF0C;&#x5728;&#x7535;&#x8DEF;&#x5EFA;&#x7ACB;&#x65F6;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x4EBA;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xFF0C;&#x800C;TCP&#x8FDE;&#x63A5;&#x7684;&#x6570;&#x636E;&#x5305;<strong>&#x673A;&#x4F1A;&#x6027;&#x5730;</strong>&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x53EF;&#x7528;&#x7684;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x7ED9;TCP&#x4E00;&#x4E2A;&#x53EF;&#x53D8;&#x5927;&#x5C0F;&#x7684;&#x6570;&#x636E;&#x5757;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x6216;&#x4E00;&#x4E2A;&#x7F51;&#x9875;&#xFF09;&#xFF0C;&#x5B83;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x5728;&#x6700;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x4F20;&#x8F93;&#x5B83;&#x3002; TCP&#x8FDE;&#x63A5;&#x7A7A;&#x95F2;&#x65F6;&#xFF0C;&#x4E0D;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x5E26;&#x5BBD;<sup><a href="#fn_ii" id="reffn_ii">ii</a></sup>&#x3002;</p>
<blockquote id="fn_ii">
<sup>ii</sup>. &#x9664;&#x4E86;&#x5076;&#x5C14;&#x7684;keepalive&#x6570;&#x636E;&#x5305;&#xFF0C;&#x5982;&#x679C;TCP keepalive&#x88AB;&#x542F;&#x7528;&#x3002;<a href="#reffn_ii" title="Jump back to footnote [ii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x5982;&#x679C;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x662F;&#x7535;&#x8DEF;&#x4EA4;&#x6362;&#x7F51;&#x7EDC;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x5EFA;&#x7ACB;&#x7535;&#x8DEF;&#x65F6;&#x5C31;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4FDD;&#x8BC1;&#x7684;&#x6700;&#x5927;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#xFF1A;&#x4EE5;&#x592A;&#x7F51;&#x548C;IP&#x662F;<strong>&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x534F;&#x8BAE;</strong>&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x5FCD;&#x53D7;&#x6392;&#x961F;&#x7684;&#x6298;&#x78E8;&#xFF0C;&#x53CA;&#x5176;&#x5BFC;&#x81F4;&#x7684;&#x7F51;&#x7EDC;&#x65E0;&#x9650;&#x5EF6;&#x8FDF;&#x3002;&#x8FD9;&#x4E9B;&#x534F;&#x8BAE;&#x6CA1;&#x6709;&#x7535;&#x8DEF;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x548C;&#x4E92;&#x8054;&#x7F51;&#x4F7F;&#x7528;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x9488;&#x5BF9;<strong>&#x7A81;&#x53D1;&#x6D41;&#x91CF;&#xFF08;bursty traffic&#xFF09;</strong>&#x8FDB;&#x884C;&#x4E86;&#x4F18;&#x5316;&#x3002;&#x4E00;&#x4E2A;&#x7535;&#x8DEF;&#x9002;&#x7528;&#x4E8E;&#x97F3;&#x9891;&#x6216;&#x89C6;&#x9891;&#x901A;&#x8BDD;&#xFF0C;&#x5728;&#x901A;&#x8BDD;&#x671F;&#x95F4;&#x9700;&#x8981;&#x6BCF;&#x79D2;&#x4F20;&#x9001;&#x76F8;&#x5F53;&#x6570;&#x91CF;&#x7684;&#x6BD4;&#x7279;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x8BF7;&#x6C42;&#x7F51;&#x9875;&#xFF0C;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x6216;&#x4F20;&#x8F93;&#x6587;&#x4EF6;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7279;&#x5B9A;&#x7684;&#x5E26;&#x5BBD;&#x8981;&#x6C42;&#x2014;&#x2014;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x5E0C;&#x671B;&#x5B83;&#x5C3D;&#x5FEB;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x4F60;&#x60F3;&#x901A;&#x8FC7;&#x7535;&#x8DEF;&#x4F20;&#x8F93;&#x6587;&#x4EF6;&#xFF0C;&#x4F60;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x731C;&#x6D4B;&#x4E00;&#x4E2A;&#x5E26;&#x5BBD;&#x5206;&#x914D;&#x3002;&#x5982;&#x679C;&#x60A8;&#x731C;&#x7684;&#x592A;&#x4F4E;&#xFF0C;&#x4F20;&#x8F93;&#x901F;&#x5EA6;&#x4F1A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x592A;&#x6162;&#xFF0C;&#x5BFC;&#x81F4;&#x7F51;&#x7EDC;&#x5BB9;&#x91CF;&#x95F2;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x4F60;&#x731C;&#x7684;&#x592A;&#x9AD8;&#xFF0C;&#x7535;&#x8DEF;&#x5C31;&#x65E0;&#x6CD5;&#x5EFA;&#x7ACB;&#xFF08;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5176;&#x5E26;&#x5BBD;&#x5206;&#x914D;&#xFF0C;&#x7F51;&#x7EDC;&#x4E0D;&#x80FD;&#x5EFA;&#x7ACB;&#x7535;&#x8DEF;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F7F;&#x7528;&#x7528;&#x4E8E;&#x7A81;&#x53D1;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x7684;&#x7535;&#x8DEF;&#x6D6A;&#x8D39;&#x7F51;&#x7EDC;&#x5BB9;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x4F20;&#x8F93;&#x4E0D;&#x5FC5;&#x8981;&#x5730;&#x7F13;&#x6162;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;TCP&#x52A8;&#x6001;&#x8C03;&#x6574;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x901F;&#x7387;&#x4EE5;&#x9002;&#x5E94;&#x53EF;&#x7528;&#x7684;&#x7F51;&#x7EDC;&#x5BB9;&#x91CF;&#x3002;</p>
<p>&#x200B;    &#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E9B;&#x5C1D;&#x8BD5;&#x53BB;&#x5EFA;&#x7ACB;&#x652F;&#x6301;&#x7535;&#x8DEF;&#x4EA4;&#x6362;&#x548C;&#x5206;&#x7EC4;&#x4EA4;&#x6362;&#x7684;&#x6DF7;&#x5408;&#x7F51;&#x7EDC;&#xFF0C;&#x6BD4;&#x5982;ATM<sup><a href="#fn_iii" id="reffn_iii">iii</a></sup> InfiniBand&#x6709;&#x4E00;&#x4E9B;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x3010;35&#x3011;&#xFF1A;&#x5B83;&#x5728;&#x94FE;&#x8DEF;&#x5C42;&#x5B9E;&#x73B0;&#x4E86;&#x7AEF;&#x5230;&#x7AEF;&#x7684;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x4E86;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x6392;&#x961F;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x56E0;&#x94FE;&#x8DEF;&#x62E5;&#x585E;&#x800C;&#x53D7;&#x5230;&#x5EF6;&#x8FDF;&#x3010;36&#x3011;&#x3002;&#x901A;&#x8FC7;&#x4ED4;&#x7EC6;&#x4F7F;&#x7528;<strong>&#x670D;&#x52A1;&#x8D28;&#x91CF;&#xFF08;quality of service,&#xFF09;</strong>&#xFF08;QoS&#xFF0C;&#x6570;&#x636E;&#x5305;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x548C;&#x8C03;&#x5EA6;&#xFF09;&#x548C;<strong>&#x51C6;&#x5165;&#x63A7;&#x5236;&#xFF08;admission control&#xFF09;</strong>&#xFF08;&#x9650;&#x901F;&#x53D1;&#x9001;&#x5668;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x4EFF;&#x771F;&#x5206;&#x7EC4;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x7535;&#x8DEF;&#x4EA4;&#x6362;&#xFF0C;&#x6216;&#x63D0;&#x4F9B;&#x7EDF;&#x8BA1;&#x4E0A;&#x7684;<strong>&#x6709;&#x9650;&#x5EF6;&#x8FDF;</strong>&#x3010;25,32&#x3011;&#x3002;</p>
<blockquote id="fn_iii">
<sup>iii</sup>. <strong>&#x5F02;&#x6B65;&#x4F20;&#x8F93;&#x6A21;&#x5F0F;&#xFF08;Asynchronous TransferMode, ATM&#xFF09;</strong>&#x5728;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x662F;&#x4EE5;&#x592A;&#x7F51;&#x7684;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x3010;32&#x3011;&#xFF0C;&#x4F46;&#x5728;&#x7535;&#x8BDD;&#x7F51;&#x6838;&#x5FC3;&#x4EA4;&#x6362;&#x673A;&#x4E4B;&#x5916;&#x5E76;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x592A;&#x591A;&#x7684;&#x91C7;&#x7528;&#x3002;&#x4E0E;&#x81EA;&#x52A8;&#x67DC;&#x5458;&#x673A;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x81EA;&#x52A8;&#x53D6;&#x6B3E;&#x673A;&#xFF09;&#x65E0;&#x5173;&#xFF0C;&#x5C3D;&#x7BA1;&#x5171;&#x7528;&#x4E00;&#x4E2A;&#x7F29;&#x5199;&#x8BCD;&#x3002;&#x6216;&#x8BB8;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x5E73;&#x884C;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x662F;&#x57FA;&#x4E8E;&#x50CF;ATM&#x8FD9;&#x6837;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x56E0;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x89C6;&#x9891;&#x901A;&#x8BDD;&#x53EF;&#x80FD;&#x6BD4;&#x6211;&#x4EEC;&#x7684;&#x66F4;&#x53EF;&#x9760;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x906D;&#x53D7;&#x4E22;&#x5305;&#x548C;&#x5EF6;&#x8FDF;&#x7684;&#x5305;&#x88F9;&#x3002;<a href="#reffn_iii" title="Jump back to footnote [iii] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x76EE;&#x524D;&#x5728;&#x591A;&#x79DF;&#x6237;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x548C;&#x516C;&#x5171;&#x4E91;&#x6216;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;<sup><a href="#fn_iv" id="reffn_iv">iv</a></sup>&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x65F6;&#xFF0C;&#x6B64;&#x7C7B;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#x5C1A;&#x672A;&#x542F;&#x7528;&#x3002;&#x5F53;&#x524D;&#x90E8;&#x7F72;&#x7684;&#x6280;&#x672F;&#x4E0D;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x5BF9;&#x7F51;&#x7EDC;&#x7684;&#x5EF6;&#x8FDF;&#x6216;&#x53EF;&#x9760;&#x6027;&#x4F5C;&#x51FA;&#x4EFB;&#x4F55;&#x4FDD;&#x8BC1;&#xFF1A;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x5047;&#x8BBE;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#xFF0C;&#x6392;&#x961F;&#x548C;&#x65E0;&#x9650;&#x7684;&#x5EF6;&#x8FDF;&#x603B;&#x662F;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x6CA1;&#x6709;&#x201C;&#x6B63;&#x786E;&#x201D;&#x7684;&#x503C;&#x2014;&#x2014;&#x5B83;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x5B9E;&#x9A8C;&#x6765;&#x786E;&#x5B9A;&#x3002;</p>
<blockquote id="fn_iv">
<sup>iv</sup>. &#x4E92;&#x8054;&#x7F51;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x7B49;&#x534F;&#x8BAE;&#x548C;&#x901A;&#x8FC7;<strong>BGP&#x7F51;&#x5173;&#x534F;&#x8BAE;&#xFF08;BGP&#xFF09;</strong>&#x5EFA;&#x7ACB;&#x8DEF;&#x7531;&#x4E4B;&#x95F4;&#x7684;&#x5BF9;&#x7B49;&#x534F;&#x8BAE;&#xFF0C;&#x4E0E;&#x7535;&#x8DEF;&#x4EA4;&#x6362;&#x672C;&#x8EAB;&#x76F8;&#x6BD4;&#xFF0C;&#x4E0E;&#x7535;&#x8DEF;&#x4EA4;&#x6362;&#x66F4;&#x63A5;&#x8FD1;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x7EA7;&#x522B;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#x4E13;&#x7528;&#x5E26;&#x5BBD;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x8DEF;&#x7531;&#x5728;&#x7F51;&#x7EDC;&#x7EA7;&#x522B;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E3B;&#x673A;&#x4E4B;&#x95F4;&#x7684;&#x5355;&#x72EC;&#x8FDE;&#x63A5;&#xFF0C;&#x800C;&#x4E14;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x8981;&#x957F;&#x5F97;&#x591A;&#x3002;<a href="#reffn_iv" title="Jump back to footnote [iv] in the text."> &#x21A9;</a>
</blockquote>
<blockquote>
<h3 id="&#x5EF6;&#x8FDF;&#x548C;&#x8D44;&#x6E90;&#x5229;&#x7528;">&#x5EF6;&#x8FDF;&#x548C;&#x8D44;&#x6E90;&#x5229;&#x7528;</h3>
<p>&#x200B;    &#x66F4;&#x4E00;&#x822C;&#x5730;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;<strong>&#x5EF6;&#x8FDF;&#x53D8;&#x5316;</strong>&#x89C6;&#x4E3A;<strong>&#x52A8;&#x6001;&#x8D44;&#x6E90;&#x5206;&#x533A;</strong>&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x200B;    &#x5047;&#x8BBE;&#x4E24;&#x53F0;&#x7535;&#x8BDD;&#x4EA4;&#x6362;&#x673A;&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x6761;&#x7EBF;&#x8DEF;&#xFF0C;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8FDB;&#x884C;10,000&#x4E2A;&#x547C;&#x53EB;&#x3002;&#x901A;&#x8FC7;&#x6B64;&#x7EBF;&#x8DEF;&#x5207;&#x6362;&#x7684;&#x6BCF;&#x4E2A;&#x7535;&#x8DEF;&#x90FD;&#x5360;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x547C;&#x53EB;&#x63D2;&#x69FD;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x7EBF;&#x8DEF;&#x89C6;&#x4E3A;&#x53EF;&#x7531;&#x591A;&#x8FBE;10,000&#x4E2A;&#x5E76;&#x53D1;&#x7528;&#x6237;&#x5171;&#x4EAB;&#x7684;&#x8D44;&#x6E90;&#x3002;&#x8D44;&#x6E90;&#x4EE5;&#x9759;&#x6001;&#x65B9;&#x5F0F;&#x5206;&#x914D;&#xFF1A;&#x5373;&#x4F7F;&#x60A8;&#x73B0;&#x5728;&#x662F;&#x7535;&#x8BDD;&#x4E0A;&#x552F;&#x4E00;&#x7684;&#x7535;&#x8BDD;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x5176;&#x4ED6;9,999&#x4E2A;&#x63D2;&#x69FD;&#x90FD;&#x672A;&#x4F7F;&#x7528;&#xFF0C;&#x60A8;&#x7684;&#x7535;&#x8DEF;&#x4ECD;&#x5C06;&#x5206;&#x914D;&#x4E0E;&#x5BFC;&#x7EBF;&#x5145;&#x5206;&#x5229;&#x7528;&#x65F6;&#x76F8;&#x540C;&#x7684;&#x56FA;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x5E26;&#x5BBD;&#x3002;</p>
<p>&#x200B;    &#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x52A8;&#x6001;&#x5206;&#x4EAB;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#x3002;&#x53D1;&#x9001;&#x8005;&#x4E92;&#x76F8;&#x63A8;&#x6324;&#x5E76;&#x4E92;&#x76F8;&#x63A8;&#x6324;&#x4EE5;&#x5C3D;&#x53EF;&#x80FD;&#x5FEB;&#x5730;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x83B7;&#x5F97;&#x5B83;&#x4EEC;&#x7684;&#x5206;&#x7EC4;&#xFF0C;&#x5E76;&#x4E14;&#x7F51;&#x7EDC;&#x4EA4;&#x6362;&#x673A;&#x51B3;&#x5B9A;&#x4ECE;&#x4E00;&#x4E2A;&#x65F6;&#x523B;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x65F6;&#x523B;&#x53D1;&#x9001;&#x54EA;&#x4E2A;&#x5206;&#x7EC4;&#xFF08;&#x5373;&#xFF0C;&#x5E26;&#x5BBD;&#x5206;&#x914D;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x6392;&#x961F;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x4F46;&#x5176;&#x4F18;&#x70B9;&#x662F;&#x5B83;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x5229;&#x7528;&#x4E86;&#x7535;&#x7EBF;&#x3002;&#x7535;&#x7EBF;&#x56FA;&#x5B9A;&#x6210;&#x672C;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x5229;&#x7528;&#x5B83;&#xFF0C;&#x4F60;&#x901A;&#x8FC7;&#x7535;&#x7EBF;&#x53D1;&#x9001;&#x7684;&#x6BCF;&#x4E2A;&#x5B57;&#x8282;&#x90FD;&#x4F1A;&#x66F4;&#x4FBF;&#x5B9C;&#x3002;</p>
<p>&#x200B;    CPU&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x7C7B;&#x4F3C;&#x7684;&#x60C5;&#x51B5;&#xFF1A;&#x5982;&#x679C;&#x60A8;&#x5728;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x95F4;&#x52A8;&#x6001;&#x5171;&#x4EAB;&#x6BCF;&#x4E2A;CPU&#x5185;&#x6838;&#xFF0C;&#x5219;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6709;&#x65F6;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x8FD0;&#x884C;&#x961F;&#x5217;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x6837;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x6682;&#x505C;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x5EA6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E0E;&#x4E3A;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5206;&#x914D;&#x9759;&#x6001;&#x6570;&#x91CF;&#x7684;CPU&#x5468;&#x671F;&#x76F8;&#x6BD4;&#xFF0C;&#x8FD9;&#x4F1A;&#x66F4;&#x597D;&#x5730;&#x5229;&#x7528;&#x786C;&#x4EF6;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="#&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;">&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;</a>&#x201D;&#xFF09;&#x3002;&#x66F4;&#x597D;&#x7684;&#x786C;&#x4EF6;&#x5229;&#x7528;&#x7387;&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x673A;&#x7684;&#x91CD;&#x8981;&#x52A8;&#x673A;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x8D44;&#x6E90;&#x662F;&#x9759;&#x6001;&#x5206;&#x533A;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E13;&#x7528;&#x786C;&#x4EF6;&#x548C;&#x4E13;&#x7528;&#x5E26;&#x5BBD;&#x5206;&#x914D;&#xFF09;&#xFF0C;&#x5219;&#x5728;&#x67D0;&#x4E9B;&#x73AF;&#x5883;&#x4E2D;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;<strong>&#x5EF6;&#x8FDF;&#x4FDD;&#x8BC1;</strong>&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x662F;&#x4EE5;&#x964D;&#x4F4E;&#x5229;&#x7528;&#x7387;&#x4E3A;&#x4EE3;&#x4EF7;&#x7684;&#x2014;&#x2014;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;&#x66F4;&#x6602;&#x8D35;&#x7684;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x52A8;&#x6001;&#x8D44;&#x6E90;&#x5206;&#x914D;&#x7684;&#x591A;&#x79DF;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x5229;&#x7528;&#x7387;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x66F4;&#x4FBF;&#x5B9C;&#xFF0C;&#x4F46;&#x5B83;&#x5177;&#x6709;&#x53EF;&#x53D8;&#x5EF6;&#x8FDF;&#x7684;&#x7F3A;&#x70B9;&#x3002;</p>
<p>&#x200B;    &#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x53EF;&#x53D8;&#x5EF6;&#x8FDF;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x7136;&#x89C4;&#x5F8B;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x6210;&#x672C;/&#x6536;&#x76CA;&#x6743;&#x8861;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
</blockquote>
<h2 id="&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x65F6;&#x949F;">&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x65F6;&#x949F;</h2>
<p>&#x65F6;&#x949F;&#x548C;&#x65F6;&#x95F4;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x4F9D;&#x8D56;&#x4E8E;&#x65F6;&#x949F;&#x6765;&#x56DE;&#x7B54;&#x4EE5;&#x4E0B;&#x95EE;&#x9898;&#xFF1A;</p>
<ol>
<li>&#x8FD9;&#x4E2A;&#x8BF7;&#x6C42;&#x662F;&#x5426;&#x8D85;&#x65F6;&#x4E86;&#xFF1F;</li>
<li>&#x8FD9;&#x9879;&#x670D;&#x52A1;&#x7684;&#x7B2C;99&#x767E;&#x5206;&#x4F4D;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x662F;&#x591A;&#x5C11;&#xFF1F;</li>
<li>&#x5728;&#x8FC7;&#x53BB;&#x4E94;&#x5206;&#x949F;&#x5185;&#xFF0C;&#x8BE5;&#x670D;&#x52A1;&#x5E73;&#x5747;&#x6BCF;&#x79D2;&#x5904;&#x7406;&#x591A;&#x5C11;&#x4E2A;&#x67E5;&#x8BE2;&#xFF1F;</li>
<li>&#x7528;&#x6237;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x82B1;&#x4E86;&#x591A;&#x957F;&#x65F6;&#x95F4;&#xFF1F;</li>
<li>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5728;&#x4F55;&#x65F6;&#x53D1;&#x5E03;&#xFF1F;</li>
<li>&#x5728;&#x4EC0;&#x4E48;&#x65F6;&#x95F4;&#x53D1;&#x9001;&#x63D0;&#x9192;&#x90AE;&#x4EF6;&#xFF1F;</li>
<li>&#x8FD9;&#x4E2A;&#x7F13;&#x5B58;&#x6761;&#x76EE;&#x4F55;&#x65F6;&#x5230;&#x671F;&#xFF1F;</li>
<li>&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x4E2D;&#x6B64;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
</ol>
<p><a href="ch1.html">&#x4F8B;1-4</a>&#x6D4B;&#x91CF;<a href="">&#x6301;&#x7EED;&#x65F6;&#x95F4;</a>&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x4E0E;&#x6B63;&#x5728;&#x63A5;&#x6536;&#x7684;&#x54CD;&#x5E94;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF09;&#xFF0C;&#x800C;<a href="ch5.html">&#x4F8B;5-8</a>&#x63CF;&#x8FF0;<strong>&#x65F6;&#x95F4;&#x70B9;&#xFF08;point in time&#xFF09;</strong>&#xFF08;&#x5728;&#x7279;&#x5B9A;&#x65E5;&#x671F;&#xFF0C;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x65F6;&#x95F4;&#x662F;&#x4E00;&#x4EF6;&#x68D8;&#x624B;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x56E0;&#x4E3A;&#x901A;&#x4FE1;&#x4E0D;&#x662F;&#x5373;&#x65F6;&#x7684;&#xFF1A;&#x6D88;&#x606F;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4ECE;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4F20;&#x9001;&#x5230;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x9700;&#x8981;&#x65F6;&#x95F4;&#x3002;&#x6536;&#x5230;&#x6D88;&#x606F;&#x7684;&#x65F6;&#x95F4;&#x603B;&#x662F;&#x665A;&#x4E8E;&#x53D1;&#x9001;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x53EF;&#x53D8;&#x5EF6;&#x8FDF;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x591A;&#x5C11;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#x6709;&#x65F6;&#x5F88;&#x96BE;&#x786E;&#x5B9A;&#x5728;&#x6D89;&#x53CA;&#x591A;&#x53F0;&#x673A;&#x5668;&#x65F6;&#x53D1;&#x751F;&#x4E8B;&#x60C5;&#x7684;&#x987A;&#x5E8F;&#x3002;</p>
<p>&#x200B;    &#x800C;&#x4E14;&#xFF0C;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x949F;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5B9E;&#x9645;&#x7684;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#xFF1A;&#x901A;&#x5E38;&#x662F;&#x77F3;&#x82F1;&#x6676;&#x4F53;&#x632F;&#x8361;&#x5668;&#x3002;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x51C6;&#x786E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x53F0;&#x673A;&#x5668;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x95F4;&#x6982;&#x5FF5;&#xFF0C;&#x53EF;&#x80FD;&#x6BD4;&#x5176;&#x4ED6;&#x673A;&#x5668;&#x7A0D;&#x5FEB;&#x6216;&#x66F4;&#x6162;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x540C;&#x6B65;&#x65F6;&#x949F;&#xFF1A;&#x6700;&#x5E38;&#x7528;&#x7684;&#x673A;&#x5236;&#x662F;<strong>&#x7F51;&#x7EDC;&#x65F6;&#x95F4;&#x534F;&#x8BAE;&#xFF08;NTP&#xFF09;</strong>&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x6839;&#x636E;&#x4E00;&#x7EC4;&#x670D;&#x52A1;&#x5668;&#x62A5;&#x544A;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x8C03;&#x6574;&#x8BA1;&#x7B97;&#x673A;&#x65F6;&#x949F;&#x3010;37&#x3011;&#x3002;&#x670D;&#x52A1;&#x5668;&#x5219;&#x4ECE;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x65F6;&#x95F4;&#x6E90;&#xFF08;&#x5982;GPS&#x63A5;&#x6536;&#x673A;&#xFF09;&#x83B7;&#x53D6;&#x65F6;&#x95F4;&#x3002;</p>
<h3 id="&#x5355;&#x8C03;&#x949F;&#x4E0E;&#x65F6;&#x949F;">&#x5355;&#x8C03;&#x949F;&#x4E0E;&#x65F6;&#x949F;</h3>
<p>&#x200B;    &#x73B0;&#x4EE3;&#x8BA1;&#x7B97;&#x673A;&#x81F3;&#x5C11;&#x6709;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x949F;&#xFF1A;&#x65F6;&#x949F;&#x548C;&#x5355;&#x8C03;&#x949F;&#x3002;&#x5C3D;&#x7BA1;&#x5B83;&#x4EEC;&#x90FD;&#x8861;&#x91CF;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x8005;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<h4 id="&#x65F6;&#x949F;">&#x65F6;&#x949F;</h4>
<p>&#x200B;    &#x65F6;&#x949F;&#x662F;&#x60A8;&#x76F4;&#x89C2;&#x5730;&#x4E86;&#x89E3;&#x65F6;&#x949F;&#x7684;&#x4F9D;&#x636E;&#xFF1A;&#x5B83;&#x6839;&#x636E;&#x67D0;&#x4E2A;&#x65E5;&#x5386;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x6302;&#x949F;&#x65F6;&#x95F4;&#xFF08;wall-clock time&#xFF09;</strong>&#xFF09;&#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x95F4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Linux<sup><a href="#fn_v" id="reffn_v">v</a></sup>&#x4E0A;&#x7684;<code>clock_gettime(CLOCK_REALTIME)</code>&#x548C;Java&#x4E2D;&#x7684;<code>System.currentTimeMillis()</code>&#x8FD4;&#x56DE;&#x81EA;epoch&#xFF08;1970&#x5E74;1&#x6708;1&#x65E5; &#x5348;&#x591C; UTC&#xFF0C;&#x683C;&#x91CC;&#x9AD8;&#x5229;&#x5386;&#xFF09;&#x4EE5;&#x6765;&#x7684;&#x79D2;&#x6570;&#xFF08;&#x6216;&#x6BEB;&#x79D2;&#xFF09;&#xFF0C;&#x6839;&#x636E;&#x516C;&#x5386;&#x65E5;&#x5386;&#xFF0C;&#x4E0D;&#x5305;&#x62EC;&#x95F0;&#x79D2;&#x3002;&#x6709;&#x4E9B;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x65E5;&#x671F;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#x70B9;&#x3002;</p>
<blockquote id="fn_v">
<sup>v</sup>. &#x867D;&#x7136;&#x65F6;&#x949F;&#x88AB;&#x79F0;&#x4E3A;&#x5B9E;&#x65F6;&#x65F6;&#x949F;&#xFF0C;&#x4F46;&#x5B83;&#x4E0E;&#x5B9E;&#x65F6;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x65E0;&#x5173;&#xFF0C;&#x5982;&#x7B2C;298&#x9875;&#x4E0A;&#x7684;&#x201C;<a href="#&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;">&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;</a>&#x201D;&#x4E2D;&#x6240;&#x8FF0;&#x3002;<a href="#reffn_v" title="Jump back to footnote [v] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x65F6;&#x949F;&#x901A;&#x5E38;&#x4E0E;NTP&#x540C;&#x6B65;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6765;&#x81EA;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x7684;&#x65F6;&#x95F4;&#x6233;&#xFF08;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF09;&#x610F;&#x5473;&#x7740;&#x4E0E;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x76F8;&#x540C;&#x3002;&#x4F46;&#x662F;&#x5982;&#x4E0B;&#x8282;&#x6240;&#x8FF0;&#xFF0C;&#x65F6;&#x949F;&#x4E5F;&#x5177;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x5947;&#x7279;&#x4E4B;&#x5904;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x672C;&#x5730;&#x65F6;&#x949F;&#x5728;NTP&#x670D;&#x52A1;&#x5668;&#x4E4B;&#x524D;&#x592A;&#x8FDC;&#xFF0C;&#x5219;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5F3A;&#x5236;&#x91CD;&#x7F6E;&#xFF0C;&#x770B;&#x4E0A;&#x53BB;&#x597D;&#x50CF;&#x8DF3;&#x56DE;&#x4E86;&#x5148;&#x524D;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#x3002;&#x8FD9;&#x4E9B;&#x8DF3;&#x8DC3;&#x4EE5;&#x53CA;&#x4ED6;&#x4EEC;&#x7ECF;&#x5E38;&#x5FFD;&#x7565;&#x95F0;&#x79D2;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x4F7F;&#x65F6;&#x949F;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x6D4B;&#x91CF;&#x7ECF;&#x8FC7;&#x65F6;&#x95F4;&#x3010;38&#x3011;&#x3002;</p>
<p>&#x200B;    &#x65F6;&#x949F;&#x8FD8;&#x5177;&#x6709;&#x76F8;&#x5F53;&#x7C97;&#x7565;&#x7684;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x8F83;&#x65E9;&#x7684;Windows&#x7CFB;&#x7EDF;&#x4E0A;&#x4EE5;10&#x6BEB;&#x79D2;&#x4E3A;&#x5355;&#x4F4D;&#x524D;&#x8FDB;&#x3010;39&#x3011;&#x3002;&#x5728;&#x6700;&#x8FD1;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FD9;&#x5DF2;&#x7ECF;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x4E86;&#x3002;</p>
<h4 id="&#x5355;&#x8C03;&#x949F;">&#x5355;&#x8C03;&#x949F;</h4>
<p>&#x200B;    &#x5355;&#x8C03;&#x949F;&#x9002;&#x7528;&#x4E8E;&#x6D4B;&#x91CF;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#xFF08;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF09;&#xFF0C;&#x4F8B;&#x5982;&#x8D85;&#x65F6;&#x6216;&#x670D;&#x52A1;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#xFF1A;Linux&#x4E0A;&#x7684;<code>clock_gettime(CLOCK_MONOTONIC)</code>&#xFF0C;&#x548C;Java&#x4E2D;&#x7684;<code>System.nanoTime()</code>&#x90FD;&#x662F;&#x5355;&#x8C03;&#x65F6;&#x949F;&#x3002;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x6765;&#x6E90;&#x4E8E;&#x4ED6;&#x4EEC;&#x4FDD;&#x8BC1;&#x603B;&#x662F;&#x524D;&#x8FDB;&#x7684;&#x4E8B;&#x5B9E;&#xFF08;&#x800C;&#x65F6;&#x949F;&#x53EF;&#x4EE5;&#x53CA;&#x65F6;&#x8DF3;&#x56DE;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x68C0;&#x67E5;&#x5355;&#x8C03;&#x949F;&#x7684;&#x503C;&#xFF0C;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x4E14;&#x7A0D;&#x540E;&#x518D;&#x6B21;&#x68C0;&#x67E5;&#x5B83;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x544A;&#x8BC9;&#x4F60;&#x4E24;&#x6B21;&#x68C0;&#x67E5;&#x4E4B;&#x95F4;&#x7ECF;&#x8FC7;&#x4E86;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x3002;&#x4F46;&#x5355;&#x8C03;&#x949F;&#x7684;&#x7EDD;&#x5BF9;&#x503C;&#x662F;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x7684;&#xFF1A;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x542F;&#x52A8;&#x4EE5;&#x6765;&#x7684;&#x7EB3;&#x79D2;&#x6570;&#xFF0C;&#x6216;&#x7C7B;&#x4F3C;&#x7684;&#x4EFB;&#x610F;&#x503C;&#x3002;&#x7279;&#x522B;&#x662F;&#x6BD4;&#x8F83;&#x6765;&#x81EA;&#x4E24;&#x53F0;&#x4E0D;&#x540C;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5355;&#x8C03;&#x949F;&#x7684;&#x503C;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x56DE;&#x4E8B;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x5177;&#x6709;&#x591A;&#x4E2A;CPU&#x63D2;&#x69FD;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E2A;CPU&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x8BA1;&#x65F6;&#x5668;&#xFF0C;&#x4F46;&#x4E0D;&#x4E00;&#x5B9A;&#x4E0E;&#x5176;&#x4ED6;CPU&#x540C;&#x6B65;&#x3002;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4F1A;&#x8865;&#x507F;&#x6240;&#x6709;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x5411;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x8868;&#x73B0;&#x51FA;&#x5355;&#x8C03;&#x949F;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x88AB;&#x8C03;&#x5EA6;&#x5230;&#x4E0D;&#x540C;&#x7684;CPU&#x4E0A;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x660E;&#x667A;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x4E0D;&#x8981;&#x592A;&#x628A;&#x8FD9;&#x79CD;&#x5355;&#x8C03;&#x6027;&#x4FDD;&#x8BC1;&#x5F53;&#x56DE;&#x4E8B;&#x3010;40&#x3011;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;NTP&#x534F;&#x8BAE;&#x68C0;&#x6D4B;&#x5230;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x672C;&#x5730;&#x77F3;&#x82F1;&#x949F;&#x6BD4;NTP&#x670D;&#x52A1;&#x5668;&#x8981;&#x66F4;&#x5FEB;&#x6216;&#x66F4;&#x6162;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x5355;&#x8C03;&#x949F;&#x5411;&#x524D;&#x8D70;&#x7684;&#x9891;&#x7387;&#xFF08;&#x8FD9;&#x79F0;&#x4E3A;<strong>&#x504F;&#x79FB;&#xFF08;skewing&#xFF09;</strong>&#x65F6;&#x949F;&#xFF09;&#x3002;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;NTP&#x5141;&#x8BB8;&#x65F6;&#x949F;&#x901F;&#x7387;&#x589E;&#x52A0;&#x6216;&#x51CF;&#x6162;&#x6700;&#x9AD8;&#x81F3;0.05&#xFF05;&#xFF0C;&#x4F46;NTP&#x4E0D;&#x80FD;&#x4F7F;&#x5355;&#x8C03;&#x65F6;&#x949F;&#x5411;&#x524D;&#x6216;&#x5411;&#x540E;&#x8DF3;&#x8F6C;&#x3002;&#x5355;&#x8C03;&#x65F6;&#x949F;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x901A;&#x5E38;&#x76F8;&#x5F53;&#x597D;&#xFF1A;&#x5728;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x80FD;&#x5728;&#x51E0;&#x5FAE;&#x79D2;&#x6216;&#x66F4;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x6D4B;&#x91CF;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x5355;&#x8C03;&#x949F;&#x6D4B;&#x91CF;<strong>&#x7ECF;&#x8FC7;&#x65F6;&#x95F4;&#xFF08;elapsed time&#xFF09;</strong>&#xFF08;&#x6BD4;&#x5982;&#x8D85;&#x65F6;&#xFF09;&#x901A;&#x5E38;&#x5F88;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x5047;&#x5B9A;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#x7684;&#x65F6;&#x949F;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x540C;&#x6B65;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x6D4B;&#x91CF;&#x7684;&#x8F7B;&#x5FAE;&#x4E0D;&#x51C6;&#x786E;&#x6027;&#x4E0D;&#x654F;&#x611F;&#x3002;</p>
<h3 id="&#x65F6;&#x949F;&#x540C;&#x6B65;&#x4E0E;&#x51C6;&#x786E;&#x6027;">&#x65F6;&#x949F;&#x540C;&#x6B65;&#x4E0E;&#x51C6;&#x786E;&#x6027;</h3>
<p>&#x200B;    &#x5355;&#x8C03;&#x949F;&#x4E0D;&#x9700;&#x8981;&#x540C;&#x6B65;&#xFF0C;&#x4F46;&#x662F;&#x65F6;&#x949F;&#x9700;&#x8981;&#x6839;&#x636E;NTP&#x670D;&#x52A1;&#x5668;&#x6216;&#x5176;&#x4ED6;&#x5916;&#x90E8;&#x65F6;&#x95F4;&#x6E90;&#x6765;&#x8BBE;&#x7F6E;&#x624D;&#x80FD;&#x6709;&#x7528;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x83B7;&#x53D6;&#x65F6;&#x949F;&#x7684;&#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x50CF;&#x4F60;&#x6240;&#x5E0C;&#x671B;&#x7684;&#x90A3;&#x6837;&#x53EF;&#x9760;&#x6216;&#x51C6;&#x786E;&#x2014;&#x2014;&#x786C;&#x4EF6;&#x65F6;&#x949F;&#x548C;NTP&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x5E7B;&#x83AB;&#x6D4B;&#x3002;&#x4E3E;&#x51E0;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p>&#x200B;    &#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x7684;&#x77F3;&#x82F1;&#x949F;&#x4E0D;&#x591F;&#x7CBE;&#x786E;&#xFF1A;&#x5B83;&#x4F1A;<strong>&#x6F02;&#x79FB;&#xFF08;drifts&#xFF09;</strong>&#xFF08;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x5FEB;&#x4E8E;&#x6216;&#x6162;&#x4E8E;&#x9884;&#x671F;&#xFF09;&#x3002;&#x65F6;&#x949F;&#x6F02;&#x79FB;&#x53D6;&#x51B3;&#x4E8E;&#x673A;&#x5668;&#x7684;&#x6E29;&#x5EA6;&#x3002; Google&#x5047;&#x8BBE;&#x5176;&#x670D;&#x52A1;&#x5668;&#x65F6;&#x949F;&#x6F02;&#x79FB;&#x4E3A;200 ppm&#xFF08;&#x767E;&#x4E07;&#x5206;&#x4E4B;&#x4E00;&#xFF09;&#x3010;41&#x3011;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x6BCF;30&#x79D2;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x91CD;&#x65B0;&#x540C;&#x6B65;&#x4E00;&#x6B21;&#x7684;&#x65F6;&#x949F;&#x6F02;&#x79FB;&#x4E3A;6&#x6BEB;&#x79D2;&#xFF0C;&#x6216;&#x8005;&#x6BCF;&#x5929;&#x91CD;&#x65B0;&#x540C;&#x6B65;&#x7684;&#x65F6;&#x949F;&#x6F02;&#x79FB;&#x4E3A;17&#x79D2;&#x3002;&#x5373;&#x4F7F;&#x4E00;&#x5207;&#x5DE5;&#x4F5C;&#x6B63;&#x5E38;&#xFF0C;&#x6B64;&#x6F02;&#x79FB;&#x4E5F;&#x4F1A;&#x9650;&#x5236;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x7684;&#x6700;&#x4F73;&#x51C6;&#x786E;&#x5EA6;&#x3002;</p>
<ul>
<li>&#x5982;&#x679C;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x65F6;&#x949F;&#x4E0E;NTP&#x670D;&#x52A1;&#x5668;&#x7684;&#x65F6;&#x949F;&#x5DEE;&#x522B;&#x592A;&#x5927;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x62D2;&#x7EDD;&#x540C;&#x6B65;&#xFF0C;&#x6216;&#x8005;&#x672C;&#x5730;&#x65F6;&#x949F;&#x5C06;&#x88AB;&#x5F3A;&#x5236;&#x91CD;&#x7F6E;&#x3010;37&#x3011;&#x3002;&#x4EFB;&#x4F55;&#x89C2;&#x5BDF;&#x91CD;&#x7F6E;&#x524D;&#x540E;&#x65F6;&#x95F4;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x65F6;&#x95F4;&#x5012;&#x9000;&#x6216;&#x7A81;&#x7136;&#x8DF3;&#x8DC3;&#x3002;</li>
<li>&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x88AB;NTP&#x670D;&#x52A1;&#x5668;&#x610F;&#x5916;&#x963B;&#x585E;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x5FFD;&#x7565;&#x9519;&#x8BEF;&#x914D;&#x7F6E;&#x3002;&#x6709;&#x8BC1;&#x636E;&#x8868;&#x660E;&#xFF0C;&#x8FD9;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x786E;&#x5B9E;&#x53D1;&#x751F;&#x8FC7;&#x3002;</li>
<li>NTP&#x540C;&#x6B65;&#x53EA;&#x80FD;&#x548C;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x4E00;&#x6837;&#x597D;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x60A8;&#x5728;&#x62E5;&#x6709;&#x53EF;&#x53D8;&#x6570;&#x636E;&#x5305;&#x5EF6;&#x8FDF;&#x7684;&#x62E5;&#x585E;&#x7F51;&#x7EDC;&#x4E0A;&#x65F6;&#xFF0C;NTP&#x540C;&#x6B65;&#x7684;&#x51C6;&#x786E;&#x6027;&#x4F1A;&#x53D7;&#x5230;&#x9650;&#x5236;&#x3002;&#x4E00;&#x4E2A;&#x5B9E;&#x9A8C;&#x8868;&#x660E;&#xFF0C;&#x5F53;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x540C;&#x6B65;&#x65F6;&#xFF0C;35&#x6BEB;&#x79D2;&#x7684;&#x6700;&#x5C0F;&#x8BEF;&#x5DEE;&#x662F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;&#x5076;&#x5C14;&#x7684;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x5CF0;&#x503C;&#x4F1A;&#x5BFC;&#x81F4;&#x5927;&#x7EA6;&#x4E00;&#x79D2;&#x7684;&#x8BEF;&#x5DEE;&#x3002;&#x6839;&#x636E;&#x914D;&#x7F6E;&#xFF0C;&#x8F83;&#x5927;&#x7684;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x4F1A;&#x5BFC;&#x81F4;NTP&#x5BA2;&#x6237;&#x7AEF;&#x5B8C;&#x5168;&#x653E;&#x5F03;&#x3002;</li>
<li>&#x4E00;&#x4E9B;NTP&#x670D;&#x52A1;&#x5668;&#x9519;&#x8BEF;&#x6216;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#xFF0C;&#x62A5;&#x544A;&#x65F6;&#x95F4;&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x4E86;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x3010;43,44&#x3011;&#x3002; NTP&#x5BA2;&#x6237;&#x7AEF;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x67E5;&#x8BE2;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x5FFD;&#x7565;&#x5F02;&#x5E38;&#x503C;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x964C;&#x751F;&#x4EBA;&#x544A;&#x8BC9;&#x4F60;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x6B63;&#x786E;&#x6027;&#x8FD8;&#x662F;&#x503C;&#x5F97;&#x62C5;&#x5FE7;&#x7684;&#x3002;</li>
<li>&#x95F0;&#x79D2;&#x5BFC;&#x81F4;59&#x5206;&#x949F;&#x6216;61&#x79D2;&#x957F;&#x7684;&#x5206;&#x949F;&#xFF0C;&#x8FD9;&#x6DF7;&#x6DC6;&#x4E86;&#x672A;&#x8BBE;&#x8BA1;&#x95F0;&#x79D2;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x65F6;&#x5E8F;&#x5047;&#x8BBE;&#x3010;45&#x3011;&#x3002;&#x95F0;&#x79D2;&#x5DF2;&#x7ECF;&#x4F7F;&#x8BB8;&#x591A;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x3010;38,46&#x3011;&#x7684;&#x4E8B;&#x5B9E;&#x8BF4;&#x660E;&#x4E86;&#xFF0C;&#x5173;&#x4E8E;&#x65F6;&#x949F;&#x7684;&#x5047;&#x8BBE;&#x662F;&#x591A;&#x4E48;&#x5BB9;&#x6613;&#x5077;&#x5077;&#x6E9C;&#x5165;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;&#x5904;&#x7406;&#x95F0;&#x79D2;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x4E00;&#x5929;&#x4E2D;&#x9010;&#x6E10;&#x6267;&#x884C;&#x95F0;&#x79D2;&#x8C03;&#x6574;&#xFF08;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x62D6;&#x5C3E;&#xFF08;smearing&#xFF09;</strong>&#xFF09;&#x3010;47,48&#x3011;&#xFF0C;&#x4F7F;NTP&#x670D;&#x52A1;&#x5668;&#x201C;&#x6492;&#x8C0E;&#x201D;&#xFF0C;&#x867D;&#x7136;&#x5B9E;&#x9645;&#x7684;NTP&#x670D;&#x52A1;&#x5668;&#x8868;&#x73B0;&#x5404;&#x5F02;&#x3010;49&#x3011;&#x3002;</li>
<li>&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#xFF0C;&#x786C;&#x4EF6;&#x65F6;&#x949F;&#x88AB;&#x865A;&#x62DF;&#x5316;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x7CBE;&#x786E;&#x8BA1;&#x65F6;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x51FA;&#x4E86;&#x989D;&#x5916;&#x7684;&#x6311;&#x6218;&#x3010;50&#x3011;&#x3002;&#x5F53;&#x4E00;&#x4E2A;CPU&#x6838;&#x5FC3;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x90FD;&#x4F1A;&#x6682;&#x505C;&#x51E0;&#x5341;&#x6BEB;&#x79D2;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x53E6;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x3002;&#x4ECE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x79CD;&#x505C;&#x987F;&#x8868;&#x73B0;&#x4E3A;&#x65F6;&#x949F;&#x7A81;&#x7136;&#x5411;&#x524D;&#x8DF3;&#x8DC3;&#x3010;26&#x3011;&#x3002;</li>
<li>&#x5982;&#x679C;&#x60A8;&#x5728;&#x672A;&#x5B8C;&#x5168;&#x63A7;&#x5236;&#x7684;&#x8BBE;&#x5907;&#x4E0A;&#x8FD0;&#x884C;&#x8F6F;&#x4EF6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x6216;&#x5D4C;&#x5165;&#x5F0F;&#x8BBE;&#x5907;&#xFF09;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x4E0D;&#x80FD;&#x4FE1;&#x4EFB;&#x8BE5;&#x8BBE;&#x5907;&#x7684;&#x786C;&#x4EF6;&#x65F6;&#x949F;&#x3002;&#x4E00;&#x4E9B;&#x7528;&#x6237;&#x6545;&#x610F;&#x5C06;&#x5176;&#x786C;&#x4EF6;&#x65F6;&#x949F;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x65E5;&#x671F;&#x548C;&#x65F6;&#x95F4;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x89C4;&#x907F;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x9650;&#x5236;&#xFF0C;&#x65F6;&#x949F;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x8BBE;&#x7F6E;&#x5230;&#x5F88;&#x8FDC;&#x7684;&#x8FC7;&#x53BB;&#x6216;&#x5C06;&#x6765;&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;&#x4F60;&#x8DB3;&#x591F;&#x5728;&#x4E4E;&#x8FD9;&#x4EF6;&#x4E8B;&#x5E76;&#x6295;&#x5165;&#x5927;&#x91CF;&#x8D44;&#x6E90;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x975E;&#x5E38;&#x597D;&#x7684;&#x65F6;&#x949F;&#x7CBE;&#x5EA6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x9488;&#x5BF9;&#x91D1;&#x878D;&#x673A;&#x6784;&#x7684;&#x6B27;&#x6D32;&#x6CD5;&#x89C4;&#x8349;&#x6848;MiFID II&#x8981;&#x6C42;&#x6240;&#x6709;&#x9AD8;&#x9891;&#x7387;&#x4EA4;&#x6613;&#x57FA;&#x91D1;&#x5728;UTC&#x65F6;&#x95F4;100&#x5FAE;&#x79D2;&#x5185;&#x540C;&#x6B65;&#x65F6;&#x949F;&#xFF0C;&#x4EE5;&#x4FBF;&#x8C03;&#x8BD5;&#x201C;&#x95EA;&#x5D29;&#x201D;&#x7B49;&#x5E02;&#x573A;&#x5F02;&#x5E38;&#x73B0;&#x8C61;&#xFF0C;&#x5E76;&#x5E2E;&#x52A9;&#x68C0;&#x6D4B;&#x5E02;&#x573A;&#x64CD;&#x7EB5; &#x3010;51&#x3011;&#x3002;</p>
<p>&#x200B;    &#x901A;&#x8FC7;GPS&#x63A5;&#x6536;&#x673A;&#xFF0C;&#x7CBE;&#x786E;&#x65F6;&#x95F4;&#x534F;&#x8BAE;&#xFF08;PTP&#xFF09;&#x3010;52&#x3011;&#x4EE5;&#x53CA;&#x4ED4;&#x7EC6;&#x7684;&#x90E8;&#x7F72;&#x548C;&#x76D1;&#x6D4B;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x7CBE;&#x786E;&#x5EA6;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x5F88;&#x591A;&#x52AA;&#x529B;&#x548C;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x65F6;&#x949F;&#x540C;&#x6B65;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;NTP&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#xFF0C;&#x6216;&#x8005;&#x9632;&#x706B;&#x5899;&#x963B;&#x6B62;&#x4E86;NTP&#x901A;&#x4FE1;&#xFF0C;&#x7531;&#x6F02;&#x79FB;&#x5F15;&#x8D77;&#x7684;&#x65F6;&#x949F;&#x8BEF;&#x5DEE;&#x53EF;&#x80FD;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x53D8;&#x5927;&#x3002;</p>
<h3 id="&#x4F9D;&#x8D56;&#x540C;&#x6B65;&#x65F6;&#x949F;">&#x4F9D;&#x8D56;&#x540C;&#x6B65;&#x65F6;&#x949F;</h3>
<p>&#x200B;    &#x65F6;&#x949F;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x7B80;&#x5355;&#x6613;&#x7528;&#xFF0C;&#x4F46;&#x5374;&#x5177;&#x6709;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#x7F3A;&#x9677;&#xFF1A;&#x4E00;&#x5929;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x6709;&#x7CBE;&#x786E;&#x7684;86,400&#x79D2;&#xFF0C;<strong>&#x65F6;&#x949F;</strong>&#x53EF;&#x80FD;&#x4F1A;&#x524D;&#x540E;&#x8DF3;&#x8DC3;&#xFF0C;&#x800C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x80FD;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x200B;    &#x672C;&#x7AE0;&#x65E9;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x7F51;&#x7EDC;&#x4E22;&#x5305;&#x548C;&#x4EFB;&#x610F;&#x5EF6;&#x8FDF;&#x5305;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5C3D;&#x7BA1;&#x7F51;&#x7EDC;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x4F46;&#x8F6F;&#x4EF6;&#x7684;&#x8BBE;&#x8BA1;&#x5FC5;&#x987B;&#x5047;&#x5B9A;&#x7F51;&#x7EDC;&#x5076;&#x5C14;&#x4F1A;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x800C;&#x8F6F;&#x4EF6;&#x5FC5;&#x987B;&#x6B63;&#x5E38;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x6545;&#x969C;&#x3002;&#x65F6;&#x949F;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#xFF1A;&#x5C3D;&#x7BA1;&#x5927;&#x591A;&#x6570;&#x65F6;&#x95F4;&#x90FD;&#x5DE5;&#x4F5C;&#x5F97;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x51C6;&#x5907;&#x5065;&#x58EE;&#x7684;&#x8F6F;&#x4EF6;&#x6765;&#x5904;&#x7406;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x65F6;&#x949F;&#x3002;</p>
<p>&#x200B;    &#x6709;&#x4E00;&#x90E8;&#x5206;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x65F6;&#x949F;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x89C6;&#x800C;&#x4E0D;&#x89C1;&#x3002;&#x5982;&#x679C;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x7684;CPU&#x51FA;&#x73B0;&#x6545;&#x969C;&#x6216;&#x8005;&#x7F51;&#x7EDC;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x5DE5;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x88AB;&#x6CE8;&#x610F;&#x548C;&#x4FEE;&#x590D;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x7684;&#x77F3;&#x82F1;&#x65F6;&#x949F;&#x6709;&#x7F3A;&#x9677;&#xFF0C;&#x6216;&#x8005;&#x5B83;&#x7684;NTP&#x5BA2;&#x6237;&#x7AEF;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4E8B;&#x60C5;&#x4F3C;&#x4E4E;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x7684;&#x65F6;&#x949F;&#x9010;&#x6E10;&#x504F;&#x79BB;&#x73B0;&#x5B9E;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x8F6F;&#x4EF6;&#x4F9D;&#x8D56;&#x4E8E;&#x7CBE;&#x786E;&#x540C;&#x6B65;&#x7684;&#x65F6;&#x949F;&#xFF0C;&#x90A3;&#x4E48;&#x7ED3;&#x679C;&#x66F4;&#x53EF;&#x80FD;&#x662F;&#x6084;&#x65E0;&#x58F0;&#x606F;&#x7684;&#xFF0C;&#x4EC5;&#x6709;&#x5FAE;&#x91CF;&#x7684;&#x6570;&#x636E;&#x4E22;&#x5931;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x6B21;&#x60CA;&#x5929;&#x52A8;&#x5730;&#x7684;&#x5D29;&#x6E83;&#x3010;53,54&#x3011;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;&#x9700;&#x8981;&#x540C;&#x6B65;&#x65F6;&#x949F;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x5FC5;&#x987B;&#x4ED4;&#x7EC6;&#x76D1;&#x63A7;&#x6240;&#x6709;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x949F;&#x504F;&#x79FB;&#x3002;&#x65F6;&#x949F;&#x504F;&#x79BB;&#x5176;&#x4ED6;&#x65F6;&#x949F;&#x592A;&#x8FDC;&#x7684;&#x8282;&#x70B9;&#x5E94;&#x5F53;&#x88AB;&#x5BA3;&#x544A;&#x6B7B;&#x4EA1;&#xFF0C;&#x5E76;&#x4ECE;&#x96C6;&#x7FA4;&#x4E2D;&#x79FB;&#x9664;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x76D1;&#x63A7;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x4F60;&#x5728;&#x635F;&#x5931;&#x53D1;&#x751F;&#x4E4B;&#x524D;&#x6CE8;&#x610F;&#x5230;&#x7834;&#x635F;&#x7684;&#x65F6;&#x949F;&#x3002;</p>
<h4 id="&#x6709;&#x5E8F;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x95F4;&#x6233;">&#x6709;&#x5E8F;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x95F4;&#x6233;</h4>
<p>&#x200B;    &#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x4EF6;&#x5F88;&#x6709;&#x8BF1;&#x60D1;&#x4F46;&#x4E5F;&#x5F88;&#x5371;&#x9669;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;&#x4F9D;&#x8D56;&#x65F6;&#x949F;&#xFF0C;&#x5728;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x5BF9;&#x4E8B;&#x4EF6;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5199;&#x5165;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8C01;&#x5148;&#x5230;&#x8FBE;&#xFF1F; &#x54EA;&#x4E00;&#x4E2A;&#x66F4;&#x8FD1;&#xFF1F;</p>
<p>&#x200B;    <a href="img/fig8-3.png">&#x56FE;8-3</a>&#x663E;&#x793A;&#x4E86;&#x5728;&#x5177;&#x6709;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5BF9;&#x65F6;&#x949F;&#x7684;&#x5371;&#x9669;&#x4F7F;&#x7528;&#xFF08;&#x8BE5;&#x4F8B;&#x5B50;&#x7C7B;&#x4F3C;&#x4E8E;<a href="img/fig5-9.png">&#x56FE;5-9</a>&#xFF09;&#x3002; &#x5BA2;&#x6237;&#x7AEF;A&#x5728;&#x8282;&#x70B9;1&#x4E0A;&#x5199;&#x5165;<code>x = 1</code>&#xFF1B;&#x5199;&#x5165;&#x88AB;&#x590D;&#x5236;&#x5230;&#x8282;&#x70B9;3&#xFF1B;&#x5BA2;&#x6237;&#x7AEF;B&#x5728;&#x8282;&#x70B9;3&#x4E0A;&#x589E;&#x52A0;x&#xFF08;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x6709;<code>x = 2</code>&#xFF09;&#xFF1B;&#x6700;&#x540E;&#x8FD9;&#x4E24;&#x4E2A;&#x5199;&#x5165;&#x90FD;&#x88AB;&#x590D;&#x5236;&#x5230;&#x8282;&#x70B9;2&#x3002;</p>
<p><img src="img/fig8-3.png" alt=""></p>
<p><strong>&#x56FE;8-3 &#x5BA2;&#x6237;&#x7AEF;B&#x7684;&#x5199;&#x5165;&#x6BD4;&#x5BA2;&#x6237;&#x7AEF;A&#x7684;&#x5199;&#x5165;&#x8981;&#x665A;&#xFF0C;&#x4F46;&#x662F;B&#x7684;&#x5199;&#x5165;&#x5177;&#x6709;&#x8F83;&#x65E9;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x3002;</strong></p>
<p>&#x200B;    &#x5728;<a href="">&#x56FE;8-3</a>&#x4E2D;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x5199;&#x5165;&#x88AB;&#x590D;&#x5236;&#x5230;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x6839;&#x636E;&#x53D1;&#x751F;&#x5199;&#x5165;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x65F6;&#x949F;&#x65F6;&#x949F;&#x6807;&#x8BB0;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x65F6;&#x949F;&#x540C;&#x6B65;&#x662F;&#x975E;&#x5E38;&#x597D;&#x7684;&#xFF1A;&#x8282;&#x70B9;1&#x548C;&#x8282;&#x70B9;3&#x4E4B;&#x95F4;&#x7684;&#x504F;&#x5DEE;&#x5C0F;&#x4E8E;3ms&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x6BD4;&#x4F60;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x9884;&#x671F;&#x7684;&#x66F4;&#x597D;&#x3002;</p>
<p>&#x200B;    &#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;<a href="img/fig8-3.png">&#x56FE;8-3</a>&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x5374;&#x65E0;&#x6CD5;&#x6B63;&#x786E;&#x6392;&#x5217;&#x4E8B;&#x4EF6;&#xFF1A;&#x5199;&#x5165;<code>x = 1</code>&#x7684;&#x65F6;&#x95F4;&#x6233;&#x4E3A;42.004&#x79D2;&#xFF0C;&#x4F46;&#x5199;&#x5165;<code>x = 2</code>&#x7684;&#x65F6;&#x95F4;&#x6233;&#x4E3A;42.003&#x79D2;&#xFF0C;&#x5373;&#x4F7F;<code>x = 2</code>&#x5728;&#x7A0D;&#x540E;&#x51FA;&#x73B0;&#x3002;&#x5F53;&#x8282;&#x70B9;2&#x63A5;&#x6536;&#x5230;&#x8FD9;&#x4E24;&#x4E2A;&#x4E8B;&#x4EF6;&#x65F6;&#xFF0C;&#x4F1A;&#x9519;&#x8BEF;&#x5730;&#x63A8;&#x65AD;&#x51FA;<code>x = 1</code>&#x662F;&#x6700;&#x8FD1;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x4E22;&#x5F03;&#x5199;&#x5165;<code>x = 2</code>&#x3002;&#x6548;&#x679C;&#x4E0A;&#x8868;&#x73B0;&#x4E3A;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;B&#x7684;&#x589E;&#x91CF;&#x64CD;&#x4F5C;&#x4F1A;&#x4E22;&#x5931;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x79CD;&#x51B2;&#x7A81;&#x89E3;&#x51B3;&#x7B56;&#x7565;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;LWW&#xFF09;</strong>&#xFF0C;&#x5B83;&#x5728;&#x591A;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x548C;&#x65E0;&#x9886;&#x5BFC;&#x8005;&#x6570;&#x636E;&#x5E93;&#xFF08;&#x5982;Cassandra &#x3010;53&#x3011;&#x548C;Riak &#x3010;54&#x3011;&#xFF09;&#x4E2D;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="#&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;&#x4E22;&#x5F03;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF09;">&#x6700;&#x540E;&#x5199;&#x5165;&#x80DC;&#x5229;&#xFF08;&#x4E22;&#x5F03;&#x5E76;&#x53D1;&#x5199;&#x5165;&#xFF09;</a>&#x201D;&#x4E00;&#x8282;&#xFF09;&#x3002;&#x6709;&#x4E9B;&#x5B9E;&#x73B0;&#x4F1A;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x800C;&#x4E0D;&#x662F;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x751F;&#x6210;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x80FD;&#x6539;&#x53D8;LWW&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x6570;&#x636E;&#x5E93;&#x5199;&#x5165;&#x53EF;&#x80FD;&#x4F1A;&#x795E;&#x79D8;&#x5730;&#x6D88;&#x5931;&#xFF1A;&#x5177;&#x6709;&#x6EDE;&#x540E;&#x65F6;&#x949F;&#x7684;&#x8282;&#x70B9;&#x65E0;&#x6CD5;&#x8986;&#x76D6;&#x4E4B;&#x524D;&#x5177;&#x6709;&#x5FEB;&#x901F;&#x65F6;&#x949F;&#x7684;&#x8282;&#x70B9;&#x5199;&#x5165;&#x7684;&#x503C;&#xFF0C;&#x76F4;&#x5230;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x949F;&#x504F;&#x5DEE;&#x6D88;&#x901D;&#x3010;54,55&#x3011;&#x3002;&#x6B64;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x6570;&#x636E;&#x88AB;&#x6084;&#x6084;&#x4E22;&#x5F03;&#xFF0C;&#x800C;&#x672A;&#x5411;&#x5E94;&#x7528;&#x62A5;&#x544A;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x3002;</li>
<li>LWW&#x65E0;&#x6CD5;&#x533A;&#x5206;<strong>&#x9AD8;&#x9891;&#x987A;&#x5E8F;&#x5199;&#x5165;</strong>&#xFF08;&#x5728;<a href="img/fig8-3.png">&#x56FE;8-3</a>&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;B&#x7684;&#x589E;&#x91CF;&#x64CD;&#x4F5C;<strong>&#x4E00;&#x5B9A;</strong>&#x53D1;&#x751F;&#x5728;&#x5BA2;&#x6237;&#x7AEF;A&#x7684;&#x5199;&#x5165;&#x4E4B;&#x540E;&#xFF09;&#x548C;<strong>&#x771F;&#x6B63;&#x5E76;&#x53D1;&#x5199;&#x5165;</strong>&#xFF08;&#x5199;&#x5165;&#x8005;&#x610F;&#x8BC6;&#x4E0D;&#x5230;&#x5176;&#x4ED6;&#x5199;&#x5165;&#x8005;&#xFF09;&#x3002;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x8DDF;&#x8E2A;&#x673A;&#x5236;&#xFF08;&#x4F8B;&#x5982;&#x7248;&#x672C;&#x5411;&#x91CF;&#xFF09;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x7684;&#x51B2;&#x7A81;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="ch5.html#&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;">&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;</a>&#x201D;&#xFF09;&#x3002;</li>
<li>&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#x5F88;&#x53EF;&#x80FD;&#x72EC;&#x7ACB;&#x5730;&#x751F;&#x6210;&#x5177;&#x6709;&#x76F8;&#x540C;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x5199;&#x5165;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x65F6;&#x949F;&#x4EC5;&#x5177;&#x6709;&#x6BEB;&#x79D2;&#x5206;&#x8FA8;&#x7387;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x6837;&#x7684;&#x51B2;&#x7A81;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;<strong>&#x51B3;&#x80DC;&#x503C;&#xFF08;tiebreaker&#xFF09;</strong>&#xFF08;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x968F;&#x673A;&#x6570;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x8FDD;&#x80CC;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x3010;53&#x3011;&#x3002;</li>
</ul>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5C3D;&#x7BA1;&#x901A;&#x8FC7;&#x4FDD;&#x7559;&#x6700;&#x201C;&#x6700;&#x8FD1;&#x201D;&#x7684;&#x503C;&#x5E76;&#x653E;&#x5F03;&#x5176;&#x4ED6;&#x503C;&#x6765;&#x89E3;&#x51B3;&#x51B2;&#x7A81;&#x662F;&#x5F88;&#x8BF1;&#x60D1;&#x4EBA;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x201C;&#x6700;&#x8FD1;&#x201D;&#x7684;&#x5B9A;&#x4E49;&#x53D6;&#x51B3;&#x4E8E;&#x672C;&#x5730;&#x7684;<strong>&#x65F6;&#x949F;</strong>&#xFF0C;&#x8FD9;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x7528;&#x9891;&#x7E41;&#x540C;&#x6B65;&#x7684;NTP&#x65F6;&#x949F;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5305;&#x4E5F;&#x53EF;&#x80FD;&#x5728;&#x65F6;&#x95F4;&#x6233;100&#x6BEB;&#x79D2;&#xFF08;&#x6839;&#x636E;&#x53D1;&#x9001;&#x8005;&#x7684;&#x65F6;&#x949F;&#xFF09;&#x65F6;&#x53D1;&#x9001;&#xFF0C;&#x5E76;&#x5728;&#x65F6;&#x95F4;&#x6233;99&#x6BEB;&#x79D2;&#xFF08;&#x6839;&#x636E;&#x63A5;&#x6536;&#x8005;&#x7684;&#x65F6;&#x949F;&#xFF09;&#x5904;&#x5230;&#x8FBE;&#x2014;&#x2014;&#x770B;&#x8D77;&#x6765;&#x597D;&#x50CF;&#x6570;&#x636E;&#x5305;&#x5728;&#x53D1;&#x9001;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x5230;&#x8FBE;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
<p>&#x200B;    NTP&#x540C;&#x6B65;&#x662F;&#x5426;&#x80FD;&#x8DB3;&#x591F;&#x51C6;&#x786E;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x8FD9;&#x79CD;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x6392;&#x5E8F;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#xFF1F;&#x4E5F;&#x8BB8;&#x4E0D;&#x80FD;&#xFF0C;&#x56E0;&#x4E3A;NTP&#x7684;&#x540C;&#x6B65;&#x7CBE;&#x5EA6;&#x672C;&#x8EAB;&#x53D7;&#x5230;&#x7F51;&#x7EDC;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x9664;&#x4E86;&#x77F3;&#x82F1;&#x949F;&#x6F02;&#x79FB;&#x8FD9;&#x7C7B;&#x8BEF;&#x5DEE;&#x6E90;&#x4E4B;&#x5916;&#x3002;&#x4E3A;&#x4E86;&#x8FDB;&#x884C;&#x6B63;&#x786E;&#x7684;&#x6392;&#x5E8F;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6BD4;&#x6D4B;&#x91CF;&#x5BF9;&#x8C61;&#xFF08;&#x5373;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF09;&#x8981;&#x7CBE;&#x786E;&#x5F97;&#x591A;&#x7684;&#x65F6;&#x949F;&#x3002;</p>
<p>&#x200B;    &#x6240;&#x8C13;&#x7684;<strong>&#x903B;&#x8F91;&#x65F6;&#x949F;&#xFF08;logic clock&#xFF09;</strong>&#x3010;56,57&#x3011;&#x662F;&#x57FA;&#x4E8E;&#x9012;&#x589E;&#x8BA1;&#x6570;&#x5668;&#x800C;&#x4E0D;&#x662F;&#x632F;&#x8361;&#x77F3;&#x82F1;&#x6676;&#x4F53;&#xFF0C;&#x5BF9;&#x4E8E;&#x6392;&#x5E8F;&#x4E8B;&#x4EF6;&#x6765;&#x8BF4;&#x662F;&#x66F4;&#x5B89;&#x5168;&#x7684;&#x9009;&#x62E9;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x201C;<a href="ch5.html#&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;">&#x68C0;&#x6D4B;&#x5E76;&#x53D1;&#x5199;&#x5165;</a>&#x201D;&#xFF09;&#x3002;&#x903B;&#x8F91;&#x65F6;&#x949F;&#x4E0D;&#x6D4B;&#x91CF;&#x4E00;&#x5929;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#x6216;&#x7ECF;&#x8FC7;&#x7684;&#x79D2;&#x6570;&#xFF0C;&#x800C;&#x4EC5;&#x6D4B;&#x91CF;&#x4E8B;&#x4EF6;&#x7684;&#x76F8;&#x5BF9;&#x987A;&#x5E8F;&#xFF08;&#x65E0;&#x8BBA;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x4E4B;&#x524D;&#x8FD8;&#x662F;&#x4E4B;&#x540E;&#xFF09;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7528;&#x6765;&#x6D4B;&#x91CF;&#x5B9E;&#x9645;&#x7ECF;&#x8FC7;&#x65F6;&#x95F4;&#x7684;<strong>&#x65F6;&#x949F;</strong>&#x548C;<strong>&#x5355;&#x8C03;&#x949F;</strong>&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x7269;&#x7406;&#x65F6;&#x949F;&#xFF08;physical clock&#xFF09;</strong>&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;<a href="#&#x987A;&#x5E8F;&#x4FDD;&#x8BC1;">&#x987A;&#x5E8F;&#x4FDD;&#x8BC1;</a>&#x201D;&#x4E2D;&#x6765;&#x770B;&#x987A;&#x5E8F;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x65F6;&#x949F;&#x8BFB;&#x6570;&#x5B58;&#x5728;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;">&#x65F6;&#x949F;&#x8BFB;&#x6570;&#x5B58;&#x5728;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;</h4>
<p>&#x200B;    &#x60A8;&#x53EF;&#x80FD;&#x80FD;&#x591F;&#x4EE5;&#x5FAE;&#x79D2;&#x6216;&#x751A;&#x81F3;&#x7EB3;&#x79D2;&#x7684;&#x7CBE;&#x5EA6;&#x8BFB;&#x53D6;&#x673A;&#x5668;&#x7684;&#x65F6;&#x949F;&#x3002;&#x4F46;&#x5373;&#x4F7F;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5982;&#x6B64;&#x7EC6;&#x81F4;&#x7684;&#x6D4B;&#x91CF;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E2A;&#x503C;&#x5BF9;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x7CBE;&#x5EA6;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x51C6;&#x786E;&#x7684;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5927;&#x6982;&#x7387;&#x662F;&#x4E0D;&#x51C6;&#x786E;&#x7684;&#x2014;&#x2014;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x5373;&#x4F7F;&#x60A8;&#x6BCF;&#x5206;&#x949F;&#x4E0E;&#x672C;&#x5730;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;NTP&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x540C;&#x6B65;&#xFF0C;&#x51E0;&#x6BEB;&#x79D2;&#x7684;&#x65F6;&#x95F4;&#x6F02;&#x79FB;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x5728;&#x4E0D;&#x7CBE;&#x786E;&#x7684;&#x77F3;&#x82F1;&#x65F6;&#x949F;&#x4E0A;&#x53D1;&#x751F;&#x3002;&#x4F7F;&#x7528;&#x516C;&#x5171;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;NTP&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x53EF;&#x80FD;&#x8FBE;&#x5230;&#x51E0;&#x5341;&#x6BEB;&#x79D2;&#xFF0C;&#x800C;&#x4E14;&#x5F53;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x65F6;&#xFF0C;&#x8BEF;&#x5DEE;&#x53EF;&#x80FD;&#x4F1A;&#x8D85;&#x8FC7;100&#x6BEB;&#x79D2;&#x3010;57&#x3011;&#x3002;</p>
<p>&#x200B;    &#x56E0;&#x6B64;&#xFF0C;&#x5C06;&#x65F6;&#x949F;&#x8BFB;&#x6570;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x2014;&#x2014;&#x5B83;&#x66F4;&#x50CF;&#x662F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x4EE5;95&#xFF05;&#x7684;&#x7F6E;&#x4FE1;&#x5EA6;&#x8BA4;&#x4E3A;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x5904;&#x4E8E;&#x672C;&#x5206;&#x949F;&#x5185;&#x7684;&#x7B2C;10.3&#x79D2;&#x548C;10.5&#x79D2;&#x4E4B;&#x95F4;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6CA1;&#x6CD5;&#x6BD4;&#x8FD9;&#x66F4;&#x7CBE;&#x786E;&#x4E86;&#x3010;58&#x3011;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x53EA;&#x77E5;&#x9053;&#xB1;100&#x6BEB;&#x79D2;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x90A3;&#x4E48;&#x65F6;&#x95F4;&#x6233;&#x4E2D;&#x7684;&#x5FAE;&#x79D2;&#x6570;&#x5B57;&#x90E8;&#x5206;&#x57FA;&#x672C;&#x4E0A;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x754C;&#x9650;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x6E90;&#x6765;&#x8BA1;&#x7B97;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7684;GPS&#x63A5;&#x6536;&#x5668;&#x6216;&#x539F;&#x5B50;&#xFF08;&#x94EF;&#xFF09;&#x65F6;&#x949F;&#x76F4;&#x63A5;&#x8FDE;&#x63A5;&#x5230;&#x60A8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x9884;&#x671F;&#x7684;&#x9519;&#x8BEF;&#x8303;&#x56F4;&#x7531;&#x5236;&#x9020;&#x5546;&#x544A;&#x77E5;&#x3002;&#x5982;&#x679C;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x83B7;&#x5F97;&#x65F6;&#x95F4;&#xFF0C;&#x5219;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x53D6;&#x51B3;&#x4E8E;&#x81EA;&#x4E0A;&#x6B21;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x540C;&#x6B65;&#x4EE5;&#x6765;&#x7684;&#x77F3;&#x82F1;&#x949F;&#x6F02;&#x79FB;&#x7684;&#x671F;&#x671B;&#x503C;&#xFF0C;&#x52A0;&#x4E0A;NTP&#x670D;&#x52A1;&#x5668;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x5230;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7F51;&#x7EDC;&#x5F80;&#x8FD4;&#x65F6;&#x95F4;&#xFF08;&#x53EA;&#x662F;&#x83B7;&#x53D6;&#x7C97;&#x7565;&#x8FD1;&#x4F3C;&#x503C;&#xFF0C;&#x5E76;&#x5047;&#x8BBE;&#x670D;&#x52A1;&#x5668;&#x662F;&#x53EF;&#x4FE1;&#x7684;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x4E0D;&#x516C;&#x5F00;&#x8FD9;&#x79CD;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x8C03;&#x7528;<code>clock_gettime()</code>&#x65F6;&#xFF0C;&#x8FD4;&#x56DE;&#x503C;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x9884;&#x671F;&#x9519;&#x8BEF;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x5176;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;&#x662F;5&#x6BEB;&#x79D2;&#x8FD8;&#x662F;5&#x5E74;&#x3002;</p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x4F8B;&#x5916;&#x662F;Spanner&#x4E2D;&#x7684;Google TrueTime API &#x3010;41&#x3011;&#xFF0C;&#x5B83;&#x660E;&#x786E;&#x5730;&#x62A5;&#x544A;&#x4E86;&#x672C;&#x5730;&#x65F6;&#x949F;&#x7684;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;&#x3002;&#x5F53;&#x4F60;&#x8BE2;&#x95EE;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E24;&#x4E2A;&#x503C;&#xFF1A;[&#x6700;&#x65E9;&#xFF0C;&#x6700;&#x665A;]&#xFF0C;&#x8FD9;&#x662F;&#x6700;&#x65E9;&#x53EF;&#x80FD;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x548C;&#x6700;&#x665A;&#x53EF;&#x80FD;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x3002;&#x5728;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x4F30;&#x8BA1;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x65F6;&#x949F;&#x77E5;&#x9053;&#x5F53;&#x524D;&#x7684;&#x5B9E;&#x9645;&#x65F6;&#x95F4;&#x843D;&#x5728;&#x8BE5;&#x533A;&#x95F4;&#x5185;&#x3002;&#x533A;&#x95F4;&#x7684;&#x5BBD;&#x5EA6;&#x53D6;&#x51B3;&#x4E8E;&#x81EA;&#x4ECE;&#x672C;&#x5730;&#x77F3;&#x82F1;&#x949F;&#x6700;&#x540E;&#x4E0E;&#x66F4;&#x7CBE;&#x786E;&#x7684;&#x65F6;&#x949F;&#x6E90;&#x540C;&#x6B65;&#x4EE5;&#x6765;&#x5DF2;&#x7ECF;&#x8FC7;&#x4E86;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x3002;</p>
<h4 id="&#x5168;&#x5C40;&#x5FEB;&#x7167;&#x7684;&#x540C;&#x6B65;&#x65F6;&#x949F;">&#x5168;&#x5C40;&#x5FEB;&#x7167;&#x7684;&#x540C;&#x6B65;&#x65F6;&#x949F;</h4>
<p>&#x200B;    &#x5728;&#x201C;<a href="ch7.html#&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x53D6;">&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x53D6;</a>&#x201D;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#xFF0C;&#x8FD9;&#x662F;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x9700;&#x8981;&#x652F;&#x6301;&#x5C0F;&#x578B;&#x5FEB;&#x901F;&#x8BFB;&#x5199;&#x4E8B;&#x52A1;&#x548C;&#x5927;&#x578B;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x53EA;&#x8BFB;&#x4E8B;&#x52A1;&#xFF0C;&#x7528;&#x4E8E;&#x5907;&#x4EFD;&#x6216;&#x5206;&#x6790;&#xFF09;&#x3002;&#x5B83;&#x5141;&#x8BB8;&#x53EA;&#x8BFB;&#x4E8B;&#x52A1;&#x770B;&#x5230;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#x7684;&#x5904;&#x4E8E;&#x4E00;&#x81F4;&#x72B6;&#x6001;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4E14;&#x4E0D;&#x4F1A;&#x9501;&#x5B9A;&#x548C;&#x5E72;&#x6270;&#x8BFB;&#x5199;&#x4E8B;&#x52A1;&#x3002;</p>
<p>&#x200B;    &#x5FEB;&#x7167;&#x9694;&#x79BB;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5B9E;&#x73B0;&#x9700;&#x8981;&#x5355;&#x8C03;&#x9012;&#x589E;&#x7684;&#x4E8B;&#x52A1;ID&#x3002;&#x5982;&#x679C;&#x5199;&#x5165;&#x6BD4;&#x5FEB;&#x7167;&#x665A;&#xFF08;&#x5373;&#xFF0C;&#x5199;&#x5165;&#x5177;&#x6709;&#x6BD4;&#x5FEB;&#x7167;&#x66F4;&#x5927;&#x7684;&#x4E8B;&#x52A1;ID&#xFF09;&#xFF0C;&#x5219;&#x8BE5;&#x5199;&#x5165;&#x5BF9;&#x4E8E;&#x5FEB;&#x7167;&#x4E8B;&#x52A1;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x5728;&#x5355;&#x8282;&#x70B9;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x5C31;&#x8DB3;&#x4EE5;&#x751F;&#x6210;&#x4E8B;&#x52A1;ID&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#x5F53;&#x6570;&#x636E;&#x5E93;&#x5206;&#x5E03;&#x5728;&#x8BB8;&#x591A;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x4E5F;&#x8BB8;&#x53EF;&#x80FD;&#x5728;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x4E2D;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x9700;&#x8981;&#x534F;&#x8C03;&#xFF0C;&#xFF08;&#x8DE8;&#x6240;&#x6709;&#x5206;&#x533A;&#xFF09;&#x5168;&#x5C40;&#x5355;&#x8C03;&#x9012;&#x589E;&#x7684;&#x4E8B;&#x52A1;ID&#x4F1A;&#x5F88;&#x96BE;&#x751F;&#x6210;&#x3002;&#x4E8B;&#x52A1;ID&#x5FC5;&#x987B;&#x53CD;&#x6620;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#xFF1A;&#x5982;&#x679C;&#x4E8B;&#x52A1;B&#x8BFB;&#x53D6;&#x7531;&#x4E8B;&#x52A1;A&#x5199;&#x5165;&#x7684;&#x503C;&#xFF0C;&#x5219;B&#x5FC5;&#x987B;&#x5177;&#x6709;&#x6BD4;A&#x66F4;&#x5927;&#x7684;&#x4E8B;&#x52A1;ID&#xFF0C;&#x5426;&#x5219;&#x5FEB;&#x7167;&#x5C31;&#x65E0;&#x6CD5;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x5728;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5C0F;&#x89C4;&#x6A21;&#x3001;&#x9AD8;&#x9891;&#x7387;&#x7684;&#x4E8B;&#x52A1;&#x60C5;&#x666F;&#x4E0B;&#xFF0C;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x521B;&#x5EFA;&#x4E8B;&#x52A1;ID&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x96BE;&#x4EE5;&#x9632;&#x5B88;&#x7684;&#x74F6;&#x9888;<sup><a href="#fn_vi" id="reffn_vi">vi</a></sup>&#x3002;</p>
<blockquote id="fn_vi">
<sup>vi</sup>. &#x5B58;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x5E8F;&#x5217;&#x53F7;&#x751F;&#x6210;&#x5668;&#xFF0C;&#x4F8B;&#x5982;Twitter&#x7684;&#x96EA;&#x82B1;&#xFF08;Snowflake&#xFF09;&#xFF0C;&#x5176;&#x4EE5;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;ID&#x7A7A;&#x95F4;&#x7684;&#x5757;&#x5206;&#x914D;&#x7ED9;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#xFF09;&#x8FD1;&#x4F3C;&#x5355;&#x8C03;&#x5730;&#x589E;&#x52A0;&#x552F;&#x4E00;ID&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x4E0E;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x4E00;&#x81F4;&#x7684;&#x6392;&#x5E8F;&#xFF0C;&#x56E0;&#x4E3A;&#x5206;&#x914D;&#x7684;ID&#x5757;&#x7684;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x6BD4;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x7684;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x8981;&#x957F;&#x3002;&#x53E6;&#x8BF7;&#x53C2;&#x9605;&#x201C;<a href="#&#x987A;&#x5E8F;&#x4FDD;&#x8BC1;">&#x987A;&#x5E8F;&#x4FDD;&#x8BC1;</a>&#x201D;&#x3002;<a href="#reffn_vi" title="Jump back to footnote [vi] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x200B;    &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x65F6;&#x949F;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x4F5C;&#x4E3A;&#x4E8B;&#x52A1;ID&#x5417;&#xFF1F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x8DB3;&#x591F;&#x597D;&#x7684;&#x540C;&#x6B65;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5C06;&#x5177;&#x6709;&#x5F88;&#x5408;&#x9002;&#x7684;&#x5C5E;&#x6027;&#xFF1A;&#x66F4;&#x665A;&#x7684;&#x4E8B;&#x52A1;&#x4F1A;&#x6709;&#x66F4;&#x5927;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x65F6;&#x949F;&#x7CBE;&#x5EA6;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x3002;</p>
<p>&#x200B;    Spanner&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x8DE8;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x3010;59&#xFF0C;60&#x3011;&#x3002;&#x5B83;&#x4F7F;&#x7528;TrueTime API&#x62A5;&#x544A;&#x7684;&#x65F6;&#x949F;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;&#xFF0C;&#x5E76;&#x57FA;&#x4E8E;&#x4EE5;&#x4E0B;&#x89C2;&#x5BDF;&#x7ED3;&#x679C;&#xFF1A;&#x5982;&#x679C;&#x60A8;&#x6709;&#x4E24;&#x4E2A;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;&#xFF0C;&#x6BCF;&#x4E2A;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;&#x5305;&#x542B;&#x6700;&#x65E9;&#x548C;&#x6700;&#x665A;&#x53EF;&#x80FD;&#x7684;&#x65F6;&#x95F4;&#x6233;&#xFF08;  $A = [A<em>{earliest}, A</em>{latest}]$&#xFF0C; $B=[B<em>{earliest}, B</em>{latest}]$&#xFF09;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x533A;&#x95F4;&#x4E0D;&#x91CD;&#x53E0;&#xFF08;&#x5373;&#xFF1A;$A<em>{earliest} &lt; A</em>{latest} &lt; B<em>{earliest} &lt; B</em>{latest}$&#xFF09;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;B&#x80AF;&#x5B9A;&#x53D1;&#x751F;&#x5728;A&#x4E4B;&#x540E;&#x2014;&#x2014;&#x8FD9;&#x662F;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x7684;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x533A;&#x95F4;&#x91CD;&#x53E0;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x4E0D;&#x786E;&#x5B9A;A&#x548C;B&#x53D1;&#x751F;&#x7684;&#x987A;&#x5E8F;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x4E8B;&#x52A1;&#x65F6;&#x95F4;&#x6233;&#x53CD;&#x6620;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#xFF0C;&#x5728;&#x63D0;&#x4EA4;&#x8BFB;&#x5199;&#x4E8B;&#x52A1;&#x4E4B;&#x524D;&#xFF0C;Spanner&#x5728;&#x63D0;&#x4EA4;&#x8BFB;&#x5199;&#x4E8B;&#x52A1;&#x65F6;&#xFF0C;&#x4F1A;&#x6545;&#x610F;&#x7B49;&#x5F85;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;&#x957F;&#x5EA6;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#x7684;&#x4E8B;&#x52A1;&#x5904;&#x4E8E;&#x8DB3;&#x591F;&#x665A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x7684;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;&#x4E0D;&#x4F1A;&#x91CD;&#x53E0;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x5C3D;&#x53EF;&#x80FD;&#x77ED;&#x7684;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#xFF0C;Spanner&#x9700;&#x8981;&#x4FDD;&#x6301;&#x5C3D;&#x53EF;&#x80FD;&#x5C0F;&#x7684;&#x65F6;&#x949F;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x4E3A;&#x6B64;&#xFF0C;Google&#x5728;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x90FD;&#x90E8;&#x7F72;&#x4E86;&#x4E00;&#x4E2A;GPS&#x63A5;&#x6536;&#x5668;&#x6216;&#x539F;&#x5B50;&#x949F;&#xFF0C;&#x8FD9;&#x5141;&#x8BB8;&#x65F6;&#x949F;&#x5728;&#x5927;&#x7EA6;7&#x6BEB;&#x79D2;&#x5185;&#x540C;&#x6B65;&#x3010;41&#x3011;&#x3002;</p>
<p>&#x200B;    &#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x8BED;&#x4E49;&#x4F7F;&#x7528;&#x65F6;&#x949F;&#x540C;&#x6B65;&#x662F;&#x4E00;&#x4E2A;&#x6D3B;&#x8DC3;&#x7684;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x3010;57,61,62&#x3011;&#x3002;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x5F88;&#x6709;&#x8DA3;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x5728;&#x8C37;&#x6B4C;&#x4E4B;&#x5916;&#x7684;&#x4E3B;&#x6D41;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;</p>
<h3 id="&#x6682;&#x505C;&#x8FDB;&#x7A0B;">&#x6682;&#x505C;&#x8FDB;&#x7A0B;</h3>
<p>&#x200B;    &#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x4F7F;&#x7528;&#x5371;&#x9669;&#x65F6;&#x949F;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#x3002;&#x53EA;&#x6709;&#x9886;&#x5BFC;&#x88AB;&#x5141;&#x8BB8;&#x63A5;&#x53D7;&#x5199;&#x5165;&#x3002;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x5B83;&#x4ECD;&#x7136;&#x662F;&#x9886;&#x5BFC;&#x8005;&#xFF08;&#x5B83;&#x5E76;&#x6CA1;&#x6709;&#x88AB;&#x522B;&#x4EBA;&#x5BA3;&#x544A;&#x4E3A;&#x6B7B;&#x4EA1;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x63A5;&#x53D7;&#x5199;&#x5165;&#xFF1F;</p>
<p>&#x200B;    &#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x9886;&#x5BFC;&#x8005;&#x4ECE;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;<strong>&#x79DF;&#x7EA6;&#xFF08;lease&#xFF09;</strong>&#xFF0C;&#x7C7B;&#x4F3C;&#x4E00;&#x4E2A;&#x5E26;&#x8D85;&#x65F6;&#x7684;&#x9501;&#x3010;63&#x3011;&#x3002;&#x4EFB;&#x4E00;&#x65F6;&#x523B;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x6301;&#x6709;&#x79DF;&#x7EA6;&#x2014;&#x2014;&#x56E0;&#x6B64;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x79DF;&#x7EA6;&#x65F6;&#xFF0C;&#x5B83;&#x77E5;&#x9053;&#x5B83;&#x5728;&#x67D0;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x81EA;&#x5DF1;&#x662F;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x76F4;&#x5230;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x6301;&#x9886;&#x5BFC;&#x5730;&#x4F4D;&#xFF0C;&#x8282;&#x70B9;&#x5FC5;&#x987B;&#x5468;&#x671F;&#x6027;&#x5730;&#x5728;&#x79DF;&#x7EA6;&#x8FC7;&#x671F;&#x524D;&#x7EED;&#x671F;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF0C;&#x5C31;&#x4F1A;&#x505C;&#x6B62;&#x7EED;&#x671F;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x79DF;&#x7EA6;&#x8FC7;&#x671F;&#x65F6;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x63A5;&#x7BA1;&#x3002;</p>
<p>&#x200B;    &#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#xFF0C;&#x8BF7;&#x6C42;&#x5904;&#x7406;&#x5FAA;&#x73AF;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">while</span>(<span class="hljs-keyword">true</span>){
    request=getIncomingRequest();
    <span class="hljs-comment">// &#x786E;&#x4FDD;&#x79DF;&#x7EA6;&#x8FD8;&#x5269;&#x4E0B;&#x81F3;&#x5C11;10&#x79D2;</span>
    <span class="hljs-keyword">if</span> (lease.expiryTimeMillis-System.currentTimeMillis()&lt; <span class="hljs-number">10000</span>){
        lease = lease.renew();
    }

    <span class="hljs-keyword">if</span>(lease.isValid()){
        process(request);
    }}
}
</code></pre>
<p>&#x200B;     &#x8FD9;&#x4E2A;&#x4EE3;&#x7801;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x540C;&#x6B65;&#x65F6;&#x949F;&#xFF1A;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#x65F6;&#x95F4;&#x7531;&#x53E6;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x8BBE;&#x7F6E;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x524D;&#x65F6;&#x95F4;&#x52A0;&#x4E0A;30&#x79D2;&#xFF0C;&#x8BA1;&#x7B97;&#x5230;&#x671F;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4E0E;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x65F6;&#x949F;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002;&#x5982;&#x679C;&#x65F6;&#x949F;&#x8D85;&#x8FC7;&#x51E0;&#x79D2;&#x4E0D;&#x540C;&#x6B65;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5C06;&#x5F00;&#x59CB;&#x505A;&#x5947;&#x602A;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x200B;    &#x5176;&#x6B21;&#xFF0C;&#x5373;&#x4F7F;&#x6211;&#x4EEC;&#x5C06;&#x534F;&#x8BAE;&#x66F4;&#x6539;&#x4E3A;&#x4EC5;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x5355;&#x8C03;&#x65F6;&#x949F;&#xFF0C;&#x4E5F;&#x5B58;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4EE3;&#x7801;&#x5047;&#x5B9A;&#x5728;&#x6267;&#x884C;&#x5269;&#x4F59;&#x65F6;&#x95F4;&#x68C0;&#x67E5;<code>System.currentTimeMillis()</code>&#x548C;&#x5B9E;&#x9645;&#x6267;&#x884C;&#x8BF7;&#x6C42;<code>process(request)</code>&#x4E2D;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x975E;&#x5E38;&#x77ED;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x5F97;&#x975E;&#x5E38;&#x5FEB;&#xFF0C;&#x6240;&#x4EE5;10&#x79D2;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x786E;&#x4FDD;<strong>&#x79DF;&#x7EA6;</strong>&#x5728;&#x8BF7;&#x6C42;&#x5904;&#x7406;&#x5230;&#x4E00;&#x534A;&#x65F6;&#x4E0D;&#x4F1A;&#x8FC7;&#x671F;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x610F;&#x5916;&#x7684;&#x505C;&#x987F;&#x5462;&#xFF1F;&#x4F8B;&#x5982;&#xFF0C;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x7EBF;&#x7A0B;&#x5728;<code>lease.isValid()</code>&#x884C;&#x5468;&#x56F4;&#x505C;&#x6B62;15&#x79D2;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x7EC8;&#x6B62;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x8BF7;&#x6C42;&#x88AB;&#x5904;&#x7406;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x79DF;&#x7EA6;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x8FC7;&#x671F;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x63A5;&#x7BA1;&#x4E86;&#x9886;&#x5BFC;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x6682;&#x505C;&#x4E86;&#x8FD9;&#x4E48;&#x957F;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x79DF;&#x7EA6;&#x5DF2;&#x7ECF;&#x5230;&#x671F;&#x4E86;&#xFF0C;&#x76F4;&#x5230;&#x5FAA;&#x73AF;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3; &#x2014;&#x2014;&#x5230;&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x5B83;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x200B;    &#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x6682;&#x505C;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x662F;&#x75AF;&#x4E86;&#x5417;&#xFF1F;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x7684;&#x539F;&#x56E0;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF1A;</p>
<ul>
<li>&#x8BB8;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x8FD0;&#x884C;&#x65F6;&#xFF08;&#x5982;Java&#x865A;&#x62DF;&#x673A;&#xFF09;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF08;GC&#xFF09;&#xFF0C;&#x5076;&#x5C14;&#x9700;&#x8981;&#x505C;&#x6B62;&#x6240;&#x6709;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7EBF;&#x7A0B;&#x3002;&#x8FD9;&#x4E9B;&#x201C;<strong>&#x505C;&#x6B62;&#x6240;&#x6709;&#x5904;&#x7406;&#xFF08;stop-the-world&#xFF09;</strong>&#x201D;GC&#x6682;&#x505C;&#x6709;&#x65F6;&#x4F1A;&#x6301;&#x7EED;&#x51E0;&#x5206;&#x949F;&#x3010;64&#x3011;&#xFF01;&#x751A;&#x81F3;&#x50CF;HotSpot JVM&#x7684;CMS&#x8FD9;&#x6837;&#x7684;&#x6240;&#x8C13;&#x7684;&#x201C;&#x5E76;&#x884C;&#x201D;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E5F;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x4E0E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x4E0D;&#x65F6;&#x5730;&#x505C;&#x6B62;&#x6240;&#x6709;&#x5904;&#x7406;&#x3010;65&#x3011;&#x3002;&#x5C3D;&#x7BA1;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x5206;&#x914D;&#x6A21;&#x5F0F;&#x6216;&#x8C03;&#x6574;GC&#x8BBE;&#x7F6E;&#x6765;&#x51CF;&#x5C11;&#x6682;&#x505C;&#x3010;66&#x3011;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x63D0;&#x4F9B;&#x5065;&#x58EE;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x5047;&#x8BBE;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x3002;</li>
<li>&#x5728;&#x865A;&#x62DF;&#x5316;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;<strong>&#x6302;&#x8D77;&#xFF08;suspend&#xFF09;</strong>&#x865A;&#x62DF;&#x673A;&#xFF08;&#x6682;&#x505C;&#x6267;&#x884C;&#x6240;&#x6709;&#x8FDB;&#x7A0B;&#x5E76;&#x5C06;&#x5185;&#x5B58;&#x5185;&#x5BB9;&#x4FDD;&#x5B58;&#x5230;&#x78C1;&#x76D8;&#xFF09;&#x5E76;&#x6062;&#x590D;&#xFF08;&#x6062;&#x590D;&#x5185;&#x5B58;&#x5185;&#x5BB9;&#x5E76;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x6682;&#x505C;&#x53EF;&#x4EE5;&#x5728;&#x8FDB;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x53D1;&#x751F;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x6301;&#x7EED;&#x4EFB;&#x610F;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x6709;&#x65F6;&#x7528;&#x4E8E;&#x865A;&#x62DF;&#x673A;&#x4ECE;&#x4E00;&#x4E2A;&#x4E3B;&#x673A;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x4E3B;&#x673A;&#x7684;&#x5B9E;&#x65F6;&#x8FC1;&#x79FB;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6682;&#x505C;&#x7684;&#x957F;&#x5EA6;&#x53D6;&#x51B3;&#x4E8E;&#x8FDB;&#x7A0B;&#x5199;&#x5165;&#x5185;&#x5B58;&#x7684;&#x901F;&#x7387;&#x3010;67&#x3011;&#x3002;</li>
<li>&#x5728;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x7684;&#x8BBE;&#x5907;&#xFF08;&#x5982;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#xFF09;&#x4E0A;&#xFF0C;&#x6267;&#x884C;&#x4E5F;&#x53EF;&#x80FD;&#x88AB;&#x6682;&#x505C;&#x5E76;&#x968F;&#x610F;&#x6062;&#x590D;&#xFF0C;&#x4F8B;&#x5982;&#x5F53;&#x7528;&#x6237;&#x5173;&#x95ED;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x7684;&#x76D6;&#x5B50;&#x65F6;&#x3002;</li>
<li>&#x5F53;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x6216;&#x8005;&#x5F53;&#x7BA1;&#x7406;&#x7A0B;&#x5E8F;&#x5207;&#x6362;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x65F6;&#xFF08;&#x5728;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x8FD0;&#x884C;&#x65F6;&#xFF09;&#xFF0C;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x70B9;&#x5904;&#x6682;&#x505C;&#x3002;&#x5728;&#x865A;&#x62DF;&#x673A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x865A;&#x62DF;&#x673A;&#x4E2D;&#x82B1;&#x8D39;&#x7684;CPU&#x65F6;&#x95F4;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x7A83;&#x53D6;&#x65F6;&#x95F4;&#xFF08;steal time&#xFF09;</strong>&#x3002;&#x5982;&#x679C;&#x673A;&#x5668;&#x5904;&#x4E8E;&#x6C89;&#x91CD;&#x7684;&#x8D1F;&#x8F7D;&#x4E0B;&#xFF08;&#x5373;&#xFF0C;&#x5982;&#x679C;&#x7B49;&#x5F85;&#x8FD0;&#x884C;&#x7684;&#x7EBF;&#x7A0B;&#x5F88;&#x957F;&#xFF09;&#xFF0C;&#x6682;&#x505C;&#x7684;&#x7EBF;&#x7A0B;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x540C;&#x6B65;&#x78C1;&#x76D8;&#x8BBF;&#x95EE;&#xFF0C;&#x5219;&#x7EBF;&#x7A0B;&#x53EF;&#x80FD;&#x6682;&#x505C;&#xFF0C;&#x7B49;&#x5F85;&#x7F13;&#x6162;&#x7684;&#x78C1;&#x76D8;I/O&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x3010;68&#x3011;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x6587;&#x4EF6;&#x8BBF;&#x95EE;&#xFF0C;&#x78C1;&#x76D8;&#x8BBF;&#x95EE;&#x4E5F;&#x53EF;&#x80FD;&#x51FA;&#x4E4E;&#x610F;&#x6599;&#x5730;&#x53D1;&#x751F;&#x2014;&#x2014;&#x4F8B;&#x5982;&#xFF0C;Java&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x4F7F;&#x7528;&#x65F6;&#x60F0;&#x6027;&#x52A0;&#x8F7D;&#x7C7B;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x968F;&#x65F6;&#x53D1;&#x751F;&#x3002; I/O&#x6682;&#x505C;&#x548C;GC&#x6682;&#x505C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x5408;&#x8C0B;&#x7EC4;&#x5408;&#x5B83;&#x4EEC;&#x7684;&#x5EF6;&#x8FDF;&#x3010;69&#x3011;&#x3002;&#x5982;&#x679C;&#x78C1;&#x76D8;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6216;&#x7F51;&#x7EDC;&#x5757;&#x8BBE;&#x5907;&#xFF08;&#x5982;&#x4E9A;&#x9A6C;&#x900A;&#x7684;EBS&#xFF09;&#xFF0C;I/O&#x5EF6;&#x8FDF;&#x8FDB;&#x4E00;&#x6B65;&#x53D7;&#x5230;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x53D8;&#x5316;&#x7684;&#x5F71;&#x54CD;&#x3010;29&#x3011;&#x3002;</li>
<li>&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x4E3A;&#x5141;&#x8BB8;&#x4EA4;&#x6362;&#x5230;&#x78C1;&#x76D8;&#xFF08;&#x5206;&#x9875;&#xFF09;&#xFF0C;&#x5219;&#x7B80;&#x5355;&#x7684;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;<strong>&#x9875;&#x9762;&#x9519;&#x8BEF;&#xFF08;page fault&#xFF09;</strong>&#xFF0C;&#x8981;&#x6C42;&#x5C06;&#x78C1;&#x76D8;&#x4E2D;&#x7684;&#x9875;&#x9762;&#x88C5;&#x5165;&#x5185;&#x5B58;&#x3002;&#x5F53;&#x8FD9;&#x4E2A;&#x7F13;&#x6162;&#x7684;I/O&#x64CD;&#x4F5C;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x7EBF;&#x7A0B;&#x6682;&#x505C;&#x3002;&#x5982;&#x679C;&#x5185;&#x5B58;&#x538B;&#x529B;&#x5F88;&#x9AD8;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x9875;&#x9762;&#x6362;&#x51FA;&#x5230;&#x78C1;&#x76D8;&#x3002;&#x5728;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x82B1;&#x8D39;&#x5927;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x5C06;&#x9875;&#x9762;&#x4EA4;&#x6362;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x5F88;&#x5C11;&#xFF08;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6296;&#x52A8;&#xFF08;thrashing&#xFF09;</strong>&#xFF09;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x670D;&#x52A1;&#x5668;&#x673A;&#x5668;&#x4E0A;&#x7981;&#x7528;&#x9875;&#x9762;&#x8C03;&#x5EA6;&#xFF08;&#x5982;&#x679C;&#x4F60;&#x5B81;&#x613F;&#x5E72;&#x6389;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x6765;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF0C;&#x4E5F;&#x4E0D;&#x613F;&#x610F;&#x5192;&#x6296;&#x52A8;&#x98CE;&#x9669;&#xFF09;&#x3002;</li>
<li>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D1;&#x9001;SIGSTOP&#x4FE1;&#x53F7;&#x6765;&#x6682;&#x505C;Unix&#x8FDB;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982;&#x901A;&#x8FC7;&#x5728;shell&#x4E2D;&#x6309;&#x4E0B;Ctrl-Z&#x3002; &#x8FD9;&#x4E2A;&#x4FE1;&#x53F7;&#x7ACB;&#x5373;&#x963B;&#x6B62;&#x8FDB;&#x7A0B;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x66F4;&#x591A;&#x7684;CPU&#x5468;&#x671F;&#xFF0C;&#x76F4;&#x5230;SIGCONT&#x6062;&#x590D;&#x4E3A;&#x6B62;&#xFF0C;&#x6B64;&#x65F6;&#x5B83;&#x5C06;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002; &#x5373;&#x4F7F;&#x4F60;&#x7684;&#x73AF;&#x5883;&#x901A;&#x5E38;&#x4E0D;&#x4F7F;&#x7528;SIGSTOP&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x7531;&#x8FD0;&#x7EF4;&#x5DE5;&#x7A0B;&#x5E08;&#x610F;&#x5916;&#x53D1;&#x9001;&#x3002;</li>
</ul>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x968F;&#x65F6;<strong>&#x62A2;&#x5360;&#xFF08;preempt&#xFF09;</strong>&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x5728;&#x7A0D;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x6062;&#x590D;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x7EBF;&#x7A0B;&#x751A;&#x81F3;&#x4E0D;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7C7B;&#x4F3C;&#x4E8E;&#x5728;&#x5355;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x4F7F;&#x591A;&#x7EBF;&#x7A0B;&#x4EE3;&#x7801;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF1A;&#x4F60;&#x4E0D;&#x80FD;&#x5BF9;&#x65F6;&#x673A;&#x505A;&#x4EFB;&#x4F55;&#x5047;&#x8BBE;&#xFF0C;&#x56E0;&#x4E3A;&#x968F;&#x65F6;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#xFF0C;&#x6216;&#x8005;&#x51FA;&#x73B0;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x200B;    &#x5F53;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x7F16;&#x5199;&#x591A;&#x7EBF;&#x7A0B;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x76F8;&#x5F53;&#x597D;&#x7684;&#x5DE5;&#x5177;&#x6765;&#x5B9E;&#x73B0;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF1A;&#x4E92;&#x65A5;&#x91CF;&#xFF0C;&#x4FE1;&#x53F7;&#x91CF;&#xFF0C;&#x539F;&#x5B50;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x65E0;&#x9501;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x963B;&#x585E;&#x961F;&#x5217;&#x7B49;&#x7B49;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x5E76;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8F6C;&#x5316;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x4E0D;&#x53EF;&#x9760;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x200B;    &#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x5FC5;&#x987B;&#x5047;&#x5B9A;&#x5176;&#x6267;&#x884C;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#x6682;&#x505C;&#x76F8;&#x5F53;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x7684;&#x4E2D;&#x95F4;&#x3002;&#x5728;&#x6682;&#x505C;&#x671F;&#x95F4;&#xFF0C;&#x4E16;&#x754C;&#x7684;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x5728;&#x7EE7;&#x7EED;&#x8FD0;&#x8F6C;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x8BE5;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF0C;&#x800C;&#x5BA3;&#x544A;&#x6682;&#x505C;&#x8282;&#x70B9;&#x7684;&#x6B7B;&#x4EA1;&#x3002;&#x6700;&#x7EC8;&#x6682;&#x505C;&#x7684;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x5728;&#x518D;&#x6B21;&#x68C0;&#x67E5;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x949F;&#x4E4B;&#x524D;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x8FDB;&#x5165;&#x4E86;&#x7761;&#x7720;&#x3002;</p>
<h4 id="&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;">&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;</h4>
<p>&#x200B;    &#x5728;&#x8BB8;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x548C;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x6682;&#x505C;&#x4E00;&#x6BB5;&#x65E0;&#x9650;&#x5236;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x6B63;&#x5982;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8DB3;&#x591F;&#x52AA;&#x529B;&#xFF0C;&#x5BFC;&#x81F4;&#x6682;&#x505C;&#x7684;&#x539F;&#x56E0;&#x662F;<strong>&#x53EF;&#x4EE5;</strong>&#x6D88;&#x9664;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x67D0;&#x4E9B;&#x8F6F;&#x4EF6;&#x7684;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x8981;&#x6C42;&#x5F88;&#x9AD8;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x54CD;&#x5E94;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E25;&#x91CD;&#x7684;&#x635F;&#x5931;&#xFF1A;&#x98DE;&#x673A;&#x4E3B;&#x63A7;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x706B;&#x7BAD;&#xFF0C;&#x673A;&#x5668;&#x4EBA;&#xFF0C;&#x6C7D;&#x8F66;&#x548C;&#x5176;&#x4ED6;&#x7269;&#x4F53;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5FC5;&#x987B;&#x5BF9;&#x5176;&#x4F20;&#x611F;&#x5668;&#x8F93;&#x5165;&#x505A;&#x51FA;&#x5FEB;&#x901F;&#x800C;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x54CD;&#x5E94;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;<strong>&#x622A;&#x6B62;&#x65F6;&#x95F4;&#xFF08;deadline&#xFF09;</strong>&#xFF0C;&#x5982;&#x679C;&#x622A;&#x6B62;&#x65F6;&#x95F4;&#x4E0D;&#x6EE1;&#x8DB3;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x6545;&#x969C;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;<strong>&#x786C;&#x5B9E;&#x65F6;&#xFF08;hard real-time&#xFF09;</strong>&#x7CFB;&#x7EDF;&#x3002;</p>
<blockquote>
<h4 id="&#x5B9E;&#x65F6;&#x662F;&#x771F;&#x7684;&#x5417;&#xFF1F;">&#x5B9E;&#x65F6;&#x662F;&#x771F;&#x7684;&#x5417;&#xFF1F;</h4>
<p>&#x5728;&#x5D4C;&#x5165;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5B9E;&#x65F6;&#x662F;&#x6307;&#x7CFB;&#x7EDF;&#x7ECF;&#x8FC7;&#x7CBE;&#x5FC3;&#x8BBE;&#x8BA1;&#x548C;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x4FDD;&#x8BC1;&#x3002;&#x8FD9;&#x4E2A;&#x542B;&#x4E49;&#x4E0E;Web&#x4E0A;&#x5B9E;&#x65F6;&#x672F;&#x8BED;&#x7684;&#x6A21;&#x7CCA;&#x4F7F;&#x7528;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x63CF;&#x8FF0;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x6570;&#x636E;&#x63A8;&#x9001;&#x5230;&#x5BA2;&#x6237;&#x7AEF;&#x4EE5;&#x53CA;&#x6D41;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x6CA1;&#x6709;&#x4E25;&#x683C;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x9650;&#x5236;&#xFF08;&#x89C1;<a href="ch11.html">&#x7B2C;11&#x7AE0;</a>&#xFF09;&#x3002;</p>
</blockquote>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8F66;&#x8F7D;&#x4F20;&#x611F;&#x5668;&#x68C0;&#x6D4B;&#x5230;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x7ECF;&#x5386;&#x78B0;&#x649E;&#xFF0C;&#x4F60;&#x80AF;&#x5B9A;&#x4E0D;&#x5E0C;&#x671B;&#x5B89;&#x5168;&#x6C14;&#x56CA;&#x91CA;&#x653E;&#x7CFB;&#x7EDF;&#x56E0;&#x4E3A;GC&#x6682;&#x505C;&#x800C;&#x5EF6;&#x8FDF;&#x5F39;&#x51FA;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x63D0;&#x4F9B;<strong>&#x5B9E;&#x65F6;&#x4FDD;&#x8BC1;</strong>&#x9700;&#x8981;&#x5404;&#x7EA7;&#x8F6F;&#x4EF6;&#x6808;&#x7684;&#x652F;&#x6301;&#xFF1A;&#x4E00;&#x4E2A;&#x5B9E;&#x65F6;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;RTOS&#xFF09;&#xFF0C;&#x5141;&#x8BB8;&#x5728;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5185;&#x4FDD;&#x8BC1;CPU&#x65F6;&#x95F4;&#x7684;&#x5206;&#x914D;&#x3002;&#x5E93;&#x51FD;&#x6570;&#x5FC5;&#x987B;&#x8BB0;&#x5F55;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#xFF1B;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;&#x53EF;&#x80FD;&#x53D7;&#x5230;&#x9650;&#x5236;&#x6216;&#x5B8C;&#x5168;&#x4E0D;&#x5141;&#x8BB8;&#xFF08;&#x5B9E;&#x65F6;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4ECD;&#x7136;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x5B83;&#x4E0D;&#x4F1A;&#x7ED9;GC&#x592A;&#x591A;&#x7684;&#x8D1F;&#x62C5;&#xFF09;&#xFF1B;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x7684;&#x6D4B;&#x8BD5;&#x548C;&#x6D4B;&#x91CF;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8FBE;&#x5230;&#x4FDD;&#x8BC1;&#x3002;</p>
<p>&#x200B;    &#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x9700;&#x8981;&#x5927;&#x91CF;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E25;&#x91CD;&#x9650;&#x5236;&#x4E86;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x5E93;&#x548C;&#x5DE5;&#x5177;&#x7684;&#x8303;&#x56F4;&#xFF08;&#x56E0;&#x4E3A;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#x548C;&#x5DE5;&#x5177;&#x4E0D;&#x63D0;&#x4F9B;&#x5B9E;&#x65F6;&#x4FDD;&#x8BC1;&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x5F00;&#x53D1;&#x5B9E;&#x65F6;&#x7CFB;&#x7EDF;&#x975E;&#x5E38;&#x6602;&#x8D35;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x5B89;&#x5168;&#x5173;&#x952E;&#x7684;&#x5D4C;&#x5165;&#x5F0F;&#x8BBE;&#x5907;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x201C;<strong>&#x5B9E;&#x65F6;</strong>&#x201D;&#x4E0E;&#x201C;<strong>&#x9AD8;&#x6027;&#x80FD;</strong>&#x201D;&#x4E0D;&#x4E00;&#x6837;&#x2014;&#x2014;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B9E;&#x65F6;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x8F83;&#x4F4E;&#x7684;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x4F18;&#x5148;&#x8003;&#x8651;&#x53CA;&#x65F6;&#x54CD;&#x5E94;&#x9AD8;&#x4E8E;&#x4E00;&#x5207;&#xFF08;&#x53E6;&#x8BF7;&#x53C2;&#x89C1;&#x201C;<a href="#&#x5EF6;&#x8FDF;&#x548C;&#x8D44;&#x6E90;&#x5229;&#x7528;">&#x5EF6;&#x8FDF;&#x548C;&#x8D44;&#x6E90;&#x5229;&#x7528;</a>&#x201C;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x6570;&#x636E;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x5B9E;&#x65F6;&#x4FDD;&#x8BC1;&#x662F;&#x4E0D;&#x7ECF;&#x6D4E;&#x6216;&#x4E0D;&#x5408;&#x9002;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x627F;&#x53D7;&#x5728;&#x975E;&#x5B9E;&#x65F6;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x6682;&#x505C;&#x548C;&#x65F6;&#x949F;&#x4E0D;&#x7A33;&#x5B9A;&#x6027;&#x3002;</p>
<h4 id="&#x9650;&#x5236;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x5F71;&#x54CD;">&#x9650;&#x5236;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x5F71;&#x54CD;</h4>
<p>&#x200B;    &#x8FC7;&#x7A0B;&#x6682;&#x505C;&#x7684;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x8BC9;&#x8BF8;&#x6602;&#x8D35;&#x7684;&#x5B9E;&#x65F6;&#x8C03;&#x5EA6;&#x4FDD;&#x8BC1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5F97;&#x5230;&#x7F13;&#x89E3;&#x3002;&#x8BED;&#x8A00;&#x8FD0;&#x884C;&#x65F6;&#x5728;&#x8BA1;&#x5212;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x8DDF;&#x8E2A;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7684;&#x901F;&#x5EA6;&#x548C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x5269;&#x4F59;&#x7684;&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x65B0;&#x5174;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x5C06;GC&#x6682;&#x505C;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x77ED;&#x6682;&#x8BA1;&#x5212;&#x4E2D;&#x65AD;&#xFF0C;&#x5E76;&#x8BA9;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5904;&#x7406;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x540C;&#x65F6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6B63;&#x5728;&#x6536;&#x96C6;&#x5176;&#x5783;&#x573E;&#x3002;&#x5982;&#x679C;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x4EE5;&#x8B66;&#x544A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5F88;&#x5FEB;&#x9700;&#x8981;GC&#x6682;&#x505C;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x505C;&#x6B62;&#x5411;&#x8BE5;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x65B0;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x7B49;&#x5F85;&#x5B83;&#x5B8C;&#x6210;&#x5904;&#x7406;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6CA1;&#x6709;&#x8BF7;&#x6C42;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x65F6;&#x6267;&#x884C;GC&#x3002;&#x8FD9;&#x4E2A;&#x6280;&#x5DE7;&#x9690;&#x85CF;&#x4E86;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#x7684;GC&#x6682;&#x505C;&#xFF0C;&#x5E76;&#x964D;&#x4F4E;&#x4E86;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x7684;&#x9AD8;&#x767E;&#x5206;&#x6BD4;&#x3010;70,71&#x3011;&#x3002;&#x4E00;&#x4E9B;&#x5BF9;&#x5EF6;&#x8FDF;&#x654F;&#x611F;&#x7684;&#x91D1;&#x878D;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x3010;72&#x3011;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x53D8;&#x79CD;&#x662F;&#x53EA;&#x7528;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x6765;&#x5904;&#x7406;&#x77ED;&#x547D;&#x5BF9;&#x8C61;&#xFF08;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x8981;&#x5FEB;&#x901F;&#x6536;&#x96C6;&#xFF09;&#xFF0C;&#x5E76;&#x5B9A;&#x671F;&#x5728;&#x79EF;&#x7D2F;&#x5927;&#x91CF;&#x957F;&#x5BFF;&#x5BF9;&#x8C61;&#xFF08;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x5B8C;&#x6574;GC&#xFF09;&#x4E4B;&#x524D;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x8FDB;&#x7A0B;&#x3010;65,73&#x3011;&#x3002;&#x4E00;&#x6B21;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x5728;&#x8BA1;&#x5212;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x4E4B;&#x524D;&#xFF0C;&#x6D41;&#x91CF;&#x53EF;&#x4EE5;&#x4ECE;&#x8282;&#x70B9;&#x79FB;&#x5F00;&#xFF0C;&#x5C31;&#x50CF;<a href="ch4.html#&#x6EDA;&#x52A8;&#x5347;&#x7EA7;">&#x6EDA;&#x52A8;&#x5347;&#x7EA7;</a>&#x4E00;&#x6837;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E9B;&#x63AA;&#x65BD;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x963B;&#x6B62;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6682;&#x505C;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x51CF;&#x5C11;&#x5B83;&#x4EEC;&#x5BF9;&#x5E94;&#x7528;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<h2 id="&#x77E5;&#x8BC6;&#x3001;&#x771F;&#x76F8;&#x4E0E;&#x8C0E;&#x8A00;">&#x77E5;&#x8BC6;&#x3001;&#x771F;&#x76F8;&#x4E0E;&#x8C0E;&#x8A00;</h2>
<p>&#x200B;    &#x672C;&#x7AE0;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x63A2;&#x7D22;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0E;&#x8FD0;&#x884C;&#x5728;&#x5355;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7684;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#xFF1A;&#x6CA1;&#x6709;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x53EF;&#x53D8;&#x5EF6;&#x8FDF;&#x7684;&#x4E0D;&#x53EF;&#x9760;&#x7F51;&#x7EDC;&#x4F20;&#x9012;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x906D;&#x53D7;&#x90E8;&#x5206;&#x5931;&#x6548;&#xFF0C;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x65F6;&#x949F;&#x548C;&#x5904;&#x7406;&#x6682;&#x505C;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x4F60;&#x4E0D;&#x4E60;&#x60EF;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x540E;&#x679C;&#x5C31;&#x4F1A;&#x8BA9;&#x4EBA;&#x8FF7;&#x60D1;&#x4E0D;&#x89E3;&#x3002;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x65E0;&#x6CD5;&#x786E;&#x5207;&#x5730;&#x77E5;&#x9053;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x2014;&#x2014;&#x5B83;&#x53EA;&#x80FD;&#x6839;&#x636E;&#x5B83;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x63A5;&#x6536;&#x5230;&#xFF08;&#x6216;&#x6CA1;&#x6709;&#x63A5;&#x6536;&#x5230;&#xFF09;&#x7684;&#x6D88;&#x606F;&#x8FDB;&#x884C;&#x731C;&#x6D4B;&#x3002;&#x8282;&#x70B9;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4EA4;&#x6362;&#x6D88;&#x606F;&#x6765;&#x627E;&#x51FA;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6240;&#x5904;&#x7684;&#x72B6;&#x6001;&#xFF08;&#x5B58;&#x50A8;&#x4E86;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x662F;&#x5426;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x7B49;&#x7B49;&#xFF09;&#x3002;&#x5982;&#x679C;&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF0C;&#x5219;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x5B83;&#x5904;&#x4E8E;&#x4EC0;&#x4E48;&#x72B6;&#x6001;&#xFF0C;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x4E0D;&#x80FD;&#x53EF;&#x9760;&#x5730;&#x4E0E;&#x8282;&#x70B9;&#x4E0A;&#x7684;&#x95EE;&#x9898;&#x533A;&#x5206;&#x5F00;&#x6765;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x7684;&#x8BA8;&#x8BBA;&#x4E0E;&#x54F2;&#x5B66;&#x6709;&#x5173;&#xFF1A;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x4EC0;&#x4E48;&#x662F;&#x771F;&#x4EC0;&#x4E48;&#x662F;&#x5047;&#xFF1F;&#x5982;&#x679C;&#x611F;&#x77E5;&#x548C;&#x6D4B;&#x91CF;&#x7684;&#x673A;&#x5236;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5173;&#x4E8E;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x6211;&#x4EEC;&#x53C8;&#x80FD;&#x591A;&#x4E48;&#x786E;&#x5B9A;&#x5462;&#xFF1F;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5E94;&#x8BE5;&#x9075;&#x5FAA;&#x6211;&#x4EEC;&#x5BF9;&#x7269;&#x7406;&#x4E16;&#x754C;&#x6240;&#x671F;&#x671B;&#x7684;&#x6CD5;&#x5219;&#xFF0C;&#x5982;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x5417;&#xFF1F;</p>
<p>&#x200B;    &#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x53BB;&#x641E;&#x6E05;&#x695A;&#x751F;&#x547D;&#x7684;&#x610F;&#x4E49;&#x3002;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x9648;&#x8FF0;&#x5173;&#x4E8E;&#x884C;&#x4E3A;&#xFF08;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#xFF09;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x5E76;&#x4EE5;&#x6EE1;&#x8DB3;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#x7684;&#x65B9;&#x5F0F;&#x8BBE;&#x8BA1;&#x5B9E;&#x9645;&#x7CFB;&#x7EDF;&#x3002;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x88AB;&#x8BC1;&#x660E;&#x5728;&#x67D0;&#x4E2A;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x4E2D;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5373;&#x4F7F;&#x5E95;&#x5C42;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x63D0;&#x4F9B;&#x4E86;&#x5F88;&#x5C11;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x53EF;&#x9760;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x4F7F;&#x8F6F;&#x4EF6;&#x5728;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x4E2D;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x53EF;&#x4EE5;&#x76F4;&#x622A;&#x4E86;&#x5F53;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FDB;&#x4E00;&#x6B65;&#x63A2;&#x8BA8;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x77E5;&#x8BC6;&#x548C;&#x771F;&#x7406;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x8FD9;&#x5C06;&#x6709;&#x52A9;&#x4E8E;&#x6211;&#x4EEC;&#x601D;&#x8003;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x51FA;&#x7684;&#x5404;&#x79CD;&#x5047;&#x8BBE;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5E0C;&#x671B;&#x63D0;&#x4F9B;&#x7684;&#x4FDD;&#x8BC1;&#x3002;&#x5728;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7740;&#x773C;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x5047;&#x8BBE;&#x6761;&#x4EF6;&#x4E0B;&#x63D0;&#x4F9B;&#x4E86;&#x7279;&#x5B9A;&#x7684;&#x4FDD;&#x8BC1;&#x3002;</p>
<h3 id="&#x771F;&#x7406;&#x7531;&#x591A;&#x6570;&#x6240;&#x5B9A;&#x4E49;">&#x771F;&#x7406;&#x7531;&#x591A;&#x6570;&#x6240;&#x5B9A;&#x4E49;</h3>
<p>&#x200B;    &#x8BBE;&#x60F3;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x4E0D;&#x5BF9;&#x79F0;&#x6545;&#x969C;&#x7684;&#x7F51;&#x7EDC;&#xFF1A;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x63A5;&#x6536;&#x53D1;&#x9001;&#x7ED9;&#x5B83;&#x7684;&#x6240;&#x6709;&#x6D88;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x6765;&#x81EA;&#x8BE5;&#x8282;&#x70B9;&#x7684;&#x4EFB;&#x4F55;&#x4F20;&#x51FA;&#x6D88;&#x606F;&#x88AB;&#x4E22;&#x5F03;&#x6216;&#x5EF6;&#x8FDF;&#x3010;19&#x3011;&#x3002;&#x5373;&#x4F7F;&#x8BE5;&#x8282;&#x70B9;&#x8FD0;&#x884C;&#x826F;&#x597D;&#xFF0C;&#x5E76;&#x4E14;&#x6B63;&#x5728;&#x63A5;&#x6536;&#x6765;&#x81EA;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E5F;&#x65E0;&#x6CD5;&#x542C;&#x5230;&#x5176;&#x54CD;&#x5E94;&#x3002;&#x7ECF;&#x8FC7;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5BA3;&#x5E03;&#x5B83;&#x5DF2;&#x7ECF;&#x6B7B;&#x4EA1;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x542C;&#x5230;&#x8282;&#x70B9;&#x7684;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5C31;&#x50CF;&#x68A6;&#x9B47;&#x4E00;&#x6837;&#xFF1A;<strong>&#x534A;&#x65AD;&#x5F00;&#xFF08;semi-disconnected&#xFF09;</strong>&#x7684;&#x8282;&#x70B9;&#x88AB;&#x62D6;&#x5411;&#x5893;&#x5730;&#xFF0C;&#x6572;&#x6253;&#x5C16;&#x53EB;&#x9053;&#x201C;&#x6211;&#x6CA1;&#x6B7B;&#xFF01;&#x201D; &#x2014;&#x2014;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x542C;&#x5230;&#x5B83;&#x7684;&#x5C16;&#x53EB;&#xFF0C;&#x846C;&#x793C;&#x961F;&#x4F0D;&#x7EE7;&#x7EED;&#x4EE5;&#x575A;&#x5FCD;&#x7684;&#x51B3;&#x5FC3;&#x7EE7;&#x7EED;&#x884C;&#x8FDB;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x4E00;&#x4E2A;&#x7A0D;&#x5FAE;&#x4E0D;&#x90A3;&#x4E48;&#x68A6;&#x9B47;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x534A;&#x65AD;&#x5F00;&#x7684;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x5B83;&#x53D1;&#x9001;&#x7684;&#x6D88;&#x606F;&#x6CA1;&#x6709;&#x88AB;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x786E;&#x8BA4;&#xFF0C;&#x56E0;&#x6B64;&#x610F;&#x8BC6;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x5FC5;&#x5B9A;&#x5B58;&#x5728;&#x6545;&#x969C;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8282;&#x70B9;&#x88AB;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x9519;&#x8BEF;&#x5730;&#x5BA3;&#x544A;&#x4E3A;&#x6B7B;&#x4EA1;&#xFF0C;&#x800C;&#x534A;&#x8FDE;&#x63A5;&#x7684;&#x8282;&#x70B9;&#x5BF9;&#x6B64;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x3002;</p>
<p>&#x200B;    &#x7B2C;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x60F3;&#x8C61;&#x4E00;&#x4E2A;&#x7ECF;&#x5386;&#x4E86;&#x4E00;&#x4E2A;&#x957F;&#x65F6;&#x95F4;<strong>&#x505C;&#x6B62;&#x6240;&#x6709;&#x5904;&#x7406;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6682;&#x505C;&#xFF08;stop-the-world GC Pause&#xFF09;</strong>&#x7684;&#x8282;&#x70B9;&#x3002;&#x8282;&#x70B9;&#x7684;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x88AB;GC&#x62A2;&#x5360;&#x5E76;&#x6682;&#x505C;&#x4E00;&#x5206;&#x949F;&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x8BF7;&#x6C42;&#x88AB;&#x5904;&#x7406;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#x88AB;&#x53D1;&#x9001;&#x3002;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x7B49;&#x5F85;&#xFF0C;&#x91CD;&#x8BD5;&#xFF0C;&#x4E0D;&#x8010;&#x70E6;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x5BA3;&#x5E03;&#x8282;&#x70B9;&#x6B7B;&#x4EA1;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4E22;&#x5230;&#x7075;&#x8F66;&#x4E0A;&#x3002;&#x6700;&#x540E;&#xFF0C;GC&#x5B8C;&#x6210;&#xFF0C;&#x8282;&#x70B9;&#x7684;&#x7EBF;&#x7A0B;&#x7EE7;&#x7EED;&#xFF0C;&#x597D;&#x50CF;&#x4EC0;&#x4E48;&#x4E5F;&#x6CA1;&#x6709;&#x53D1;&#x751F;&#x3002;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x611F;&#x5230;&#x60CA;&#x8BB6;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x8C13;&#x7684;&#x6B7B;&#x4EA1;&#x8282;&#x70B9;&#x7A81;&#x7136;&#x4ECE;&#x68FA;&#x6750;&#x4E2D;&#x62AC;&#x8D77;&#x5934;&#x6765;&#xFF0C;&#x8EAB;&#x4F53;&#x5065;&#x5EB7;&#xFF0C;&#x5F00;&#x59CB;&#x548C;&#x65C1;&#x89C2;&#x8005;&#x9AD8;&#x5174;&#x5730;&#x804A;&#x5929;&#x3002;GC&#x540E;&#x7684;&#x8282;&#x70B9;&#x6700;&#x521D;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x5DF2;&#x7ECF;&#x7ECF;&#x8FC7;&#x4E86;&#x6574;&#x6574;&#x4E00;&#x5206;&#x949F;&#xFF0C;&#x800C;&#x4E14;&#x81EA;&#x5DF1;&#x5DF2;&#x88AB;&#x5BA3;&#x544A;&#x6B7B;&#x4EA1;&#x3002;&#x4ECE;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4ECE;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x4E0E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4EA4;&#x8C08;&#x4EE5;&#x6765;&#xFF0C;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x7ECF;&#x8FC7;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E9B;&#x6545;&#x4E8B;&#x7684;&#x5BD3;&#x610F;&#x662F;&#xFF0C;&#x8282;&#x70B9;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x76F8;&#x4FE1;&#x81EA;&#x5DF1;&#x5BF9;&#x4E8E;&#x60C5;&#x51B5;&#x7684;&#x5224;&#x65AD;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x968F;&#x65F6;&#x5931;&#x6548;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7CFB;&#x7EDF;&#x5361;&#x6B7B;&#xFF0C;&#x65E0;&#x6CD5;&#x6062;&#x590D;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8BB8;&#x591A;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF0C;&#x5373;&#x5728;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x6295;&#x7968;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch5.html#&#x8BFB;&#x5199;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;">&#x8BFB;&#x5199;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;</a>&#x201C;&#xFF09;&#xFF1A;&#x51B3;&#x7B56;&#x9700;&#x8981;&#x6765;&#x81EA;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6700;&#x5C0F;&#x6295;&#x7968;&#x6570;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x8282;&#x70B9;&#x7684;&#x4F9D;&#x8D56;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E5F;&#x5305;&#x62EC;&#x5173;&#x4E8E;&#x5BA3;&#x544A;&#x8282;&#x70B9;&#x6B7B;&#x4EA1;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x5982;&#x679C;&#x6CD5;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8282;&#x70B9;&#x5BA3;&#x544A;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x6B7B;&#x4EA1;&#xFF0C;&#x90A3;&#x4E48;&#x5373;&#x4F7F;&#x8BE5;&#x8282;&#x70B9;&#x4ECD;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x6D3B;&#x7740;&#xFF0C;&#x5B83;&#x4E5F;&#x5FC5;&#x987B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6B7B;&#x7684;&#x3002;&#x4E2A;&#x4F53;&#x8282;&#x70B9;&#x5FC5;&#x987B;&#x9075;&#x5B88;&#x6CD5;&#x5B9A;&#x51B3;&#x5B9A;&#x5E76;&#x4E0B;&#x53F0;&#x3002;</p>
<p>&#x200B;    &#x6700;&#x5E38;&#x89C1;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x662F;&#x8D85;&#x8FC7;&#x4E00;&#x534A;&#x7684;&#x7EDD;&#x5BF9;&#x591A;&#x6570;&#xFF08;&#x5C3D;&#x7BA1;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E5F;&#x662F;&#x53EF;&#x80FD;&#x7684;&#xFF09;&#x3002;&#x591A;&#x6570;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x5141;&#x8BB8;&#x7CFB;&#x7EDF;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#xFF0C;&#x5982;&#x679C;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF08;&#x4E09;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x5355;&#x8282;&#x70B9;&#x6545;&#x969C;&#xFF1B;&#x4E94;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x5BB9;&#x5FCD;&#x53CC;&#x8282;&#x70B9;&#x6545;&#x969C;&#xFF09;&#x3002;&#x7CFB;&#x7EDF;&#x4ECD;&#x7136;&#x662F;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x4E2A;&#x5236;&#x5EA6;&#x4E2D;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x591A;&#x6570;&#x2014;&#x2014;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x5B58;&#x5728;&#x4E24;&#x4E2A;&#x76F8;&#x4E92;&#x51B2;&#x7A81;&#x7684;&#x591A;&#x6570;&#x51B3;&#x5B9A;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5728;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x4E2D;&#x8BA8;&#x8BBA;<strong>&#x5171;&#x8BC6;&#x7B97;&#x6CD5;&#xFF08;consensus algorithms&#xFF09;</strong>&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<h4 id="&#x9886;&#x5BFC;&#x8005;&#x548C;&#x9501;">&#x9886;&#x5BFC;&#x8005;&#x548C;&#x9501;</h4>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E9B;&#x4E1C;&#x897F;&#x5728;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x6570;&#x636E;&#x5E93;&#x5206;&#x533A;&#x7684;&#x9886;&#x5BFC;&#x8005;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4EE5;&#x907F;&#x514D;<strong>&#x8111;&#x88C2;&#xFF08;split brain&#xFF09;</strong>&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="ch5.html#&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;">&#x5904;&#x7406;&#x8282;&#x70B9;&#x5B95;&#x673A;</a>&#x201D;&#xFF09;&#x3002;</li>
<li>&#x7279;&#x5B9A;&#x8D44;&#x6E90;&#x7684;&#x9501;&#x6216;&#x5BF9;&#x8C61;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x4E8B;&#x52A1;/&#x5BA2;&#x6237;&#x7AEF;&#x6301;&#x6709;&#xFF0C;&#x4EE5;&#x9632;&#x540C;&#x65F6;&#x5199;&#x5165;&#x548C;&#x635F;&#x574F;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x7528;&#x6237;&#x540D;&#x53EA;&#x80FD;&#x88AB;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x6240;&#x6CE8;&#x518C;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x540D;&#x5FC5;&#x987B;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x3002;</li>
</ul>
<p>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;&#x5373;&#x4F7F;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x8BA4;&#x4E3A;&#x5B83;&#x662F;&#x201C;<strong>&#x5929;&#x9009;&#x8005;&#xFF08;the choosen one&#xFF09;</strong>&#x201D;&#xFF08;&#x5206;&#x533A;&#x7684;&#x8D1F;&#x8D23;&#x4EBA;&#xFF0C;&#x9501;&#x7684;&#x6301;&#x6709;&#x8005;&#xFF0C;&#x6210;&#x529F;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x540D;&#x7684;&#x7528;&#x6237;&#x7684;&#x8BF7;&#x6C42;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x610F;&#x5473;&#x7740;&#x6709;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x7684;&#x8282;&#x70B9;&#x540C;&#x610F;&#xFF01;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4EE5;&#x524D;&#x662F;&#x9886;&#x5BFC;&#x8005;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x5BA3;&#x5E03;&#x5B83;&#x6B7B;&#x4EA1;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x6216;GC&#x6682;&#x505C;&#xFF09;&#xFF0C;&#x5219;&#x5B83;&#x53EF;&#x80FD;&#x5DF2;&#x88AB;&#x964D;&#x7EA7;&#xFF0C;&#x4E14;&#x53E6;&#x4E00;&#x4E2A;&#x9886;&#x5BFC;&#x8005;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5F53;&#x9009;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7EE7;&#x7EED;&#x8868;&#x73B0;&#x4E3A;<strong>&#x5929;&#x9009;&#x8005;</strong>&#xFF0C;&#x5373;&#x4F7F;&#x5927;&#x591A;&#x6570;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x58F0;&#x660E;&#x5B83;&#x5DF2;&#x7ECF;&#x6B7B;&#x4E86;&#xFF0C;&#x5219;&#x5728;&#x8003;&#x8651;&#x4E0D;&#x5468;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8282;&#x70B9;&#x80FD;&#x4EE5;&#x81EA;&#x5DF1;&#x8D4B;&#x4E88;&#x7684;&#x6743;&#x80FD;&#x5411;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x76F8;&#x4FE1;&#xFF0C;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x4F1A;&#x505A;&#x4E00;&#x4E9B;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x200B;    &#x4F8B;&#x5982;&#xFF0C;<a href="img/fig8-4.png">&#x56FE;8-4</a>&#x663E;&#x793A;&#x4E86;&#x7531;&#x4E8E;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x9501;&#x5B9E;&#x73B0;&#x5BFC;&#x81F4;&#x7684;&#x6570;&#x636E;&#x635F;&#x574F;&#x9519;&#x8BEF;&#x3002; &#xFF08;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7406;&#x8BBA;&#x4E0A;&#x7684;&#xFF1A;HBase&#x66FE;&#x7ECF;&#x6709;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3010;74,75&#x3011;&#xFF09;&#x5047;&#x8BBE;&#x4F60;&#x8981;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x88AB;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x8BD5;&#x56FE;&#x5199;&#x5BF9;&#x6B64;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x5C06;&#x88AB;&#x635F;&#x574F;&#x3002;&#x60A8;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x5728;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x4E4B;&#x524D;&#x8981;&#x6C42;&#x5BA2;&#x6237;&#x7AEF;&#x4ECE;&#x9501;&#x5B9A;&#x670D;&#x52A1;&#x83B7;&#x53D6;&#x79DF;&#x7EA6;&#x6765;&#x5B9E;&#x73B0;&#x6B64;&#x76EE;&#x7684;&#x3002;</p>
<p><img src="img/fig8-4.png" alt=""></p>
<p><strong>&#x56FE;8-4 &#x5206;&#x5E03;&#x5F0F;&#x9501;&#x7684;&#x5B9E;&#x73B0;&#x4E0D;&#x6B63;&#x786E;&#xFF1A;&#x5BA2;&#x6237;&#x7AEF;1&#x8BA4;&#x4E3A;&#x5B83;&#x4ECD;&#x7136;&#x5177;&#x6709;&#x6709;&#x6548;&#x7684;&#x79DF;&#x7EA6;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x5DF2;&#x7ECF;&#x8FC7;&#x671F;&#xFF0C;&#x4ECE;&#x800C;&#x7834;&#x574F;&#x4E86;&#x5B58;&#x50A8;&#x4E2D;&#x7684;&#x6587;&#x4EF6;</strong></p>
<p>&#x200B;    &#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x5148;&#x524D;&#x5728;&#x201C;<a href="#&#x8FDB;&#x7A0B;&#x6682;&#x505C;">&#x8FDB;&#x7A0B;&#x6682;&#x505C;</a>&#x201D;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x5982;&#x679C;&#x6301;&#x6709;&#x79DF;&#x7EA6;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x6682;&#x505C;&#x592A;&#x4E45;&#xFF0C;&#x5B83;&#x7684;&#x79DF;&#x7EA6;&#x5C06;&#x5230;&#x671F;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x540C;&#x4E00;&#x6587;&#x4EF6;&#x7684;&#x79DF;&#x7EA6;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;&#x5F53;&#x6682;&#x505C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x56DE;&#x6765;&#x65F6;&#xFF0C;&#x5B83;&#x8BA4;&#x4E3A;&#xFF08;&#x4E0D;&#x6B63;&#x786E;&#xFF09;&#x5B83;&#x4ECD;&#x7136;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x79DF;&#x7EA6;&#xFF0C;&#x5E76;&#x7EE7;&#x7EED;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x5BA2;&#x6237;&#x7684;&#x5199;&#x5165;&#x51B2;&#x7A81;&#x548C;&#x635F;&#x574F;&#x7684;&#x6587;&#x4EF6;&#x3002;</p>
<h4 id="&#x9632;&#x62A4;&#x4EE4;&#x724C;">&#x9632;&#x62A4;&#x4EE4;&#x724C;</h4>
<p>&#x200B;    &#x5F53;&#x4F7F;&#x7528;&#x9501;&#x6216;&#x79DF;&#x7EA6;&#x6765;&#x4FDD;&#x62A4;&#x5BF9;&#x67D0;&#x4E9B;&#x8D44;&#x6E90;&#xFF08;&#x5982;<a href="img/fig8-4.png">&#x56FE;8-4</a>&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#xFF09;&#x7684;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x88AB;&#x8BEF;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x201C;&#x5929;&#x9009;&#x8005;&#x201D;&#x7684;&#x8282;&#x70B9;&#x4E0D;&#x80FD;&#x6270;&#x4E71;&#x7CFB;&#x7EDF;&#x7684;&#x5176;&#x5B83;&#x90E8;&#x5206;&#x3002;&#x5B9E;&#x73B0;&#x8FD9;&#x4E00;&#x76EE;&#x6807;&#x7684;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x7684;&#x6280;&#x672F;&#x5C31;&#x662F;<strong>&#x9632;&#x62A4;&#xFF08;fencing&#xFF09;</strong>&#xFF0C;&#x5982;<a href="">&#x56FE;8-5</a>&#x6240;&#x793A;</p>
<p><img src="img/fig8-5.png" alt=""></p>
<p><strong>&#x56FE;8-5 &#x53EA;&#x5141;&#x8BB8;&#x4EE5;&#x589E;&#x52A0;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x7684;&#x987A;&#x5E8F;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x5B58;&#x50A8;&#x5B89;&#x5168;</strong></p>
<p>&#x200B;    &#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6BCF;&#x6B21;&#x9501;&#x5B9A;&#x670D;&#x52A1;&#x5668;&#x6388;&#x4E88;&#x9501;&#x6216;&#x79DF;&#x7EA6;&#x65F6;&#xFF0C;&#x5B83;&#x8FD8;&#x4F1A;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;<strong>&#x9632;&#x62A4;&#x4EE4;&#x724C;&#xFF08;fencing token&#xFF09;</strong>&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x5728;&#x6BCF;&#x6B21;&#x6388;&#x4E88;&#x9501;&#x5B9A;&#x65F6;&#x90FD;&#x4F1A;&#x589E;&#x52A0;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x9501;&#x5B9A;&#x670D;&#x52A1;&#x589E;&#x52A0;&#xFF09;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x5BA2;&#x6237;&#x7AEF;&#x6BCF;&#x6B21;&#x5411;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x53D1;&#x9001;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x5F53;&#x524D;&#x7684;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x3002;</p>
<p>&#x200B;    &#x5728;<a href="img/fig8-5.png">&#x56FE;8-5</a>&#x4E2D;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;1&#x4EE5;33&#x7684;&#x4EE4;&#x724C;&#x83B7;&#x5F97;&#x79DF;&#x7EA6;&#xFF0C;&#x4F46;&#x968F;&#x540E;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x505C;&#x987F;&#x5E76;&#x4E14;&#x79DF;&#x7EA6;&#x5230;&#x671F;&#x3002;&#x5BA2;&#x6237;&#x7AEF;2&#x4EE5;34&#x7684;&#x4EE4;&#x724C;&#xFF08;&#x8BE5;&#x6570;&#x5B57;&#x603B;&#x662F;&#x589E;&#x52A0;&#xFF09;&#x83B7;&#x53D6;&#x79DF;&#x7EA6;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x5199;&#x5165;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x5230;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#xFF0C;&#x5305;&#x62EC;34&#x7684;&#x4EE4;&#x724C;&#x3002;&#x7A0D;&#x540E;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;1&#x6062;&#x590D;&#x751F;&#x673A;&#x5E76;&#x5C06;&#x5176;&#x5199;&#x5165;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#xFF0C;&#x5305;&#x62EC;&#x5176;&#x4EE4;&#x724C;&#x503C;33.&#x4F46;&#x662F;&#xFF0C;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x8BB0;&#x4F4F;&#x5B83;&#x5DF2;&#x7ECF;&#x5904;&#x7406;&#x4E86;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x66F4;&#x9AD8;&#x4EE4;&#x724C;&#x7F16;&#x53F7;&#xFF08;34&#xFF09;&#x7684;&#x5199;&#x5165;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4F1A;&#x62D2;&#x7EDD;&#x5E26;&#x6709;&#x4EE4;&#x724C;33&#x7684;&#x8BF7;&#x6C42;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x5C06;ZooKeeper&#x7528;&#x4F5C;&#x9501;&#x5B9A;&#x670D;&#x52A1;&#xFF0C;&#x5219;&#x53EF;&#x5C06;&#x4E8B;&#x52A1;&#x6807;&#x8BC6;<code>zxid</code>&#x6216;&#x8282;&#x70B9;&#x7248;&#x672C;<code>cversion</code>&#x7528;&#x4F5C;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x4EEC;&#x4FDD;&#x8BC1;&#x5355;&#x8C03;&#x9012;&#x589E;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x5177;&#x6709;&#x6240;&#x9700;&#x7684;&#x5C5E;&#x6027;&#x3010;74&#x3011;&#x3002;</p>
<p>&#x200B;    &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x8981;&#x6C42;&#x8D44;&#x6E90;&#x672C;&#x8EAB;&#x5728;&#x68C0;&#x67E5;&#x4EE4;&#x724C;&#x65B9;&#x9762;&#x53D1;&#x6325;&#x79EF;&#x6781;&#x4F5C;&#x7528;&#xFF0C;&#x901A;&#x8FC7;&#x62D2;&#x7EDD;&#x4F7F;&#x7528;&#x65E7;&#x7684;&#x4EE4;&#x724C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5DF2;&#x7ECF;&#x88AB;&#x5904;&#x7406;&#x7684;&#x4EE4;&#x724C;&#x6765;&#x8FDB;&#x884C;&#x5199;&#x64CD;&#x4F5C;&#x2014;&#x2014;&#x4EC5;&#x4EC5;&#x4F9D;&#x9760;&#x5BA2;&#x6237;&#x7AEF;&#x68C0;&#x67E5;&#x81EA;&#x5DF1;&#x7684;&#x9501;&#x72B6;&#x6001;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x4E0D;&#x660E;&#x786E;&#x652F;&#x6301;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x80FD;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x6B64;&#x9650;&#x5236;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x5305;&#x542B;&#x5728;&#x6587;&#x4EF6;&#x540D;&#x4E2D;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x5728;&#x9501;&#x7684;&#x4FDD;&#x62A4;&#x4E4B;&#x5916;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x67D0;&#x79CD;&#x68C0;&#x67E5;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x68C0;&#x67E5;&#x4E00;&#x4E2A;&#x4EE4;&#x724C;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#xFF0C;&#x4F46;&#x8FD9;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#xFF1A;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5047;&#x5B9A;&#x5B83;&#x7684;&#x5BA2;&#x6237;&#x603B;&#x662F;&#x5B88;&#x89C4;&#x77E9;&#x5E76;&#x4E0D;&#x660E;&#x667A;&#xFF0C;&#x56E0;&#x4E3A;&#x4F7F;&#x7528;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4EBA;&#x4E0E;&#x8FD0;&#x884C;&#x670D;&#x52A1;&#x7684;&#x4EBA;&#x4F18;&#x5148;&#x7EA7;&#x975E;&#x5E38;&#x4E0D;&#x4E00;&#x6837;&#x3010;76&#x3011;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4EFB;&#x4F55;&#x670D;&#x52A1;&#x4FDD;&#x62A4;&#x81EA;&#x5DF1;&#x514D;&#x53D7;&#x610F;&#x5916;&#x5BA2;&#x6237;&#x7684;&#x6EE5;&#x7528;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x3002;</p>
<h3 id="&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;">&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;</h3>
<p>&#x200B;    &#x9632;&#x62A4;&#x4EE4;&#x724C;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x548C;&#x963B;&#x6B62;&#x65E0;&#x610F;&#x4E2D;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x7684;&#x8282;&#x70B9;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C1A;&#x672A;&#x53D1;&#x73B0;&#x5176;&#x79DF;&#x7EA6;&#x5DF2;&#x8FC7;&#x671F;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x8282;&#x70B9;&#x6709;&#x610F;&#x7834;&#x574F;&#x7CFB;&#x7EDF;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5047;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x6765;&#x8F7B;&#x677E;&#x5B8C;&#x6210;&#x6B64;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x672C;&#x4E66;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8282;&#x70B9;&#x662F;&#x4E0D;&#x53EF;&#x9760;&#x4F46;&#x8BDA;&#x5B9E;&#x7684;&#xFF1A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x5F88;&#x6162;&#x6216;&#x8005;&#x4ECE;&#x4E0D;&#x54CD;&#x5E94;&#xFF08;&#x7531;&#x4E8E;&#x6545;&#x969C;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x7684;&#x72B6;&#x6001;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x8FC7;&#x65F6;&#xFF08;&#x7531;&#x4E8E;GC&#x6682;&#x505C;&#x6216;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x5982;&#x679C;&#x8282;&#x70B9;&#x5B83;&#x505A;&#x51FA;&#x4E86;&#x56DE;&#x5E94;&#xFF0C;&#x5B83;&#x6B63;&#x5728;&#x8BF4;&#x51FA;&#x201C;&#x771F;&#x76F8;&#x201D;&#xFF1A;&#x5C3D;&#x5176;&#x6240;&#x77E5;&#xFF0C;&#x5B83;&#x6B63;&#x5728;&#x6309;&#x7167;&#x534F;&#x8BAE;&#x7684;&#x89C4;&#x5219;&#x626E;&#x6F14;&#x5176;&#x89D2;&#x8272;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x5B58;&#x5728;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x201C;&#x6492;&#x8C0E;&#x201D;&#xFF08;&#x53D1;&#x9001;&#x4EFB;&#x610F;&#x9519;&#x8BEF;&#x6216;&#x635F;&#x574F;&#x7684;&#x54CD;&#x5E94;&#xFF09;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x5219;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#x53D8;&#x5F97;&#x66F4;&#x56F0;&#x96BE;&#x4E86;&#x2014;&#x2014;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x58F0;&#x79F0;&#x5176;&#x5B9E;&#x9645;&#x4E0A;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;&#xFF08;Byzantine fault&#xFF09;</strong>&#xFF0C;<strong>&#x5728;&#x4E0D;&#x4FE1;&#x4EFB;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x7684;&#x95EE;&#x9898;&#x88AB;&#x79F0;&#x4E3A;&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;</strong>&#x3010;77&#x3011;&#x3002;</p>
<blockquote>
<h3 id="&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;">&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;</h3>
<p>&#x200B;    &#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;&#x662F;&#x6240;&#x8C13;&#x201C;&#x4E24;&#x5C06;&#x519B;&#x95EE;&#x9898;&#x201D;&#x7684;&#x6982;&#x62EC;&#x3010;78&#x3011;&#xFF0C;&#x5B83;&#x60F3;&#x8C61;&#x4E24;&#x4E2A;&#x5C06;&#x519B;&#x9700;&#x8981;&#x5C31;&#x6218;&#x6597;&#x8BA1;&#x5212;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x7531;&#x4E8E;&#x4ED6;&#x4EEC;&#x5728;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x70B9;&#x5EFA;&#x7ACB;&#x4E86;&#x8425;&#x5730;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4FE1;&#x4F7F;&#x8FDB;&#x884C;&#x6C9F;&#x901A;&#xFF0C;&#x4FE1;&#x4F7F;&#x6709;&#x65F6;&#x4F1A;&#x88AB;&#x5EF6;&#x8FDF;&#x6216;&#x4E22;&#x5931;&#xFF08;&#x5C31;&#x50CF;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x5305;&#x4E00;&#x6837;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x5171;&#x8BC6;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x8FD9;&#x4E2A;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x7684;&#x95EE;&#x9898;&#x4E2D;&#xFF0C;&#x6709;n&#x4F4D;&#x5C06;&#x519B;&#x9700;&#x8981;&#x540C;&#x610F;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x52AA;&#x529B;&#x56E0;&#x4E3A;&#x6709;&#x4E00;&#x4E9B;&#x53DB;&#x5F92;&#x5728;&#x4ED6;&#x4EEC;&#x4E2D;&#x95F4;&#x800C;&#x53D7;&#x5230;&#x963B;&#x788D;&#x3002;&#x5927;&#x591A;&#x6570;&#x7684;&#x5C06;&#x519B;&#x90FD;&#x662F;&#x5FE0;&#x8BDA;&#x7684;&#xFF0C;&#x56E0;&#x800C;&#x53D1;&#x51FA;&#x4E86;&#x771F;&#x5B9E;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x53DB;&#x5F92;&#x53EF;&#x80FD;&#x4F1A;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x865A;&#x5047;&#x6216;&#x4E0D;&#x771F;&#x5B9E;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x6B3A;&#x9A97;&#x548C;&#x6DF7;&#x6DC6;&#x4ED6;&#x4EBA;&#xFF08;&#x5728;&#x8BD5;&#x56FE;&#x4FDD;&#x6301;&#x672A;&#x88AB;&#x53D1;&#x73B0;&#x7684;&#x540C;&#x65F6;&#xFF09;&#x3002;&#x4E8B;&#x5148;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x53DB;&#x5F92;&#x662F;&#x8C01;&#x3002;</p>
<p>&#x200B;    &#x62DC;&#x5360;&#x5EAD;&#x662F;&#x540E;&#x6765;&#x6210;&#x4E3A;&#x541B;&#x58EB;&#x5766;&#x4E01;&#x5821;&#x7684;&#x53E4;&#x5E0C;&#x814A;&#x57CE;&#x5E02;&#xFF0C;&#x73B0;&#x5728;&#x5728;&#x571F;&#x8033;&#x5176;&#x7684;&#x4F0A;&#x65AF;&#x5766;&#x5E03;&#x5C14;&#x3002;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5386;&#x53F2;&#x8BC1;&#x636E;&#x8868;&#x660E;&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x6BD4;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x66F4;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x9634;&#x8C0B;&#x548C;&#x9634;&#x8C0B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x6765;&#x6E90;&#x4E8E;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x7684;&#x8FC7;&#x5EA6;&#x590D;&#x6742;&#xFF0C;&#x5B98;&#x50DA;&#xFF0C;&#x8FC2;&#x56DE;&#x7B49;&#x610F;&#x4E49;&#xFF0C;&#x65E9;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x7ECF;&#x5728;&#x653F;&#x6CBB;&#x4E2D;&#x88AB;&#x4F7F;&#x7528;&#x4E86;&#x3010;79&#x3011;&#x3002;Lamport&#x60F3;&#x8981;&#x9009;&#x4E00;&#x4E2A;&#x4E0D;&#x4F1A;&#x5192;&#x72AF;&#x4EFB;&#x4F55;&#x8BFB;&#x8005;&#x7684;&#x56FD;&#x5BB6;&#xFF0C;&#x4ED6;&#x88AB;&#x544A;&#x77E5;&#x5C06;&#x5176;&#x79F0;&#x4E3A;&#x963F;&#x5C14;&#x5DF4;&#x5C3C;&#x4E9A;&#x5C06;&#x519B;&#x95EE;&#x9898;&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x3010;80&#x3011;&#x3002;</p>
</blockquote>
<p>&#x200B;    &#x5F53;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5728;&#x90E8;&#x5206;&#x8282;&#x70B9;&#x53D1;&#x751F;&#x6545;&#x969C;&#x3001;&#x4E0D;&#x9075;&#x5B88;&#x534F;&#x8BAE;&#x3001;&#x751A;&#x81F3;&#x6076;&#x610F;&#x653B;&#x51FB;&#x3001;&#x6270;&#x4E71;&#x7F51;&#x7EDC;&#x65F6;&#x4ECD;&#x7136;&#x80FD;&#x7EE7;&#x7EED;&#x6B63;&#x786E;&#x5DE5;&#x4F5C;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;<strong>&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#xFF08;Byzantine fault-tolerant&#xFF09;</strong>&#x7684;&#xFF0C;&#x5728;&#x7279;&#x5B9A;&#x573A;&#x666F;&#x4E0B;&#xFF0C;&#x8FD9;&#x79CD;&#x62C5;&#x5FE7;&#x5728;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x822A;&#x7A7A;&#x822A;&#x5929;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5185;&#x5B58;&#x6216;CPU&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x88AB;&#x8F90;&#x5C04;&#x7834;&#x574F;&#xFF0C;&#x5BFC;&#x81F4;&#x5176;&#x4EE5;&#x4EFB;&#x610F;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x7684;&#x65B9;&#x5F0F;&#x54CD;&#x5E94;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x3002;&#x7531;&#x4E8E;&#x7CFB;&#x7EDF;&#x6545;&#x969C;&#x975E;&#x5E38;&#x6602;&#x8D35;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x98DE;&#x673A;&#x649E;&#x6BC1;&#x548C;&#x70B8;&#x6B7B;&#x8239;&#x4E0A;&#x6240;&#x6709;&#x4EBA;&#x5458;&#xFF0C;&#x6216;&#x706B;&#x7BAD;&#x4E0E;&#x56FD;&#x9645;&#x7A7A;&#x95F4;&#x7AD9;&#x76F8;&#x649E;&#xFF09;&#xFF0C;&#x98DE;&#x884C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x5BB9;&#x5FCD;&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;&#x3010;81,82&#x3011;&#x3002;</li>
<li>&#x5728;&#x591A;&#x4E2A;&#x53C2;&#x4E0E;&#x7EC4;&#x7EC7;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4E00;&#x4E9B;&#x53C2;&#x4E0E;&#x8005;&#x53EF;&#x80FD;&#x4F1A;&#x8BD5;&#x56FE;&#x6B3A;&#x9A97;&#x6216;&#x6B3A;&#x9A97;&#x4ED6;&#x4EBA;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8282;&#x70B9;&#x4EC5;&#x4EC5;&#x4FE1;&#x4EFB;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6D88;&#x606F;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x662F;&#x51FA;&#x4E8E;&#x6076;&#x610F;&#x7684;&#x76EE;&#x7684;&#x800C;&#x88AB;&#x53D1;&#x9001;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x50CF;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x5176;&#x4ED6;&#x533A;&#x5757;&#x94FE;&#x4E00;&#x6837;&#x7684;&#x5BF9;&#x7B49;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x8BA9;&#x4E92;&#x4E0D;&#x4FE1;&#x4EFB;&#x7684;&#x5404;&#x65B9;&#x540C;&#x610F;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x53D1;&#x751F;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x800C;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x4E2D;&#x592E;&#x5F53;&#x5C40;&#x3010;83&#x3011;&#x3002;</li>
</ul>
<p>&#x7136;&#x800C;&#xFF0C;&#x5728;&#x672C;&#x4E66;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x5047;&#x8BBE;&#x6CA1;&#x6709;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x5728;&#x4F60;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x91CC;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x7531;&#x4F60;&#x7684;&#x7EC4;&#x7EC7;&#x63A7;&#x5236;&#x7684;&#xFF08;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4FE1;&#x4EFB;&#xFF09;&#xFF0C;&#x8F90;&#x5C04;&#x6C34;&#x5E73;&#x8DB3;&#x591F;&#x4F4E;&#xFF0C;&#x5185;&#x5B58;&#x635F;&#x574F;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#x3002;&#x5236;&#x4F5C;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x7CFB;&#x7EDF;&#x7684;&#x534F;&#x8BAE;&#x76F8;&#x5F53;&#x590D;&#x6742;&#x3010;84&#x3011;&#xFF0C;&#x800C;&#x5BB9;&#x9519;&#x5D4C;&#x5165;&#x5F0F;&#x7CFB;&#x7EDF;&#x4F9D;&#x8D56;&#x4E8E;&#x786C;&#x4EF6;&#x5C42;&#x9762;&#x7684;&#x652F;&#x6301;&#x3010;81&#x3011;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x90E8;&#x7F72;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x6210;&#x672C;&#x4F7F;&#x5176;&#x53D8;&#x5F97;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x3002;</p>
<p>&#x200B;    Web&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x9884;&#x671F;&#x53D7;&#x7EC8;&#x7AEF;&#x7528;&#x6237;&#x63A7;&#x5236;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x5982;Web&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#x7684;&#x4EFB;&#x610F;&#x548C;&#x6076;&#x610F;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x8F93;&#x5165;&#x9A8C;&#x8BC1;&#xFF0C;&#x6570;&#x636E;&#x6E05;&#x6D17;&#x548C;&#x8F93;&#x51FA;&#x8F6C;&#x4E49;&#x5982;&#x6B64;&#x91CD;&#x8981;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x9632;&#x6B62;SQL&#x6CE8;&#x5165;&#x548C;&#x8DE8;&#x7AD9;&#x70B9;&#x811A;&#x672C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x4F7F;&#x7528;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x534F;&#x8BAE;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x8BA9;&#x670D;&#x52A1;&#x5668;&#x51B3;&#x5B9A;&#x4EC0;&#x4E48;&#x662F;&#x5BA2;&#x6237;&#x7AEF;&#x884C;&#x4E3A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5141;&#x8BB8;&#x7684;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x8FD9;&#x79CD;&#x4E2D;&#x5FC3;&#x6388;&#x6743;&#x7684;&#x5BF9;&#x7B49;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x200B;    &#x8F6F;&#x4EF6;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x53EF;&#x80FD;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x60A8;&#x5C06;&#x76F8;&#x540C;&#x7684;&#x8F6F;&#x4EF6;&#x90E8;&#x7F72;&#x5230;&#x6240;&#x6709;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x7684;&#x5BB9;&#x9519;&#x7B97;&#x6CD5;&#x4E0D;&#x80FD;&#x4E3A;&#x60A8;&#x8282;&#x7701;&#x3002;&#x5927;&#x591A;&#x6570;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x5BB9;&#x9519;&#x7B97;&#x6CD5;&#x8981;&#x6C42;&#x8D85;&#x8FC7;&#x4E09;&#x5206;&#x4E4B;&#x4E8C;&#x7684;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF08;&#x5373;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x56DB;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x6700;&#x591A;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x6545;&#x969C;&#xFF09;&#x3002;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5BF9;&#x4ED8;bug&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x6709;&#x56DB;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x76F8;&#x540C;&#x8F6F;&#x4EF6;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x4E00;&#x4E2A;bug&#x53EA;&#x51FA;&#x73B0;&#x5728;&#x56DB;&#x4E2A;&#x5B9E;&#x73B0;&#x4E4B;&#x4E00;&#x4E2D;&#x3002;</p>
<p>&#x200B;    &#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x534F;&#x8BAE;&#x53EF;&#x4EE5;&#x4FDD;&#x62A4;&#x6211;&#x4EEC;&#x514D;&#x53D7;&#x6F0F;&#x6D1E;&#xFF0C;&#x5B89;&#x5168;&#x59A5;&#x534F;&#x548C;&#x6076;&#x610F;&#x653B;&#x51FB;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5C06;&#x662F;&#x6709;&#x5438;&#x5F15;&#x529B;&#x7684;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#xFF1A;&#x5728;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x6E17;&#x900F;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x90A3;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x6E17;&#x900F;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x8FD0;&#x884C;&#x76F8;&#x540C;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x56E0;&#x6B64;&#x4F20;&#x7EDF;&#x673A;&#x5236;&#xFF08;&#x8BA4;&#x8BC1;&#xFF0C;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF0C;&#x52A0;&#x5BC6;&#xFF0C;&#x9632;&#x706B;&#x5899;&#x7B49;&#xFF09;&#x4ECD;&#x7136;&#x662F;&#x62B5;&#x5FA1;&#x653B;&#x51FB;&#x8005;&#x7684;&#x4E3B;&#x8981;&#x4FDD;&#x62A4;&#x63AA;&#x65BD;&#x3002;</p>
<h4 id="&#x5F31;&#x8C0E;&#x8A00;&#x5F62;&#x5F0F;">&#x5F31;&#x8C0E;&#x8A00;&#x5F62;&#x5F0F;</h4>
<p>&#x200B;    &#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8282;&#x70B9;&#x901A;&#x5E38;&#x662F;&#x8BDA;&#x5B9E;&#x7684;&#xFF0C;&#x4F46;&#x503C;&#x5F97;&#x5411;&#x8F6F;&#x4EF6;&#x4E2D;&#x6DFB;&#x52A0;&#x9632;&#x6B62;&#x201C;&#x6492;&#x8C0E;&#x201D;&#x5F31;&#x5F62;&#x5F0F;&#x7684;&#x673A;&#x5236;&#x2014;&#x2014;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x786C;&#x4EF6;&#x95EE;&#x9898;&#x5BFC;&#x81F4;&#x7684;&#x65E0;&#x6548;&#x6D88;&#x606F;&#xFF0C;&#x8F6F;&#x4EF6;&#x9519;&#x8BEF;&#x548C;&#x9519;&#x8BEF;&#x914D;&#x7F6E;&#x3002;&#x8FD9;&#x79CD;&#x4FDD;&#x62A4;&#x673A;&#x5236;&#x5E76;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x7684;&#x62DC;&#x5360;&#x5EAD;&#x5BB9;&#x9519;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x62B5;&#x6321;&#x51B3;&#x5FC3;&#x575A;&#x5B9A;&#x7684;&#x5BF9;&#x624B;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4ECD;&#x7136;&#x662F;&#x7B80;&#x5355;&#x800C;&#x5B9E;&#x7528;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x53EF;&#x9760;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF1A;</p>
<ul>
<li>&#x7531;&#x4E8E;&#x786C;&#x4EF6;&#x95EE;&#x9898;&#x6216;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x8DEF;&#x7531;&#x5668;&#x7B49;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x6709;&#x65F6;&#x4F1A;&#x53D7;&#x5230;&#x635F;&#x574F;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5185;&#x5EFA;&#x4E8E;TCP&#x548C;UDP&#x4E2D;&#x7684;&#x6821;&#x9A8C;&#x548C;&#x4F1A;&#x4FD8;&#x83B7;&#x635F;&#x574F;&#x7684;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5B83;&#x4EEC;&#x4F1A;&#x9003;&#x907F;&#x68C0;&#x6D4B;&#x3010;85,86,87&#x3011; &#x3002;&#x7B80;&#x5355;&#x7684;&#x63AA;&#x65BD;&#x901A;&#x5E38;&#x662F;&#x91C7;&#x7528;&#x5145;&#x5206;&#x7684;&#x4FDD;&#x62A4;&#x6765;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x7834;&#x574F;&#xFF0C;&#x4F8B;&#x5982;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x534F;&#x8BAE;&#x4E2D;&#x7684;&#x6821;&#x9A8C;&#x548C;&#x3002;</li>
<li>&#x53EF;&#x516C;&#x5F00;&#x8BBF;&#x95EE;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x4ED4;&#x7EC6;&#x6E05;&#x7406;&#x6765;&#x81EA;&#x7528;&#x6237;&#x7684;&#x4EFB;&#x4F55;&#x8F93;&#x5165;&#xFF0C;&#x4F8B;&#x5982;&#x68C0;&#x67E5;&#x503C;&#x662F;&#x5426;&#x5728;&#x5408;&#x7406;&#x7684;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x5E76;&#x9650;&#x5236;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5927;&#x5C0F;&#x4EE5;&#x9632;&#x6B62;&#x901A;&#x8FC7;&#x5927;&#x5185;&#x5B58;&#x5206;&#x914D;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x3002;&#x9632;&#x706B;&#x5899;&#x540E;&#x9762;&#x7684;&#x5185;&#x90E8;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x80FD;&#x591F;&#x5728;&#x5BF9;&#x8F93;&#x5165;&#x8FDB;&#x884C;&#x8F83;&#x4E0D;&#x4E25;&#x683C;&#x7684;&#x68C0;&#x67E5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9003;&#x8131;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x7406;&#x667A;&#x68C0;&#x67E5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x534F;&#x8BAE;&#x89E3;&#x6790;&#x4E2D;&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x3002;</li>
<li>NTP&#x5BA2;&#x6237;&#x7AEF;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#x3002;&#x540C;&#x6B65;&#x65F6;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x8054;&#x7CFB;&#x6240;&#x6709;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F30;&#x8BA1;&#x5B83;&#x4EEC;&#x7684;&#x8BEF;&#x5DEE;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x5927;&#x591A;&#x6570;&#x670D;&#x52A1;&#x5668;&#x662F;&#x5426;&#x5728;&#x5BF9;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x8303;&#x56F4;&#x5185;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;&#x53EA;&#x8981;&#x5927;&#x591A;&#x6570;&#x7684;&#x670D;&#x52A1;&#x5668;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x9519;&#x8BEF;&#x7684;NTP&#x670D;&#x52A1;&#x5668;&#x62A5;&#x544A;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x88AB;&#x5F53;&#x6210;&#x7279;&#x5F02;&#x503C;&#x4ECE;&#x540C;&#x6B65;&#x4E2D;&#x6392;&#x9664;&#x3010;37&#x3011;&#x3002;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4F7F;NTP&#x66F4;&#x5065;&#x58EE;&#xFF08;&#x6BD4;&#x8D77;&#x53EA;&#x7528;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x6765;&#xFF09;&#x3002;</li>
</ul>
<h3 id="&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x4E0E;&#x73B0;&#x5B9E;">&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x4E0E;&#x73B0;&#x5B9E;</h3>
<p>&#x200B;    &#x5DF2;&#x7ECF;&#x6709;&#x5F88;&#x591A;&#x7B97;&#x6CD5;&#x88AB;&#x8BBE;&#x8BA1;&#x4EE5;&#x89E3;&#x51B3;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x95EE;&#x9898;&#x2014;&#x2014;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#x8BA8;&#x8BBA;&#x5171;&#x8BC6;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x4E3A;&#x4E86;&#x6709;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x5BB9;&#x5FCD;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x5404;&#x79CD;&#x6545;&#x969C;&#x3002;</p>
<p>&#x200B;    &#x7B97;&#x6CD5;&#x7684;&#x7F16;&#x5199;&#x65B9;&#x5F0F;&#x5E76;&#x4E0D;&#x8FC7;&#x5206;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD0;&#x884C;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x914D;&#x7F6E;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x8FD9;&#x53C8;&#x8981;&#x6C42;&#x6211;&#x4EEC;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5C06;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x5F62;&#x5F0F;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x6765;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x662F;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#xFF0C;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x53EF;&#x80FD;&#x627F;&#x62C5;&#x7684;&#x4E8B;&#x60C5;&#x3002;
&#x5173;&#x4E8E;&#x5B9A;&#x65F6;&#x5047;&#x8BBE;&#xFF0C;&#x4E09;&#x79CD;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x662F;&#x5E38;&#x7528;&#x7684;&#xFF1A;</p>
<p><strong><em>&#x540C;&#x6B65;&#x6A21;&#x578B;</em></strong></p>
<p>&#x200B;    <strong>&#x540C;&#x6B65;&#x6A21;&#x578B;&#xFF08;synchronous model&#xFF09;</strong>&#x5047;&#x8BBE;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF0C;&#x8FDB;&#x7A0B;&#x6682;&#x505C;&#x548C;&#x548C;&#x65F6;&#x949F;&#x8BEF;&#x5DEE;&#x90FD;&#x662F;&#x6709;&#x754C;&#x9650;&#x7684;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B8C;&#x5168;&#x540C;&#x6B65;&#x7684;&#x65F6;&#x949F;&#x6216;&#x96F6;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF1B;&#x8FD9;&#x53EA;&#x610F;&#x5473;&#x7740;&#x4F60;&#x77E5;&#x9053;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF0C;&#x6682;&#x505C;&#x548C;&#x65F6;&#x949F;&#x6F02;&#x79FB;&#x5C06;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x67D0;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x4E0A;&#x9650;&#x3010;88&#x3011;&#x3002;&#x540C;&#x6B65;&#x6A21;&#x578B;&#x5E76;&#x4E0D;&#x662F;&#x5927;&#x591A;&#x6570;&#x5B9E;&#x9645;&#x7CFB;&#x7EDF;&#x7684;&#x73B0;&#x5B9E;&#x6A21;&#x578B;&#xFF0C;&#x56E0;&#x4E3A;&#xFF08;&#x5982;&#x672C;&#x7AE0;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#xFF09;&#x65E0;&#x9650;&#x5EF6;&#x8FDF;&#x548C;&#x6682;&#x505C;&#x786E;&#x5B9E;&#x4F1A;&#x53D1;&#x751F;&#x3002;</p>
<p><strong><em>&#x90E8;&#x5206;&#x540C;&#x6B65;&#x6A21;&#x578B;</em></strong></p>
<p>&#x200B;    <strong>&#x90E8;&#x5206;&#x540C;&#x6B65;&#xFF08;partial synchronous&#xFF09;</strong>&#x610F;&#x5473;&#x7740;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x50CF;&#x4E00;&#x4E2A;&#x540C;&#x6B65;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#x8FD0;&#x884C;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x8D85;&#x51FA;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF0C;&#x8FDB;&#x7A0B;&#x6682;&#x505C;&#x548C;&#x65F6;&#x949F;&#x6F02;&#x79FB;&#x7684;&#x754C;&#x9650;&#x3010;88&#x3011;&#x3002;&#x8FD9;&#x662F;&#x5F88;&#x591A;&#x7CFB;&#x7EDF;&#x7684;&#x73B0;&#x5B9E;&#x6A21;&#x578B;&#xFF1A;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7F51;&#x7EDC;&#x548C;&#x8FDB;&#x7A0B;&#x8868;&#x73B0;&#x826F;&#x597D;&#xFF0C;&#x5426;&#x5219;&#x6211;&#x4EEC;&#x6C38;&#x8FDC;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x627F;&#x8BA4;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x523B;&#x5047;&#x8BBE;&#x90FD;&#x5B58;&#x5728;&#x5076;&#x7136;&#x88AB;&#x7834;&#x574F;&#x7684;&#x4E8B;&#x5B9E;&#x3002;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#xFF0C;&#x6682;&#x505C;&#x548C;&#x65F6;&#x949F;&#x9519;&#x8BEF;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x5F97;&#x76F8;&#x5F53;&#x5927;&#x3002;</p>
<p><strong><em>&#x5F02;&#x6B65;&#x6A21;&#x578B;</em></strong></p>
<p>&#x200B;    &#x5728;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x7B97;&#x6CD5;&#x4E0D;&#x5141;&#x8BB8;&#x5BF9;&#x65F6;&#x673A;&#x505A;&#x4EFB;&#x4F55;&#x5047;&#x8BBE;&#x2014;&#x2014;&#x4E8B;&#x5B9E;&#x4E0A;&#x5B83;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x65F6;&#x949F;&#xFF08;&#x6240;&#x4EE5;&#x5B83;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x8D85;&#x65F6;&#xFF09;&#x3002;&#x4E00;&#x4E9B;&#x7B97;&#x6CD5;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x53EF;&#x7528;&#x4E8E;&#x5F02;&#x6B65;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x975E;&#x5E38;&#x53D7;&#x9650;&#x3002;</p>
<p>&#x8FDB;&#x4E00;&#x6B65;&#x6765;&#x8BF4;&#xFF0C;&#x9664;&#x4E86;&#x65F6;&#x95F4;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x8981;&#x8003;&#x8651;<strong>&#x8282;&#x70B9;&#x5931;&#x6548;</strong>&#x3002;&#x4E09;&#x79CD;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x8282;&#x70B9;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x662F;&#xFF1A;</p>
<p><strong><em>&#x5D29;&#x6E83;-&#x505C;&#x6B62;&#x6545;&#x969C;</em></strong></p>
<p>&#x200B;    &#x5728;<strong>&#x5D29;&#x6E83;&#x505C;&#x6B62;&#xFF08;crash-stop&#xFF09;</strong>&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x7B97;&#x6CD5;&#x53EF;&#x80FD;&#x4F1A;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EA;&#x80FD;&#x4EE5;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x5931;&#x6548;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x5D29;&#x6E83;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x610F;&#x65F6;&#x523B;&#x7A81;&#x7136;&#x505C;&#x6B62;&#x54CD;&#x5E94;&#xFF0C;&#x6B64;&#x540E;&#x8BE5;&#x8282;&#x70B9;&#x6C38;&#x8FDC;&#x6D88;&#x5931;&#x2014;&#x2014;&#x5B83;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x56DE;&#x6765;&#x3002;</p>
<p><strong><em>&#x5D29;&#x6E83;-&#x6062;&#x590D;&#x6545;&#x969C;</em></strong></p>
<p>&#x200B;    &#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x5D29;&#x6E83;&#xFF0C;&#x4F46;&#x4E5F;&#x8BB8;&#x4F1A;&#x5728;&#x672A;&#x77E5;&#x7684;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#x518D;&#x6B21;&#x5F00;&#x59CB;&#x54CD;&#x5E94;&#x3002;&#x5728;<strong>&#x5D29;&#x6E83;-&#x6062;&#x590D;&#xFF08;crash-recovery&#xFF09;</strong>&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x5047;&#x8BBE;&#x8282;&#x70B9;&#x5177;&#x6709;&#x7A33;&#x5B9A;&#x7684;&#x5B58;&#x50A8;&#xFF08;&#x5373;&#xFF0C;&#x975E;&#x6613;&#x5931;&#x6027;&#x78C1;&#x76D8;&#x5B58;&#x50A8;&#xFF09;&#x4E14;&#x4F1A;&#x5728;&#x5D29;&#x6E83;&#x4E2D;&#x4FDD;&#x7559;&#xFF0C;&#x800C;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x72B6;&#x6001;&#x4F1A;&#x4E22;&#x5931;&#x3002;</p>
<p><strong><em>&#x62DC;&#x5360;&#x5EAD;&#xFF08;&#x4EFB;&#x610F;&#xFF09;&#x6545;&#x969C;</em></strong></p>
<p>&#x200B;    &#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x505A;&#xFF08;&#x7EDD;&#x5BF9;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#xFF09;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#xFF0C;&#x5305;&#x62EC;&#x8BD5;&#x56FE;&#x620F;&#x5F04;&#x548C;&#x6B3A;&#x9A97;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x4E0A;&#x4E00;&#x8282;&#x6240;&#x8FF0;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x771F;&#x5B9E;&#x7CFB;&#x7EDF;&#x7684;&#x5EFA;&#x6A21;&#xFF0C;&#x5177;&#x6709;<strong>&#x5D29;&#x6E83;-&#x6062;&#x590D;&#x6545;&#x969C;&#xFF08;crash-recovery&#xFF09;</strong>&#x7684;<strong>&#x90E8;&#x5206;&#x540C;&#x6B65;&#x6A21;&#x578B;&#xFF08;partial synchronous&#xFF09;</strong>&#x901A;&#x5E38;&#x662F;&#x6700;&#x6709;&#x7528;&#x7684;&#x6A21;&#x578B;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x5982;&#x4F55;&#x5E94;&#x5BF9;&#x8FD9;&#x79CD;&#x6A21;&#x578B;&#xFF1F;</p>
<h4 id="&#x7B97;&#x6CD5;&#x7684;&#x6B63;&#x786E;&#x6027;">&#x7B97;&#x6CD5;&#x7684;&#x6B63;&#x786E;&#x6027;</h4>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x5B9A;&#x4E49;&#x7B97;&#x6CD5;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x63CF;&#x8FF0;&#x5B83;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x51FA;&#x5177;&#x6709;&#x5982;&#x4E0B;&#x7279;&#x6027;&#xFF1A;&#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x5DE6;&#x8FB9;&#x7684;&#x5143;&#x7D20;&#x6BD4;&#x53F3;&#x8FB9;&#x7684;&#x5143;&#x7D20;&#x5C0F;&#x3002;&#x8FD9;&#x53EA;&#x662F;&#x5B9A;&#x4E49;&#x5BF9;&#x5217;&#x8868;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#x542B;&#x4E49;&#x7684;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x200B;    &#x540C;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5199;&#x4E0B;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x7684;&#x5C5E;&#x6027;&#x6765;&#x5B9A;&#x4E49;&#x5B83;&#x7684;&#x6B63;&#x786E;&#x542B;&#x4E49;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x4E3A;&#x4E00;&#x4E2A;&#x9501;&#x751F;&#x6210;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#xFF08;&#x53C2;&#x9605;&#x201C;<a href="&#x9632;&#x62A4;&#x4EE4;&#x724C;">&#x9632;&#x62A4;&#x4EE4;&#x724C;</a>&#x201D;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x8981;&#x6C42;&#x7B97;&#x6CD5;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x5C5E;&#x6027;&#xFF1A;</p>
<p><strong><em>&#x552F;&#x4E00;&#x6027;</em></strong></p>
<p>&#x200B;    &#x6CA1;&#x6709;&#x4E24;&#x4E2A;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x8BF7;&#x6C42;&#x8FD4;&#x56DE;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;</p>
<p><strong><em>&#x5355;&#x8C03;&#x5E8F;&#x5217;</em></strong></p>
<p>&#x200B;    &#x5982;&#x679C;&#x8BF7;&#x6C42; $x$ &#x8FD4;&#x56DE;&#x4E86;&#x4EE4;&#x724C; $t_x$&#xFF0C;&#x5E76;&#x4E14;&#x8BF7;&#x6C42;$y$&#x8FD4;&#x56DE;&#x4E86;&#x4EE4;&#x724C;$t_y$&#xFF0C;&#x5E76;&#x4E14; $x$ &#x5728; $y$ &#x5F00;&#x59CB;&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x4E48;$t_x &lt;t_y$&#x3002;</p>
<p><strong><em>&#x53EF;&#x7528;&#x6027;</em></strong></p>
<p>&#x200B;    &#x8BF7;&#x6C42;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x5D29;&#x6E83;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x6700;&#x7EC8;&#x4F1A;&#x6536;&#x5230;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x7B97;&#x6CD5;&#x603B;&#x662F;&#x6EE1;&#x8DB3;&#x5B83;&#x5728;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x6027;&#x8D28;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4F46;&#x8FD9;&#x5982;&#x4F55;&#x6709;&#x610F;&#x4E49;&#xFF1F;&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x5D29;&#x6E83;&#xFF0C;&#x6216;&#x8005;&#x6240;&#x6709;&#x7684;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x65E0;&#x9650;&#x957F;&#xFF0C;&#x90A3;&#x4E48;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7B97;&#x6CD5;&#x80FD;&#x591F;&#x5B8C;&#x6210;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x3002;</p>
<h4 id="&#x5B89;&#x5168;&#x6027;&#x548C;&#x6D3B;&#x6027;">&#x5B89;&#x5168;&#x6027;&#x548C;&#x6D3B;&#x6027;</h4>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x6F84;&#x6E05;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x533A;&#x5206;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6027;&#x8D28;&#xFF1A;<strong>&#x5B89;&#x5168;&#x6027;&#xFF08;safety&#xFF09;</strong>&#x548C;<strong>&#x6D3B;&#x6027;&#xFF08;liveness&#xFF09;</strong>&#x3002;&#x5728;&#x521A;&#x521A;&#x7ED9;&#x51FA;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;<strong>&#x552F;&#x4E00;&#x6027;&#xFF08;uniqueness&#xFF09;</strong>&#x548C;<strong>&#x5355;&#x8C03;&#x5E8F;&#x5217;&#xFF08;monotonic sequence&#xFF09;</strong>&#x662F;&#x5B89;&#x5168;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;<strong>&#x53EF;&#x7528;&#x6027;</strong>&#x662F;<strong>&#x6D3B;&#x6027;&#xFF08;liveness&#xFF09;</strong>&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x4E24;&#x79CD;&#x6027;&#x8D28;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;&#x4E00;&#x4E2A;&#x8BD5;&#x91D1;&#x77F3;&#x5C31;&#x662F;&#xFF0C;&#x6D3B;&#x6027;&#x5C5E;&#x6027;&#x901A;&#x5E38;&#x5728;&#x5B9A;&#x4E49;&#x4E2D;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x201C;<strong>&#x6700;&#x7EC8;</strong>&#x201D;&#x4E00;&#x8BCD;&#x3002; &#xFF08;&#x662F;&#x7684;&#xFF0C;&#x4F60;&#x731C;&#x5BF9;&#x4E86;&#x2014;&#x2014;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#x662F;&#x4E00;&#x4E2A;&#x6D3B;&#x6027;&#x5C5E;&#x6027;&#x3010;89&#x3011;&#x3002;&#xFF09;</p>
<p>&#x200B;    &#x5B89;&#x5168;&#x6027;&#x901A;&#x5E38;&#x88AB;&#x975E;&#x6B63;&#x5F0F;&#x5730;&#x5B9A;&#x4E49;&#x4E3A;&#xFF0C;<strong>&#x6CA1;&#x6709;&#x574F;&#x4E8B;&#x53D1;&#x751F;</strong>&#xFF0C;&#x800C;&#x6D3B;&#x6027;&#x901A;&#x5E38;&#x5C31;&#x7C7B;&#x4F3C;&#xFF1A;<strong>&#x6700;&#x7EC8;&#x597D;&#x4E8B;&#x53D1;&#x751F;</strong>&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x8FC7;&#x591A;&#x5730;&#x9605;&#x8BFB;&#x90A3;&#x4E9B;&#x975E;&#x6B63;&#x5F0F;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x597D;&#x4E0E;&#x574F;&#x7684;&#x542B;&#x4E49;&#x662F;&#x4E3B;&#x89C2;&#x7684;&#x3002;&#x5B89;&#x5168;&#x6027;&#x548C;&#x6D3B;&#x6027;&#x7684;&#x5B9E;&#x9645;&#x5B9A;&#x4E49;&#x662F;&#x7CBE;&#x786E;&#x7684;&#x548C;&#x6570;&#x5B66;&#x7684;&#x3010;90&#x3011;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x679C;&#x5B89;&#x5168;&#x5C5E;&#x6027;&#x88AB;&#x8FDD;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6307;&#x5411;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x70B9;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8FDD;&#x53CD;&#x4E86;&#x552F;&#x4E00;&#x6027;&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x91CD;&#x590D;&#x7684;&#x9632;&#x62A4;&#x4EE4;&#x724C;&#x8FD4;&#x56DE;&#x7684;&#x7279;&#x5B9A;&#x64CD;&#x4F5C;&#xFF09; &#x3002;&#x8FDD;&#x53CD;&#x5B89;&#x5168;&#x5C5E;&#x6027;&#x540E;&#xFF0C;&#x8FDD;&#x89C4;&#x884C;&#x4E3A;&#x4E0D;&#x80FD;&#x64A4;&#x9500;&#x2014;&#x2014;&#x635F;&#x5931;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x3002;</li>
<li>&#x6D3B;&#x6027;&#x5C5E;&#x6027;&#x53CD;&#x8FC7;&#x6765;&#xFF1A;&#x5728;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x53D1;&#x9001;&#x4E86;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x4F46;&#x8FD8;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x54CD;&#x5E94;&#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x6210;&#x7ACB;&#xFF0C;&#x4F46;&#x603B;&#x662F;&#x5E0C;&#x671B;&#x5728;&#x672A;&#x6765;&#xFF08;&#x5373;&#x901A;&#x8FC7;&#x63A5;&#x53D7;&#x7B54;&#x590D;&#xFF09;&#x3002;</li>
</ul>
<p>&#x533A;&#x5206;&#x5B89;&#x5168;&#x6027;&#x548C;&#x6D3B;&#x6027;&#x5C5E;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x4F18;&#x70B9;&#x662F;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x56F0;&#x96BE;&#x7684;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x3002;&#x5BF9;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#xFF0C;&#x5728;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x7684;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8981;&#x6C42;<strong>&#x59CB;&#x7EC8;</strong>&#x4FDD;&#x6301;&#x5B89;&#x5168;&#x5C5E;&#x6027;&#x662F;&#x5E38;&#x89C1;&#x7684;&#x3010;88&#x3011;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5373;&#x4F7F;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5D29;&#x6E83;&#xFF0C;&#x6216;&#x8005;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x51FA;&#x73B0;&#x6545;&#x969C;&#xFF0C;&#x7B97;&#x6CD5;&#x4ECD;&#x7136;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x5B83;&#x4E0D;&#x4F1A;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x5373;&#x4FDD;&#x8BC1;&#x5B89;&#x5168;&#x6027;&#x5F97;&#x5230;&#x6EE1;&#x8DB3;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6D3B;&#x6027;&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x63D0;&#x51FA;&#x4E00;&#x4E9B;&#x6CE8;&#x610F;&#x4E8B;&#x9879;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x5927;&#x591A;&#x6570;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x5D29;&#x6E83;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x7F51;&#x7EDC;&#x6700;&#x7EC8;&#x4ECE;&#x4E2D;&#x65AD;&#x4E2D;&#x6062;&#x590D;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x53EF;&#x4EE5;&#x8BF4;&#x8BF7;&#x6C42;&#x9700;&#x8981;&#x63A5;&#x6536;&#x54CD;&#x5E94;&#x3002;&#x90E8;&#x5206;&#x540C;&#x6B65;&#x6A21;&#x578B;&#x7684;&#x5B9A;&#x4E49;&#x8981;&#x6C42;&#x7CFB;&#x7EDF;&#x6700;&#x7EC8;&#x8FD4;&#x56DE;&#x5230;&#x540C;&#x6B65;&#x72B6;&#x6001;&#x2014;&#x2014;&#x5373;&#x4EFB;&#x4F55;&#x7F51;&#x7EDC;&#x4E2D;&#x65AD;&#x7684;&#x65F6;&#x95F4;&#x6BB5;&#x53EA;&#x4F1A;&#x6301;&#x7EED;&#x4E00;&#x6BB5;&#x6709;&#x9650;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x8FDB;&#x884C;&#x4FEE;&#x590D;&#x3002;</p>
<h4 id="&#x5C06;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x6620;&#x5C04;&#x5230;&#x73B0;&#x5B9E;&#x4E16;&#x754C;">&#x5C06;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x6620;&#x5C04;&#x5230;&#x73B0;&#x5B9E;&#x4E16;&#x754C;</h4>
<p>&#x200B;    &#x5B89;&#x5168;&#x6027;&#x548C;&#x6D3B;&#x6027;&#x5C5E;&#x6027;&#x4EE5;&#x53CA;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x5BF9;&#x4E8E;&#x63A8;&#x7406;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x7684;&#x6B63;&#x786E;&#x6027;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x5B9E;&#x65BD;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x73B0;&#x5B9E;&#x7684;&#x6DF7;&#x4E71;&#x4E8B;&#x5B9E;&#x518D;&#x4E00;&#x6B21;&#x5730;&#x8BA9;&#x4F60;&#x54AC;&#x7259;&#x5207;&#x9F7F;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x662F;&#x5BF9;&#x73B0;&#x5B9E;&#x7684;&#x7B80;&#x5316;&#x62BD;&#x8C61;&#x3002;</p>
<p>&#x200B;    &#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x6545;&#x969C;&#x6062;&#x590D;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x7B97;&#x6CD5;&#x901A;&#x5E38;&#x5047;&#x8BBE;&#x7A33;&#x5B9A;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7ECF;&#x5386;&#x4E86;&#x5D29;&#x6E83;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x88AB;&#x7834;&#x574F;&#xFF0C;&#x6216;&#x8005;&#x7531;&#x4E8E;&#x786C;&#x4EF6;&#x9519;&#x8BEF;&#x6216;&#x9519;&#x8BEF;&#x914D;&#x7F6E;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x88AB;&#x6E05;&#x9664;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF1F;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x5728;&#x56FA;&#x4EF6;&#x9519;&#x8BEF;&#x5E76;&#x4E14;&#x5728;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x65F6;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x5176;&#x786C;&#x76D8;&#x9A71;&#x52A8;&#x5668;&#xFF0C;&#x5373;&#x4F7F;&#x9A71;&#x52A8;&#x5668;&#x5DF2;&#x6B63;&#x786E;&#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x90A3;&#x53C8;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF1F;</p>
<p>&#x200B;    &#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x7B97;&#x6CD5;&#xFF08;&#x53C2;&#x89C1;&#x201C;<a href="ch5.html#&#x8BFB;&#x5199;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;">&#x8BFB;&#x5199;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;</a>&#x201D;&#xFF09;&#x4F9D;&#x8D56;&#x8282;&#x70B9;&#x6765;&#x8BB0;&#x4F4F;&#x5B83;&#x58F0;&#x79F0;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x60A3;&#x6709;&#x5065;&#x5FD8;&#x75C7;&#xFF0C;&#x5FD8;&#x8BB0;&#x4E86;&#x4EE5;&#x524D;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4F1A;&#x6253;&#x7834;&#x6CD5;&#x5B9A;&#x6761;&#x4EF6;&#xFF0C;&#x4ECE;&#x800C;&#x7834;&#x574F;&#x7B97;&#x6CD5;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;&#x4E5F;&#x8BB8;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x7A33;&#x5B9A;&#x7684;&#x5B58;&#x50A8;&#x5927;&#x591A;&#x5B58;&#x5728;&#x5D29;&#x6E83;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x3002;&#x4F46;&#x662F;&#x90A3;&#x4E2A;&#x6A21;&#x578B;&#x5C31;&#x53D8;&#x5F97;&#x66F4;&#x96BE;&#x4EE5;&#x63A8;&#x7406;&#x4E86;&#x3002;</p>
<p>&#x200B;    &#x7B97;&#x6CD5;&#x7684;&#x7406;&#x8BBA;&#x63CF;&#x8FF0;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5BA3;&#x79F0;&#x4E00;&#x4E9B;&#x4E8B;&#x5728;&#x5047;&#x8BBE;&#x4E0A;&#x662F;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x7684;&#x2014;&#x2014;&#x5728;&#x975E;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x5BF9;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x548C;&#x4E0D;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x6545;&#x969C;&#x505A;&#x51FA;&#x5047;&#x8BBE;&#xFF0C;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4ECD;&#x7136;&#x4F1A;&#x5305;&#x62EC;&#x5904;&#x7406;&#x201C;&#x5047;&#x8BBE;&#x4E0A;&#x4E0D;&#x53EF;&#x80FD;&#x201D;&#x60C5;&#x51B5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5373;&#x4F7F;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x5C31;&#x662F;<code>printf(&quot;you sucks&quot;)</code>&#x548C;<code>exit(666)</code>&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E5F;&#x5C31;&#x662F;&#x7559;&#x7ED9;&#x8FD0;&#x7EF4;&#x6765;&#x64E6;&#x5C41;&#x80A1;&#x3002;&#xFF08;&#x8FD9;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x548C;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x95F4;&#x7684;&#x4E00;&#x4E2A;&#x5DEE;&#x5F02;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#x7406;&#x8BBA;&#x4E0A;&#x62BD;&#x8C61;&#x7684;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x662F;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x7684;&#xFF0C;&#x6070;&#x6070;&#x76F8;&#x53CD;&#x3002;&#x5B83;&#x4EEC;&#x5BF9;&#x4E8E;&#x5C06;&#x5B9E;&#x9645;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x964D;&#x4F4E;&#x5230;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x63A8;&#x7406;&#x7684;&#x53EF;&#x5904;&#x7406;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x975E;&#x5E38;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x8BD5;&#x56FE;&#x7CFB;&#x7EDF;&#x5730;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x901A;&#x8FC7;&#x8868;&#x660E;&#x5B83;&#x4EEC;&#x7684;&#x5C5E;&#x6027;&#x603B;&#x662F;&#x4FDD;&#x6301;&#x5728;&#x67D0;&#x4E2A;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x4E2D;&#x3002;</p>
<p>&#x200B;    &#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x6B63;&#x786E;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B83;&#x5728;&#x771F;&#x5B9E;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5B9E;&#x73B0;&#x5FC5;&#x7136;&#x603B;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x4F46;&#x8FD9;&#x8FC8;&#x51FA;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#xFF0C;&#x56E0;&#x4E3A;&#x7406;&#x8BBA;&#x5206;&#x6790;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x7B97;&#x6CD5;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x73B0;&#x5B9E;&#x7CFB;&#x7EDF;&#x4E2D;&#x957F;&#x671F;&#x6F5C;&#x4F0F;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x7684;&#x5047;&#x8BBE;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x65F6;&#x95F4;&#xFF09;&#x56E0;&#x4E3A;&#x4E0D;&#x5BFB;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#x88AB;&#x6253;&#x7834;&#x3002;&#x7406;&#x8BBA;&#x5206;&#x6790;&#x4E0E;&#x7ECF;&#x9A8C;&#x6D4B;&#x8BD5;&#x540C;&#x6837;&#x91CD;&#x8981;&#x3002;</p>
<h2 id="&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;">&#x672C;&#x7AE0;&#x5C0F;&#x7ED3;</h2>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x5F53;&#x60A8;&#x5C1D;&#x8BD5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x6570;&#x636E;&#x5305;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5305;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x6216;&#x4EFB;&#x610F;&#x5EF6;&#x8FDF;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x7B54;&#x590D;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x6216;&#x5EF6;&#x8FDF;&#xFF0C;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x4F60;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x7B54;&#x590D;&#xFF0C;&#x4F60;&#x4E0D;&#x77E5;&#x9053;&#x6D88;&#x606F;&#x662F;&#x5426;&#x901A;&#x8FC7;&#x3002;</li>
<li>&#x8282;&#x70B9;&#x7684;&#x65F6;&#x949F;&#x53EF;&#x80FD;&#x4F1A;&#x4E0E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x663E;&#x8457;&#x4E0D;&#x540C;&#x6B65;&#xFF08;&#x5C3D;&#x7BA1;&#x60A8;&#x5C3D;&#x6700;&#x5927;&#x52AA;&#x529B;&#x8BBE;&#x7F6E;NTP&#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x7A81;&#x7136;&#x8DF3;&#x8F6C;&#x6216;&#x8DF3;&#x56DE;&#xFF0C;&#x4F9D;&#x9760;&#x5B83;&#x662F;&#x5F88;&#x5371;&#x9669;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x60A8;&#x5F88;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x597D;&#x7684;&#x6D4B;&#x91CF;&#x4F60;&#x7684;&#x65F6;&#x949F;&#x7684;&#x9519;&#x8BEF;&#x95F4;&#x9694;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5176;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x6682;&#x505C;&#x4E00;&#x6BB5;&#x76F8;&#x5F53;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x505C;&#x6B62;&#x6240;&#x6709;&#x5904;&#x7406;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF09;&#xFF0C;&#x88AB;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5BA3;&#x544A;&#x6B7B;&#x4EA1;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6B21;&#x590D;&#x6D3B;&#xFF0C;&#x5374;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x5B83;&#x88AB;&#x6682;&#x505C;&#x4E86;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x7C7B;<strong>&#x90E8;&#x5206;&#x5931;&#x6548;</strong>&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x5B9E;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x51B3;&#x5B9A;&#x6027;&#x7279;&#x5F81;&#x3002;&#x6BCF;&#x5F53;&#x8F6F;&#x4EF6;&#x8BD5;&#x56FE;&#x505A;&#x4EFB;&#x4F55;&#x6D89;&#x53CA;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x7684;&#x4E8B;&#x60C5;&#x65F6;&#xFF0C;&#x5076;&#x5C14;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x6216;&#x8005;&#x968F;&#x673A;&#x53D8;&#x6162;&#xFF0C;&#x6216;&#x8005;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x54CD;&#x5E94;&#xFF08;&#x6700;&#x7EC8;&#x8D85;&#x65F6;&#xFF09;&#x3002;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x5728;&#x8F6F;&#x4EF6;&#x4E2D;&#x5EFA;&#x7ACB;<strong>&#x90E8;&#x5206;&#x5931;&#x6548;</strong>&#x7684;&#x5BB9;&#x9519;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x6837;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5373;&#x4F7F;&#x5728;&#x67D0;&#x4E9B;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x88AB;&#x7834;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#x200B;    &#x4E3A;&#x4E86;&#x5BB9;&#x5FCD;&#x9519;&#x8BEF;&#xFF0C;&#x7B2C;&#x4E00;&#x6B65;&#x662F;<strong>&#x68C0;&#x6D4B;</strong>&#x5B83;&#x4EEC;&#xFF0C;&#x4F46;&#x5373;&#x4F7F;&#x8FD9;&#x6837;&#x4E5F;&#x5F88;&#x96BE;&#x3002;&#x5927;&#x591A;&#x6570;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x68C0;&#x6D4B;&#x8282;&#x70B9;&#x662F;&#x5426;&#x53D1;&#x751F;&#x6545;&#x969C;&#x7684;&#x51C6;&#x786E;&#x673A;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x5927;&#x591A;&#x6570;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x4F9D;&#x9760;<strong>&#x8D85;&#x65F6;</strong>&#x6765;&#x786E;&#x5B9A;&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x662F;&#x5426;&#x4ECD;&#x7136;&#x53EF;&#x7528;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8D85;&#x65F6;&#x65E0;&#x6CD5;&#x533A;&#x5206;&#x7F51;&#x7EDC;&#x5931;&#x6548;&#x548C;&#x8282;&#x70B9;&#x5931;&#x6548;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x53D8;&#x7684;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x6709;&#x65F6;&#x4F1A;&#x5BFC;&#x81F4;&#x8282;&#x70B9;&#x88AB;&#x9519;&#x8BEF;&#x5730;&#x6000;&#x7591;&#x53D1;&#x751F;&#x6545;&#x969C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6709;&#x65F6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x5904;&#x4E8E;&#x964D;&#x7EA7;&#x72B6;&#x6001;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x7531;&#x4E8E;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;&#x3010;94&#x3011;&#xFF0C;&#x5343;&#x5146;&#x7F51;&#x5361;&#x53EF;&#x80FD;&#x7A81;&#x7136;&#x4E0B;&#x964D;&#x5230;1 Kb/s&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x201C;&#x8DDB;&#x884C;&#x201D;&#x800C;&#x4E0D;&#x662F;&#x6B7B;&#x6389;&#x7684;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x6BD4;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x7684;&#x5931;&#x6548;&#x8282;&#x70B9;&#x66F4;&#x96BE;&#x5904;&#x7406;&#x3002;</p>
<p>&#x200B;    &#x4E00;&#x65E6;&#x68C0;&#x6D4B;&#x5230;&#x6545;&#x969C;&#xFF0C;&#x4F7F;&#x7CFB;&#x7EDF;&#x5BB9;&#x5FCD;&#x5B83;&#x4E5F;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#xFF1A;&#x6CA1;&#x6709;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x6CA1;&#x6709;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#xFF0C;&#x6CA1;&#x6709;&#x5171;&#x540C;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6216;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x79CD;&#x7C7B;&#x7684;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#x3002;&#x8282;&#x70B9;&#x751A;&#x81F3;&#x4E0D;&#x80FD;&#x5C31;&#x73B0;&#x5728;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x95F4;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#xFF0C;&#x5C31;&#x4E0D;&#x7528;&#x8BF4;&#x66F4;&#x6DF1;&#x5965;&#x7684;&#x4E86;&#x3002;&#x4FE1;&#x606F;&#x4ECE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6D41;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x7F51;&#x7EDC;&#x53D1;&#x9001;&#x4FE1;&#x606F;&#x3002;&#x91CD;&#x5927;&#x51B3;&#x7B56;&#x4E0D;&#x80FD;&#x7531;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5B89;&#x5168;&#x5730;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x80FD;&#x4ECE;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x83B7;&#x5F97;&#x5E2E;&#x52A9;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x5E76;&#x4E89;&#x53D6;&#x8FBE;&#x5230;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4EE5;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x200B;    &#x5982;&#x679C;&#x4F60;&#x4E60;&#x60EF;&#x4E8E;&#x5728;&#x7406;&#x60F3;&#x5316;&#x7684;&#x6570;&#x5B66;&#x5B8C;&#x7F8E;&#xFF08;&#x540C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x603B;&#x80FD;&#x786E;&#x5B9A;&#x5730;&#x8FD4;&#x56DE;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF09;&#x7684;&#x5355;&#x673A;&#x73AF;&#x5883;&#x4E2D;&#x7F16;&#x5199;&#x8F6F;&#x4EF6;&#xFF0C;&#x90A3;&#x4E48;&#x8F6C;&#x5411;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x51CC;&#x4E71;&#x7684;&#x7269;&#x7406;&#x73B0;&#x5B9E;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E9B;&#x4EE4;&#x4EBA;&#x9707;&#x60CA;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x591F;&#x5728;&#x5355;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#x5E08;&#x901A;&#x5E38;&#x4F1A;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5E73;&#x51E1;&#x7684;&#x3010;5&#x3011;&#xFF0C;&#x73B0;&#x5728;&#x5355;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x786E;&#x5B9E;&#x53EF;&#x4EE5;&#x505A;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x3010;95&#x3011;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x6253;&#x5F00;&#x6F58;&#x591A;&#x62C9;&#x7684;&#x76D2;&#x5B50;&#xFF0C;&#x628A;&#x4E1C;&#x897F;&#x653E;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x901A;&#x5E38;&#x662F;&#x503C;&#x5F97;&#x7684;&#x3002;</p>
<p>&#x200B;    &#x4F46;&#x662F;&#xFF0C;&#x6B63;&#x5982;&#x5728;<a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;</a>&#x7684;&#x4ECB;&#x7ECD;&#x4E2D;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x5E76;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x552F;&#x4E00;&#x539F;&#x56E0;&#x3002;&#x5BB9;&#x9519;&#x548C;&#x4F4E;&#x5EF6;&#x8FDF;&#xFF08;&#x901A;&#x8FC7;&#x5C06;&#x6570;&#x636E;&#x653E;&#x7F6E;&#x5728;&#x8DDD;&#x79BB;&#x7528;&#x6237;&#x8F83;&#x8FD1;&#x7684;&#x5730;&#x65B9;&#xFF09;&#x662F;&#x540C;&#x7B49;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4E0D;&#x80FD;&#x7528;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x200B;    &#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x8F6C;&#x6362;&#x4E86;&#x51E0;&#x6B21;&#x8BDD;&#x9898;&#xFF0C;&#x63A2;&#x8BA8;&#x4E86;&#x7F51;&#x7EDC;&#xFF0C;&#x65F6;&#x949F;&#x548C;&#x8FDB;&#x7A0B;&#x7684;&#x4E0D;&#x53EF;&#x9760;&#x6027;&#x662F;&#x5426;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x81EA;&#x7136;&#x89C4;&#x5F8B;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#xFF1A;&#x6709;&#x53EF;&#x80FD;&#x7ED9;&#x7F51;&#x7EDC;&#x63D0;&#x4F9B;&#x786C;&#x5B9E;&#x65F6;&#x7684;&#x54CD;&#x5E94;&#x4FDD;&#x8BC1;&#x548C;&#x6709;&#x9650;&#x7684;&#x5EF6;&#x8FDF;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x505A;&#x975E;&#x5E38;&#x6602;&#x8D35;&#xFF0C;&#x4E14;&#x5BFC;&#x81F4;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x7684;&#x5229;&#x7528;&#x7387;&#x964D;&#x4F4E;&#x3002;&#x5927;&#x591A;&#x6570;&#x975E;&#x5B89;&#x5168;&#x5173;&#x952E;&#x7CFB;&#x7EDF;&#x4F1A;&#x9009;&#x62E9;<strong>&#x4FBF;&#x5B9C;&#x800C;&#x4E0D;&#x53EF;&#x9760;</strong>&#xFF0C;&#x800C;&#x4E0D;&#x662F;<strong>&#x6602;&#x8D35;&#x548C;&#x53EF;&#x9760;</strong>&#x3002;</p>
<p>&#x200B;    &#x6211;&#x4EEC;&#x8FD8;&#x8C08;&#x5230;&#x4E86;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x5B83;&#x4EEC;&#x91C7;&#x7528;&#x53EF;&#x9760;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x7EC4;&#x4EF6;&#x53D1;&#x751F;&#x6545;&#x969C;&#x65F6;&#x5FC5;&#x987B;&#x5B8C;&#x5168;&#x505C;&#x6B62;&#x5E76;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x6C38;&#x4E45;&#x8FD0;&#x884C;&#x800C;&#x4E0D;&#x4F1A;&#x5728;&#x670D;&#x52A1;&#x5C42;&#x9762;&#x4E2D;&#x65AD;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x9519;&#x8BEF;&#x548C;&#x7EF4;&#x62A4;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x8282;&#x70B9;&#x7EA7;&#x522B;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x2014;&#x2014;&#x81F3;&#x5C11;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x5982;&#x6B64;&#x3002; &#xFF08;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x7684;&#x914D;&#x7F6E;&#x53D8;&#x66F4;&#x88AB;&#x5E94;&#x7528;&#x5230;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4ECD;&#x7136;&#x4F1A;&#x4F7F;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x762B;&#x75EA;&#xFF09;&#x3002;</p>
<p>&#x200B;    &#x672C;&#x7AE0;&#x4E00;&#x76F4;&#x5728;&#x8BB2;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7ED9;&#x6211;&#x4EEC;&#x5C55;&#x73B0;&#x4E86;&#x4E00;&#x5E45;&#x9EEF;&#x6DE1;&#x7684;&#x524D;&#x666F;&#x3002;&#x5728;<a href="ch9.html">&#x4E0B;&#x4E00;&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#x8BA8;&#x8BBA;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x8BA8;&#x8BBA;&#x4E00;&#x4E9B;&#x65E8;&#x5728;&#x89E3;&#x51B3;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x6240;&#x6709;&#x95EE;&#x9898;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;">&#x53C2;&#x8003;&#x6587;&#x732E;</h2>
<ol>
<li>Mark Cavage:  Just No Getting Around It: You&#x2019;re Building a Distributed System](<a href="http://queue.acm.org/detail.cfm?id=2482856),&#x201D;" target="_blank">http://queue.acm.org/detail.cfm?id=2482856),&#x201D;</a> <em>ACM Queue</em>, volume 11, number 4, pages 80-89, April 2013.
<a href="http://dx.doi.org/10.1145/2466486.2482856" target="_blank">doi:10.1145/2466486.2482856</a></li>
<li>Jay Kreps: &#x201C;<a href="http://blog.empathybox.com/post/19574936361/getting-real-about-distributed-system-reliability" target="_blank">Getting Real About Distributed System Reliability</a>,&#x201D; <em>blog.empathybox.com</em>, March 19, 2012.</li>
<li>Sydney Padua: <em>The Thrilling Adventures of Lovelace and Babbage: The (Mostly) True Story of the First Computer</em>. Particular Books, April ISBN: 978-0-141-98151-2</li>
<li>Coda Hale: &#x201C;<a href="http://codahale.com/you-cant-sacrifice-partition-tolerance/" target="_blank">You Can&#x2019;t Sacrifice Partition Tolerance</a>,&#x201D; <em>codahale.com</em>, October 7, 2010.</li>
<li>Jeff Hodges: &#x201C;<a href="http://www.somethingsimilar.com/2013/01/14/notes-on-distributed-systems-for-young-bloods/" target="_blank">Notes on Distributed Systems for Young Bloods</a>,&#x201D; <em>somethingsimilar.com</em>, January 14, 2013.</li>
<li>Antonio Regalado:  &#x201C;<a href="http://www.technologyreview.com/news/425970/who-coined-cloud-computing/" target="_blank">Who Coined   &apos;Cloud Computing&#x2019;?</a>,&#x201D; <em>technologyreview.com</em>, October 31, 2011.</li>
<li>Luiz Andr&#xE9; Barroso, Jimmy Clidaras, and Urs H&#xF6;lzle: &#x201C;<a href="http://www.morganclaypool.com/doi/abs/10.2200/S00516ED2V01Y201306CAC024" target="_blank">The Datacenter as a Computer: An Introduction to the Design of Warehouse-Scale Machines, Second Edition</a>,&#x201D; <em>Synthesis Lectures on Computer Architecture</em>, volume 8, number 3, Morgan &amp; Claypool Publishers, July 2013.<a href="http://dx.doi.org/10.2200/S00516ED2V01Y201306CAC024" target="_blank">doi:10.2200/S00516ED2V01Y201306CAC024</a>, ISBN: 978-1-627-05010-4</li>
<li>David Fiala, Frank Mueller, Christian Engelmann, et al.: &#x201C;<a href="http://moss.csc.ncsu.edu/~mueller/ftp/pub/mueller/papers/sc12.pdf" target="_blank">Detection and Correction of Silent Data Corruption for Large-Scale High-Performance Computing</a>,&#x201D; at <em>International Conference for High Performance Computing, Networking, Storage and Analysis</em> (SC12), November 2012.</li>
<li>Arjun Singh, Joon Ong, Amit Agarwal, et al.:   &#x201C;<a href="http://conferences.sigcomm.org/sigcomm/2015/pdf/papers/p183.pdf" target="_blank">Jupiter Rising: A   Decade of Clos Topologies and Centralized Control in Google&#x2019;s Datacenter Network</a>,&#x201D; at   <em>Annual Conference of the ACM Special Interest Group on Data Communication</em> (SIGCOMM), August 2015.  <a href="http://dx.doi.org/10.1145/2785956.2787508" target="_blank">doi:10.1145/2785956.2787508</a></li>
<li>Glenn K. Lockwood:  &#x201C;<a href="http://glennklockwood.blogspot.co.uk/2014/05/hadoops-uncomfortable-fit-in-hpc.html" target="_blank">Hadoop&apos;s   Uncomfortable Fit in HPC</a>,&#x201D; <em>glennklockwood.blogspot.co.uk</em>, May 16, 2014.</li>
<li>John von Neumann: &#x201C;<a href="https://ece.uwaterloo.ca/~ssundara/courses/prob_logics.pdf" target="_blank">Probabilistic Logics and the Synthesis of Reliable Organisms from Unreliable Components</a>,&#x201D; in <em>Automata Studies (AM-34)</em>, edited by Claude E. Shannon and John McCarthy, Princeton University Press, 1956. ISBN: 978-0-691-07916-5</li>
<li>Richard W. Hamming:  <em>The Art of Doing Science and Engineering</em>. Taylor &amp; Francis, 1997.  ISBN: 978-9-056-99500-3</li>
<li>Claude E. Shannon: &#x201C;<a href="http://cs.brynmawr.edu/Courses/cs380/fall2012/shannon1948.pdf" target="_blank">A Mathematical Theory of Communication</a>,&#x201D; <em>The Bell System Technical Journal</em>, volume 27, number 3, pages 379&#x2013;423 and 623&#x2013;656, July 1948.</li>
<li>Peter Bailis and Kyle Kingsbury: &#x201C;<a href="https://queue.acm.org/detail.cfm?id=2655736" target="_blank">The Network Is Reliable</a>,&#x201D; <em>ACM Queue</em>, volume 12, number 7, pages 48-55, July 2014. <a href="http://dx.doi.org/10.1145/2639988.2639988" target="_blank">doi:10.1145/2639988.2639988</a></li>
<li>Joshua B. Leners, Trinabh Gupta, Marcos K. Aguilera, and Michael Walfish: &#x201C;<a href="http://www.cs.nyu.edu/~mwalfish/papers/albatross-eurosys15.pdf" target="_blank">Taming Uncertainty in Distributed Systems with Help from the Network</a>,&#x201D; at <em>10th European Conference on Computer Systems</em> (EuroSys), April 2015. <a href="http://dx.doi.org/10.1145/2741948.2741976" target="_blank">doi:10.1145/2741948.2741976</a></li>
<li>Phillipa Gill, Navendu Jain, and Nachiappan Nagappan: &#x201C;<a href="http://conferences.sigcomm.org/sigcomm/2011/papers/sigcomm/p350.pdf" target="_blank">Understanding Network Failures in Data Centers: Measurement, Analysis, and Implications</a>,&#x201D; at <em>ACM SIGCOMM Conference</em>, August 2011.
<a href="http://dx.doi.org/10.1145/2018436.2018477" target="_blank">doi:10.1145/2018436.2018477</a></li>
<li>Mark Imbriaco: &#x201C;<a href="https://github.com/blog/1364-downtime-last-saturday" target="_blank">Downtime Last Saturday</a>,&#x201D; <em>github.com</em>, December 26, 2012.</li>
<li>Will Oremus: &#x201C;<a href="http://www.slate.com/blogs/future_tense/2014/08/15/shark_attacks_threaten_google_s_undersea_internet_cables_video.html" target="_blank">The Global Internet Is Being Attacked by Sharks, Google Confirms</a>,&#x201D; <em>slate.com</em>, August 15,
2014.</li>
<li>Marc A. Donges: &#x201C;<a href="http://www.spinics.net/lists/netdev/msg210485.html" target="_blank">Re: bnx2 cards Intermittantly Going Offline</a>,&#x201D; Message to Linux <em>netdev</em> mailing list, <em>spinics.net</em>, September 13, 2012.</li>
<li>Kyle Kingsbury: &#x201C;<a href="https://aphyr.com/posts/317-call-me-maybe-elasticsearch" target="_blank">Call Me Maybe: Elasticsearch</a>,&#x201D; <em>aphyr.com</em>, June 15, 2014.</li>
<li>Salvatore Sanfilippo: &#x201C;<a href="http://antirez.com/news/80" target="_blank">A Few Arguments About Redis Sentinel Properties and Fail Scenarios</a>,&#x201D; <em>antirez.com</em>, October 21, 2014.</li>
<li>Bert Hubert:  &#x201C;<a href="http://blog.netherlabs.nl/articles/2009/01/18/the-ultimate-so_linger-page-or-why-is-my-tcp-not-reliable" target="_blank">The   Ultimate SO_LINGER Page, or: Why Is My TCP Not Reliable</a>,&#x201D; <em>blog.netherlabs.nl</em>, January 18, 2009.</li>
<li>Nicolas Liochon:  &#x201C;<a href="http://blog.thislongrun.com/2015/05/CAP-theorem-partition-timeout-zookeeper.html" target="_blank">CAP:   If All You Have Is a Timeout, Everything Looks Like a Partition</a>,&#x201D; <em>blog.thislongrun.com</em>,   May 25, 2015.</li>
<li>Jerome H. Saltzer, David P. Reed, and David D. Clark: &#x201C;<a href="http://www.ece.drexel.edu/courses/ECE-C631-501/SalRee1984.pdf" target="_blank">End-To-End Arguments in System Design</a>,&#x201D; <em>ACM Transactions on Computer Systems</em>, volume 2, number 4, pages 277&#x2013;288, November 1984. <a href="http://dx.doi.org/10.1145/357401.357402" target="_blank">doi:10.1145/357401.357402</a></li>
<li>Matthew P. Grosvenor, Malte Schwarzkopf, Ionel Gog, et al.: &#x201C;<a href="https://www.usenix.org/system/files/conference/nsdi15/nsdi15-paper-grosvenor_update.pdf" target="_blank">Queues Don&#x2019;t Matter When You Can JUMP Them!</a>,&#x201D; at <em>12th USENIX Symposium on Networked Systems Design and Implementation</em> (NSDI), May 2015.</li>
<li>Guohui Wang and T. S. Eugene Ng:   &#x201C;<a href="http://www.cs.rice.edu/~eugeneng/papers/INFOCOM10-ec2.pdf" target="_blank">The Impact of   Virtualization on Network Performance of Amazon EC2 Data Center</a>,&#x201D; at <em>29th IEEE  International Conference on Computer Communications</em> (INFOCOM), March 2010.  <a href="http://dx.doi.org/10.1109/INFCOM.2010.5461931" target="_blank">doi:10.1109/INFCOM.2010.5461931</a></li>
<li>Van Jacobson:   &#x201C;<a href="http://www.cs.usask.ca/ftp/pub/discus/seminars2002-2003/p314-jacobson.pdf" target="_blank">Congestion   Avoidance and Control</a>,&#x201D; at <em>ACM Symposium on Communications Architectures and  Protocols</em> (SIGCOMM), August 1988.  <a href="http://dx.doi.org/10.1145/52324.52356" target="_blank">doi:10.1145/52324.52356</a></li>
<li>Brandon Philips: &#x201C;<a href="https://www.youtube.com/watch?v=HJIjTTHWYnE" target="_blank">etcd: Distributed Locking and Service Discovery</a>,&#x201D; at <em>Strange Loop</em>, September 2014.</li>
<li>Steve Newman: &#x201C;<a href="http://blog.scalyr.com/2012/10/a-systematic-look-at-ec2-io/" target="_blank">A Systematic Look at EC2 I/O</a>,&#x201D; <em>blog.scalyr.com</em>, October 16, 2012.</li>
<li>Naohiro Hayashibara, Xavier D&#xE9;fago, Rami Yared, and Takuya Katayama: &#x201C;<a href="http://hdl.handle.net/10119/4784" target="_blank">The &#x3D5; Accrual Failure Detector</a>,&#x201D; Japan Advanced Institute of Science and Technology, School of Information Science, Technical Report IS-RR-2004-010, May 2004.</li>
<li>Jeffrey Wang: &#x201C;<a href="http://ternarysearch.blogspot.co.uk/2013/08/phi-accrual-failure-detector.html" target="_blank">Phi Accrual Failure Detector</a>,&#x201D; <em>ternarysearch.blogspot.co.uk</em>, August 11, 2013.</li>
<li>Srinivasan Keshav: <em>An Engineering Approach to Computer Networking: ATM Networks, the Internet, and the Telephone Network</em>. Addison-Wesley Professional, May 1997. ISBN: 978-0-201-63442-6</li>
<li>Cisco, &#x201C;<a href="http://docwiki.cisco.com/wiki/Integrated_Services_Digital_Network" target="_blank">Integrated Services Digital Network</a>,&#x201D; <em>docwiki.cisco.com</em>.</li>
<li>Othmar Kyas: <em>ATM Networks</em>. International Thomson Publishing, 1995. ISBN: 978-1-850-32128-6</li>
<li>&#x201C;<a href="http://www.mellanox.com/related-docs/whitepapers/InfiniBandFAQ_FQ_100.pdf" target="_blank">InfiniBand FAQ</a>,&#x201D; Mellanox Technologies, December 22, 2014.</li>
<li>Jose Renato Santos, Yoshio Turner, and G. (John) Janakiraman: &#x201C;<a href="http://www.hpl.hp.com/techreports/2002/HPL-2002-359.pdf" target="_blank">End-to-End Congestion Control for InfiniBand</a>,&#x201D; at <em>22nd Annual Joint Conference of the IEEE Computer and Communications Societies</em> (INFOCOM), April 2003. Also published by HP Laboratories Palo
Alto, Tech Report HPL-2002-359. <a href="http://dx.doi.org/10.1109/INFCOM.2003.1208949" target="_blank">doi:10.1109/INFCOM.2003.1208949</a></li>
<li>Ulrich Windl, David Dalton, Marc Martinec, and Dale R. Worley: &#x201C;<a href="http://www.ntp.org/ntpfaq/NTP-a-faq.htm" target="_blank">The NTP FAQ and HOWTO</a>,&#x201D; <em>ntp.org</em>, November 2006.</li>
<li>John Graham-Cumming: &#x201C;<a href="https://blog.cloudflare.com/how-and-why-the-leap-second-affected-cloudflare-dns/" target="_blank">How and why the leap second affected Cloudflare DNS</a>,&#x201D; <em>blog.cloudflare.com</em>, January 1, 2017.</li>
<li>David Holmes: &#x201C;<a href="https://blogs.oracle.com/dholmes/entry/inside_the_hotspot_vm_clocks" target="_blank">Inside the Hotspot VM: Clocks, Timers and Scheduling Events &#x2013; Part I &#x2013; Windows</a>,&#x201D; <em>blogs.oracle.com</em>, October 2, 2006.</li>
<li>Steve Loughran: &#x201C;<a href="http://steveloughran.blogspot.co.uk/2015/09/time-on-multi-core-multi-socket-servers.html" target="_blank">Time on Multi-Core, Multi-Socket Servers</a>,&#x201D; <em>steveloughran.blogspot.co.uk</em>, September 17, 2015.</li>
<li>James C. Corbett, Jeffrey Dean, Michael Epstein, et al.:  &#x201C;<a href="http://research.google.com/archive/spanner.html" target="_blank">Spanner: Google&#x2019;s Globally-Distributed   Database</a>,&#x201D; at <em>10th USENIX Symposium on Operating System Design and  Implementation</em> (OSDI), October 2012.</li>
<li>M. Caporaloni and R. Ambrosini:  &#x201C;<a href="https://iopscience.iop.org/0143-0807/23/4/103/" target="_blank">How Closely Can a Personal Computer   Clock Track the UTC Timescale Via the Internet?</a>,&#x201D; <em>European Journal of   Physics</em>, volume 23, number 4, pages L17&#x2013;L21, June 2012.   <a href="http://dx.doi.org/10.1088/0143-0807/23/4/103" target="_blank">doi:10.1088/0143-0807/23/4/103</a></li>
<li>Nelson Minar:   &#x201C;<a href="http://alumni.media.mit.edu/~nelson/research/ntp-survey99/" target="_blank">A Survey of the NTP Network</a>,&#x201D;  <em>alumni.media.mit.edu</em>, December 1999.</li>
<li>Viliam Holub:  &#x201C;<a href="https://blog.logentries.com/2014/03/synchronizing-clocks-in-a-cassandra-cluster-pt-1-the-problem/" target="_blank">Synchronizing   Clocks in a Cassandra Cluster Pt. 1 &#x2013; The Problem</a>,&#x201D; <em>blog.logentries.com</em>, March 14, 2014.</li>
<li>Poul-Henning Kamp:   &#x201C;<a href="http://queue.acm.org/detail.cfm?id=1967009" target="_blank">The One-Second War (What Time Will You   Die?)</a>,&#x201D; <em>ACM Queue</em>, volume 9, number 4, pages 44&#x2013;48, April 2011.   <a href="http://dx.doi.org/10.1145/1966989.1967009" target="_blank">doi:10.1145/1966989.1967009</a></li>
<li>Nelson Minar:   &#x201C;<a href="http://www.somebits.com/weblog/tech/bad/leap-second-2012.html" target="_blank">Leap Second Crashes Half   the Internet</a>,&#x201D; <em>somebits.com</em>, July 3, 2012.</li>
<li>Christopher Pascoe:   &#x201C;<a href="http://googleblog.blogspot.co.uk/2011/09/time-technology-and-leaping-seconds.html" target="_blank">Time,   Technology and Leaping Seconds</a>,&#x201D; <em>googleblog.blogspot.co.uk</em>, September 15, 2011.</li>
<li>Mingxue Zhao and Jeff Barr:   &#x201C;<a href="https://aws.amazon.com/blogs/aws/look-before-you-leap-the-coming-leap-second-and-aws/" target="_blank">Look   Before You Leap &#x2013; The Coming Leap Second and AWS</a>,&#x201D; <em>aws.amazon.com</em>, May 18, 2015.</li>
<li>Darryl Veitch and Kanthaiah Vijayalayan:   &#x201C;<a href="http://crin.eng.uts.edu.au/~darryl/Publications/LeapSecond_camera.pdf" target="_blank">Network Timing   and the 2015 Leap Second</a>,&#x201D; at <em>17th International Conference on Passive and Active   Measurement</em> (PAM), April 2016.   <a href="http://dx.doi.org/10.1007/978-3-319-30505-9_29" target="_blank">doi:10.1007/978-3-319-30505-9_29</a></li>
<li>&#x201C;<a href="http://www.vmware.com/resources/techresources/238" target="_blank">Timekeeping   in VMware Virtual Machines</a>,&#x201D; Information Guide, VMware, Inc., December 2011.</li>
<li>&#x201C;<a href="https://www.esma.europa.eu/sites/default/files/library/2015/11/2015-esma-1464_annex_i_-_draft_rts_and_its_on_mifid_ii_and_mifir.pdf" target="_blank">MiFID II / MiFIR: Regulatory Technical and Implementing Standards &#x2013; Annex I (Draft)</a>,&#x201D;
European Securities and Markets Authority, Report ESMA/2015/1464, September 2015.</li>
<li>Luke Bigum: &#x201C;<a href="https://www.lmax.com/blog/staff-blogs/2015/11/27/solving-mifid-ii-clock-synchronisation-minimum-spend-part-1/" target="_blank">Solving MiFID II Clock Synchronisation With Minimum Spend (Part 1)</a>,&#x201D; <em>lmax.com</em>, November 27, 2015.</li>
<li>Kyle Kingsbury: &#x201C;<a href="https://aphyr.com/posts/294-call-me-maybe-cassandra/" target="_blank">Call Me Maybe: Cassandra</a>,&#x201D; <em>aphyr.com</em>, September 24, 2013.</li>
<li>John Daily: &#x201C;<a href="http://basho.com/clocks-are-bad-or-welcome-to-distributed-systems/" target="_blank">Clocks Are Bad, or, Welcome to the Wonderful World of Distributed Systems</a>,&#x201D; <em>basho.com</em>, November 12, 2013.</li>
<li>Kyle Kingsbury:   &#x201C;<a href="https://aphyr.com/posts/299-the-trouble-with-timestamps" target="_blank">The Trouble with   Timestamps</a>,&#x201D; <em>aphyr.com</em>, October 12, 2013.</li>
<li>Leslie Lamport: &#x201C;<a href="http://research.microsoft.com/en-US/um/people/Lamport/pubs/time-clocks.pdf" target="_blank">Time, Clocks, and the Ordering of Events in a Distributed System</a>,&#x201D; <em>Communications of the ACM</em>, volume 21, number 7, pages 558&#x2013;565, July 1978. <a href="http://dx.doi.org/10.1145/359545.359563" target="_blank">doi:10.1145/359545.359563</a></li>
<li>Sandeep Kulkarni, Murat Demirbas, Deepak Madeppa, et al.: &#x201C;<a href="http://www.cse.buffalo.edu/tech-reports/2014-04.pdf" target="_blank">Logical Physical Clocks and Consistent Snapshots in Globally Distributed Databases</a>,&#x201D; State University of New York at Buffalo, Computer Science and Engineering Technical Report 2014-04, May 2014.</li>
<li>Justin Sheehy: &#x201C;<a href="https://queue.acm.org/detail.cfm?id=2745385" target="_blank">There Is No Now: Problems With Simultaneity in Distributed Systems</a>,&#x201D; <em>ACM Queue</em>, volume 13, number 3, pages 36&#x2013;41, March 2015. <a href="http://dx.doi.org/10.1145/2733108" target="_blank">doi:10.1145/2733108</a></li>
<li>Murat Demirbas: &#x201C;<a href="http://muratbuffalo.blogspot.co.uk/2013/07/spanner-googles-globally-distributed_4.html" target="_blank">Spanner: Google&apos;s Globally-Distributed Database</a>,&#x201D; <em>muratbuffalo.blogspot.co.uk</em>, July 4, 2013.</li>
<li>Dahlia Malkhi and Jean-Philippe Martin: &#x201C;<a href="http://www.cs.cornell.edu/~ie53/publications/DC-col51-Sep13.pdf" target="_blank">Spanner&apos;s Concurrency Control</a>,&#x201D; <em>ACM SIGACT News</em>, volume 44, number 3, pages 73&#x2013;77, September 2013. <a href="http://dx.doi.org/10.1145/2527748.2527767" target="_blank">doi:10.1145/2527748.2527767</a></li>
<li>Manuel Bravo, Nuno Diegues, Jingna Zeng, et al.: &#x201C;<a href="http://sites.computer.org/debull/A15mar/p18.pdf" target="_blank">On the Use of Clocks to Enforce Consistency in the Cloud</a>,&#x201D; <em>IEEE Data Engineering Bulletin</em>,
volume 38, number 1, pages 18&#x2013;31, March 2015.</li>
<li>Spencer Kimball: &#x201C;<a href="http://www.cockroachlabs.com/blog/living-without-atomic-clocks/" target="_blank">Living Without Atomic Clocks</a>,&#x201D; <em>cockroachlabs.com</em>, February 17, 2016.</li>
<li>Cary G. Gray and David R. Cheriton:&#x201C;<a href="http://web.stanford.edu/class/cs240/readings/89-leases.pdf" target="_blank">Leases: An Efficient Fault-Tolerant Mechanism for Distributed File Cache Consistency</a>,&#x201D; at <em>12th ACM Symposium on Operating Systems Principles</em> (SOSP), December 1989.
<a href="http://dx.doi.org/10.1145/74850.74870" target="_blank">doi:10.1145/74850.74870</a></li>
<li>Todd Lipcon:  &#x201C;<a href="http://blog.cloudera.com/blog/2011/02/avoiding-full-gcs-in-hbase-with-memstore-local-allocation-buffers-part-1/" target="_blank">Avoiding   Full GCs in Apache HBase with MemStore-Local Allocation Buffers: Part 1</a>,&#x201D;
  <em>blog.cloudera.com</em>, February 24, 2011.</li>
<li>Martin Thompson:  &#x201C;<a href="http://mechanical-sympathy.blogspot.co.uk/2013/07/java-garbage-collection-distilled.html" target="_blank">Java   Garbage Collection Distilled</a>,&#x201D; <em>mechanical-sympathy.blogspot.co.uk</em>, July 16, 2013.</li>
<li>Alexey Ragozin:  &#x201C;<a href="http://java.dzone.com/articles/how-tame-java-gc-pauses" target="_blank">How to Tame Java GC Pauses?   Surviving 16GiB Heap and Greater</a>,&#x201D; <em>java.dzone.com</em>, June 28, 2011.</li>
<li>Christopher Clark, Keir Fraser, Steven Hand, et al.:  &#x201C;<a href="http://www.cl.cam.ac.uk/research/srg/netos/papers/2005-nsdi-migration.pdf" target="_blank">Live   Migration of Virtual Machines</a>,&#x201D; at <em>2nd USENIX Symposium on Symposium on Networked Systems Design &amp; Implementation</em> (NSDI), May 2005.</li>
<li>Mike Shaver:  &#x201C;<a href="http://shaver.off.net/diary/2008/05/25/fsyncers-and-curveballs/" target="_blank">fsyncers and   Curveballs</a>,&#x201D; <em>shaver.off.net</em>, May 25, 2008.</li>
<li>Zhenyun Zhuang and Cuong Tran:  &#x201C;<a href="https://engineering.linkedin.com/blog/2016/02/eliminating-large-jvm-gc-pauses-caused-by-background-io-traffic" target="_blank">Eliminating   Large JVM GC Pauses Caused by Background IO Traffic</a>,&#x201D; <em>engineering.linkedin.com</em>, February 10,  2016.</li>
<li>David Terei and Amit Levy: &#x201C;<a href="http://arxiv.org/pdf/1504.02578.pdf" target="_blank">Blade: A Data Center Garbage Collector</a>,&#x201D; arXiv:1504.02578, April 13, 2015.</li>
<li>Martin Maas, Tim Harris, Krste Asanovi&#x107;, and John Kubiatowicz: &#x201C;<a href="https://timharris.uk/papers/2015-hotos.pdf" target="_blank">Trash Day: Coordinating Garbage Collection in Distributed Systems</a>,&#x201D; at <em>15th USENIX Workshop on Hot Topics in Operating Systems</em> (HotOS), May 2015.</li>
<li>&#x201C;<a href="http://cdn2.hubspot.net/hubfs/1624455/Website_2016/content/White%20papers/Cinnober%20on%20GC%20pause%20free%20Java%20applications.pdf" target="_blank">Predictable Low Latency</a>,&#x201D; Cinnober Financial Technology AB, <em>cinnober.com</em>, November 24, 2013.</li>
<li>Martin Fowler: &#x201C;<a href="http://martinfowler.com/articles/lmax.html" target="_blank">The LMAX Architecture</a>,&#x201D; <em>martinfowler.com</em>, July 12, 2011.</li>
<li>Flavio P. Junqueira and Benjamin Reed: <em>ZooKeeper: Distributed Process Coordination</em>. O&apos;Reilly Media, 2013. ISBN: 978-1-449-36130-3</li>
<li>Enis S&#xF6;ztutar: &#x201C;<a href="http://www.slideshare.net/enissoz/hbase-and-hdfs-understanding-filesystem-usage" target="_blank">HBase and HDFS: Understanding Filesystem Usage in HBase</a>,&#x201D; at <em>HBaseCon</em>, June 2013.</li>
<li>Caitie McCaffrey: &#x201C;<a href="http://caitiem.com/2015/06/23/clients-are-jerks-aka-how-halo-4-dosed-the-services-at-launch-how-we-survived/" target="_blank">Clients Are Jerks: AKA How Halo 4 DoSed the Services at Launch &amp; How We Survived</a>,&#x201D; <em>caitiem.com</em>, June 23, 2015.</li>
<li>Leslie Lamport, Robert Shostak, and Marshall Pease: &#x201C;<a href="http://research.microsoft.com/en-us/um/people/lamport/pubs/byz.pdf" target="_blank">The Byzantine Generals Problem</a>,&#x201D; <em>ACM Transactions on Programming Languages and Systems</em> (TOPLAS), volume 4, number 3, pages 382&#x2013;401, July 1982. <a href="http://dx.doi.org/10.1145/357172.357176" target="_blank">doi:10.1145/357172.357176</a></li>
<li>Jim N. Gray: &#x201C;<a href="http://research.microsoft.com/en-us/um/people/gray/papers/DBOS.pdf" target="_blank">Notes on Data Base Operating Systems</a>,&#x201D; in <em>Operating Systems: An Advanced Course</em>, Lecture
Notes in Computer Science, volume 60, edited by R. Bayer, R. M. Graham, and G. Seegm&#xFC;ller,
pages 393&#x2013;481, Springer-Verlag, 1978. ISBN: 978-3-540-08755-7</li>
<li>Brian Palmer: &#x201C;<a href="http://www.slate.com/articles/news_and_politics/explainer/2011/10/the_byzantine_tax_code_how_complicated_was_byzantium_anyway_.html" target="_blank">How Complicated Was the Byzantine Empire?</a>,&#x201D; <em>slate.com</em>, October 20, 2011.</li>
<li>Leslie Lamport: &#x201C;<a href="http://research.microsoft.com/en-us/um/people/lamport/pubs/pubs.html" target="_blank">My Writings</a>,&#x201D; <em>research.microsoft.com</em>, December 16, 2014. This page can be found by searching the web for the 23-character string obtained by removing the hyphens from the string <code>allla-mport-spubso-ntheweb</code>.</li>
<li>John Rushby:   &#x201C;<a href="http://www.csl.sri.com/papers/emsoft01/emsoft01.pdf" target="_blank">Bus Architectures for   Safety-Critical Embedded Systems</a>,&#x201D; at <em>1st International Workshop on Embedded Software</em>   (EMSOFT), October 2001.</li>
<li>Jake Edge:  &#x201C;<a href="http://lwn.net/Articles/540368/" target="_blank">ELC: SpaceX Lessons Learned</a>,&#x201D; <em>lwn.net</em>,  March 6, 2013.</li>
<li>Andrew Miller and Joseph J. LaViola, Jr.:  &#x201C;<a href="http://nakamotoinstitute.org/static/docs/anonymous-byzantine-consensus.pdf" target="_blank">Anonymous   Byzantine Consensus from Moderately-Hard Puzzles: A Model for Bitcoin</a>,&#x201D; University of Central  Florida, Technical Report CS-TR-14-01, April 2014.</li>
<li>James Mickens: &#x201C;<a href="https://www.usenix.org/system/files/login-logout_1305_mickens.pdf" target="_blank">The Saddest Moment</a>,&#x201D; <em>USENIX ;login: logout</em>, May 2013.</li>
<li>Evan Gilman:   &#x201C;<a href="http://www.pagerduty.com/blog/the-discovery-of-apache-zookeepers-poison-packet/" target="_blank">The   Discovery of Apache ZooKeeper&#x2019;s Poison Packet</a>,&#x201D; <em>pagerduty.com</em>, May 7, 2015.</li>
<li>Jonathan Stone and Craig Partridge:   &#x201C;<a href="http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.27.7611&amp;rep=rep1&amp;type=pdf" target="_blank">When   the CRC and TCP Checksum Disagree</a>,&#x201D; at <em>ACM Conference on Applications,  Technologies, Architectures, and Protocols for Computer Communication</em> (SIGCOMM), August 2000.  <a href="http://dx.doi.org/10.1145/347059.347561" target="_blank">doi:10.1145/347059.347561</a></li>
<li>Evan Jones:  &#x201C;<a href="http://www.evanjones.ca/tcp-and-ethernet-checksums-fail.html" target="_blank">How Both TCP and Ethernet   Checksums Fail</a>,&#x201D; <em>evanjones.ca</em>, October 5, 2015.</li>
<li>Cynthia Dwork, Nancy Lynch, and Larry Stockmeyer:  &#x201C;<a href="http://www.net.t-labs.tu-berlin.de/~petr/ADC-07/papers/DLS88.pdf" target="_blank">Consensus in the   Presence of Partial Synchrony</a>,&#x201D; <em>Journal of the ACM</em>, volume 35, number 2, pages 288&#x2013;323,  April 1988. <a href="http://dx.doi.org/10.1145/42282.42283" target="_blank">doi:10.1145/42282.42283</a></li>
<li>Peter Bailis and Ali Ghodsi: &#x201C;<a href="http://queue.acm.org/detail.cfm?id=2462076" target="_blank">Eventual Consistency Today: Limitations, Extensions, and Beyond</a>,&#x201D; <em>ACM Queue</em>, volume 11, number 3, pages 55-63, March 2013. <a href="http://dx.doi.org/10.1145/2460276.2462076" target="_blank">doi:10.1145/2460276.2462076</a></li>
<li>Bowen Alpern and Fred B. Schneider: &#x201C;<a href="https://www.cs.cornell.edu/fbs/publications/DefLiveness.pdf" target="_blank">Defining Liveness</a>,&#x201D; <em>Information Processing Letters</em>, volume 21, number 4, pages 181&#x2013;185, October 1985. <a href="http://dx.doi.org/10.1016/0020-0190(85" target="_blank">doi:10.1016/0020-0190(85)90056-0</a>90056-0)</li>
<li>Flavio P. Junqueira: &#x201C;<a href="http://fpj.me/2015/05/28/dude-wheres-my-metadata/" target="_blank">Dude, Where&#x2019;s My Metadata?</a>,&#x201D; <em>fpj.me</em>, May 28, 2015.</li>
<li>Scott Sanders: &#x201C;<a href="https://github.com/blog/2106-january-28th-incident-report" target="_blank">January 28th Incident Report</a>,&#x201D; <em>github.com</em>, February 3, 2016.</li>
<li>Jay Kreps: &#x201C;<a href="http://blog.empathybox.com/post/62279088548/a-few-notes-on-kafka-and-jepsen" target="_blank">A Few Notes on Kafka and Jepsen</a>,&#x201D; <em>blog.empathybox.com</em>, September 25, 2013.</li>
<li>Thanh Do, Mingzhe Hao, Tanakorn Leesatapornwongsa, et al.: &#x201C;<a href="http://ucare.cs.uchicago.edu/pdf/socc13-limplock.pdf" target="_blank">Limplock: Understanding the Impact of Limpware on Scale-out Cloud Systems</a>,&#x201D; at <em>4th ACM Symposium on Cloud Computing</em> (SoCC), October 2013. <a href="http://dx.doi.org/10.1145/2523616.2523627" target="_blank">doi:10.1145/2523616.2523627</a></li>
<li>Frank McSherry, Michael Isard, and Derek G. Murray: &#x201C;<a href="http://www.frankmcsherry.org/assets/COST.pdf" target="_blank">Scalability! But at What COST?</a>,&#x201D; at <em>15th USENIX Workshop on Hot Topics in Operating Systems</em> (HotOS), May 2015.</li>
</ol>
<hr>
<table>
<thead>
<tr>
<th>&#x4E0A;&#x4E00;&#x7AE0;</th>
<th>&#x76EE;&#x5F55;</th>
<th>&#x4E0B;&#x4E00;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><a href="ch7.html">&#x7B2C;&#x4E03;&#x7AE0;&#xFF1A;&#x4E8B;&#x52A1;</a></td>
<td><a href="./">&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;</a></td>
<td><a href="ch9.html">&#x7B2C;&#x4E5D;&#x7AE0;&#xFF1A;&#x4E00;&#x81F4;&#x6027;&#x4E0E;&#x5171;&#x8BC6;</a></td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch7.html" class="navigation navigation-prev " aria-label="Previous page: 第七章：事务">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch9.html" class="navigation navigation-next " aria-label="Next page: 第九章：一致性与共识">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第八章：分布式系统的麻烦","level":"1.4.4","depth":2,"next":{"title":"第九章：一致性与共识","level":"1.4.5","depth":2,"path":"ch9.md","ref":"ch9.md","articles":[]},"previous":{"title":"第七章：事务","level":"1.4.3","depth":2,"path":"ch7.md","ref":"ch7.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/KnowledgeHive"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch8.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-12T15:31:17.016Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

