
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>术语表 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="colophon.html" />
    
    
    <link rel="prev" href="ch12.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >术语表</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x672F;&#x8BED;&#x8868;-&#x3010;draft&#x3011;">&#x672F;&#x8BED;&#x8868; &#x3010;DRAFT&#x3011;</h1>
<blockquote>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x672C;&#x672F;&#x8BED;&#x8868;&#x4E2D;&#x7684;&#x5B9A;&#x4E49;&#x7B80;&#x77ED;&#x800C;&#x7B80;&#x5355;&#xFF0C;&#x65E8;&#x5728;&#x4F20;&#x8FBE;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x672F;&#x8BED;&#x7684;&#x5B8C;&#x6574;&#x7EC6;&#x5FAE;&#x4E4B;&#x5904;&#x3002; &#x6709;&#x5173;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x6B63;&#x6587;&#x4E2D;&#x7684;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x3002;</p>
</blockquote>
<p>[TOC]</p>
<h3 id="&#x5F02;&#x6B65;&#xFF08;asynchronous&#xFF09;">&#x5F02;&#x6B65;&#xFF08;asynchronous&#xFF09;</h3>
<p>&#x4E0D;&#x7B49;&#x5F85;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#x5B8C;&#x6210;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x53D1;&#x9001;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x5047;&#x8BBE;&#x8981;&#x82B1;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;153&#x9875;&#x4E0A;&#x7684;&#x201C;&#x540C;&#x6B65;&#x4E0E;&#x5F02;&#x6B65;&#x590D;&#x5236;&#x201D;&#xFF0C;&#x7B2C;284&#x9875;&#x4E0A;&#x7684;&#x201C;&#x540C;&#x6B65;&#x4E0E;&#x5F02;&#x6B65;&#x7F51;&#x7EDC;&#x201D;&#xFF0C;&#x4EE5;&#x53CA;&#x7B2C;306&#x9875;&#x4E0A;&#x7684;&#x201C;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x4E0E;&#x73B0;&#x5B9E;&#x201D;&#x3002;</p>
<h3 id="&#x539F;&#x5B50;&#xFF08;atomic&#xFF09;">&#x539F;&#x5B50;&#xFF08;atomic&#xFF09;</h3>
<p>1.&#x5728;&#x5E76;&#x53D1;&#x64CD;&#x4F5C;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF1A;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x5728;&#x5355;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#x770B;&#x8D77;&#x6765;&#x751F;&#x6548;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6240;&#x4EE5;&#x53E6;&#x4E00;&#x4E2A;&#x5E76;&#x53D1;&#x8FDB;&#x7A0B;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x9047;&#x5230;&#x5904;&#x4E8E;&#x201C;&#x534A;&#x5B8C;&#x6210;&#x201D;&#x72B6;&#x6001;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x53E6;&#x89C1;&#x9694;&#x79BB;&#x3002;</p>
<p>2.&#x5728;&#x4E8B;&#x52A1;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF1A;&#x5C06;&#x4E00;&#x4E9B;&#x5199;&#x5165;&#x64CD;&#x4F5C;&#x5206;&#x4E3A;&#x4E00;&#x7EC4;&#xFF0C;&#x8FD9;&#x7EC4;&#x5199;&#x5165;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x63D0;&#x4EA4;&#x6210;&#x529F;&#xFF0C;&#x8981;&#x4E48;&#x9047;&#x5230;&#x9519;&#x8BEF;&#x65F6;&#x5168;&#x90E8;&#x56DE;&#x6EDA;&#x3002;&#x53C2;&#x89C1;&#x7B2C;223&#x9875;&#x7684;&#x201C;&#x539F;&#x5B50;&#x6027;&#x201D;&#x548C;&#x7B2C;354&#x9875;&#x7684;&#x201C;&#x539F;&#x5B50;&#x63D0;&#x4EA4;&#x548C;&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#xFF08;2PC&#xFF09;&#x201D;&#x3002;</p>
<h3 id="&#x80CC;&#x538B;&#xFF08;backpressure&#xFF09;">&#x80CC;&#x538B;&#xFF08;backpressure&#xFF09;</h3>
<p>&#x63A5;&#x6536;&#x65B9;&#x63A5;&#x6536;&#x6570;&#x636E;&#x901F;&#x5EA6;&#x8F83;&#x6162;&#x65F6;&#xFF0C;&#x5F3A;&#x5236;&#x964D;&#x4F4E;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x6570;&#x636E;&#x53D1;&#x9001;&#x901F;&#x5EA6;&#x3002;&#x4E5F;&#x79F0;&#x4E3A;&#x6D41;&#x91CF;&#x63A7;&#x5236;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;441&#x9875;&#x4E0A;&#x7684;&#x201C;&#x6D88;&#x606F;&#x7CFB;&#x7EDF;&#x201D;&#x3002;</p>
<h3 id="&#x6279;&#x5904;&#x7406;&#xFF08;batch-process&#xFF09;">&#x6279;&#x5904;&#x7406;&#xFF08;batch process&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x8BA1;&#x7B97;&#xFF0C;&#x5B83;&#x5C06;&#x4E00;&#x4E9B;&#x56FA;&#x5B9A;&#x7684;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x5927;&#x7684;&#xFF09;&#x6570;&#x636E;&#x96C6;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x8F93;&#x51FA;&#xFF0C;&#x800C;&#x4E0D;&#x4FEE;&#x6539;&#x8F93;&#x5165;&#x3002;&#x89C1;&#x7B2C;&#x5341;&#x7AE0;&#x3002;</p>
<h3 id="&#x8FB9;&#x754C;&#xFF08;bounded&#xFF09;">&#x8FB9;&#x754C;&#xFF08;bounded&#xFF09;</h3>
<p>&#x6709;&#x4E00;&#x4E9B;&#x5DF2;&#x77E5;&#x7684;&#x4E0A;&#x9650;&#x6216;&#x5927;&#x5C0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7F51;&#x7EDC;&#x5EF6;&#x8FDF;&#x60C5;&#x51B5;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x201C;&#x8D85;&#x65F6;&#x548C;&#x672A;&#x5B9A;&#x4E49;&#x7684;&#x5EF6;&#x8FDF;&#x201D;&#x5728;&#x672C;&#x9875;281&#xFF09;&#x548C;&#x6570;&#x636E;&#x96C6;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;11&#x7AE0;&#x7684;&#x4ECB;&#x7ECD;&#xFF09;&#x3002;</p>
<h3 id="&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;&#xFF08;byzantine-fault&#xFF09;">&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;&#xFF08;Byzantine fault&#xFF09;</h3>
<p>&#x8868;&#x73B0;&#x5F02;&#x5E38;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x79CD;&#x5F02;&#x5E38;&#x53EF;&#x80FD;&#x4EE5;&#x4EFB;&#x610F;&#x65B9;&#x5F0F;&#x51FA;&#x73B0;&#xFF0C;&#x4F8B;&#x5982;&#x5411;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x77DB;&#x76FE;&#x6216;&#x6076;&#x610F;&#x6D88;&#x606F;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;304&#x9875;&#x4E0A;&#x7684;&#x201C;&#x62DC;&#x5360;&#x5EAD;&#x6545;&#x969C;&#x201D;&#x3002;</p>
<h3 id="&#x7F13;&#x5B58;&#xFF08;cache&#xFF09;">&#x7F13;&#x5B58;&#xFF08;cache&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x7EC4;&#x4EF6;&#xFF0C;&#x901A;&#x8FC7;&#x5B58;&#x50A8;&#x6700;&#x8FD1;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x52A0;&#x5FEB;&#x672A;&#x6765;&#x5BF9;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x53D6;&#x901F;&#x5EA6;&#x3002;&#x7F13;&#x5B58;&#x4E2D;&#x901A;&#x5E38;&#x5B58;&#x653E;&#x90E8;&#x5206;&#x6570;&#x636E;&#xFF1A;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x7F13;&#x5B58;&#x4E2D;&#x7F3A;&#x5C11;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x4ECE;&#x67D0;&#x4E9B;&#x5E95;&#x5C42;&#x8F83;&#x6162;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x83B7;&#x53D6;&#x5B8C;&#x6574;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#x3002;</p>
<h3 id="cap&#x5B9A;&#x7406;&#xFF08;cap-theorem&#xFF09;">CAP&#x5B9A;&#x7406;&#xFF08;CAP theorem&#xFF09;</h3>
<p>&#x4E00;&#x4E2A;&#x88AB;&#x5E7F;&#x6CDB;&#x8BEF;&#x89E3;&#x7684;&#x7406;&#x8BBA;&#x7ED3;&#x679C;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x662F;&#x6CA1;&#x6709;&#x7528;&#x7684;&#x3002;&#x53C2;&#x89C1;&#x7B2C;336&#x9875;&#x7684;&#x201C;CAP&#x5B9A;&#x7406;&#x201D;&#x3002;</p>
<h3 id="&#x56E0;&#x679C;&#x5173;&#x7CFB;&#xFF08;causality&#xFF09;">&#x56E0;&#x679C;&#x5173;&#x7CFB;&#xFF08;causality&#xFF09;</h3>
<p>&#x4E8B;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5F53;&#x4E00;&#x4EF6;&#x4E8B;&#x53D1;&#x751F;&#x5728;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x4E4B;&#x524D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x540E;&#x9762;&#x7684;&#x4E8B;&#x4EF6;&#x662F;&#x5BF9;&#x65E9;&#x671F;&#x4E8B;&#x4EF6;&#x7684;&#x56DE;&#x5E94;&#xFF0C;&#x6216;&#x8005;&#x4F9D;&#x8D56;&#x4E8E;&#x66F4;&#x65E9;&#x7684;&#x4E8B;&#x4EF6;&#xFF0C;&#x6216;&#x8005;&#x5E94;&#x8BE5;&#x6839;&#x636E;&#x5148;&#x524D;&#x7684;&#x4E8B;&#x4EF6;&#x6765;&#x7406;&#x89E3;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;186&#x9875;&#x4E0A;&#x7684;&#x201C;&#x53D1;&#x751F;&#x4E4B;&#x524D;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x5E76;&#x53D1;&#x6027;&#x201D;&#x548C;&#x7B2C;339&#x9875;&#x4E0A;&#x7684;&#x201C;&#x6392;&#x5E8F;&#x548C;&#x56E0;&#x679C;&#x5173;&#x7CFB;&#x201D;&#x3002;</p>
<h3 id="&#x5171;&#x8BC6;&#xFF08;consensus&#xFF09;">&#x5171;&#x8BC6;&#xFF08;consensus&#xFF09;</h3>
<p>&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x51E0;&#x4E2A;&#x8282;&#x70B9;&#x540C;&#x610F;&#x67D0;&#x4E9B;&#x4E8B;&#x60C5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x54EA;&#x4E2A;&#x8282;&#x70B9;&#x5E94;&#x8BE5;&#x662F;&#x6570;&#x636E;&#x5E93;&#x96C6;&#x7FA4;&#x7684;&#x9886;&#x5BFC;&#x8005;&#xFF09;&#x3002;&#x95EE;&#x9898;&#x6BD4;&#x4E4D;&#x770B;&#x8D77;&#x6765;&#x8981;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;364&#x9875;&#x4E0A;&#x7684;&#x201C;&#x5BB9;&#x9519;&#x5171;&#x8BC6;&#x201D;&#x3002;</p>
<h3 id="&#x6570;&#x636E;&#x4ED3;&#x5E93;&#xFF08;data-warehouse&#xFF09;">&#x6570;&#x636E;&#x4ED3;&#x5E93;&#xFF08;data warehouse&#xFF09;</h3>
<p>&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5176;&#x4E2D;&#x6765;&#x81EA;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;OLTP&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x88AB;&#x5408;&#x5E76;&#x548C;&#x51C6;&#x5907;&#x7528;&#x4E8E;&#x5206;&#x6790;&#x76EE;&#x7684;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;91&#x9875;&#x4E0A;&#x7684;&#x201C;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x201D;&#x3002;</p>
<h3 id="&#x58F0;&#x660E;&#x5F0F;&#xFF08;declarative&#xFF09;">&#x58F0;&#x660E;&#x5F0F;&#xFF08;declarative&#xFF09;</h3>
<p>&#x63CF;&#x8FF0;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x5E94;&#x6709;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#x7684;&#x786E;&#x5207;&#x6B65;&#x9AA4;&#x3002;&#x5728;&#x67E5;&#x8BE2;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x5668;&#x91C7;&#x7528;&#x58F0;&#x660E;&#x6027;&#x67E5;&#x8BE2;&#x5E76;&#x51B3;&#x5B9A;&#x5982;&#x4F55;&#x6700;&#x597D;&#x5730;&#x6267;&#x884C;&#x5B83;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;42&#x9875;&#x4E0A;&#x7684;&#x201C;&#x6570;&#x636E;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x201D;&#x3002;</p>
<h3 id="&#x975E;&#x89C4;&#x8303;&#x5316;&#xFF08;denormalize&#xFF09;">&#x975E;&#x89C4;&#x8303;&#x5316;&#xFF08;denormalize&#xFF09;</h3>
<p>&#x4E3A;&#x4E86;&#x52A0;&#x901F;&#x8BFB;&#x53D6;&#xFF0C;&#x5728;&#x6807;&#x51C6;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x5F15;&#x5165;&#x4E00;&#x4E9B;&#x5197;&#x4F59;&#x6216;&#x91CD;&#x590D;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x5E38;&#x91C7;&#x7528;&#x7F13;&#x5B58;&#x6216;&#x7D22;&#x5F15;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x975E;&#x89C4;&#x8303;&#x5316;&#x7684;&#x503C;&#x662F;&#x4E00;&#x79CD;&#x9884;&#x5148;&#x8BA1;&#x7B97;&#x7684;&#x67E5;&#x8BE2;&#x7ED3;&#x679C;&#xFF0C;&#x50CF;&#x7269;&#x5316;&#x89C6;&#x56FE;&#x3002;&#x8BF7;&#x53C2;&#x89C1;&#x201C;&#x5355;&#x5BF9;&#x8C61;&#x548C;&#x591A;&#x5BF9;&#x8C61;&#x64CD;&#x4F5C;&#x201D;&#xFF08;&#x7B2C;228&#x9875;&#xFF09;&#x548C;&#x201C;&#x4ECE;&#x540C;&#x4E00;&#x4E8B;&#x4EF6;&#x65E5;&#x5FD7;&#x4E2D;&#x6D3E;&#x751F;&#x591A;&#x4E2A;&#x89C6;&#x56FE;&#x201D;&#xFF08;&#x7B2C;461&#x9875;&#xFF09;&#x3002;</p>
<h3 id="&#x884D;&#x751F;&#x6570;&#x636E;&#xFF08;derived-data&#xFF09;">&#x884D;&#x751F;&#x6570;&#x636E;&#xFF08;derived data&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x6839;&#x636E;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x901A;&#x8FC7;&#x53EF;&#x91CD;&#x590D;&#x8FD0;&#x884C;&#x7684;&#x6D41;&#x7A0B;&#x521B;&#x5EFA;&#x3002;&#x5FC5;&#x8981;&#x65F6;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x8BE5;&#x6D41;&#x7A0B;&#x518D;&#x6B21;&#x521B;&#x5EFA;&#x884D;&#x751F;&#x6570;&#x636E;&#x3002;&#x884D;&#x751F;&#x6570;&#x636E;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x63D0;&#x9AD8;&#x7279;&#x5B9A;&#x6570;&#x636E;&#x7684;&#x8BFB;&#x53D6;&#x901F;&#x5EA6;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x884D;&#x751F;&#x6570;&#x636E;&#x6709;&#x7D22;&#x5F15;&#x3001;&#x7F13;&#x5B58;&#x548C;&#x7269;&#x5316;&#x89C6;&#x56FE;&#x3002;&#x53C2;&#x89C1;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="&#x786E;&#x5B9A;&#x6027;&#xFF08;deterministic&#xFF09;">&#x786E;&#x5B9A;&#x6027;&#xFF08;deterministic&#xFF09;</h3>
<p>&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x7ED9;&#x5B83;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x5219;&#x603B;&#x662F;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4E0D;&#x80FD;&#x4F9D;&#x8D56;&#x4E8E;&#x968F;&#x673A;&#x6570;&#x5B57;&#x3001;&#x65F6;&#x95F4;&#x3001;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x6216;&#x5176;&#x4ED6;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<h3 id="&#x5206;&#x5E03;&#x5F0F;&#xFF08;distributed&#xFF09;">&#x5206;&#x5E03;&#x5F0F;&#xFF08;distributed&#xFF09;</h3>
<p>&#x5728;&#x7531;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x5BF9;&#x4E8E;&#x90E8;&#x5206;&#x8282;&#x70B9;&#x6545;&#x969C;&#xFF0C;&#x5177;&#x6709;&#x5BB9;&#x9519;&#x6027;&#xFF1A;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x53D1;&#x751F;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x4ECD;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F6F;&#x4EF6;&#x65E0;&#x9700;&#x4E86;&#x89E3;&#x6545;&#x969C;&#x76F8;&#x5173;&#x7684;&#x786E;&#x5207;&#x60C5;&#x51B5;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;274&#x9875;&#x4E0A;&#x7684;&#x201C;&#x6545;&#x969C;&#x548C;&#x90E8;&#x5206;&#x6545;&#x969C;&#x201D;&#x3002;</p>
<h3 id="&#x6301;&#x4E45;&#xFF08;durable&#xFF09;">&#x6301;&#x4E45;&#xFF08;durable&#xFF09;</h3>
<p>&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#x6570;&#x636E;&#xFF0C;&#x5373;&#x4F7F;&#x53D1;&#x751F;&#x5404;&#x79CD;&#x6545;&#x969C;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E22;&#x5931;&#x6570;&#x636E;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;226&#x9875;&#x4E0A;&#x7684;&#x201C;&#x6301;&#x4E45;&#x6027;&#x201D;&#x3002;</p>
<h3 id="etl&#xFF08;extract-transform-load&#xFF09;">ETL&#xFF08;Extract-Transform-Load&#xFF09;</h3>
<p>&#x63D0;&#x53D6;-&#x8F6C;&#x6362;-&#x52A0;&#x8F7D;&#xFF08;Extract-Transform-Load&#xFF09;&#x3002;&#x4ECE;&#x6E90;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x63D0;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x66F4;&#x9002;&#x5408;&#x5206;&#x6790;&#x67E5;&#x8BE2;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x52A0;&#x8F7D;&#x5230;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x6216;&#x6279;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;91&#x9875;&#x4E0A;&#x7684;&#x201C;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x201D;&#x3002;</p>
<h3 id="&#x6545;&#x969C;&#x5207;&#x6362;&#xFF08;failover&#xFF09;">&#x6545;&#x969C;&#x5207;&#x6362;&#xFF08;failover&#xFF09;</h3>
<p>&#x5728;&#x5177;&#x6709;&#x5355;&#x4E00;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6545;&#x969C;&#x5207;&#x6362;&#x662F;&#x5C06;&#x9886;&#x5BFC;&#x89D2;&#x8272;&#x4ECE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x8F6C;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;156&#x9875;&#x7684;&#x201C;&#x5904;&#x7406;&#x8282;&#x70B9;&#x6545;&#x969C;&#x201D;&#x3002;</p>
<h3 id="&#x5BB9;&#x9519;&#xFF08;fault-tolerant&#xFF09;">&#x5BB9;&#x9519;&#xFF08;fault-tolerant&#xFF09;</h3>
<p>&#x5982;&#x679C;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x673A;&#x5668;&#x5D29;&#x6E83;&#x6216;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x5931;&#x8D25;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x6062;&#x590D;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;6&#x9875;&#x4E0A;&#x7684;&#x201C;&#x53EF;&#x9760;&#x6027;&#x201D;&#x3002;</p>
<h3 id="&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF08;flow-control&#xFF09;">&#x6D41;&#x91CF;&#x63A7;&#x5236;&#xFF08;flow control&#xFF09;</h3>
<p>&#x89C1;&#x80CC;&#x538B;&#xFF08;backpressure&#xFF09;&#x3002;</p>
<h3 id="&#x8FFD;&#x968F;&#x8005;&#xFF08;follower&#xFF09;">&#x8FFD;&#x968F;&#x8005;&#xFF08;follower&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x6570;&#x636E;&#x526F;&#x672C;&#xFF0C;&#x4EC5;&#x5904;&#x7406;&#x9886;&#x5BFC;&#x8005;&#x53D1;&#x51FA;&#x7684;&#x6570;&#x636E;&#x53D8;&#x66F4;&#xFF0C;&#x4E0D;&#x76F4;&#x63A5;&#x63A5;&#x53D7;&#x6765;&#x81EA;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4EFB;&#x4F55;&#x5199;&#x5165;&#x3002;&#x4E5F;&#x79F0;&#x4E3A;&#x8F85;&#x52A9;&#x3001;&#x4EC6;&#x4ECE;&#x3001;&#x53EA;&#x8BFB;&#x526F;&#x672C;&#x6216;&#x70ED;&#x5907;&#x4EFD;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;152&#x9875;&#x4E0A;&#x7684;&#x201C;&#x9886;&#x5BFC;&#x548C;&#x8FFD;&#x968F;&#x8005;&#x201D;&#x3002;</p>
<h3 id="&#x5168;&#x6587;&#x68C0;&#x7D22;&#xFF08;full-text-search&#xFF09;">&#x5168;&#x6587;&#x68C0;&#x7D22;&#xFF08;full-text search&#xFF09;</h3>
<p>&#x901A;&#x8FC7;&#x4EFB;&#x610F;&#x5173;&#x952E;&#x5B57;&#x6765;&#x641C;&#x7D22;&#x6587;&#x672C;&#xFF0C;&#x901A;&#x5E38;&#x5177;&#x6709;&#x9644;&#x52A0;&#x7279;&#x5F81;&#xFF0C;&#x4F8B;&#x5982;&#x5339;&#x914D;&#x7C7B;&#x4F3C;&#x7684;&#x62FC;&#x5199;&#x8BCD;&#x6216;&#x540C;&#x4E49;&#x8BCD;&#x3002;&#x5168;&#x6587;&#x7D22;&#x5F15;&#x662F;&#x4E00;&#x79CD;&#x652F;&#x6301;&#x8FD9;&#x79CD;&#x67E5;&#x8BE2;&#x7684;&#x6B21;&#x7EA7;&#x7D22;&#x5F15;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;88&#x9875;&#x4E0A;&#x7684;&#x201C;&#x5168;&#x6587;&#x641C;&#x7D22;&#x548C;&#x6A21;&#x7CCA;&#x7D22;&#x5F15;&#x201D;&#x3002;</p>
<h3 id="&#x56FE;&#xFF08;graph&#xFF09;">&#x56FE;&#xFF08;graph&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7531;&#x9876;&#x70B9;&#xFF08;&#x53EF;&#x4EE5;&#x6307;&#x5411;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x8282;&#x70B9;&#x6216;&#x5B9E;&#x4F53;&#xFF09;&#x548C;&#x8FB9;&#xFF08;&#x4ECE;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x9876;&#x70B9;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x5173;&#x7CFB;&#x6216;&#x5F27;&#xFF09;&#x7EC4;&#x6210;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;49&#x9875;&#x4E0A;&#x7684;&#x201C;&#x548C;&#x56FE;&#x76F8;&#x4F3C;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x201D;&#x3002; </p>
<h3 id="&#x6563;&#x5217;&#xFF08;hash&#xFF09;">&#x6563;&#x5217;&#xFF08;hash&#xFF09;</h3>
<p>&#x5C06;&#x8F93;&#x5165;&#x8F6C;&#x6362;&#x4E3A;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x968F;&#x673A;&#x6570;&#x503C;&#x7684;&#x51FD;&#x6570;&#x3002;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x5165;&#x4F1A;&#x8F6C;&#x6362;&#x4E3A;&#x76F8;&#x540C;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x4E00;&#x822C;&#x4F1A;&#x8F6C;&#x6362;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x8F6C;&#x6362;&#x4E3A;&#x76F8;&#x540C;&#x6570;&#x503C;&#xFF08;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x51B2;&#x7A81;&#xFF09;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;203&#x9875;&#x7684;&#x201C;&#x6839;&#x636E;&#x952E;&#x7684;&#x6563;&#x5217;&#x503C;&#x5206;&#x9694;&#x201D;&#x3002;</p>
<h3 id="&#x5E42;&#x7B49;&#xFF08;idempotent&#xFF09;">&#x5E42;&#x7B49;&#xFF08;idempotent&#xFF09;</h3>
<p>&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x4E00;&#x79CD;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x91CD;&#x8BD5;&#x6267;&#x884C;&#xFF0C;&#x5373;&#x6267;&#x884C;&#x591A;&#x6B21;&#x7684;&#x6548;&#x679C;&#x548C;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x7684;&#x6548;&#x679C;&#x76F8;&#x540C;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;478&#x9875;&#x7684;&#x201C;&#x5E42;&#x7B49;&#x201D;&#x3002;</p>
<h3 id="&#x7D22;&#x5F15;&#xFF08;index&#xFF09;">&#x7D22;&#x5F15;&#xFF08;index&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x901A;&#x8FC7;&#x7D22;&#x5F15;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x7279;&#x5B9A;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x6570;&#x636E;&#x8BB0;&#x5F55;&#x4E2D;&#x8FDB;&#x884C;&#x9AD8;&#x6548;&#x68C0;&#x7D22;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;70&#x9875;&#x7684;&#x201C;&#x8BA9;&#x6570;&#x636E;&#x5E93;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x201D;&#x3002;</p>
<h3 id="&#x9694;&#x79BB;&#x6027;&#xFF08;isolation&#xFF09;">&#x9694;&#x79BB;&#x6027;&#xFF08;isolation&#xFF09;</h3>
<p>&#x5728;&#x4E8B;&#x52A1;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#x7684;&#x4E92;&#x76F8;&#x5E72;&#x6270;&#x7A0B;&#x5EA6;&#x3002;&#x4E32;&#x884C;&#x8FD0;&#x884C;&#x5177;&#x6709;&#x6700;&#x5F3A;&#x7684;&#x9694;&#x79BB;&#x6027;&#xFF0C;&#x4E0D;&#x8FC7;&#x5176;&#x5B83;&#x7A0B;&#x5EA6;&#x7684;&#x9694;&#x79BB;&#x4E5F;&#x901A;&#x5E38;&#x88AB;&#x4F7F;&#x7528;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;225&#x9875;&#x7684;&#x201C;&#x9694;&#x79BB;&#x201D;&#x3002;</p>
<h3 id="&#x8FDE;&#x63A5;&#xFF08;join&#xFF09;">&#x8FDE;&#x63A5;&#xFF08;join&#xFF09;</h3>
<p>&#x6C47;&#x96C6;&#x6709;&#x5171;&#x540C;&#x70B9;&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x4E0E;&#x53E6;&#x4E00;&#x4E2A;&#x8BB0;&#x5F55;&#x6709;&#x5173;&#xFF08;&#x5916;&#x952E;&#xFF0C;&#x6587;&#x6863;&#x53C2;&#x8003;&#xFF0C;&#x56FE;&#x4E2D;&#x7684;&#x8FB9;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6700;&#x5E38;&#x7528;&#xFF0C;&#x67E5;&#x8BE2;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x53C2;&#x8003;&#x6240;&#x6307;&#x5411;&#x7684;&#x8BB0;&#x5F55;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;33&#x9875;&#x4E0A;&#x7684;&#x201C;&#x591A;&#x5BF9;&#x4E00;&#x548C;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x201D;&#x548C;&#x7B2C;393&#x9875;&#x4E0A;&#x7684;&#x201C;&#x51CF;&#x5C11;&#x7AEF;&#x8FDE;&#x63A5;&#x548C;&#x5206;&#x7EC4;&#x201D;&#x3002;</p>
<h3 id="&#x9886;&#x5BFC;&#x8005;&#xFF08;leader&#xFF09;">&#x9886;&#x5BFC;&#x8005;&#xFF08;leader&#xFF09;</h3>
<p>&#x5F53;&#x6570;&#x636E;&#x6216;&#x670D;&#x52A1;&#x88AB;&#x590D;&#x5236;&#x5230;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x65F6;&#xFF0C;&#x7531;&#x9886;&#x5BFC;&#x8005;&#x5206;&#x53D1;&#x5DF2;&#x6388;&#x6743;&#x53D8;&#x66F4;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#x3002;&#x9886;&#x5BFC;&#x8005;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67D0;&#x4E9B;&#x534F;&#x8BAE;&#x9009;&#x4E3E;&#x4EA7;&#x751F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7531;&#x7BA1;&#x7406;&#x8005;&#x624B;&#x52A8;&#x9009;&#x62E9;&#x3002;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x4E3B;&#x4EBA;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;152&#x9875;&#x7684;&#x201C;&#x9886;&#x5BFC;&#x8005;&#x548C;&#x8FFD;&#x968F;&#x8005;&#x201D;&#x3002;</p>
<h3 id="&#x7EBF;&#x6027;&#x5316;&#xFF08;linearizable&#xFF09;">&#x7EBF;&#x6027;&#x5316;&#xFF08;linearizable&#xFF09;</h3>
<p>&#x8868;&#x73B0;&#x4E3A;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EA;&#x6709;&#x4E00;&#x4EFD;&#x901A;&#x8FC7;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x66F4;&#x65B0;&#x7684;&#x6570;&#x636E;&#x526F;&#x672C;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;324&#x9875;&#x7684;&#x201C;&#x7EBF;&#x6027;&#x5316;&#x201D;&#x3002;</p>
<h3 id="&#x5C40;&#x90E8;&#x6027;&#xFF08;locality&#xFF09;">&#x5C40;&#x90E8;&#x6027;&#xFF08;locality&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x65B9;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x7ECF;&#x5E38;&#x5728;&#x76F8;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x8BF7;&#x6C42;&#x4E00;&#x4E9B;&#x79BB;&#x6563;&#x6570;&#x636E;&#xFF0C;&#x628A;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;41&#x9875;&#x7684;&#x201C;&#x8BF7;&#x6C42;&#x6570;&#x636E;&#x7684;&#x5C40;&#x90E8;&#x6027;&#x201D;&#x3002;</p>
<h3 id="&#x9501;&#xFF08;lock&#xFF09;">&#x9501;&#xFF08;lock&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x4FDD;&#x8BC1;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x3001;&#x8282;&#x70B9;&#x6216;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x3001;&#x8282;&#x70B9;&#x6216;&#x4E8B;&#x52A1;&#x60F3;&#x8BBF;&#x95EE;&#x76F8;&#x540C;&#x5143;&#x7D20;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x9501;&#x88AB;&#x91CA;&#x653E;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;257&#x9875;&#x7684;&#x201C;&#x4E24;&#x6BB5;&#x9501;&#xFF08;2PL&#xFF09;&#x201D;&#x548C;301&#x9875;&#x7684;&#x201C;&#x9886;&#x5BFC;&#x8005;&#x548C;&#x9501;&#x201D;&#x3002;</p>
<h3 id="&#x65E5;&#x5FD7;&#xFF08;log&#xFF09;">&#x65E5;&#x5FD7;&#xFF08;log&#xFF09;</h3>
<p>&#x65E5;&#x5FD7;&#x662F;&#x4E00;&#x4E2A;&#x53EA;&#x80FD;&#x4EE5;&#x8FFD;&#x52A0;&#x65B9;&#x5F0F;&#x5199;&#x5165;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x653E;&#x6570;&#x636E;&#x3002;&#x9884;&#x5199;&#x5F0F;&#x65E5;&#x5FD7;&#x7528;&#x4E8E;&#x5728;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x5D29;&#x6E83;&#x65F6;&#x6062;&#x590D;&#x6570;&#x636E;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;82&#x9875;&#x7684;&#x201C;&#x4F7F;&#x4E8C;&#x53C9;&#x6811;&#x66F4;&#x7A33;&#x5B9A;&#x201D;&#xFF09;&#xFF1B;&#x7ED3;&#x6784;&#x5316;&#x65E5;&#x5FD7;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x4F7F;&#x7528;&#x65E5;&#x5FD7;&#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x4E3B;&#x8981;&#x5B58;&#x50A8;&#x683C;&#x5F0F;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;76&#x9875;&#x7684;&#x201C;&#x6709;&#x5E8F;&#x5B57;&#x7B26;&#x4E32;&#x8868;&#x548C;&#x65E5;&#x5FD7;&#x7ED3;&#x6784;&#x7684;&#x5408;&#x5E76;&#x6811;&#x201D;&#xFF09;&#xFF1B;&#x590D;&#x5236;&#x578B;&#x65E5;&#x5FD7;&#x7528;&#x4E8E;&#x628A;&#x5199;&#x5165;&#x4ECE;&#x9886;&#x5BFC;&#x8005;&#x590D;&#x5236;&#x5230;&#x8FFD;&#x968F;&#x8005;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;152&#x9875;&#x7684;&#x201C;&#x9886;&#x5BFC;&#x8005;&#x548C;&#x8FFD;&#x968F;&#x8005;&#x201D;&#xFF09;&#xFF1B;&#x4E8B;&#x4EF6;&#x6027;&#x65E5;&#x5FD7;&#x53EF;&#x4EE5;&#x8868;&#x73B0;&#x4E3A;&#x6570;&#x636E;&#x6D41;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;446&#x9875;&#x7684;&#x201C;&#x5206;&#x6BB5;&#x65E5;&#x5FD7;&#x201D;&#xFF09;&#x3002;</p>
<h3 id="&#x7269;&#x5316;&#xFF08;materialize&#xFF09;">&#x7269;&#x5316;&#xFF08;materialize&#xFF09;</h3>
<p>&#x6025;&#x5207;&#x5730;&#x8BA1;&#x7B97;&#x5E76;&#x5199;&#x51FA;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x8BF7;&#x6C42;&#x65F6;&#x8BA1;&#x7B97;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;101&#x9875;&#x7684;&#x201C;&#x805A;&#x5408;&#xFF1A;&#x6570;&#x636E;&#x7ACB;&#x65B9;&#x548C;&#x7269;&#x5316;&#x89C6;&#x56FE;&#x201D;&#x548C;419&#x9875;&#x7684;&#x201C;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x7684;&#x7269;&#x5316;&#x201D;&#x3002;</p>
<h3 id="&#x8282;&#x70B9;&#xFF08;node&#xFF09;">&#x8282;&#x70B9;&#xFF08;node&#xFF09;</h3>
<p>&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x4E00;&#x4E9B;&#x8F6F;&#x4EF6;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4E0E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x901A;&#x4FE1;&#x4EE5;&#x5B8C;&#x6210;&#x67D0;&#x9879;&#x4EFB;&#x52A1;&#x3002;</p>
<h3 id="&#x89C4;&#x8303;&#x5316;&#xFF08;normalized&#xFF09;">&#x89C4;&#x8303;&#x5316;&#xFF08;normalized&#xFF09;</h3>
<p>&#x4EE5;&#x6CA1;&#x6709;&#x5197;&#x4F59;&#x6216;&#x91CD;&#x590D;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x7ED3;&#x6784;&#x5316;&#x3002; &#x5728;&#x89C4;&#x8303;&#x5316;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5F53;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x590D;&#x5236;&#x5F88;&#x591A;&#x6B21;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;33&#x9875;&#x4E0A;&#x7684;&#x201C;&#x591A;&#x5BF9;&#x4E00;&#x548C;&#x591A;&#x5BF9;&#x591A;&#x5173;&#x7CFB;&#x201D;&#x3002;</p>
<h3 id="olap&#xFF08;online-analytic-processing&#xFF09;">OLAP&#xFF08;Online Analytic Processing&#xFF09;</h3>
<p>&#x5728;&#x7EBF;&#x5206;&#x6790;&#x5904;&#x7406;&#x3002; &#x901A;&#x8FC7;&#x5BF9;&#x5927;&#x91CF;&#x8BB0;&#x5F55;&#x8FDB;&#x884C;&#x805A;&#x5408;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8BA1;&#x6570;&#xFF0C;&#x603B;&#x548C;&#xFF0C;&#x5E73;&#x5747;&#xFF09;&#x6765;&#x8868;&#x5F81;&#x7684;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;90&#x9875;&#x4E0A;&#x7684;&#x201C;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x6216;&#x5206;&#x6790;&#xFF1F;&#x201D;&#x3002;</p>
<h3 id="oltp&#xFF08;online-transaction-processing&#xFF09;">OLTP&#xFF08;Online Transaction Processing&#xFF09;</h3>
<p>&#x5728;&#x7EBF;&#x4E8B;&#x52A1;&#x5904;&#x7406;&#x3002; &#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x7684;&#x7279;&#x70B9;&#x662F;&#x5FEB;&#x901F;&#x67E5;&#x8BE2;&#xFF0C;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x5C11;&#x91CF;&#x8BB0;&#x5F55;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BB0;&#x5F55;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x952E;&#x7D22;&#x5F15;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;90&#x9875;&#x4E0A;&#x7684;&#x201C;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x6216;&#x5206;&#x6790;&#xFF1F;&#x201D;&#x3002;</p>
<h3 id="&#x5206;&#x533A;&#xFF08;partitioning&#xFF09;">&#x5206;&#x533A;&#xFF08;partitioning&#xFF09;</h3>
<p>&#x5C06;&#x5355;&#x673A;&#x4E0A;&#x7684;&#x5927;&#x578B;&#x6570;&#x636E;&#x96C6;&#x6216;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x62C6;&#x5206;&#x4E3A;&#x8F83;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x5E03;&#x5230;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x3002; &#x4E5F;&#x79F0;&#x4E3A;&#x5206;&#x7247;&#x3002; &#x89C1;&#x7B2C;6&#x7AE0;&#x3002;</p>
<h3 id="&#x767E;&#x5206;&#x4F4D;&#x70B9;&#xFF08;percentile&#xFF09;">&#x767E;&#x5206;&#x4F4D;&#x70B9;&#xFF08;percentile&#xFF09;</h3>
<p>&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x6709;&#x591A;&#x5C11;&#x503C;&#x9AD8;&#x4E8E;&#x6216;&#x4F4E;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#x6765;&#x8861;&#x91CF;&#x503C;&#x5206;&#x5E03;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x7684;&#x7B2C;95&#x4E2A;&#x767E;&#x5206;&#x4F4D;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x662F;&#x65F6;&#x95F4;t&#xFF0C;&#x5219;&#x8BE5;&#x65F6;&#x95F4;&#x6BB5;&#x4E2D;&#xFF0C;95&#xFF05;&#x7684;&#x8BF7;&#x6C42;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x5C0F;&#x4E8E;t&#xFF0C;5&#xFF05;&#x7684;&#x8BF7;&#x6C42;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x8981;&#x6BD4;t&#x957F;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;13&#x9875;&#x4E0A;&#x7684;&#x201C;&#x63CF;&#x8FF0;&#x6027;&#x80FD;&#x201D;&#x3002;</p>
<h3 id="&#x4E3B;&#x952E;&#xFF08;primary-key&#xFF09;">&#x4E3B;&#x952E;&#xFF08;primary key&#xFF09;</h3>
<p>&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x8BB0;&#x5F55;&#x7684;&#x503C;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x6570;&#x5B57;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x3002; &#x5728;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x4E3B;&#x952E;&#x7531;&#x7CFB;&#x7EDF;&#x5728;&#x521B;&#x5EFA;&#x8BB0;&#x5F55;&#x65F6;&#x751F;&#x6210;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6309;&#x987A;&#x5E8F;&#x6216;&#x968F;&#x673A;&#xFF09;; &#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x7531;&#x7528;&#x6237;&#x8BBE;&#x7F6E;&#x3002; &#x53E6;&#x8BF7;&#x53C2;&#x9605;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x3002;</p>
<h3 id="&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF08;quorum&#xFF09;">&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF08;quorum&#xFF09;</h3>
<p>&#x5728;&#x64CD;&#x4F5C;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x6295;&#x7968;&#x7684;&#x6700;&#x5C11;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;179&#x9875;&#x4E0A;&#x7684;&#x201C;&#x8BFB;&#x5199;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x201D;&#x3002;</p>
<h3 id="&#x518D;&#x5E73;&#x8861;&#xFF08;rebalance&#xFF09;">&#x518D;&#x5E73;&#x8861;&#xFF08;rebalance&#xFF09;</h3>
<p>&#x5C06;&#x6570;&#x636E;&#x6216;&#x670D;&#x52A1;&#x4ECE;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x79FB;&#x52A8;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4EE5;&#x5B9E;&#x73B0;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;209&#x9875;&#x4E0A;&#x7684;&#x201C;&#x518D;&#x5E73;&#x8861;&#x5206;&#x533A;&#x201D;&#x3002;</p>
<h3 id="&#x590D;&#x5236;&#xFF08;replication&#xFF09;">&#x590D;&#x5236;&#xFF08;replication&#xFF09;</h3>
<p>&#x5728;&#x51E0;&#x4E2A;&#x8282;&#x70B9;&#xFF08;&#x526F;&#x672C;&#xFF09;&#x4E0A;&#x4FDD;&#x7559;&#x76F8;&#x540C;&#x6570;&#x636E;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x67D0;&#x4E9B;&#x8282;&#x70B9;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x4ECD;&#x53EF;&#x8BBF;&#x95EE;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;5&#x7AE0;&#x3002;</p>
<h3 id="&#x6A21;&#x5F0F;&#xFF08;schema&#xFF09;">&#x6A21;&#x5F0F;&#xFF08;schema&#xFF09;</h3>
<p>&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x5305;&#x62EC;&#x5176;&#x5B57;&#x6BB5;&#x548C;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002; &#x53EF;&#x4EE5;&#x5728;&#x6570;&#x636E;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#x68C0;&#x67E5;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x662F;&#x5426;&#x7B26;&#x5408;&#x6A21;&#x5F0F;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;39&#x9875;&#x4E0A;&#x7684;&#x201C;&#x6587;&#x6863;&#x6A21;&#x578B;&#x4E2D;&#x7684;&#x6A21;&#x5F0F;&#x7075;&#x6D3B;&#x6027;&#x201D;&#xFF09;&#xFF0C;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;4&#x7AE0;&#xFF09;&#x3002;</p>
<h3 id="&#x6B21;&#x7EA7;&#x7D22;&#x5F15;&#xFF08;secondary-index&#xFF09;">&#x6B21;&#x7EA7;&#x7D22;&#x5F15;&#xFF08;secondary index&#xFF09;</h3>
<p>&#x4E0E;&#x4E3B;&#x8981;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5668;&#x4E00;&#x8D77;&#x7EF4;&#x62A4;&#x7684;&#x9644;&#x52A0;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4F7F;&#x60A8;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x5730;&#x641C;&#x7D22;&#x4E0E;&#x67D0;&#x79CD;&#x6761;&#x4EF6;&#x76F8;&#x5339;&#x914D;&#x7684;&#x8BB0;&#x5F55;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;85&#x9875;&#x4E0A;&#x7684;&#x201C;&#x5176;&#x4ED6;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x201D;&#x548C;&#x7B2C;206&#x9875;&#x4E0A;&#x7684;&#x201C;&#x5206;&#x533A;&#x548C;&#x4E8C;&#x7EA7;&#x7D22;&#x5F15;&#x201D;&#x3002;</p>
<h3 id="&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;serializable&#xFF09;">&#x53EF;&#x5E8F;&#x5217;&#x5316;&#xFF08;serializable&#xFF09;</h3>
<p>&#x4FDD;&#x8BC1;&#x591A;&#x4E2A;&#x5E76;&#x53D1;&#x4E8B;&#x52A1;&#x540C;&#x65F6;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#x4E0E;&#x6309;&#x987A;&#x5E8F;&#x9010;&#x4E2A;&#x6267;&#x884C;&#x4E8B;&#x52A1;&#x76F8;&#x540C;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;251&#x9875;&#x4E0A;&#x7684;&#x201C;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x201D;&#x3002;</p>
<h3 id="&#x65E0;&#x5171;&#x4EAB;&#xFF08;shared-nothing&#xFF09;">&#x65E0;&#x5171;&#x4EAB;&#xFF08;shared-nothing&#xFF09;</h3>
<p>&#x4E0E;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x6216;&#x5171;&#x4EAB;&#x78C1;&#x76D8;&#x67B6;&#x6784;&#x76F8;&#x6BD4;&#xFF0C;&#x72EC;&#x7ACB;&#x8282;&#x70B9;&#xFF08;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;CPU&#xFF0C;&#x5185;&#x5B58;&#x548C;&#x78C1;&#x76D8;&#xFF09;&#x901A;&#x8FC7;&#x4F20;&#x7EDF;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x3002; &#x89C1;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="&#x504F;&#x659C;&#xFF08;skew&#xFF09;">&#x504F;&#x659C;&#xFF08;skew&#xFF09;</h3>
<p>1.&#x5404;&#x5206;&#x533A;&#x8D1F;&#x8F7D;&#x4E0D;&#x5E73;&#x8861;&#xFF0C;&#x4F8B;&#x5982;&#x67D0;&#x4E9B;&#x5206;&#x533A;&#x6709;&#x5927;&#x91CF;&#x8BF7;&#x6C42;&#x6216;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x5206;&#x533A;&#x5219;&#x5C11;&#x5F97;&#x591A;&#x3002;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x70ED;&#x70B9;&#x3002;&#x8BF7;&#x53C2;&#x9605;&#x7B2C;205&#x9875;&#x4E0A;&#x7684;&#x201C;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x504F;&#x659C;&#x548C;&#x51CF;&#x8F7B;&#x70ED;&#x70B9;&#x201D;&#x548C;&#x7B2C;407&#x9875;&#x4E0A;&#x7684;&#x201C;&#x5904;&#x7406;&#x504F;&#x659C;&#x201D;&#x3002;</p>
<p>2.&#x65F6;&#x95F4;&#x7EBF;&#x5F02;&#x5E38;&#x5BFC;&#x81F4;&#x4E8B;&#x4EF6;&#x4EE5;&#x4E0D;&#x671F;&#x671B;&#x7684;&#x987A;&#x5E8F;&#x51FA;&#x73B0;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;237&#x9875;&#x4E0A;&#x7684;&#x201C;&#x5FEB;&#x7167;&#x9694;&#x79BB;&#x548C;&#x53EF;&#x91CD;&#x590D;&#x8BFB;&#x53D6;&#x201D;&#x4E2D;&#x7684;&#x5173;&#x4E8E;&#x8BFB;&#x53D6;&#x504F;&#x659C;&#x7684;&#x8BA8;&#x8BBA;&#xFF0C;&#x7B2C;246&#x9875;&#x4E0A;&#x7684;&#x201C;&#x5199;&#x5165;&#x504F;&#x659C;&#x548C;&#x6A21;&#x7CCA;&#x201D;&#x4E2D;&#x7684;&#x5199;&#x5165;&#x504F;&#x659C;&#x4EE5;&#x53CA;&#x7B2C;291&#x9875;&#x4E0A;&#x7684;&#x201C;&#x8BA2;&#x8D2D;&#x4E8B;&#x4EF6;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x201D;&#x4E2D;&#x7684;&#x65F6;&#x949F;&#x504F;&#x659C;&#x3002;</p>
<h3 id="&#x8111;&#x88C2;&#xFF08;split-brain&#xFF09;">&#x8111;&#x88C2;&#xFF08;split brain&#xFF09;</h3>
<p>&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#x540C;&#x65F6;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x662F;&#x9886;&#x5BFC;&#x8005;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x8FDD;&#x53CD;&#x7CFB;&#x7EDF;&#x62C5;&#x4FDD;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;156&#x9875;&#x7684;&#x201C;&#x5904;&#x7406;&#x8282;&#x70B9;&#x4E2D;&#x65AD;&#x201D;&#x548C;&#x7B2C;300&#x9875;&#x7684;&#x201C;&#x771F;&#x76F8;&#x7531;&#x591A;&#x6570;&#x5B9A;&#x4E49;&#x201D;&#x3002;</p>
<h3 id="&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF08;stored-procedure&#xFF09;">&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#xFF08;stored procedure&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x5BF9;&#x4E8B;&#x52A1;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x5728;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6267;&#x884C;&#xFF0C;&#x4E8B;&#x52A1;&#x6267;&#x884C;&#x671F;&#x95F4;&#x65E0;&#x9700;&#x4E0E;&#x5BA2;&#x6237;&#x7AEF;&#x901A;&#x4FE1;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;252&#x9875;&#x7684;&#x201C;&#x5B9E;&#x9645;&#x4E32;&#x884C;&#x6267;&#x884C;&#x201D;&#x3002;</p>
<h3 id="&#x6D41;&#x5904;&#x7406;&#xFF08;stream-process&#xFF09;">&#x6D41;&#x5904;&#x7406;&#xFF08;stream process&#xFF09;</h3>
<p>&#x6301;&#x7EED;&#x8FD0;&#x884C;&#x7684;&#x8BA1;&#x7B97;&#x3002;&#x53EF;&#x4EE5;&#x6301;&#x7EED;&#x63A5;&#x6536;&#x4E8B;&#x4EF6;&#x6D41;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x5F97;&#x51FA;&#x4E00;&#x4E9B;&#x8F93;&#x51FA;&#x3002; &#x89C1;&#x7B2C;11&#x7AE0;&#x3002;</p>
<h3 id="&#x540C;&#x6B65;&#xFF08;synchronous&#xFF09;">&#x540C;&#x6B65;&#xFF08;synchronous&#xFF09;</h3>
<p>&#x5F02;&#x6B65;&#x7684;&#x53CD;&#x4E49;&#x8BCD;&#x3002;</p>
<h3 id="&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#xFF08;system-of-record&#xFF09;">&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#xFF08;system of record&#xFF09;</h3>
<p>&#x4E00;&#x4E2A;&#x4FDD;&#x5B58;&#x4E3B;&#x8981;&#x6743;&#x5A01;&#x7248;&#x672C;&#x6570;&#x636E;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x771F;&#x76F8;&#x7684;&#x6765;&#x6E90;&#x3002;&#x9996;&#x5148;&#x5728;&#x8FD9;&#x91CC;&#x5199;&#x5165;&#x6570;&#x636E;&#x53D8;&#x66F4;&#xFF0C;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x96C6;&#x53EF;&#x4EE5;&#x4ECE;&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#x884D;&#x751F;&#x3002; &#x53C2;&#x89C1;&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#x7684;&#x4ECB;&#x7ECD;&#x3002;</p>
<h3 id="&#x8D85;&#x65F6;&#xFF08;timeout&#xFF09;">&#x8D85;&#x65F6;&#xFF08;timeout&#xFF09;</h3>
<p>&#x68C0;&#x6D4B;&#x6545;&#x969C;&#x7684;&#x6700;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x5373;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x89C2;&#x5BDF;&#x662F;&#x5426;&#x7F3A;&#x4E4F;&#x54CD;&#x5E94;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x8D85;&#x65F6;&#x662F;&#x7531;&#x4E8E;&#x8FDC;&#x7A0B;&#x8282;&#x70B9;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#x9020;&#x6210;&#x7684;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;281&#x9875;&#x4E0A;&#x7684;&#x201C;&#x8D85;&#x65F6;&#x548C;&#x65E0;&#x9650;&#x5EF6;&#x8FDF;&#x201D;&#x3002;</p>
<h3 id="&#x5168;&#x5E8F;&#xFF08;total-order&#xFF09;">&#x5168;&#x5E8F;&#xFF08;total order&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x6BD4;&#x8F83;&#x4E8B;&#x7269;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x4F8B;&#x5982;&#x65F6;&#x95F4;&#x6233;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x60A8;&#x603B;&#x662F;&#x8BF4;&#x51FA;&#x4E24;&#x4EF6;&#x4E8B;&#x4E2D;&#x54EA;&#x4E00;&#x4EF6;&#x66F4;&#x5927;&#xFF0C;&#x54EA;&#x4EF6;&#x66F4;&#x5C0F;&#x3002; &#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x6709;&#x4E9B;&#x4E1C;&#x897F;&#x662F;&#x65E0;&#x6CD5;&#x6BD4;&#x62DF;&#x7684;&#xFF08;&#x4E0D;&#x80FD;&#x8BF4;&#x54EA;&#x4E2A;&#x66F4;&#x5927;&#x6216;&#x66F4;&#x5C0F;&#xFF09;&#x7684;&#x987A;&#x5E8F;&#x79F0;&#x4E3A;&#x504F;&#x5E8F;&#x3002; &#x8BF7;&#x53C2;&#x89C1;&#x7B2C;341&#x9875;&#x7684;&#x201C;&#x56E0;&#x679C;&#x987A;&#x5E8F;&#x4E0D;&#x662F;&#x5168;&#x5E8F;&#x201D;&#x3002;</p>
<h3 id="&#x4E8B;&#x52A1;&#xFF08;transaction&#xFF09;">&#x4E8B;&#x52A1;&#xFF08;transaction&#xFF09;</h3>
<p>&#x4E3A;&#x4E86;&#x7B80;&#x5316;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x548C;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x5C06;&#x51E0;&#x4E2A;&#x8BFB;&#x5199;&#x64CD;&#x4F5C;&#x5206;&#x7EC4;&#x5230;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x5355;&#x5143;&#x4E2D;&#x3002; &#x89C1;&#x7B2C;7&#x7AE0;&#x3002;</p>
<h3 id="&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#xFF08;2pc-two-phase-commit&#xFF09;">&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#xFF08;2PC, two-phase commit&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x786E;&#x4FDD;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x8282;&#x70B9;&#x5168;&#x90E8;&#x63D0;&#x4EA4;&#x6216;&#x5168;&#x90E8;&#x4E2D;&#x6B62;&#x4E8B;&#x52A1;&#x7684;&#x7B97;&#x6CD5;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;354&#x9875;&#x4E0A;&#x7684;&#x201C;&#x539F;&#x5B50;&#x63D0;&#x4EA4;&#x548C;&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#xFF08;2PC&#xFF09;&#x201D;&#x3002;</p>
<h3 id="&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;2pl-two-phase-locking&#xFF09;">&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;2PL, two-phase locking&#xFF09;</h3>
<p>&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x53EF;&#x5E8F;&#x5217;&#x5316;&#x9694;&#x79BB;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x901A;&#x8FC7;&#x4E8B;&#x52A1;&#x83B7;&#x53D6;&#x5BF9;&#x5176;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x7684;&#x9501;&#xFF0C;&#x76F4;&#x5230;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x3002; &#x8BF7;&#x53C2;&#x9605;&#x7B2C;257&#x9875;&#x4E0A;&#x7684;&#x201C;&#x4E24;&#x9636;&#x6BB5;&#x9501;&#x5B9A;&#xFF08;2PL&#xFF09;&#x201D;&#x3002;</p>
<h3 id="&#x65E0;&#x8FB9;&#x754C;&#xFF08;unbounded&#xFF09;">&#x65E0;&#x8FB9;&#x754C;&#xFF08;unbounded&#xFF09;</h3>
<p>&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5DF2;&#x77E5;&#x7684;&#x4E0A;&#x9650;&#x6216;&#x5927;&#x5C0F;&#x3002; &#x53CD;&#x4E49;&#x8BCD;&#x662F;&#x8FB9;&#x754C;&#xFF08;bounded&#xFF09;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch12.html" class="navigation navigation-prev " aria-label="Previous page: 第十二章：数据系统的未来">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="colophon.html" class="navigation navigation-next " aria-label="Next page: 后记">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"术语表","level":"1.6","depth":1,"next":{"title":"后记","level":"1.7","depth":1,"path":"colophon.md","ref":"colophon.md","articles":[]},"previous":{"title":"第十二章：数据系统的未来","level":"1.5.3","depth":2,"path":"ch12.md","ref":"ch12.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing","mathjax-pro","livereload"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/ddia"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"livereload":{},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"mathjax-pro":{"forceSVG":false,"version":"2.7.7"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"glossary.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-21T05:58:49.715Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.7/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-mathjax-pro/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

