
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第二部分：分布式数据 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch5.html" />
    
    
    <link rel="prev" href="ch4.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第二部分：分布式数据</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF1A;-&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF1A; &#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;</h1>
<blockquote>
<p>&#x4E00;&#x4E2A;&#x6210;&#x529F;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x73B0;&#x5B9E;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x5FC5;&#x987B;&#x9AD8;&#x4E8E;&#x516C;&#x5173;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7CCA;&#x5F04;&#x522B;&#x4EBA;&#xFF0C;&#x4F46;&#x7CCA;&#x5F04;&#x4E0D;&#x4E86;&#x81EA;&#x7136;&#x89C4;&#x5F8B;&#x3002;</p>
<p>&#x2014;&#x2014;&#x7F57;&#x6770;&#x65AF;&#x59D4;&#x5458;&#x4F1A;&#x62A5;&#x544A;&#xFF08;1986&#xFF09;</p>
</blockquote>
<hr>
<p>&#x5728;&#x672C;&#x4E66;&#x7684;<a href="part-i.html">&#x7B2C;&#x4E00;&#x90E8;&#x5206;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x4E86;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x5404;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x4F46;&#x4EC5;&#x9650;&#x4E8E;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x5355;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5230;&#x4E86;<a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;</a>&#xFF0C;&#x8FDB;&#x5165;&#x66F4;&#x9AD8;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x5E76;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x5982;&#x679C;<strong>&#x591A;&#x53F0;&#x673A;&#x5668;</strong>&#x53C2;&#x4E0E;&#x6570;&#x636E;&#x7684;&#x5B58;&#x50A8;&#x548C;&#x68C0;&#x7D22;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x4E8E;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5E0C;&#x671B;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x5206;&#x5E03;&#x5230;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#xFF1A;</p>
<p><strong><em>&#x53EF;&#x4F38;&#x7F29;&#x6027;</em></strong></p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x6570;&#x636E;&#x91CF;&#x3001;&#x8BFB;&#x53D6;&#x8D1F;&#x8F7D;&#x3001;&#x5199;&#x5165;&#x8D1F;&#x8F7D;&#x8D85;&#x51FA;&#x5355;&#x53F0;&#x673A;&#x5668;&#x7684;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8D1F;&#x8F7D;&#x5206;&#x6563;&#x5230;&#x591A;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x3002;</p>
<p><strong><em>&#x5BB9;&#x9519;/&#x9AD8;&#x53EF;&#x7528;&#x6027;</em></strong></p>
<p>&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x9700;&#x8981;&#x5728;&#x5355;&#x53F0;&#x673A;&#x5668;&#xFF08;&#x6216;&#x591A;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x7F51;&#x7EDC;&#x6216;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF09;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4ECD;&#x7136;&#x80FD;&#x7EE7;&#x7EED;&#x5DE5;&#x4F5C;&#xFF0C;&#x5219;&#x53EF;&#x4F7F;&#x7528;&#x591A;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x4EE5;&#x63D0;&#x4F9B;&#x5197;&#x4F59;&#x3002;&#x4E00;&#x53F0;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x53E6;&#x4E00;&#x53F0;&#x53EF;&#x4EE5;&#x63A5;&#x7BA1;&#x3002;</p>
<p><strong><em>&#x5EF6;&#x8FDF;</em></strong></p>
<p>&#x5982;&#x679C;&#x5728;&#x4E16;&#x754C;&#x5404;&#x5730;&#x90FD;&#x6709;&#x7528;&#x6237;&#xFF0C;&#x4F60;&#x4E5F;&#x8BB8;&#x4F1A;&#x8003;&#x8651;&#x5728;&#x5168;&#x7403;&#x8303;&#x56F4;&#x90E8;&#x7F72;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4ECE;&#x800C;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4ECE;&#x5730;&#x7406;&#x4E0A;&#x6700;&#x8FD1;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x7B49;&#x5F85;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x7A7F;&#x8D8A;&#x534A;&#x4E2A;&#x4E16;&#x754C;&#x3002;</p>
<h3 id="&#x4F38;&#x7F29;&#x81F3;&#x66F4;&#x9AD8;&#x7684;&#x8F7D;&#x8377;">&#x4F38;&#x7F29;&#x81F3;&#x66F4;&#x9AD8;&#x7684;&#x8F7D;&#x8377;</h3>
<p>&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x7684;&#x53EA;&#x662F;&#x4F38;&#x7F29;&#x81F3;&#x66F4;&#x9AD8;&#x7684;<strong>&#x8F7D;&#x8377;&#xFF08;load&#xFF09;</strong>&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x8D2D;&#x4E70;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x673A;&#x5668;&#xFF08;&#x6709;&#x65F6;&#x79F0;&#x4E3A;<strong>&#x5782;&#x76F4;&#x4F38;&#x7F29;&#xFF08;vertical scaling&#xFF09;</strong>&#x6216;<strong>&#x5411;&#x4E0A;&#x4F38;&#x7F29;&#xFF08;scale up&#xFF09;</strong>&#xFF09;&#x3002;&#x8BB8;&#x591A;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5185;&#x5B58;&#x548C;&#x78C1;&#x76D8;&#x53EF;&#x4EE5;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0B;&#x76F8;&#x4E92;&#x8FDE;&#x63A5;&#xFF0C;&#x5FEB;&#x901F;&#x7684;&#x76F8;&#x4E92;&#x8FDE;&#x63A5;&#x5141;&#x8BB8;&#x4EFB;&#x610F;&#x5904;&#x7406;&#x5668;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x6216;&#x78C1;&#x76D8;&#x7684;&#x4EFB;&#x610F;&#x90E8;&#x5206;&#x3002;&#x5728;&#x8FD9;&#x79CD; <strong>&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x67B6;&#x6784;&#xFF08;shared-memory architecture&#xFF09;</strong> &#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7EC4;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x4E00;&#x53F0;&#x5355;&#x72EC;&#x7684;&#x673A;&#x5668;&#x3002;</p>
<blockquote id="fn_i">
<sup>i</sup>. &#x5728;&#x5927;&#x578B;&#x673A;&#x4E2D;&#xFF0C;&#x5C3D;&#x7BA1;&#x4EFB;&#x610F;&#x5904;&#x7406;&#x5668;&#x90FD;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x4EFB;&#x610F;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x603B;&#x6709;&#x4E00;&#x4E9B;&#x5185;&#x5B58;&#x533A;&#x57DF;&#x4E0E;&#x4E00;&#x4E9B;&#x5904;&#x7406;&#x5668;&#x66F4;&#x63A5;&#x8FD1;&#xFF08;&#x79F0;&#x4E3A;<strong>&#x975E;&#x5747;&#x5300;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#xFF08;nonuniform memory access, NUMA&#xFF09;</strong>&#x3010;1&#x3011;&#xFF09;&#x3002; &#x4E3A;&#x4E86;&#x6709;&#x6548;&#x5229;&#x7528;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x7279;&#x6027;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x5904;&#x7406;&#x8FDB;&#x884C;&#x7EC6;&#x5206;&#xFF0C;&#x4EE5;&#x4FBF;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E3B;&#x8981;&#x8BBF;&#x95EE;&#x4E34;&#x8FD1;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5373;&#x4F7F;&#x8868;&#x9762;&#x4E0A;&#x770B;&#x8D77;&#x6765;&#x53EA;&#x6709;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x5728;&#x8FD0;&#x884C;&#xFF0C;<strong>&#x5206;&#x533A;&#xFF08;partitioning&#xFF09;</strong>&#x4ECD;&#x7136;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;<a href="#reffn_i" title="Jump back to footnote [i] in the text."> &#x21A9;</a>
</blockquote>
<p>&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x65B9;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x6210;&#x672C;&#x589E;&#x957F;&#x901F;&#x5EA6;&#x5FEB;&#x4E8E;&#x7EBF;&#x6027;&#x589E;&#x957F;&#xFF1A;&#x4E00;&#x53F0;&#x6709;&#x7740;&#x53CC;&#x500D;&#x5904;&#x7406;&#x5668;&#x6570;&#x91CF;&#xFF0C;&#x53CC;&#x500D;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#xFF0C;&#x53CC;&#x500D;&#x78C1;&#x76D8;&#x5BB9;&#x91CF;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x901A;&#x5E38;&#x6210;&#x672C;&#x4F1A;&#x8FDC;&#x8FDC;&#x8D85;&#x8FC7;&#x539F;&#x6765;&#x7684;&#x4E24;&#x500D;&#x3002;&#x800C;&#x4E14;&#x53EF;&#x80FD;&#x56E0;&#x4E3A;&#x5B58;&#x5728;&#x74F6;&#x9888;&#xFF0C;&#x5E76;&#x4E0D;&#x8DB3;&#x4EE5;&#x5904;&#x7406;&#x53CC;&#x500D;&#x7684;&#x8F7D;&#x8377;&#x3002;</p>
<p>&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x67B6;&#x6784;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6709;&#x9650;&#x7684;&#x5BB9;&#x9519;&#x80FD;&#x529B;&#xFF0C;&#x9AD8;&#x7AEF;&#x673A;&#x5668;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x70ED;&#x63D2;&#x62D4;&#x7684;&#x7EC4;&#x4EF6;&#xFF08;&#x4E0D;&#x5173;&#x673A;&#x66F4;&#x6362;&#x78C1;&#x76D8;&#xFF0C;&#x5185;&#x5B58;&#x6A21;&#x5757;&#xFF0C;&#x751A;&#x81F3;&#x5904;&#x7406;&#x5668;&#xFF09;&#x2014;&#x2014;&#x4F46;&#x5B83;&#x5FC5;&#x7136;&#x56FF;&#x4E8E;&#x5355;&#x4E2A;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x7684;&#x684E;&#x688F;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;<strong>&#x5171;&#x4EAB;&#x78C1;&#x76D8;&#x67B6;&#x6784;&#xFF08;shared-disk architecture&#xFF09;</strong>&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x591A;&#x53F0;&#x5177;&#x6709;&#x72EC;&#x7ACB;&#x5904;&#x7406;&#x5668;&#x548C;&#x5185;&#x5B58;&#x7684;&#x673A;&#x5668;&#xFF0C;&#x4F46;&#x5C06;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x7684;&#x78C1;&#x76D8;&#x9635;&#x5217;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x78C1;&#x76D8;&#x901A;&#x8FC7;&#x5FEB;&#x901F;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;<sup><a href="#fn_ii" id="reffn_ii">ii</a></sup>&#x3002;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x7528;&#x4E8E;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#xFF0C;&#x4F46;&#x7ADE;&#x4E89;&#x548C;&#x9501;&#x5B9A;&#x7684;&#x5F00;&#x9500;&#x9650;&#x5236;&#x4E86;&#x5171;&#x4EAB;&#x78C1;&#x76D8;&#x65B9;&#x6CD5;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3010;2&#x3011;&#x3002;</p>
<blockquote id="fn_ii">
<sup>ii</sup>. &#x7F51;&#x7EDC;&#x9644;&#x5C5E;&#x5B58;&#x50A8;&#xFF08;Network Attached Storage, NAS&#xFF09;&#xFF0C;&#x6216;<strong>&#x5B58;&#x50A8;&#x533A;&#x7F51;&#x7EDC;&#xFF08;Storage Area Network, SAN&#xFF09;</strong><a href="#reffn_ii" title="Jump back to footnote [ii] in the text."> &#x21A9;</a>
</blockquote>
<h4 id="&#x65E0;&#x5171;&#x4EAB;&#x67B6;&#x6784;">&#x65E0;&#x5171;&#x4EAB;&#x67B6;&#x6784;</h4>
<p>&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;<strong>&#x65E0;&#x5171;&#x4EAB;&#x67B6;&#x6784;&#xFF08;shared-nothing architecture&#xFF09;</strong>&#xFF08;&#x6709;&#x65F6;&#x79F0;&#x4E3A;<strong>&#x6C34;&#x5E73;&#x4F38;&#x7F29;&#xFF08;horizontal scale&#xFF09;</strong> &#x6216;<strong>&#x5411;&#x5916;&#x4F38;&#x7F29;&#xFF08;scale out&#xFF09;</strong>&#xFF09;&#x5DF2;&#x7ECF;&#x76F8;&#x5F53;&#x666E;&#x53CA;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x8FD0;&#x884C;&#x6570;&#x636E;&#x5E93;&#x8F6F;&#x4EF6;&#x7684;&#x6BCF;&#x53F0;&#x673A;&#x5668;/&#x865A;&#x62DF;&#x673A;&#x90FD;&#x79F0;&#x4E3A;<strong>&#x8282;&#x70B9;&#xFF08;node&#xFF09;</strong>&#x3002;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x53EA;&#x4F7F;&#x7528;&#x5404;&#x81EA;&#x7684;&#x5904;&#x7406;&#x5668;&#xFF0C;&#x5185;&#x5B58;&#x548C;&#x78C1;&#x76D8;&#x3002;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x4EFB;&#x4F55;&#x534F;&#x8C03;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x8F6F;&#x4EF6;&#x5C42;&#x9762;&#x4F7F;&#x7528;&#x4F20;&#x7EDF;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p>&#x65E0;&#x5171;&#x4EAB;&#x7CFB;&#x7EDF;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4EFB;&#x610F;&#x673A;&#x5668;&#x2014;&#x2014;&#x6BD4;&#x5982;&#x6027;&#x4EF7;&#x6BD4;&#x6700;&#x597D;&#x7684;&#x673A;&#x5668;&#x3002;&#x4F60;&#x4E5F;&#x8BB8;&#x53EF;&#x4EE5;&#x8DE8;&#x591A;&#x4E2A;&#x5730;&#x7406;&#x533A;&#x57DF;&#x5206;&#x5E03;&#x6570;&#x636E;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x7528;&#x6237;&#x5EF6;&#x8FDF;&#xFF0C;&#x6216;&#x8005;&#x5728;&#x635F;&#x5931;&#x4E00;&#x6574;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5E78;&#x514D;&#x4E8E;&#x96BE;&#x3002;&#x968F;&#x7740;&#x4E91;&#x7AEF;&#x865A;&#x62DF;&#x673A;&#x90E8;&#x7F72;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x5C0F;&#x516C;&#x53F8;&#xFF0C;&#x73B0;&#x5728;&#x65E0;&#x9700;Google&#x7EA7;&#x522B;&#x7684;&#x8FD0;&#x7EF4;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5F02;&#x5730;&#x5206;&#x5E03;&#x5F0F;&#x67B6;&#x6784;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x65E0;&#x5171;&#x4EAB;&#x67B6;&#x6784;&#x4E0A;&#x3002;&#x5B83;&#x4E0D;&#x89C1;&#x5F97;&#x662F;&#x6240;&#x6709;&#x573A;&#x666F;&#x7684;&#x6700;&#x4F73;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x5B83;&#x662F;&#x6700;&#x9700;&#x8981;&#x4F60;&#x8C28;&#x614E;&#x4ECE;&#x4E8B;&#x7684;&#x67B6;&#x6784;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x6570;&#x636E;&#x5206;&#x5E03;&#x5728;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x7EA6;&#x675F;&#x548C;&#x6743;&#x8861; &#x2014;&#x2014;&#x6570;&#x636E;&#x5E93;&#x5E76;&#x4E0D;&#x80FD;&#x9B54;&#x672F;&#x822C;&#x5730;&#x628A;&#x8FD9;&#x4E9B;&#x4E1C;&#x897F;&#x9690;&#x85CF;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x867D;&#x7136;&#x5206;&#x5E03;&#x5F0F;&#x65E0;&#x5171;&#x4EAB;&#x67B6;&#x6784;&#x6709;&#x8BB8;&#x591A;&#x4F18;&#x70B9;&#xFF0C;&#x4F46;&#x5B83;&#x901A;&#x5E38;&#x4E5F;&#x4F1A;&#x7ED9;&#x5E94;&#x7528;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x9650;&#x5236;&#x4F60;&#x53EF;&#x7528;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x8868;&#x8FBE;&#x529B;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5355;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x6BD4;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x8D85;&#x8FC7;100&#x4E2A;CPU&#x6838;&#x7684;&#x96C6;&#x7FA4;&#x8868;&#x73B0;&#x5F97;&#x66F4;&#x597D;&#x3010;4&#x3011;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x65E0;&#x5171;&#x4EAB;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x7AE0;&#xFF0C;&#x5C06;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x4F1A;&#x5E26;&#x6765;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x590D;&#x5236;-vs-&#x5206;&#x533A;">&#x590D;&#x5236; vs &#x5206;&#x533A;</h3>
<p>&#x6570;&#x636E;&#x5206;&#x5E03;&#x5728;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#x6709;&#x4E24;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x65B9;&#x5F0F;&#xFF1A;</p>
<p><strong><em>&#x590D;&#x5236;&#xFF08;Replication&#xFF09;</em></strong></p>
<p>&#x200B;    &#x5728;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x4FDD;&#x5B58;&#x6570;&#x636E;&#x7684;&#x76F8;&#x540C;&#x526F;&#x672C;&#xFF0C;&#x53EF;&#x80FD;&#x653E;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x4F4D;&#x7F6E;&#x3002; &#x590D;&#x5236;&#x63D0;&#x4F9B;&#x4E86;&#x5197;&#x4F59;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x5269;&#x4F59;&#x7684;&#x8282;&#x70B9;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x670D;&#x52A1;&#x3002; &#x590D;&#x5236;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x6539;&#x5584;&#x6027;&#x80FD;&#x3002; <a href="ch5.html">&#x7B2C;&#x4E94;&#x7AE0;</a>&#x5C06;&#x8BA8;&#x8BBA;&#x590D;&#x5236;&#x3002;</p>
<p><strong><em>&#x5206;&#x533A; (Partitioning)</em></strong></p>
<p>&#x200B;    &#x5C06;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x6570;&#x636E;&#x5E93;&#x62C6;&#x5206;&#x6210;&#x8F83;&#x5C0F;&#x7684;&#x5B50;&#x96C6;&#xFF08;&#x79F0;&#x4E3A;<strong>&#x5206;&#x533A;&#xFF08;partitions&#xFF09;</strong>&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x533A;&#x53EF;&#x4EE5;&#x6307;&#x6D3E;&#x7ED9;&#x4E0D;&#x540C;&#x7684;<strong>&#x8282;&#x70B9;&#xFF08;node&#xFF09;</strong>&#xFF08;&#x4EA6;&#x79F0;<strong>&#x5206;&#x7247;&#xFF08;shard&#xFF09;</strong>&#xFF09;&#x3002; <a href="ch6.html">&#x7B2C;&#x516D;&#x7AE0;</a>&#x5C06;&#x8BA8;&#x8BBA;&#x5206;&#x533A;&#x3002;</p>
<p>&#x590D;&#x5236;&#x548C;&#x5206;&#x533A;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x7ECF;&#x5E38;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x3002;&#x5982;<a href="img/figii-1.png">&#x56FE;II-1</a>&#x6240;&#x793A;&#x3002;</p>
<p><img src="img/figii-1.png" alt=""></p>
<p><strong>&#x56FE;II-1 &#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x5207;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5206;&#x533A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5206;&#x533A;&#x90FD;&#x6709;&#x4E24;&#x4E2A;&#x526F;&#x672C;</strong></p>
<p>&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x8BA8;&#x8BBA;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x9700;&#x8981;&#x505A;&#x51FA;&#x7684;&#x56F0;&#x96BE;&#x6289;&#x62E9;&#x3002;<a href="ch7.html">&#x7B2C;&#x4E03;&#x7AE0;</a>&#x5C06;&#x8BA8;&#x8BBA;<strong>&#x4E8B;&#x52A1;(Transaction)</strong>&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x4E86;&#x89E3;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E2D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x5404;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;<a href="ch8.html">&#x7B2C;&#x516B;&#x7AE0;</a>&#x548C;<a href="ch9.html">&#x7B2C;&#x4E5D;&#x7AE0;</a>&#x5C06;&#x8BA8;&#x8BBA;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x6839;&#x672C;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<p>&#x5728;&#x672C;&#x4E66;&#x7684;<a href="part-iii.html">&#x7B2C;&#x4E09;&#x90E8;&#x5206;</a>&#x4E2D;&#xFF0C;&#x5C06;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x5C06;&#x591A;&#x4E2A;&#xFF08;&#x53EF;&#x80FD;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#xFF09;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x96C6;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x9700;&#x6C42;&#x3002; &#x4F46;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x804A;&#x804A;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<h2 id="&#x7D22;&#x5F15;">&#x7D22;&#x5F15;</h2>
<ol>
<li><a href="ch5.html">&#x590D;&#x5236;</a></li>
<li><a href="ch6.html">&#x5206;&#x7247;</a> </li>
<li><a href="ch7.html">&#x4E8B;&#x52A1;</a> </li>
<li><a href="ch8.html">&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x9EBB;&#x70E6;</a> </li>
<li><a href="ch9.html">&#x4E00;&#x81F4;&#x6027;&#x4E0E;&#x5171;&#x8BC6;</a> </li>
</ol>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;">&#x53C2;&#x8003;&#x6587;&#x732E;</h2>
<ol>
<li><p>Ulrich Drepper: &#x201C;<a href="https://people.freebsd.org/~lstewart/articles/cpumemory.pdf" target="_blank">What Every Programmer Should Know About Memory</a>,&#x201D; akka&#x2010;dia.org, November 21, 2007.</p>
</li>
<li><p>Ben Stopford: &#x201C;<a href="http://www.benstopford.com/2009/11/24/understanding-the-shared-nothing-architecture/" target="_blank">Shared Nothing vs. Shared Disk Architectures: An Independent View</a>,&#x201D; benstopford.com, November 24, 2009.</p>
</li>
</ol>
<ol>
<li>Michael Stonebraker: &#x201C;<a href="http://db.cs.berkeley.edu/papers/hpts85-nothing.pdf" target="_blank">The Case for Shared Nothing</a>,&#x201D; IEEE Database EngineeringBulletin, volume 9, number 1, pages 4&#x2013;9, March 1986.</li>
<li>Frank McSherry, Michael Isard, and Derek G. Murray: &#x201C;<a href="http://www.frankmcsherry.org/assets/COST.pdf" target="_blank">Scalability! But at What COST?</a>,&#x201D; at 15th USENIX Workshop on Hot Topics in Operating Systems (HotOS),May 2015.</li>
</ol>
<hr>
<table>
<thead>
<tr>
<th>&#x4E0A;&#x4E00;&#x7AE0;</th>
<th>&#x76EE;&#x5F55;</th>
<th>&#x4E0B;&#x4E00;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><a href="ch4.html">&#x7B2C;&#x56DB;&#x7AE0;&#xFF1A;&#x7F16;&#x7801;&#x4E0E;&#x6F14;&#x5316;</a></td>
<td><a href="./">&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;</a></td>
<td><a href="ch5.html">&#x7B2C;&#x4E94;&#x7AE0;&#xFF1A;&#x590D;&#x5236;</a></td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch4.html" class="navigation navigation-prev " aria-label="Previous page: 第四章：编码与演化">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch5.html" class="navigation navigation-next " aria-label="Next page: 第五章：复制">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第二部分：分布式数据","level":"1.4","depth":1,"next":{"title":"第五章：复制","level":"1.4.1","depth":2,"path":"ch5.md","ref":"ch5.md","articles":[]},"previous":{"title":"第四章：编码与演化","level":"1.3.4","depth":2,"path":"ch4.md","ref":"ch4.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/KnowledgeHive"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part-ii.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-12T15:31:17.016Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

