
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三部分：衍生数据 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch10.html" />
    
    
    <link rel="prev" href="ch9.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第三部分：衍生数据</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#xFF1A;&#x884D;&#x751F;&#x6570;&#x636E;">&#x7B2C;&#x4E09;&#x90E8;&#x5206;&#xFF1A;&#x884D;&#x751F;&#x6570;&#x636E;</h1>
<p>&#x5728;&#x672C;&#x4E66;&#x7684;<a href="part-i.html">&#x7B2C;&#x4E00;&#x90E8;&#x5206;</a>&#x548C;<a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x5730;&#x628A;&#x6240;&#x6709;&#x5173;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E3B;&#x8981;&#x8003;&#x91CF;&#x90FD;&#x8FC7;&#x4E86;&#x4E00;&#x904D;&#x3002;&#x4ECE;&#x6570;&#x636E;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x5E03;&#x5C40;&#xFF0C;&#x4E00;&#x76F4;&#x5230;&#x51FA;&#x73B0;&#x6545;&#x969C;&#x65F6;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x5C40;&#x9650;&#x3002;&#x4F46;&#x6240;&#x6709;&#x7684;&#x8BA8;&#x8BBA;&#x90FD;&#x5047;&#x5B9A;&#x4E86;&#x5E94;&#x7528;&#x4E2D;&#x53EA;&#x7528;&#x4E86;&#x4E00;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p>&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x5F80;&#x5F80;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x3002;&#x5927;&#x578B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x4EE5;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x8BBF;&#x95EE;&#x548C;&#x5904;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x9700;&#x6C42;&#x3002;&#x56E0;&#x6B64;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x7EC4;&#x5408;&#x4F7F;&#x7528;&#x591A;&#x79CD;&#x7EC4;&#x4EF6;&#xFF1A;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x7D22;&#x5F15;&#xFF0C;&#x7F13;&#x5B58;&#xFF0C;&#x5206;&#x6790;&#x7CFB;&#x7EDF;&#xFF0C;&#x7B49;&#x7B49;&#xFF0C;&#x5E76;&#x5B9E;&#x73B0;&#x5728;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x4E2D;&#x79FB;&#x52A8;&#x6570;&#x636E;&#x7684;&#x673A;&#x5236;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x7684;&#x6700;&#x540E;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F1A;&#x7814;&#x7A76;&#x5C06;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#xFF08;&#x53EF;&#x80FD;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF09;&#x96C6;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x534F;&#x8C03;&#x4E00;&#x81F4;&#x7684;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x65F6;&#xFF0C;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8F6F;&#x4EF6;&#x4F9B;&#x5E94;&#x5546;&#x7ECF;&#x5E38;&#x4F1A;&#x5FFD;&#x7565;&#x8FD9;&#x4E00;&#x65B9;&#x9762;&#x7684;&#x751F;&#x6001;&#x5EFA;&#x8BBE;&#xFF0C;&#x5E76;&#x58F0;&#x79F0;&#x4ED6;&#x4EEC;&#x7684;&#x4EA7;&#x54C1;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x4F60;&#x7684;&#x6240;&#x6709;&#x9700;&#x6C42;&#x3002;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x96C6;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x7CFB;&#x7EDF;&#x662F;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x4E4B;&#x4E00;&#x3002;</p>
<h2 id="&#x8BB0;&#x5F55;&#x548C;&#x884D;&#x751F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;">&#x8BB0;&#x5F55;&#x548C;&#x884D;&#x751F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;</h2>
<p>&#x4ECE;&#x9AD8;&#x5C42;&#x6B21;&#x4E0A;&#x770B;&#xFF0C;&#x5B58;&#x50A8;&#x548C;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF1A;</p>
<h4 id="&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#xFF08;system-of-record&#xFF09;">&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#xFF08;System of record&#xFF09;</h4>
<p><strong>&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;</strong>&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x771F;&#x76F8;&#x6E90;&#xFF08;source of truth&#xFF09;</strong>&#xFF0C;&#x6301;&#x6709;&#x6570;&#x636E;&#x7684;&#x6743;&#x5A01;&#x7248;&#x672C;&#x3002;&#x5F53;&#x65B0;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x5165;&#x65F6;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x6237;&#x8F93;&#x5165;&#xFF09;&#x9996;&#x5148;&#x4F1A;&#x8BB0;&#x5F55;&#x5728;&#x8FD9;&#x91CC;&#x3002;&#x6BCF;&#x4E2A;&#x4E8B;&#x5B9E;&#x6B63;&#x6B63;&#x597D;&#x597D;&#x8868;&#x793A;&#x4E00;&#x6B21;&#xFF08;&#x8868;&#x793A;&#x901A;&#x5E38;&#x662F;<strong>&#x6807;&#x51C6;&#x5316;&#x7684;&#xFF08;normalized&#xFF09;</strong>&#xFF09;&#x3002;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x548C;<strong>&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;</strong>&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x5DEE;&#x5F02;&#xFF0C;&#x90A3;&#x4E48;&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x503C;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF08;&#x6839;&#x636E;&#x5B9A;&#x4E49;&#xFF09;&#x3002;</p>
<h4 id="&#x884D;&#x751F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#xFF08;derived-data-systems&#xFF09;">&#x884D;&#x751F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#xFF08;Derived data systems&#xFF09;</h4>
<p><strong>&#x884D;&#x751F;&#x7CFB;&#x7EDF;</strong>&#x4E2D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x73B0;&#x6709;&#x6570;&#x636E;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x6216;&#x5904;&#x7406;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5982;&#x679C;&#x4E22;&#x5931;&#x884D;&#x751F;&#x6570;&#x636E;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x539F;&#x59CB;&#x6765;&#x6E90;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x3002;&#x5178;&#x578B;&#x7684;&#x4F8B;&#x5B50;&#x662F;<strong>&#x7F13;&#x5B58;&#xFF08;cache&#xFF09;</strong>&#xFF1A;&#x5982;&#x679C;&#x6570;&#x636E;&#x5728;&#x7F13;&#x5B58;&#x4E2D;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x7531;&#x7F13;&#x5B58;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF1B;&#x5982;&#x679C;&#x7F13;&#x5B58;&#x4E0D;&#x5305;&#x542B;&#x6240;&#x9700;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x964D;&#x7EA7;&#x7531;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x5E93;&#x63D0;&#x4F9B;&#x3002;&#x975E;&#x89C4;&#x8303;&#x5316;&#x7684;&#x503C;&#xFF0C;&#x7D22;&#x5F15;&#x548C;&#x7269;&#x5316;&#x89C6;&#x56FE;&#x4EA6;&#x5C5E;&#x6B64;&#x7C7B;&#x3002;&#x5728;&#x63A8;&#x8350;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x9884;&#x6D4B;&#x6C47;&#x603B;&#x6570;&#x636E;&#x901A;&#x5E38;&#x884D;&#x751F;&#x81EA;&#x7528;&#x6237;&#x65E5;&#x5FD7;&#x3002;</p>
<p>&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BB2;&#xFF0C;&#x884D;&#x751F;&#x6570;&#x636E;&#x662F;<strong>&#x5197;&#x4F59;&#x7684;&#xFF08;redundant&#xFF09;</strong>&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x91CD;&#x590D;&#x4E86;&#x5DF2;&#x6709;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#x884D;&#x751F;&#x6570;&#x636E;&#x5BF9;&#x4E8E;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x7684;&#x53EA;&#x8BFB;&#x67E5;&#x8BE2;&#x6027;&#x80FD;&#x901A;&#x5E38;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5B83;&#x901A;&#x5E38;&#x662F;&#x975E;&#x89C4;&#x8303;&#x5316;&#x7684;&#x3002;&#x53EF;&#x4EE5;&#x4ECE;&#x5355;&#x4E2A;&#x6E90;&#x5934;&#x884D;&#x751F;&#x51FA;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F7F;&#x4F60;&#x80FD;&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x201C;&#x89C6;&#x89D2;&#x201D;&#x6D1E;&#x5BDF;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x7CFB;&#x7EDF;&#x90FD;&#x5728;&#x5176;&#x67B6;&#x6784;&#x4E2D;&#x660E;&#x786E;&#x533A;&#x5206;<strong>&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;</strong>&#x548C;<strong>&#x884D;&#x751F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;</strong>&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x7528;&#x7684;&#x533A;&#x5206;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x660E;&#x786E;&#x4E86;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF1A;&#x7CFB;&#x7EDF;&#x7684;&#x54EA;&#x4E00;&#x90E8;&#x5206;&#x5177;&#x6709;&#x54EA;&#x4E9B;&#x8F93;&#x5165;&#x548C;&#x54EA;&#x4E9B;&#x8F93;&#x51FA;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#x548C;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x65E2;&#x4E0D;&#x662F;&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#x4E5F;&#x4E0D;&#x662F;&#x884D;&#x751F;&#x7CFB;&#x7EDF;&#x3002;&#x6570;&#x636E;&#x5E93;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF1A;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x81EA;&#x5DF1;&#x3002;<strong>&#x8BB0;&#x5F55;&#x7CFB;&#x7EDF;&#x548C;&#x884D;&#x751F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x4E0D;&#x5728;&#x4E8E;&#x5DE5;&#x5177;&#xFF0C;&#x800C;&#x5728;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x3002;</strong></p>
<p>&#x901A;&#x8FC7;&#x68B3;&#x7406;&#x6570;&#x636E;&#x7684;&#x884D;&#x751F;&#x5173;&#x7CFB;&#xFF0C;&#x53EF;&#x4EE5;&#x6E05;&#x695A;&#x5730;&#x7406;&#x89E3;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x56F0;&#x60D1;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x3002;&#x8FD9;&#x5C06;&#x8D2F;&#x7A7F;&#x672C;&#x4E66;&#x7684;&#x8FD9;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<h2 id="&#x7AE0;&#x8282;&#x6982;&#x8FF0;">&#x7AE0;&#x8282;&#x6982;&#x8FF0;</h2>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4ECE;<a href="ch10.html">&#x7B2C;&#x5341;&#x7AE0;</a>&#x5F00;&#x59CB;&#xFF0C;&#x7814;&#x7A76;&#x4F8B;&#x5982;MapReduce&#x8FD9;&#x6837; <strong>&#x9762;&#x5411;&#x6279;&#x5904;&#x7406;&#xFF08;batch-oriented&#xFF09;</strong> &#x7684;&#x6570;&#x636E;&#x6D41;&#x7CFB;&#x7EDF;&#x3002;&#x5BF9;&#x4E8E;&#x5EFA;&#x8BBE;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#xFF0C;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4F18;&#x79C0;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x601D;&#x60F3;&#x3002;<a href="ch11.html">&#x7B2C;&#x5341;&#x4E00;&#x7AE0;</a>&#x5C06;&#x628A;&#x8FD9;&#x4E9B;&#x601D;&#x60F3;&#x5E94;&#x7528;&#x5230; <strong>&#x6D41;&#x5F0F;&#x6570;&#x636E;&#xFF08;data streams&#xFF09;</strong> &#x4E2D;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x7528;&#x66F4;&#x4F4E;&#x7684;&#x5EF6;&#x8FDF;&#x5B8C;&#x6210;&#x540C;&#x6837;&#x7684;&#x4EFB;&#x52A1;&#x3002;<a href="ch12.html">&#x7B2C;&#x5341;&#x4E8C;&#x7AE0;</a>&#x5C06;&#x5BF9;&#x672C;&#x4E66;&#x8FDB;&#x884C;&#x603B;&#x7ED3;&#xFF0C;&#x63A2;&#x8BA8;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x6765;&#x6784;&#x5EFA;&#x53EF;&#x9760;&#xFF0C;&#x53EF;&#x4F38;&#x7F29;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<h2 id="&#x7D22;&#x5F15;">&#x7D22;&#x5F15;</h2>
<ol>
<li><a href="ch10.html">&#x6279;&#x5904;&#x7406;</a></li>
<li><a href="ch11.html">&#x6D41;&#x5904;&#x7406;</a></li>
<li><a href="ch12.html">&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x672A;&#x6765;</a></li>
</ol>
<hr>
<table>
<thead>
<tr>
<th>&#x4E0A;&#x4E00;&#x7AE0;</th>
<th>&#x76EE;&#x5F55;</th>
<th>&#x4E0B;&#x4E00;&#x7AE0;</th>
</tr>
</thead>
<tbody>
<tr>
<td><a href="ch9.html">&#x7B2C;&#x4E5D;&#x7AE0;&#xFF1A;&#x4E00;&#x81F4;&#x6027;&#x4E0E;&#x5171;&#x8BC6;</a></td>
<td><a href="./">&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;</a></td>
<td><a href="ch10.html">&#x7B2C;&#x5341;&#x7AE0;&#xFF1A;&#x6279;&#x5904;&#x7406;</a></td>
</tr>
</tbody>
</table>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch9.html" class="navigation navigation-prev " aria-label="Previous page: 第九章：一致性与共识">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch10.html" class="navigation navigation-next " aria-label="Next page: 第十章：批处理">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三部分：衍生数据","level":"1.5","depth":1,"next":{"title":"第十章：批处理","level":"1.5.1","depth":2,"path":"ch10.md","ref":"ch10.md","articles":[]},"previous":{"title":"第九章：一致性与共识","level":"1.4.5","depth":2,"path":"ch9.md","ref":"ch9.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/KnowledgeHive"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"part-iii.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-12T15:31:17.016Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

