
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>序言 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-theme-comscore/test.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="part-i.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="part-i.html">
            
                <a href="part-i.html">
            
                    
                    第一部分：数据系统的基石
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：可靠性、可伸缩性、可维护性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：数据模型与查询语言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：存储与检索
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：编码与演化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="part-ii.html">
            
                <a href="part-ii.html">
            
                    
                    第二部分：分布式数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：复制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：分区
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章：事务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章：分布式系统的麻烦
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.5" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章：一致性与共识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="part-iii.html">
            
                <a href="part-iii.html">
            
                    
                    第三部分：衍生数据
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章：批处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.2" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章：流处理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5.3" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章：数据系统的未来
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    术语表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="colophon.html">
            
                <a href="colophon.html">
            
                    
                    后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >序言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5E8F;&#x8A00;">&#x5E8F;&#x8A00;</h1>
<p>&#x5982;&#x679C;&#x8FD1;&#x51E0;&#x5E74;&#x4ECE;&#x4E1A;&#x4E8E;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x548C;&#x540E;&#x7AEF;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x88AB;&#x5927;&#x91CF;&#x5173;&#x4E8E;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x548C;&#x5904;&#x7406;&#x7684;&#x65F6;&#x9AE6;&#x8BCD;&#x6C47;&#x8F70;&#x70B8;&#x8FC7;&#x4E86;&#xFF1A; NoSQL&#xFF01;&#x5927;&#x6570;&#x636E;&#xFF01;Web-Scale&#xFF01;&#x5206;&#x7247;&#xFF01;&#x6700;&#x7EC8;&#x4E00;&#x81F4;&#x6027;&#xFF01;ACID&#xFF01; CAP&#x5B9A;&#x7406;&#xFF01;&#x4E91;&#x670D;&#x52A1;&#xFF01;MapReduce&#xFF01;&#x5B9E;&#x65F6;&#xFF01;</p>
<p>&#x5728;&#x6700;&#x8FD1;&#x5341;&#x5E74;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x6709;&#x8DA3;&#x7684;&#x8FDB;&#x5C55;&#xFF0C;&#x5173;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E9B;&#x8FDB;&#x5C55;&#x6709;&#x7740;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x9A71;&#x52A8;&#x529B;&#xFF1A;</p>
<ul>
<li>&#x8C37;&#x6B4C;&#xFF0C;&#x96C5;&#x864E;&#xFF0C;&#x4E9A;&#x9A6C;&#x900A;&#xFF0C;&#x8138;&#x4E66;&#xFF0C;&#x9886;&#x82F1;&#xFF0C;&#x5FAE;&#x8F6F;&#x548C;&#x63A8;&#x7279;&#x7B49;&#x4E92;&#x8054;&#x7F51;&#x516C;&#x53F8;&#x6B63;&#x5728;&#x548C;&#x5DE8;&#x5927;&#x7684;&#x6D41;&#x91CF;/&#x6570;&#x636E;&#x6253;&#x4EA4;&#x9053;&#xFF0C;&#x8FD9;&#x8FEB;&#x4F7F;&#x4ED6;&#x4EEC;&#x53BB;&#x521B;&#x9020;&#x80FD;&#x6709;&#x6548;&#x5E94;&#x5BF9;&#x5982;&#x6B64;&#x89C4;&#x6A21;&#x7684;&#x65B0;&#x5DE5;&#x5177;&#x3002;</li>
<li>&#x4F01;&#x4E1A;&#x9700;&#x8981;&#x53D8;&#x5F97;&#x654F;&#x6377;&#xFF0C;&#x9700;&#x8981;&#x4F4E;&#x6210;&#x672C;&#x5730;&#x68C0;&#x9A8C;&#x5047;&#x8BBE;&#xFF0C;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7F29;&#x77ED;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x548C;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x6A21;&#x578B;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5FEB;&#x901F;&#x5730;&#x54CD;&#x5E94;&#x65B0;&#x7684;&#x5E02;&#x573A;&#x6D1E;&#x5BDF;&#x3002;</li>
<li>&#x514D;&#x8D39;&#x548C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6210;&#x529F;&#xFF0C;&#x5728;&#x8BB8;&#x591A;&#x73AF;&#x5883;&#x4E2D;&#x6BD4;&#x5546;&#x4E1A;&#x8F6F;&#x4EF6;&#x548C;&#x5B9A;&#x5236;&#x8F6F;&#x4EF6;&#x66F4;&#x53D7;&#x6B22;&#x8FCE;&#x3002;</li>
<li>&#x5904;&#x7406;&#x5668;&#x4E3B;&#x9891;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x589E;&#x957F;&#xFF0C;&#x4F46;&#x662F;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x6807;&#x914D;&#xFF0C;&#x7F51;&#x7EDC;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x5FEB;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5E76;&#x884C;&#x5316;&#x7A0B;&#x5EA6;&#x53EA;&#x589E;&#x4E0D;&#x51CF;&#x3002;</li>
<li>&#x5373;&#x4F7F;&#x60A8;&#x5728;&#x4E00;&#x4E2A;&#x5C0F;&#x56E2;&#x961F;&#x4E2D;&#x5DE5;&#x4F5C;&#xFF0C;&#x73B0;&#x5728;&#x4E5F;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x5206;&#x5E03;&#x5728;&#x591A;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x751A;&#x81F3;&#x591A;&#x4E2A;&#x5730;&#x7406;&#x533A;&#x57DF;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x8981;&#x5F52;&#x529F;&#x4E8E;&#x8B6C;&#x5982;&#x4E9A;&#x9A6C;&#x900A;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#xFF08;AWS&#xFF09;&#x7B49;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5373;&#x670D;&#x52A1;&#xFF08;IaaS&#xFF09;&#x6982;&#x5FF5;&#x7684;&#x8DF5;&#x884C;&#x8005;&#x3002;</li>
<li>&#x8BB8;&#x591A;&#x670D;&#x52A1;&#x90FD;&#x8981;&#x6C42;&#x9AD8;&#x53EF;&#x7528;&#xFF0C;&#x56E0;&#x505C;&#x7535;&#x6216;&#x7EF4;&#x62A4;&#x5BFC;&#x81F4;&#x7684;&#x670D;&#x52A1;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x4EE5;&#x63A5;&#x53D7;&#x3002;</li>
</ul>
<p><strong>&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;&#xFF08;data-intensive applications&#xFF09;</strong>&#x6B63;&#x5728;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x8FDB;&#x6B65;&#x6765;&#x63A8;&#x52A8;&#x53EF;&#x80FD;&#x6027;&#x7684;&#x8FB9;&#x754C;&#x3002;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;</strong>&#x7684;&#xFF0C;&#x5982;&#x679C;<strong>&#x6570;&#x636E;&#x662F;&#x5176;&#x4E3B;&#x8981;&#x6311;&#x6218;</strong>&#xFF08;&#x6570;&#x636E;&#x91CF;&#xFF0C;&#x6570;&#x636E;&#x590D;&#x6742;&#x5EA6;&#x6216;&#x6570;&#x636E;&#x53D8;&#x5316;&#x901F;&#x5EA6;&#xFF09;&#x2014;&#x2014; &#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#x7684;&#x662F;<strong>&#x8BA1;&#x7B97;&#x5BC6;&#x96C6;&#x578B;</strong>&#xFF0C;&#x5373;&#x5904;&#x7406;&#x5668;&#x901F;&#x5EA6;&#x662F;&#x5176;&#x74F6;&#x9888;&#x3002;</p>
<p>&#x5E2E;&#x52A9;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;&#x5B58;&#x50A8;&#x548C;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x5DE5;&#x5177;&#x4E0E;&#x6280;&#x672F;&#xFF0C;&#x6B63;&#x8FC5;&#x901F;&#x5730;&#x9002;&#x5E94;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x3002;&#x65B0;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF08;&#x201C;NoSQL&#x201D;&#xFF09;&#x5DF2;&#x7ECF;&#x5907;&#x53D7;&#x5173;&#x6CE8;&#xFF0C;&#x800C;&#x6D88;&#x606F;&#x961F;&#x5217;&#xFF0C;&#x7F13;&#x5B58;&#xFF0C;&#x641C;&#x7D22;&#x7D22;&#x5F15;&#xFF0C;&#x6279;&#x5904;&#x7406;&#x548C;&#x6D41;&#x5904;&#x7406;&#x6846;&#x67B6;&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x6280;&#x672F;&#x4E5F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;&#x5F88;&#x591A;&#x5E94;&#x7528;&#x7EC4;&#x5408;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x4E0E;&#x6280;&#x672F;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x751F;&#x610F;&#x76CE;&#x7136;&#x7684;&#x65F6;&#x9AE6;&#x8BCD;&#x6C47;&#x4F53;&#x73B0;&#x51FA;&#x4EBA;&#x4EEC;&#x5BF9;&#x65B0;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x7684;&#x70ED;&#x60C5;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#x3002;&#x4F46;&#x662F;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#x548C;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5F00;&#x53D1;&#x4F18;&#x79C0;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x5404;&#x79CD;&#x5C42;&#x51FA;&#x4E0D;&#x7A77;&#x7684;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5229;&#x5F0A;&#x6743;&#x8861;&#x6709;&#x7CBE;&#x51C6;&#x7684;&#x6280;&#x672F;&#x7406;&#x89E3;&#x3002;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x8FD9;&#x79CD;&#x6D1E;&#x5BDF;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6DF1;&#x6316;&#x65F6;&#x9AE6;&#x8BCD;&#x6C47;&#x80CC;&#x540E;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x6280;&#x672F;&#x8FC5;&#x901F;&#x53D8;&#x5316;&#x7684;&#x80CC;&#x540E;&#x603B;&#x662F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x6301;&#x7EED;&#x6210;&#x7ACB;&#x7684;&#x539F;&#x5219;&#xFF0C;&#x65E0;&#x8BBA;&#x60A8;&#x4F7F;&#x7528;&#x4E86;&#x7279;&#x5B9A;&#x5DE5;&#x5177;&#x7684;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x9886;&#x4F1A;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x7684;&#x9002;&#x7528;&#x573A;&#x666F;&#xFF0C;&#x5982;&#x4F55;&#x5145;&#x5206;&#x5229;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x907F;&#x514D;&#x5176;&#x4E2D;&#x7684;&#x9677;&#x9631;&#x3002;&#x8FD9;&#x6B63;&#x662F;&#x672C;&#x4E66;&#x7684;&#x521D;&#x8877;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5E2E;&#x52A9;&#x60A8;&#x5728;&#x98DE;&#x901F;&#x53D8;&#x5316;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x548C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x5927;&#x89C2;&#x56ED;&#x4E2D;&#x627E;&#x5230;&#x65B9;&#x5411;&#x3002;&#x672C;&#x4E66;&#x5E76;&#x4E0D;&#x662F;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x5DE5;&#x5177;&#x7684;&#x6559;&#x7A0B;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x4E00;&#x672C;&#x5145;&#x6EE1;&#x67AF;&#x71E5;&#x7406;&#x8BBA;&#x7684;&#x6559;&#x79D1;&#x4E66;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x6210;&#x529F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x6837;&#x4F8B;&#xFF1A;&#x8BB8;&#x591A;&#x6D41;&#x884C;&#x5E94;&#x7528;&#x6BCF;&#x5929;&#x90FD;&#x8981;&#x5728;&#x751F;&#x4EA7;&#x4E2D;&#x4F1A;&#x6EE1;&#x8DB3;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3001;&#x6027;&#x80FD;&#x3001;&#x4EE5;&#x53CA;&#x53EF;&#x9760;&#x6027;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x6784;&#x6210;&#x4E86;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x6DF1;&#x5165;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x90E8;&#xFF0C;&#x7406;&#x6E05;&#x5B83;&#x4EEC;&#x7684;&#x5173;&#x952E;&#x7B97;&#x6CD5;&#xFF0C;&#x8BA8;&#x8BBA;&#x80CC;&#x540E;&#x7684;&#x539F;&#x5219;&#x548C;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x505A;&#x51FA;&#x7684;&#x6743;&#x8861;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5C1D;&#x8BD5;&#x5BFB;&#x627E;<strong>&#x601D;&#x8003;</strong>&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x6709;&#x6548;&#x65B9;&#x5F0F; &#x2014;&#x2014; &#x4E0D;&#x4EC5;&#x5173;&#x4E8E;&#x5B83;&#x4EEC;<strong>&#x5982;&#x4F55;</strong>&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x5B83;&#x4EEC;<strong>&#x4E3A;&#x4EC0;&#x4E48;</strong>&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EE5;&#x53CA;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x95EE;&#x7684;&#x3002;</p>
<p>&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x540E;&#xFF0C;&#x4F60;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x51B3;&#x5B9A;&#x54EA;&#x79CD;&#x6280;&#x672F;&#x9002;&#x5408;&#x54EA;&#x79CD;&#x7528;&#x9014;&#xFF0C;&#x5E76;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x5C06;&#x5DE5;&#x5177;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#xFF0C;&#x4E3A;&#x4E00;&#x4E2A;&#x826F;&#x597D;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x5960;&#x5B9A;&#x57FA;&#x7840;&#x3002;&#x672C;&#x4E66;&#x5E76;&#x4E0D;&#x8DB3;&#x4EE5;&#x4F7F;&#x4F60;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF0C;&#x4E0D;&#x8FC7;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x8FD9;&#x57FA;&#x672C;&#x4E0A;&#x5F88;&#x5C11;&#x6709;&#x5FC5;&#x8981;&#x3002;&#x4F60;&#x5C06;&#x83B7;&#x5F97;&#x5BF9;&#x7CFB;&#x7EDF;&#x5E95;&#x5C42;&#x53D1;&#x751F;&#x4E8B;&#x60C5;&#x7684;&#x654F;&#x9510;&#x76F4;&#x89C9;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x6709;&#x80FD;&#x529B;&#x63A8;&#x7406;&#x5B83;&#x4EEC;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x505A;&#x51FA;&#x4F18;&#x79C0;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#xFF0C;&#x5E76;&#x8FFD;&#x8E2A;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="&#x672C;&#x4E66;&#x7684;&#x76EE;&#x6807;&#x8BFB;&#x8005;">&#x672C;&#x4E66;&#x7684;&#x76EE;&#x6807;&#x8BFB;&#x8005;</h2>
<p>&#x5982;&#x679C;&#x4F60;&#x5F00;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x5177;&#x6709;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x6216;&#x5904;&#x7406;&#x6570;&#x636E;&#x7684;&#x67D0;&#x79CD;&#x670D;&#x52A1;&#x5668;/&#x540E;&#x7AEF;&#x7CFB;&#x7EDF;&#xFF0C;&#x800C;&#x4E14;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;Web&#x5E94;&#x7528;&#xFF0C;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x6216;&#x8FDE;&#x63A5;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4F20;&#x611F;&#x5668;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x672C;&#x4E66;&#x5C31;&#x662F;&#x4E3A;&#x4F60;&#x51C6;&#x5907;&#x7684;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x662F;&#x4E3A;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5E08;&#xFF0C;&#x4EE5;&#x53CA;&#x559C;&#x6B22;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x6280;&#x672F;&#x7ECF;&#x7406;&#x51C6;&#x5907;&#x7684;&#x3002;&#x5982;&#x679C;&#x60A8;&#x9700;&#x8981;&#x5BF9;&#x6240;&#x4ECE;&#x4E8B;&#x7CFB;&#x7EDF;&#x7684;&#x67B6;&#x6784;&#x505A;&#x51FA;&#x51B3;&#x7B56; &#x2014;&#x2014; &#x4F8B;&#x5982;&#x60A8;&#x9700;&#x8981;&#x9009;&#x62E9;&#x89E3;&#x51B3;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x627E;&#x51FA;&#x5982;&#x4F55;&#x6700;&#x597D;&#x5730;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x672C;&#x4E66;&#x5BF9;&#x60A8;&#x5C24;&#x6709;&#x4EF7;&#x503C;&#x3002;&#x4F46;&#x5373;&#x4F7F;&#x4F60;&#x65E0;&#x6CD5;&#x9009;&#x62E9;&#x4F60;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x672C;&#x4E66;&#x4ECD;&#x5C06;&#x5E2E;&#x52A9;&#x4F60;&#x66F4;&#x597D;&#x5730;&#x4E86;&#x89E3;&#x6240;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#x7684;&#x957F;&#x5904;&#x548C;&#x77ED;&#x5904;&#x3002;</p>
<p>&#x60A8;&#x5E94;&#x5F53;&#x5177;&#x6709;&#x4E00;&#x4E9B;&#x5F00;&#x53D1;Web&#x5E94;&#x7528;&#x6216;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E14;&#x5E94;&#x5F53;&#x719F;&#x6089;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x548C;SQL&#x3002;&#x4EFB;&#x4F55;&#x60A8;&#x4E86;&#x89E3;&#x7684;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x548C;&#x5176;&#x4ED6;&#x4E0E;&#x6570;&#x636E;&#x76F8;&#x5173;&#x5DE5;&#x5177;&#x90FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5FC5;&#x9700;&#x7684;&#x3002;&#x5BF9;&#x5E38;&#x89C1;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x5982;TCP&#x548C;HTTP&#x7684;&#x5927;&#x6982;&#x7406;&#x89E3;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6216;&#x6846;&#x67B6;&#x7684;&#x9009;&#x62E9;&#x5BF9;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E0D;&#x540C;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4EE5;&#x4E0B;&#x4EFB;&#x610F;&#x4E00;&#x6761;&#x5BF9;&#x60A8;&#x4E3A;&#x771F;&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x672C;&#x4E66;&#x5F88;&#x6709;&#x4EF7;&#x503C;&#xFF1A;</p>
<ul>
<li>&#x60A8;&#x60F3;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x53EF;&#x4F38;&#x7F29;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x652F;&#x6301;&#x62E5;&#x6709;&#x6570;&#x767E;&#x4E07;&#x7528;&#x6237;&#x7684;Web&#x6216;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x3002;</li>
<li>&#x60A8;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF08;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x505C;&#x673A;&#x65F6;&#x95F4;&#xFF09;&#xFF0C;&#x4FDD;&#x6301;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x3002;</li>
<li>&#x60A8;&#x6B63;&#x5728;&#x5BFB;&#x627E;&#x4F7F;&#x7CFB;&#x7EDF;&#x5728;&#x957F;&#x671F;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5373;&#x4F7F;&#x7CFB;&#x7EDF;&#x89C4;&#x6A21;&#x589E;&#x957F;&#xFF0C;&#x9700;&#x6C42;&#x4E0E;&#x6280;&#x672F;&#x4E5F;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;</li>
<li>&#x60A8;&#x5BF9;&#x4E8B;&#x7269;&#x7684;&#x8FD0;&#x4F5C;&#x65B9;&#x5F0F;&#x6709;&#x7740;&#x5929;&#x7136;&#x7684;&#x597D;&#x5947;&#x5FC3;&#xFF0C;&#x5E76;&#x4E14;&#x5E0C;&#x671B;&#x77E5;&#x9053;&#x4E00;&#x4E9B;&#x4E3B;&#x6D41;&#x7F51;&#x7AD9;&#x548C;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#x80CC;&#x540E;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x6253;&#x7834;&#x4E86;&#x5404;&#x79CD;&#x6570;&#x636E;&#x5E93;&#x548C;&#x6570;&#x636E;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5E55;&#xFF0C;&#x63A2;&#x7D22;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x667A;&#x6167;&#x662F;&#x975E;&#x5E38;&#x6709;&#x8DA3;&#x7684;&#x3002;</li>
</ul>
<p>&#x6709;&#x65F6;&#x5728;&#x8BA8;&#x8BBA;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x4F1A;&#x8BF4;&#xFF1A;&#x201C;&#x4F60;&#x53C8;&#x4E0D;&#x5728;&#x8C37;&#x6B4C;&#x6216;&#x4E9A;&#x9A6C;&#x900A;&#xFF0C;&#x522B;&#x64CD;&#x5FC3;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x4E0A;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x201D;&#x3002;&#x8FD9;&#x4E2A;&#x9648;&#x8FF0;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x9053;&#x7406;&#xFF1A;&#x4E3A;&#x4E86;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4F38;&#x7F29;&#x6027;&#x800C;&#x8BBE;&#x8BA1;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E0D;&#x4EC5;&#x4F1A;&#x6D6A;&#x8D39;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x7CBE;&#x529B;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4F1A;&#x628A;&#x4F60;&#x9501;&#x6B7B;&#x5728;&#x4E00;&#x4E2A;&#x4E0D;&#x7075;&#x6D3B;&#x7684;&#x8BBE;&#x8BA1;&#x4E2D;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x201C;&#x8FC7;&#x65E9;&#x4F18;&#x5316;&#x201D;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x5DE5;&#x5177;&#x786E;&#x5B9E;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x800C;&#x4E0D;&#x540C;&#x7684;&#x6280;&#x672F;&#x5404;&#x6709;&#x4F18;&#x7F3A;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#xFF0C;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x867D;&#x7136;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x7EDD;&#x4E0D;&#x662F;&#x6570;&#x636E;&#x5904;&#x7406;&#x7684;&#x7EC8;&#x7AE0;&#x3002;</p>
<h2 id="&#x672C;&#x4E66;&#x6D89;&#x53CA;&#x7684;&#x9886;&#x57DF;">&#x672C;&#x4E66;&#x6D89;&#x53CA;&#x7684;&#x9886;&#x57DF;</h2>
<p>&#x672C;&#x4E66;&#x5E76;&#x4E0D;&#x4F1A;&#x5C1D;&#x8BD5;&#x544A;&#x8BC9;&#x8BFB;&#x8005;&#x5982;&#x4F55;&#x5B89;&#x88C5;&#x6216;&#x4F7F;&#x7528;&#x7279;&#x5B9A;&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x6216;API&#xFF0C;&#x56E0;&#x4E3A;&#x5DF2;&#x7ECF;&#x6709;&#x5927;&#x91CF;&#x6587;&#x6863;&#x7ED9;&#x51FA;&#x4E86;&#x8BE6;&#x7EC6;&#x7684;&#x4F7F;&#x7528;&#x8BF4;&#x660E;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8BA8;&#x8BBA;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x77F3;&#x2014;&#x2014;&#x5404;&#x79CD;&#x539F;&#x5219;&#x4E0E;&#x5229;&#x5F0A;&#x6743;&#x8861;&#xFF0C;&#x5E76;&#x63A2;&#x8BA8;&#x4E86;&#x4E0D;&#x540C;&#x4EA7;&#x54C1;&#x6240;&#x505A;&#x51FA;&#x7684;&#x4E0D;&#x540C;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;</p>
<p>&#x5728;&#x7535;&#x5B50;&#x4E66;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x5728;&#x7EBF;&#x8D44;&#x6E90;&#x5168;&#x6587;&#x7684;&#x94FE;&#x63A5;&#x3002;&#x6240;&#x6709;&#x94FE;&#x63A5;&#x5728;&#x51FA;&#x7248;&#x65F6;&#x90FD;&#x8FDB;&#x884C;&#x4E86;&#x9A8C;&#x8BC1;&#xFF0C;&#x4F46;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x81EA;&#x7136;&#x89C4;&#x5F8B;&#xFF0C;&#x94FE;&#x63A5;&#x5F80;&#x5F80;&#x4F1A;&#x9891;&#x7E41;&#x5730;&#x7834;&#x635F;&#x3002;&#x5982;&#x679C;&#x60A8;&#x9047;&#x5230;&#x94FE;&#x63A5;&#x65AD;&#x5F00;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6216;&#x8005;&#x6B63;&#x5728;&#x9605;&#x8BFB;&#x672C;&#x4E66;&#x7684;&#x6253;&#x5370;&#x526F;&#x672C;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x67E5;&#x627E;&#x53C2;&#x8003;&#x6587;&#x732E;&#x3002;&#x5BF9;&#x4E8E;&#x5B66;&#x672F;&#x8BBA;&#x6587;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;Google&#x5B66;&#x672F;&#x4E2D;&#x641C;&#x7D22;&#x6807;&#x9898;&#xFF0C;&#x67E5;&#x627E;&#x53EF;&#x4EE5;&#x516C;&#x5F00;&#x83B7;&#x53D6;&#x7684;PDF&#x6587;&#x4EF6;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x60A8;&#x4E5F;&#x53EF;&#x4EE5;&#x5728; <a href="https://github.com/ept/ddia-references" target="_blank">https://github.com/ept/ddia-references</a> &#x4E2D;&#x627E;&#x5230;&#x6240;&#x6709;&#x7684;&#x53C2;&#x8003;&#x8D44;&#x6599;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x90A3;&#x513F;&#x7EF4;&#x62A4;&#x6700;&#x65B0;&#x7684;&#x94FE;&#x63A5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x6570;&#x636E;&#x7CFB;&#x7EDF;&#x7684;<strong>&#x67B6;&#x6784;&#xFF08;architecture&#xFF09;</strong>&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x88AB;&#x96C6;&#x6210;&#x5230;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x672C;&#x4E66;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x8986;&#x76D6;&#x90E8;&#x7F72;&#xFF0C;&#x8FD0;&#x7EF4;&#xFF0C;&#x5B89;&#x5168;&#xFF0C;&#x7BA1;&#x7406;&#x7B49;&#x9886;&#x57DF; &#x2014;&#x2014; &#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x590D;&#x6742;&#x800C;&#x91CD;&#x8981;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4EC5;&#x4EC5;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x7528;&#x7C97;&#x7565;&#x7684;&#x6CE8;&#x89E3;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x5BF9;&#x5B83;&#x4EEC;&#x5F88;&#x4E0D;&#x516C;&#x5E73;&#x3002;&#x6BCF;&#x4E2A;&#x9886;&#x57DF;&#x90FD;&#x503C;&#x5F97;&#x7528;&#x5355;&#x72EC;&#x7684;&#x4E66;&#x53BB;&#x8BB2;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x8BB8;&#x591A;&#x6280;&#x672F;&#x90FD;&#x88AB;&#x6DB5;&#x76D6;&#x5728; <strong>&#x5927;&#x6570;&#x636E;&#xFF08;Big Data&#xFF09;</strong> &#x8FD9;&#x4E2A;&#x65F6;&#x9AE6;&#x8BCD;&#x7684;&#x8303;&#x7574;&#x4E2D;&#x3002;&#x7136;&#x800C;&#x201C;&#x5927;&#x6570;&#x636E;&#x201D;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x88AB;&#x6EE5;&#x7528;&#xFF0C;&#x7F3A;&#x4E4F;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x4E25;&#x8083;&#x7684;&#x5DE5;&#x7A0B;&#x8BA8;&#x8BBA;&#x4E2D;&#x6CA1;&#x6709;&#x7528;&#x5904;&#x3002;&#x8FD9;&#x672C;&#x4E66;&#x4F7F;&#x7528;&#x6B67;&#x4E49;&#x66F4;&#x5C0F;&#x7684;&#x672F;&#x8BED;&#xFF0C;&#x5982;&#x201C;&#x5355;&#x8282;&#x70B9;&#x201D;&#x4E4B;&#x4E8E;&#x201D;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x201C;&#xFF0C;&#x6216;&#x201D;&#x5728;&#x7EBF;/&#x4EA4;&#x4E92;&#x5F0F;&#x7CFB;&#x7EDF;&#x201C;&#x4E4B;&#x4E8E;&#x201D;&#x79BB;&#x7EBF;/&#x6279;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x201C;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x5BF9; <strong>&#x81EA;&#x7531;&#x548C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#xFF08;FOSS&#xFF09;</strong> &#x6709;&#x4E00;&#x5B9A;&#x504F;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x9605;&#x8BFB;&#xFF0C;&#x4FEE;&#x6539;&#x548C;&#x6267;&#x884C;&#x6E90;&#x7801;&#x662F;&#x4E86;&#x89E3;&#x67D0;&#x4E8B;&#x7269;&#x8BE6;&#x7EC6;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#x3002;&#x5F00;&#x653E;&#x7684;&#x5E73;&#x53F0;&#x4E5F;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x4F9B;&#x5E94;&#x5546;&#x5784;&#x65AD;&#x7684;&#x98CE;&#x9669;&#x3002;&#x7136;&#x800C;&#x5728;&#x9002;&#x5F53;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x8BA8;&#x8BBA;&#x4E13;&#x5229;&#x8F6F;&#x4EF6;&#xFF08;&#x95ED;&#x6E90;&#x8F6F;&#x4EF6;&#xFF0C;&#x8F6F;&#x4EF6;&#x5373;&#x670D;&#x52A1; SaaS&#xFF0C;&#x6216;&#x4E00;&#x4E9B;&#x5728;&#x6587;&#x732E;&#x4E2D;&#x63CF;&#x8FF0;&#x8FC7;&#x4F46;&#x672A;&#x516C;&#x5F00;&#x53D1;&#x884C;&#x7684;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x8F6F;&#x4EF6;&#xFF09;&#x3002;</p>
<h2 id="&#x672C;&#x4E66;&#x7EB2;&#x8981;">&#x672C;&#x4E66;&#x7EB2;&#x8981;</h2>
<p>&#x672C;&#x4E66;&#x5206;&#x4E3A;&#x4E09;&#x90E8;&#x5206;&#xFF1A;</p>
<ol>
<li><p>&#x5728;<a href="part-i.html">&#x7B2C;&#x4E00;&#x90E8;&#x5206;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8BA8;&#x8BBA;&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x5E94;&#x7528;&#x6240;&#x8D56;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x3002;&#x6211;&#x4EEC;&#x4ECE;<a href="ch1.html">&#x7B2C;1&#x7AE0;</a>&#x5F00;&#x59CB;&#xFF0C;&#x8BA8;&#x8BBA;&#x6211;&#x4EEC;&#x5B9E;&#x9645;&#x8981;&#x8FBE;&#x5230;&#x7684;&#x76EE;&#x6807;&#xFF1A;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#xFF1B;&#x6211;&#x4EEC;&#x8BE5;&#x5982;&#x4F55;&#x601D;&#x8003;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#xFF1B;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5B83;&#x4EEC;&#x3002;&#x5728;<a href="ch2.html">&#x7B2C;2&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6BD4;&#x8F83;&#x4E86;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x548C;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x770B;&#x770B;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x9002;&#x7528;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x3002;&#x5728;<a href="ch3.html">&#x7B2C;3&#x7AE0;</a>&#x4E2D;&#x5C06;&#x8BA8;&#x8BBA;&#x5B58;&#x50A8;&#x5F15;&#x64CE;&#xFF1A;&#x6570;&#x636E;&#x5E93;&#x5982;&#x4F55;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x6446;&#x653E;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x9AD8;&#x6548;&#x5730;&#x518D;&#x6B21;&#x627E;&#x5230;&#x5B83;&#x3002;<a href="ch4.html">&#x7B2C;4&#x7AE0;</a>&#x8F6C;&#x5411;&#x6570;&#x636E;&#x7F16;&#x7801;&#xFF08;&#x5E8F;&#x5217;&#x5316;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x968F;&#x65F6;&#x95F4;&#x6F14;&#x5316;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
</li>
<li><p>&#x5728;<a href="part-ii.html">&#x7B2C;&#x4E8C;&#x90E8;&#x5206;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;&#x8BA8;&#x8BBA;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x8F6C;&#x5411;&#x8BA8;&#x8BBA;&#x5206;&#x5E03;&#x5728;&#x591A;&#x53F0;&#x673A;&#x5668;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x901A;&#x5E38;&#x662F;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x4F46;&#x5E26;&#x6765;&#x4E86;&#x5404;&#x79CD;&#x72EC;&#x7279;&#x7684;&#x6311;&#x6218;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8BA8;&#x8BBA;&#x590D;&#x5236;&#xFF08;<a href="ch5.html">&#x7B2C;5&#x7AE0;</a>&#xFF09;&#xFF0C;&#x5206;&#x533A;/&#x5206;&#x7247;&#xFF08;<a href="ch6.html">&#x7B2C;6&#x7AE0;</a>&#xFF09;&#x548C;&#x4E8B;&#x52A1;&#xFF08;<a href="ch7.html">&#x7B2C;7&#x7AE0;</a>&#xFF09;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x63A2;&#x7D22;&#x5173;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x95EE;&#x9898;&#x7684;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF08;<a href="ch8.html">&#x7B2C;8&#x7AE0;</a>&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B9E;&#x73B0;&#x4E00;&#x81F4;&#x6027;&#x4E0E;&#x5171;&#x8BC6;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF08;<a href="ch9.html">&#x7B2C;9&#x7AE0;</a>&#xFF09;&#x3002;</p>
</li>
<li><p>&#x5728;<a href="part-iii.html">&#x7B2C;&#x4E09;&#x90E8;&#x5206;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x90A3;&#x4E9B;&#x4ECE;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x96C6;&#x884D;&#x751F;&#x51FA;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x884D;&#x751F;&#x6570;&#x636E;&#x7ECF;&#x5E38;&#x51FA;&#x73B0;&#x5728;&#x5F02;&#x6784;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF1A;&#x5F53;&#x6CA1;&#x6709;&#x5355;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x628A;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x90FD;&#x505A;&#x7684;&#x5F88;&#x597D;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x9700;&#x8981;&#x96C6;&#x6210;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7F13;&#x5B58;&#xFF0C;&#x7D22;&#x5F15;&#x7B49;&#x3002;&#x5728;<a href="ch10.html">&#x7B2C;10&#x7AE0;</a>&#x4E2D;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x4E00;&#x79CD;&#x884D;&#x751F;&#x6570;&#x636E;&#x7684;&#x6279;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#x5EFA;&#x7ACB;&#x5728;<a href="ch11.html">&#x7B2C;11&#x7AE0;</a>&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x6D41;&#x5904;&#x7406;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5728;<a href="ch12.html">&#x7B2C;12&#x7AE0;</a>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x6C47;&#x603B;&#xFF0C;&#x8BA8;&#x8BBA;&#x5728;&#x5C06;&#x6765;&#x6784;&#x5EFA;&#x53EF;&#x9760;&#xFF0C;&#x53EF;&#x4F38;&#x7F29;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</li>
</ol>
<h2 id="&#x53C2;&#x8003;&#x6587;&#x732E;&#x4E0E;&#x5EF6;&#x4F38;&#x9605;&#x8BFB;">&#x53C2;&#x8003;&#x6587;&#x732E;&#x4E0E;&#x5EF6;&#x4F38;&#x9605;&#x8BFB;</h2>
<p>&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x5DF2;&#x7ECF;&#x5728;&#x5176;&#x5B83;&#x5730;&#x65B9;&#x4EE5;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x51FA;&#x73B0;&#x8FC7;&#x4E86; &#x2014;&#x2014; &#x4F1A;&#x8BAE;&#x6F14;&#x793A;&#x6587;&#x7A3F;&#xFF0C;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#xFF0C;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#xFF0C;&#x4EE3;&#x7801;&#xFF0C;BUG&#x8DDF;&#x8E2A;&#x5668;&#xFF0C;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#xFF0C;&#x4EE5;&#x53CA;&#x5DE5;&#x7A0B;&#x4E60;&#x60EF;&#x4E2D;&#x3002;&#x672C;&#x4E66;&#x603B;&#x7ED3;&#x4E86;&#x4E0D;&#x540C;&#x6765;&#x6E90;&#x8D44;&#x6599;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x5E76;&#x5728;&#x6587;&#x672C;&#x4E2D;&#x5305;&#x542B;&#x4E86;&#x6307;&#x5411;&#x539F;&#x59CB;&#x6587;&#x732E;&#x7684;&#x94FE;&#x63A5;&#x3002; &#x5982;&#x679C;&#x4F60;&#x60F3;&#x66F4;&#x6DF1;&#x5165;&#x5730;&#x63A2;&#x7D22;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x7AE0;&#x672B;&#x5C3E;&#x7684;&#x53C2;&#x8003;&#x6587;&#x732E;&#x90FD;&#x662F;&#x5F88;&#x597D;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5176;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x514D;&#x8D39;&#x5728;&#x7EBF;&#x83B7;&#x53D6;&#x3002;</p>
<h2 id="oreilly-safari">O&#x2018;Reilly Safari</h2>
<p><a href="http://oreilly.com/safari" target="_blank">Safari</a> (formerly Safari Books Online) is a membership-based training and reference platform for enterprise, government, educators, and individuals.</p>
<p>Members have access to thousands of books, training videos, Learning Paths, interac&#x2010; tive tutorials, and curated playlists from over 250 publishers, including O&#x2019;Reilly Media, Harvard Business Review, Prentice Hall Professional, Addison-Wesley Pro&#x2010; fessional, Microsoft Press, Sams, Que, Peachpit Press, Adobe, Focal Press, Cisco Press, John Wiley &amp; Sons, Syngress, Morgan Kaufmann, IBM Redbooks, Packt, Adobe Press, FT Press, Apress, Manning, New Riders, McGraw-Hill, Jones &amp; Bartlett, and Course Technology, among others.</p>
<p>For more information, please visit <a href="http://oreilly.com/safari" target="_blank">http://oreilly.com/safari</a>.</p>
<h2 id="&#x81F4;&#x8C22;">&#x81F4;&#x8C22;</h2>
<p>&#x672C;&#x4E66;&#x878D;&#x5408;&#x4E86;&#x5B66;&#x672F;&#x7814;&#x7A76;&#x548C;&#x5DE5;&#x4E1A;&#x5B9E;&#x8DF5;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x878D;&#x5408;&#x5E76;&#x7CFB;&#x7EDF;&#x5316;&#x4E86;&#x5927;&#x91CF;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x60F3;&#x6CD5;&#x4E0E;&#x77E5;&#x8BC6;&#x3002;&#x5728;&#x8BA1;&#x7B97;&#x9886;&#x57DF;&#xFF0C;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x4F1A;&#x88AB;&#x5404;&#x79CD;&#x65B0;&#x9C9C;&#x82B1;&#x6837;&#x6240;&#x5438;&#x5F15;&#xFF0C;&#x4F46;&#x6211;&#x8BA4;&#x4E3A;&#x524D;&#x4EBA;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x6709;&#x592A;&#x591A;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x5B66;&#x4E60;&#x7684;&#x5730;&#x65B9;&#x4E86;&#x3002;&#x672C;&#x4E66;&#x6709;800&#x591A;&#x5904;&#x5F15;&#x7528;&#xFF1A;&#x6587;&#x7AE0;&#xFF0C;&#x535A;&#x5BA2;&#xFF0C;&#x8BB2;&#x5EA7;&#xFF0C;&#x6587;&#x6863;&#x7B49;&#xFF0C;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x5B9D;&#x8D35;&#x7684;&#x5B66;&#x4E60;&#x8D44;&#x6E90;&#x3002;&#x6211;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x8FD9;&#x4E9B;&#x6750;&#x6599;&#x7684;&#x4F5C;&#x8005;&#x5206;&#x4EAB;&#x4ED6;&#x4EEC;&#x7684;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x6211;&#x4E5F;&#x4ECE;&#x4E0E;&#x4EBA;&#x4EA4;&#x6D41;&#x4E2D;&#x5B66;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x82B1;&#x8D39;&#x4E86;&#x5B9D;&#x8D35;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x6211;&#x8BA8;&#x8BBA;&#x60F3;&#x6CD5;&#x5E76;&#x8010;&#x5FC3;&#x89E3;&#x91CA;&#x3002;&#x7279;&#x522B;&#x611F;&#x8C22; Joe Adler, Ross Anderson, Peter Bailis, M&#xE1;rton Balassi, Alastair Beresford, Mark Callaghan, Mat Clayton, Patrick Collison, Sean Cribbs, Shirshanka Das, Niklas Ekstr&#xF6;m, Stephan Ewen, Alan Fekete, Gyula F&#xF3;ra, Camille Fournier, Andres Freund, John Garbutt, Seth Gilbert, Tom Haggett, Pat Hel&#x2010; land, Joe Hellerstein, Jakob Homan, Heidi Howard, John Hugg, Julian Hyde, Conrad Irwin, Evan Jones, Flavio Junqueira, Jessica Kerr, Kyle Kingsbury, Jay Kreps, Carl Lerche, Nicolas Liochon, Steve Loughran, Lee Mallabone, Nathan Marz, Caitie McCaffrey, Josie McLellan, Christopher Meiklejohn, Ian Meyers, Neha Narkhede, Neha Narula, Cathy O&#x2019;Neil, Onora O&#x2019;Neill, Ludovic Orban, Zoran Perkov, Julia Powles, Chris Riccomini, Henry Robinson, David Rosenthal, Jennifer Rullmann, Matthew Sackman, Martin Scholl, Amit Sela, Gwen Shapira, Greg Spurrier, Sam Stokes, Ben Stopford, Tom Stuart, Diana Vasile, Rahul Vohra, Pete Warden, &#x4EE5;&#x53CA; Brett Wooldridge.</p>
<p>&#x66F4;&#x591A;&#x4EBA;&#x901A;&#x8FC7;&#x5BA1;&#x9605;&#x8349;&#x7A3F;&#x5E76;&#x63D0;&#x4F9B;&#x53CD;&#x9988;&#x610F;&#x89C1;&#x5728;&#x672C;&#x4E66;&#x7684;&#x521B;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x505A;&#x51FA;&#x4E86;&#x65E0;&#x4EF7;&#x7684;&#x8D21;&#x732E;&#x3002;&#x6211;&#x8981;&#x7279;&#x522B;&#x611F;&#x8C22;Raul Agepati, Tyler Akidau, Mattias Andersson, Sasha Baranov, Veena Basavaraj, David Beyer, Jim Brikman, Paul Carey, Raul Castro Fernandez, Joseph Chow, Derek Elkins, Sam Elliott, Alexander Gallego, Mark Grover, Stu Halloway, Heidi Howard, Nicola Kleppmann, Stefan Kruppa, Bjorn Madsen, Sander Mak, Stefan Podkowinski, Phil Potter, Hamid Ramazani, Sam Stokes, &#x4EE5;&#x53CA;Ben Summers&#x3002;&#x5F53;&#x7136;&#x5BF9;&#x4E8E;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x9057;&#x7559;&#x9519;&#x8BEF;&#x6216;&#x96BE;&#x4EE5;&#x63A5;&#x53D7;&#x7684;&#x89C1;&#x89E3;&#xFF0C;&#x6211;&#x90FD;&#x627F;&#x62C5;&#x5168;&#x90E8;&#x8D23;&#x4EFB;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5E2E;&#x52A9;&#x8FD9;&#x672C;&#x4E66;&#x843D;&#x5730;&#xFF0C;&#x5E76;&#x4E14;&#x8010;&#x5FC3;&#x5730;&#x5904;&#x7406;&#x6211;&#x7F13;&#x6162;&#x7684;&#x5199;&#x4F5C;&#x548C;&#x4E0D;&#x5BFB;&#x5E38;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x6211;&#x8981;&#x5BF9;&#x7F16;&#x8F91;Marie Beaugureau&#xFF0C;Mike Loukides&#xFF0C;Ann Spencer&#x548C;O&apos;Reilly&#x7684;&#x6240;&#x6709;&#x56E2;&#x961F;&#x8868;&#x793A;&#x611F;&#x8C22;&#x3002;&#x6211;&#x8981;&#x611F;&#x8C22;Rachel Head&#x5E2E;&#x6211;&#x627E;&#x5230;&#x4E86;&#x5408;&#x9002;&#x7684;&#x672F;&#x8BED;&#x3002;&#x6211;&#x8981;&#x611F;&#x8C22;Alastair Beresford&#xFF0C;Susan Goodhue&#xFF0C;Neha Narkhede&#x548C;Kevin Scott&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x5DE5;&#x4F5C;&#x4E8B;&#x52A1;&#x4E4B;&#x5916;&#x7ED9;&#x4E86;&#x6211;&#x5145;&#x5206;&#x5730;&#x521B;&#x4F5C;&#x65F6;&#x95F4;&#x548C;&#x81EA;&#x7531;&#x3002;</p>
<p>&#x7279;&#x522B;&#x611F;&#x8C22;Shabbir Diwan&#x548C;Edie Freedman&#xFF0C;&#x4ED6;&#x4EEC;&#x975E;&#x5E38;&#x7528;&#x5FC3;&#x5730;&#x4E3A;&#x5404;&#x7AE0;&#x914D;&#x4E86;&#x5730;&#x56FE;&#x3002;&#x4ED6;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x4E0D;&#x843D;&#x4FD7;&#x5957;&#x7684;&#x7075;&#x611F;&#xFF0C;&#x521B;&#x4F5C;&#x4E86;&#x8FD9;&#x4E9B;&#x5730;&#x56FE;&#xFF0C;&#x7F8E;&#x4E3D;&#x800C;&#x5F15;&#x4EBA;&#x5165;&#x80DC;&#xFF0C;&#x771F;&#x662F;&#x592A;&#x68D2;&#x4E86;&#x3002;</p>
<p>&#x6700;&#x540E;&#x6211;&#x8981;&#x8868;&#x8FBE;&#x5BF9;&#x5BB6;&#x4EBA;&#x548C;&#x670B;&#x53CB;&#x4EEC;&#x7684;&#x7231;&#xFF0C;&#x6CA1;&#x6709;&#x4ED6;&#x4EEC;&#xFF0C;&#x6211;&#x5C06;&#x65E0;&#x6CD5;&#x8D70;&#x5B8C;&#x8FD9;&#x4E2A;&#x5C06;&#x8FD1;&#x56DB;&#x5E74;&#x7684;&#x5199;&#x4F5C;&#x5386;&#x7A0B;&#x3002;&#x4F60;&#x4EEC;&#x662F;&#x6700;&#x68D2;&#x7684;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 简介">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="part-i.html" class="navigation navigation-next " aria-label="Next page: 第一部分：数据系统的基石">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"序言","level":"1.2","depth":1,"next":{"title":"第一部分：数据系统的基石","level":"1.3","depth":1,"path":"part-i.md","ref":"part-i.md","articles":[{"title":"第一章：可靠性、可伸缩性、可维护性","level":"1.3.1","depth":2,"path":"ch1.md","ref":"ch1.md","articles":[]},{"title":"第二章：数据模型与查询语言","level":"1.3.2","depth":2,"path":"ch2.md","ref":"ch2.md","articles":[]},{"title":"第三章：存储与检索","level":"1.3.3","depth":2,"path":"ch3.md","ref":"ch3.md","articles":[]},{"title":"第四章：编码与演化","level":"1.3.4","depth":2,"path":"ch4.md","ref":"ch4.md","articles":[]}]},"previous":{"title":"简介","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["callouts@git+https://github.com/Simran-B/gitbook-plugin-callouts.git","intopic-toc","theme-comscore","-lunr","-search","search-pro","github","splitter","-sharing"],"pluginsConfig":{"callouts":{"showTypeInHeader":true},"github":{"url":"https://github.com/KnowledgeHive/KnowledgeHive"},"intopic-toc":{"isCollapsed":false,"isScrollspyActive":true,"label":{"de":"导航","en":"导航","ch":"导航"},"maxDepth":6,"mode":"nested","selector":".markdown-section h1, .markdown-section h2, .markdown-section h3, .markdown-section h4, .markdown-section h5, .markdown-section h6","visible":true},"splitter":{},"search-pro":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"theme-comscore":{},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"preface.md","mtime":"2020-12-01T02:42:40.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-12T15:31:17.016Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.polyfills.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-theme-comscore/test.js"></script>
        
    

    </body>
</html>

